{
    "id": "ebeb08e3096932633efe828145d4652a3d921a7b",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA5A_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604746A"
        },
        "ProgramElementTitle": {
            "val": "Automatic Test Equipment Development"
        },
        "R1LineItemNumber": {
            "val": "105"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.553"
            },
            "CurrentYear": {
                "val": "14.361"
            },
            "BudgetYearOne": {
                "val": "10.815"
            },
            "BudgetYearOneBase": {
                "val": "10.815"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "11.983"
            },
            "BudgetYearThree": {
                "val": "11.911"
            },
            "BudgetYearFour": {
                "val": "12.367"
            },
            "BudgetYearFive": {
                "val": "12.575"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides for development and testing of general-purpose test equipment and of state-of-the-art diagnostics and prognostics technology, software and systems to support the increasingly complex electronic components of the Army's new and upgraded weapon systems.  It focuses on implementation of commercial test and diagnostic technologies across multiple weapon platforms to minimize the cost of troubleshooting and maintenance of Army equipment in the field.  \n\nModular, reconfigurable automatic and semi-automatic systems are being developed under this program to satisfy weapon system test and diagnostics requirements.  The Next Generation Automatic Test System (NGATS) currently under development will provide state-of-the-art test and diagnostic capabilities to support current and future weapon systems.  It is the platform for transitioning Agile Rapid Global Combat Support System (ARGCS) technologies into the Army weapon system support structure, and it will replace several aging automatic test systems (ATS) which are becoming prohibitively expensive to operate and maintain.  \n\nThis PE also provides for continued development and improvement of general-purpose test equipment and calibration standards with emphasis on the incorporation of digital electronics and tailoring of configurations to improve deployability, mobility and survivability of the support equipment.  Artificial intelligence and anticipatory maintenance applications are being developed to support the integration of self-diagnostic capabilities in Army weapons and support systems.  The goal of these efforts is to reduce logistics burdens and improve readiness by minimizing the need for external testers and improving the troubleshooting abilities of soldiers in the field.\n\nFY 2013 Base funding for this program continues development in accordance with Department of Defense and Army policies of the Army standard Next Generation Automatic Test System which will improve deployability and mobility of test and diagnostic equipment and replace aging and obsolete automated equipment currently supporting a number of the Army's vital warfighting systems.  It will also develop or significantly modify test equipment to satisfy modular force and homeland security support requirements that cannot be accommodated with test equipment currently available in the commercial marketplace."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.041"
                },
                "CurrentYear": {
                    "val": "14.375"
                },
                "BudgetYearOne": {
                    "val": "10.705"
                },
                "BudgetYearOneBase": {
                    "val": "10.705"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.553"
                },
                "CurrentYear": {
                    "val": "14.361"
                },
                "BudgetYearOne": {
                    "val": "10.815"
                },
                "BudgetYearOneBase": {
                    "val": "10.815"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.488"
                },
                "CurrentYear": {
                    "val": "-0.014"
                },
                "BudgetYearOne": {
                    "val": "0.110"
                },
                "BudgetYearOneBase": {
                    "val": "0.110"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.396"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.110"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.110"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.092"
                                },
                                "CurrentYear": {
                                    "val": "-0.014"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "L59"
                    },
                    "ProjectTitle": {
                        "val": "DIAGNOST\/EXPERT SYS DE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.243"
                        },
                        "CurrentYear": {
                            "val": "10.869"
                        },
                        "BudgetYearOne": {
                            "val": "8.237"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.237"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.387"
                        },
                        "BudgetYearThree": {
                            "val": "8.308"
                        },
                        "BudgetYearFour": {
                            "val": "8.639"
                        },
                        "BudgetYearFive": {
                            "val": "8.784"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds development of and system enhancements for the Next Generation Automatic Test System (NGATS).  The NGATS is a general-purpose automatic test system (ATS) that will provide test and diagnostic capabilities required to support current and future weapons and combat support systems and will facilitate retirement of aging and obsolete test equipment that is imposing increasing logistics and operations and support cost burdens.  It is the platform for transitioning Agile Rapid Global Combat Support System (ARGCS) technologies into the Army weapon system support structure.  The ARGCS initiative was sponsored by the Department of Defense, and all Services are expected to transition demonstrated technologies into their ATS programs.  This project also provides for continuing efforts to upgrade and improve general-purpose automatic test equipment to satisfy test and diagnostic requirements of the Army's new and upgraded weapon systems; development and adaptation of automatic test equipment required to overcome existing deficiencies and voids in organic test and diagnostic capabilities; development and testing of common procedures utilizing existing test program sets and software applications; and market surveys of commercially available test equipment, methods and procedures to determine applicability to Army requirements.  The test and diagnostic systems and procedures developed under this project are essential for ensuring the operational readiness, accuracy and effectiveness of the Army's warfighting systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Abrams\/Bradley Test Program Set (TPS) Rehost"
                                    },
                                    "Description": {
                                        "val": "Rehost, test and evaluate inital complement of Abrams\/Bradley TPSs for NGATS first unit equipped"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.309"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete rehost, test and evaluation of TPSs"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Logistics Support Products"
                                    },
                                    "Description": {
                                        "val": "Develop NGATS initial logistics support products (including provisioning, technical manuals and calibration)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of initial logistics support products"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of initial logistics support products"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Complete development of initial logistics support products"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Developmental and Operational Follow-on Testing"
                                    },
                                    "Description": {
                                        "val": "Complete Increment 1 developmental and operational follow-on testing activities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.134"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue developmental and operational testing"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete developmental and operational testing"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Increment 2"
                                    },
                                    "Description": {
                                        "val": "Develop and test hardware and software for NGATS Increment 2 system"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of Increment 2 hardware and software"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of Increment 2 hardware and software; initiate development and testing of hardware and software for support of Increment 2 systems (Avenger, Multiple Launch Rocket System, Tube-launched Optically-tracked Wire-guided (TOW) Missile System, Paladin, and Common Remotely Operated Weapons Station (CROWS) II)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of Increment 2 hardware and software; continue development and testing of hardware and software for support of Increment 2 systems (Avenger, Multiple Launch Rocket System, Tube-launched Optically-tracked Wire-guided (TOW) Missile System, Paladin, and Common Remotely Operated Weapons Station (CROWS) II)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Electro-Optics Subsystem"
                                    },
                                    "Description": {
                                        "val": "Develop and test hardware and software for NGATS electro-optics (EO) subsystem (to include the capability to support new ground and aerial sensors for unmanned air and ground vehicles)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for NGATS EO subsystem"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.252"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for NGATS EO subsystem; initiate development and testing of hardware and software for support of Increment 3 systems (Apache, Kiowa Warrior, CROWS II, and Stryker Remote Weapons Station)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.655"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.655"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for NGATS EO subsystem; continue development and testing of hardware and software for support of Increment 3 systems (Apache, Kiowa Warrior, CROWS II, and Stryker Remote Weapons Station)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "General-Purpose Shop Replaceable Unit Diagnostic Capability"
                                    },
                                    "Description": {
                                        "val": "Develop expanded general-purpose shop replaceable unit diagnostic capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of expanded general-purpose shop replaceable unit diagnostic capability"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of expanded general-purpose shop replaceable unit diagnostic capability"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue development of expanded general-purpose shop replaceable unit diagnostic capability"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Abrams\/Bradley Test Program Set (TPS) Redesign"
                                    },
                                    "Description": {
                                        "val": "Redesign, test and evaluate Abrams\/Bradley TPSs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate redesign, test and evaluation of TPSs"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue redesign, test and evaluation of TPSs"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue redesign, test and evaluation of TPSs"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additional Software Capabilities"
                                    },
                                    "Description": {
                                        "val": "Develop software capabilities to incorporate common logistics operating environment (CLOE)\/netcentric and embedded diagnostics data collection and analysis for closed loop diagnostic maintenance in support of condition-based maintenance"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of expanded software capabilities"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of expanded software capabilities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue development of expanded software capabilities"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Smart TPSs"
                                    },
                                    "Description": {
                                        "val": "Develop enhanced smart TPS hardware and software"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of enhanced smart TPSs"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue development of enhanced smart TPSs"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Weight Enhancements"
                                    },
                                    "Description": {
                                        "val": "Develop power and weight enhancements for NGATS"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.517"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of power and weight enhancements"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue development of power and weight enhancements"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Abrams\/Bradley EO TPS Development"
                                    },
                                    "Description": {
                                        "val": "Develop Abrams\/Bradley TPSs for use with NGATS EO asset"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of TPSs"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.082"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.082"
                                            },
                                            "Text": {
                                                "val": "Continue development of TPSs"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "."
                                    },
                                    "Title": {
                                        "val": "OPA3, SSN MB4000, Integrated Family of Test Equipment (IFTE)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "103.323"
                                        },
                                        "CurrentYear": {
                                            "val": "36.937"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.508"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.508"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.239"
                                        },
                                        "BudgetYearFour": {
                                            "val": "70.126"
                                        },
                                        "BudgetYearFive": {
                                            "val": "65.406"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This developmental project consists of cooperative in-house and competitive and sole-source contractual actions.  When the necessary expertise and capability are available within the Department of Defense, services required for the individual development projects are ordered from the government source; otherwise, commercial contracts are used.  Equipment required for developmental projects is obtained by contract from the commercial supplier.  Developmental efforts for the Next Generation Automatic Test System (NGATS) are being completed under a sole-source contract awarded to the prime contractor for the Integrated Family of Test Equipment off-platform testers.  Full-rate production of the system will be a competitive award.  NGATS is following an evolutionary acquisition strategy using incremental development.  The NGATS Increment 1 will replace the Direct Support Electrical Systems Test Set (DSESTS).  Increment 2 and the electro-optics subsystem will replace the Base Shop Test Facility (BSTF) (V)3 and BSTF (V)5 systems."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Prototype Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman, Rolling Meadows, IL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "."
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.472"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.252"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.062"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.062"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hardware\/Support Items Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "55.129"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.317"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.438"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.438"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development\/ Verification\/Validation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "23.271"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.100"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.737"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.737"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management\/ Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "46.691"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Direct"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.790"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Test program set (TPS) and contractor developmental test and evalutation are included in the product development cost."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Operational Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.814"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Developmental Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.046"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Full Rate Production Decision Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Materiel Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "First Unit Equipped"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Testing (EO Subsystem)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS P3I - Netcentric"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "New Systems Test Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L65"
                    },
                    "ProjectTitle": {
                        "val": "Test Equipment Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.310"
                        },
                        "CurrentYear": {
                            "val": "3.492"
                        },
                        "BudgetYearOne": {
                            "val": "2.578"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.578"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.596"
                        },
                        "BudgetYearThree": {
                            "val": "3.603"
                        },
                        "BudgetYearFour": {
                            "val": "3.728"
                        },
                        "BudgetYearFive": {
                            "val": "3.791"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports development and demonstration of state-of-the-art calibration instruments and test methods and  upgrades\/improvements to existing Army calibration systems.  It provides for laboratory and feasibility studies, market research, inventory analysis, bid sample testing, and prototyping to support calibration systems and general-purpose test and diagnostic equipment acquisitions.  Primary efforts under this project include development of calibration software; development of calibration capability for chemical and biological agent detection systems, aviation test equipment and night vision testers; improvement of test and measurement equipment performance envelopes via preplanned product improvements (P3I); and development\/evaluation of advance technology and higher reliability calibration systems and general-purpose test, measurement and diagnostic equipment (TMDE).  Preplanned product improvements to current test and measurement systems are underway to overcome deficiencies and voids in existing organic capabilities ensuring the operational readiness, accuracy, effectiveness, and safety of Army weapons and combat support systems.  These improvements will employ reconfigurable open electronics architecture and computer-based instrumentation wherever feasible and will be focused on reducing the test equipment footprints to improve deployability and mobility in areas of operation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AN\/GSM-421(V2)"
                                    },
                                    "Description": {
                                        "val": "Develop and test a tactical, up-armor capable Army calibration system that provides a split-based calibration capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.595"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete developmental testing and environmental testing.  Inititate user testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete user testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Instruments"
                                    },
                                    "Description": {
                                        "val": "Research, develop and test physical parameter calibration instrumentation to support areas such as chemical\/biological agent detection systems, night vision testers, hydraulic and pneumatic pressure systems, temperature, etc."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.990"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research and develop calibration standards for optical, radiation and liquid\/gas flow calibration test requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.850"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and test calibration standards for optical, radiation and liquid\/gas flow calibration test requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.427"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.427"
                                            },
                                            "Text": {
                                                "val": "Complete development and test of liquid hydrocarbon flow calibration and test standards.  Continue development of traceable calibration standards for biological and chemical agent detectors and gas mask testers.  Continue development and test of pneumatic and hydraulic transport standards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Calibration Sets (CALSETS) Software Environment and Calibration"
                                    },
                                    "Description": {
                                        "val": "Develop and test an Army automated calibration environment and develop calibration procedures.  Test efforts in support of DoD Information Assurance Certification and Accreditation Process (DIACAP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.627"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development and evaluation of test and calibration procedures.  Research and develop calibration software environment issues.  Perform testing for DIACAP issues."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.301"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development and evaluation of test and calibration procedures.  Conduct development and testing for a calibration software environment.  Perform testing efforts for DIACAP issues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.126"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.126"
                                            },
                                            "Text": {
                                                "val": "Continue development and evaluation of calibration procedures.  Perform testing efforts for DIACAP issues.  Complete testing for initial release of a calibration software environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electrical Instruments"
                                    },
                                    "Description": {
                                        "val": "Research, develop and test electrical parameter calibration instrumentation to support areas such as deployable recertification set, intrinsic electrical standards, electrical transport standards, etc."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.778"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial equipment and develop performance specifications for acquisition.  Continue development of deployable recertification set capability.  Develop\/test transport standards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.971"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluate commercial equipment and develop performance specifications for acquisition.  Continue development of deployable recertification set capability.  Continue testing of transport standards.  Develop\/test intrinsic electrical standards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.975"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.975"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluate commercial equipment and develop performance specifications for acquisition of transport calibration standards package.  Develop requirements and specifications for small, practical intrinsic voltage standard.  Complete development and initiate testing of a deployable recertification set capability.  Continue development and test of an intrinsic voltage standard."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test Equipment Modernization"
                                    },
                                    "Description": {
                                        "val": "Perform market research and evaluation of commercial equipment and develop performance specifications for acquisition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.320"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial equipment and develop performance specifications for acquisition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.320"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial equipment and develop performance specifications for acquisition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial equipment and develop performance specifications for acquisition."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "SSN N10000"
                                    },
                                    "Title": {
                                        "val": "Calibration Sets Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "38.560"
                                        },
                                        "CurrentYear": {
                                            "val": "13.618"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.494"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.494"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.798"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.771"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.136"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SSN N11000"
                                    },
                                    "Title": {
                                        "val": "Test Equipment Modernization"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.064"
                                        },
                                        "CurrentYear": {
                                            "val": "30.451"
                                        },
                                        "BudgetYearOne": {
                                            "val": "24.334"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "24.334"
                                        },
                                        "BudgetYearThree": {
                                            "val": "24.856"
                                        },
                                        "BudgetYearFour": {
                                            "val": "26.322"
                                        },
                                        "BudgetYearFive": {
                                            "val": "26.778"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects are focused on use of commercial and nondevelopmental item technologies.  When programmatic and engineering expertise and capability are available within the Department of Defense, services required for the individual development projects are acquired from the government source; otherwise, commercial services contracts are used to provide these capabilities.  Equipment required for development projects is obtained from the commercial supplier.  Candidate commercial equipment and nondevelopmental items are identified and evaluated through market research and government testing and evaluation."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "In-house Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Civ Labor"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.416"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CALSETS Software Environment and Calibration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.098"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.011"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AN\/GSM-421(V2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.346"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Physical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.632"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.380"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Electrical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.287"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.851"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.578"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.578"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test Equipment Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.110"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.120"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.837"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AN\/GSM-421(V2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.570"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Physical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.200"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CALSETS Software Environment and Calibration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.150"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Electrical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.263"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.130"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test Equipment Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.100"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}