{
    "id": "ed71b35d04f9c8af970e010b7ab356d31bb8e788",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602787A"
        },
        "ProgramElementTitle": {
            "val": "MEDICAL TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "96.360"
            },
            "CurrentYear": {
                "val": "105.762"
            },
            "BudgetYearOne": {
                "val": "107.891"
            },
            "BudgetYearOneBase": {
                "val": "107.891"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "106.338"
            },
            "BudgetYearThree": {
                "val": "89.714"
            },
            "BudgetYearFour": {
                "val": "86.344"
            },
            "BudgetYearFive": {
                "val": "78.045"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) supports application of knowledge gained through basic research to refine drugs, vaccines, medical devices, diagnostics, medical practices\/procedures, and other preventive measures essential to the protection and sustainment of Warfighter health.  Research is conducted in five principal areas: Combat Casualty Care; Military Operational Medicine; Military Relevant Infectious Diseases, including Human Immunodeficiency Virus (HIV); Clinical and Rehabilitative Medicine; and Systems Biology\/Network Sciences and funded in seven projects.  \n\nProject 869 refines knowledge and technologies (such as screening tools and preventive measures) for post-traumatic stress disorder and mild traumatic brain injuries, physiological monitors to protect Soldiers from injuries due to exposure to hazardous environments and materials, and medically valid testing devices and predictive models used for the refinement of Soldier protective equipment.  This project is being coordinated with the Defense Health Program.  \nProject 870 designs and refines medical diagnosis, protection, and treatment against naturally occurring diseases and wound infections of military importance, as identified by worldwide medical surveillance and military threat analysis.  This project is being coordinated with the Defense Health Program.  \nProject 873 conducts research on the human immunodeficiency virus (HIV), which causes Acquired Immunodeficiency Syndrome (AIDS). Work in this area includes refining improved identification methods to determine genetic diversity of the virus, preclinical work in laboratory animals including non-human primates to identify candidates for future vaccine refinement, and evaluating and preparing overseas sites for future vaccine trials.  This project is being coordinated with the Defense Health Program.    \nProject 874 identifies and evaluates drugs, biologics (products derived from living organisms), medical devices, and diagnostics for resuscitation, life support, and post-evacuation restorative and rehabilitative care, as well as trauma care systems for use by field medics and surgeons.  Research focus is on identifying more effective critical care technologies and protocols to treat severe bleeding, traumatic brain injury and other blast related injuries, and treatments for ocular injury and visual system dysfunction, as well as laboratory and animal studies of regenerating skin, muscle, nerves, and bone tissue for the care and treatment of battle-injured casualties. This project is being coordinated with the Defense Health Program. \nProject FH2 conducts research to support applied research directed toward the sustainment of a healthy force of Warfighters from accession through retirement.  \nProject VB4 conducts applied research in systems biology to provide a highly effective mechanism to integrate iterative biological tests, computer simulations, and animal studies.  Such refinement efforts using systems biology could ultimately reduce the time and effort invested in medical product refinement.  This project is being coordinated with the Defense Health Program.\nProject VJ4 examines over a planned five-year period to examine the mental and behavioral health of Soldiers to counter suicidal behavior.  This work will focus on advancing the understanding of the multiple determinants of suicidal behavior, psychopathology (study of the causes and nature of abnormal behavior), psychological resilience, and role functioning.  Work on this project is being performed by the National Institute of Mental Health through extramural cooperative research grants in collaboration with the Department of the Army.  This project is being coordinated with the Defense Health Program.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nAll medical applied research is conducted in compliance with U.S. Food and Drug Administration (FDA) or Environmental Protection Agency (EPA) regulations.  The FDA requires thorough testing in animals (referred to as preclinical testing) to assure safety and, where possible, effectiveness (i.e., efficacy) prior to approving controlled clinical trials where these early (previously unproven in humans) drugs, vaccines, and medical devices are tested in humans.  These clinical trials are conducted in three phases (Phase 1, 2, and 3) to prove safety and effectiveness of the drug\/vaccine\/device for the targeted disease\/condition.   Each successive clinical trial includes more voluntary study subjects.  This PE focuses on identifying candidate solutions on research and refinement of technologies such as product purification, formulation and assay refinement; and involves preclinical testing in animals and early human clinical testing (Phase 1 safety and Phase 2 expanded safety and efficacy).  The EPA also requires thorough testing of products, such as repellents and insecticides"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "96.797"
                },
                "CurrentYear": {
                    "val": "105.929"
                },
                "BudgetYearOne": {
                    "val": "105.289"
                },
                "BudgetYearOneBase": {
                    "val": "105.289"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "96.360"
                },
                "CurrentYear": {
                    "val": "105.762"
                },
                "BudgetYearOne": {
                    "val": "107.891"
                },
                "BudgetYearOneBase": {
                    "val": "107.891"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.437"
                },
                "CurrentYear": {
                    "val": "-0.167"
                },
                "BudgetYearOne": {
                    "val": "2.602"
                },
                "BudgetYearOneBase": {
                    "val": "2.602"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.119"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.602"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.602"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "1.682"
                                },
                                "CurrentYear": {
                                    "val": "-0.167"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "869"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Health Prot & Perf Stnds"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.669"
                        },
                        "CurrentYear": {
                            "val": "38.679"
                        },
                        "BudgetYearOne": {
                            "val": "38.907"
                        },
                        "BudgetYearOneBase": {
                            "val": "38.907"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "37.133"
                        },
                        "BudgetYearThree": {
                            "val": "33.674"
                        },
                        "BudgetYearFour": {
                            "val": "29.988"
                        },
                        "BudgetYearFive": {
                            "val": "30.333"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts research to prevent and protect Soldiers from training and operational injuries, the refinement of mechanisms for detection of physiological and psychological health problems, the evaluation of hazards to head, neck, spine, eyes, and ears, the standards for rapid return-to-duty, and the determination of new methods to sustain and enhance performance across the operational spectrum.  This research provides medical information important to the design and operational use of military systems, and this work forms the basis for behavioral, training, pharmacological (drug actions), and nutritional interventions. \n\nThe four main areas of study are: \n\n(1) Physiological Health\n(2) Environmental Health and Protection\n(3) Injury Prevention and Reduction\n(4) Psychological Health and Resilience\n\nPromising efforts identified in this project are further matured under PE 0603002A, project MM3.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.   \n\nWork in this project is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; U.S. Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; U.S. Institute of Surgical Research (USAISR), Fort Sam Houston, TX; and the U.S. Army Aeromedical Research Laboratory (USAARL), Fort Rucker, AL. \n\nEfforts in this project support the Soldier Portfolio and the principle areas of Combat Casualty Care and Military Operational Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection - Physiological Awareness Tools and Warrior Sustainment in Extreme Environments"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates remote monitoring of Soldier physiological status and mitigating\/eliminating the effects of heat, cold, altitude, and other environmental stressors on Soldier performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.376"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed low-oxygen training guidelines based on analysis of low-oxygen exposure studies; performed biomedical modeling to define individual differences affecting heat regulation; developed methods and models to predict core temperature using identified thermal parameters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.567"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop altitude acclimatization and work performance models for altitudes between 7,000 and 14,000 feet."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.038"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.038"
                                            },
                                            "Text": {
                                                "val": "Will conduct laboratory studies to determine effects of hypoxia (oxygen depletion) on peripheral blood flow during cold exposure.  These results will lead to the refinement of preventive measures for Warfighters deployed in high altitude environments.  These results may be included as components in the altitude and work performance models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physiological Health - Nutritional Sustainment and Fatigue Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of nutrition and fatigue on Soldier operational performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.862"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed nutritional countermeasures (supplements taken to counter or offset injury or trauma) for diminished bone health in response to operational stress; defined impact of micronutrient status on performance and immune function during military training; demonstrated protective effects of probiotics (dietary supplements) for sustaining digestive and immune function during operational stress; demonstrated effectiveness of nutritional supplements for promoting fat loss in overweight Warriors; conducted study to determine changes in sleep brain activity on Soldiers in theater; conducted a study to determine extent to which sleep duration impacts resilience\/sensitivity to combat experiences."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.670"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate whether there is any association between disturbances in nutritional health and the prevalence of Warfighter psychological disorders; determine the impact of weight status on risk of musculoskeletal injury; define the muscle metabolic responses to energy deficit for development of treatment interventions; determine impact of nutritional status on blast recovery; demonstrate effectiveness of a non-prescription medication for promoting fat loss in overweight Warriors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.086"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.086"
                                            },
                                            "Text": {
                                                "val": "Will determine the capacity of nutrients from plants to alter oxidative stress (condition where potentially damaging substances exist in cells in excess of the cell's ability to detoxify them), reduced oxygen supply, or chemical-induced toxicity.  These results will lead to interventions designed to protect Warfighters from environmental hazards.  Will define the effects of metabolic energy availability on cognitive performance; determine if nutritional interventions can facilitate bone remodeling in response to military training; incorporate a mathematical model of caffeine effects during chronic sleep restriction into the sleep performance model; refine a cognitive (mental processing) model to predict differential rates of recovery following various chronic sleep restriction operational scenarios.  These results will increase predictive capability against the effects of fatigue. Will determine the effects of physiological (human mechanical, physical and biochemical functions) factors, such as genetic makeup, sleep history and personality on individual differences in physiological resiliency."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Neurosensory Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort analyzes and models the effects of mechanical and operational stressors on Soldier performance, to include acoustic and impact trauma, vision, vibration, and jolt to model the effects of these stressors on the brain, spine, eyes, and hearing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.423"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determined head injury thresholds in boxers and paratroopers for risk assessment and development of biomedically-valid criteria for use in materiel development; completed eye injury dose-response modeling for vulnerability assessments using the instrumented headform system; extended laser injury diagnostics to animal models; used improved headforms, assessed ear protection strategies with simulated battle sounds and conducted assessments of vulnerability models for jobs that define job-specific strategies and interventions; conducted comparative analysis of foam and preformed eartips for use with the Communications Earplug."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.176"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determine thresholds of operationally relevant blunt head injury; complete additional eye injury dose-response modeling for the instrumented headform system; assess effectiveness of existing hearing protection in continuous high-noise training environments using otoacoustic emissions (sound generated within the inner ear, which can be used as a measure of inner ear health); develop biomedically-based injury mechanism criteria to define auditory risk potential; examine both biophysical and animal models of blast to characterize the nature and extent of effects on the eye."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.824"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.824"
                                            },
                                            "Text": {
                                                "val": "Will refine standard methodology for the evaluation of vision and ocular sensitivity during rapid transitions between light and dark operational conditions; refine methodology to evaluate blunt facial protection strategies; refine a model that will assess the effectiveness of existing and newly developed hearing protection\/enhancement strategies during continuous and impulse noise combat operations that will predict the effects of hearing loss in an operational environment; determine additive effects of laser pulses to enable the safe use of military laser systems and provides biomedical data to assess eye protection devices; assess military ocular (eye) trauma from blast or lasers and outcomes that leads to the prevention and effective mitigation of battlefield eye injuries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Musculoskeletal Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and assesses the effects of repetitive motion during military operations and training on the human body. Also allows for the prediction of injuries as a result of continuous operations and muscle fatigue.  This effort evaluates current standards for return-to-duty and establishes improved medical assessment methods with the goal of rapid return to duty of Soldiers following injury"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.644"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed recovery assessment tests that are used to develop return-to-duty recommendations after musculoskeletal injury; refined and validated the training, overuse, and injury prediction model to incorporate stress fracture data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.212"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and validate a model that will identify relationships among multi-sensory and musculoskeletal injuries; develop and implement an injury risk methodology for remediation and prevention in an effort to mitigate lost duty-time due to musculoskeletal injury; develop strategies to evaluate predictions and generalizations of musculoskeletal injuries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.937"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.937"
                                            },
                                            "Text": {
                                                "val": "Will refine a mounted Soldier injury performance assessment battery; assess the physical performance requirements and determine minimal acceptable standards for muscle\/skeletal injury for the dismounted Soldier.  These results will provide data for an improved injury risk analysis capability for the Soldier."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Injury Return to Duty Standards:"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates current methods for rapid return-to-duty standards and establishes  improved medical assessment methods with the goal of more rapid return to duty of Soldiers following injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.787"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed measures of effectiveness for interventions with baseline criteria for Warriors with brain, eye, and hearing injury; developed preliminary techniques and technologies to accelerate and assist Wounded Warriors in rapid return to military duty."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.598"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop strategies to validate if hearing following blast or blunt trauma is a predictor of mild Traumatic Brain Injury (mTBI); evaluate the human vestibular system (system which contributes to our sense of balance and spatial orientation) as a predictor of mTBI from blast and blunt trauma."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.752"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.752"
                                            },
                                            "Text": {
                                                "val": "Will evaluate impulse noise measurement techniques to assess the potential for acoustic (hearing) injury to Soldiers.  These results will provide an increased predictive capability for acoustic trauma.  Will determine the effect of a low level repeated blast exposure environment on vestibular function (balance and movement).  These results will lead to the refinement of medical guidelines that will prevent impaired Soldiers from being prematurely returned to duty."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health - Psychological Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines, validates, and disseminates early interventions to prevent and reduce combat-related behavioral health problems, including symptoms of post-traumatic stress disorder (PTSD), depression, anger problems, anxiety, substance abuse, post-concussive symptoms, and other health risk behaviors. This effort also assesses and refines interventions to enhance and sustain resilience throughout the Warfighter's career."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalized assessments of components of Advanced Battlemind; determined lessons-learned from post-deployment health assessments and healthcare utilization to determine outcomes of psychological disorders."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.843"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Establish key targeted skills that leaders employ to effectively build resilience and handle behavioral health issues in their units. Develop training content for these leader skills. Conduct studies to assess efficacy of new advanced resilience training modules post-deployment and deliver validated training. Validate enhanced resilience training techniques and assess optimal training delivery strategies. Assess post-deployment reintegration strategies. Develop and assess efficacy of spouse resilience training to enhance mental health and reintegration. Provide evidence-based guidance for adequate resourcing of mental health services for military families."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.566"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.566"
                                            },
                                            "Text": {
                                                "val": "Will finalize assessment of post-deployment reintegration strategies; conduct studies to show the effectiveness of behavioral health and resiliency skills for leaders; conduct studies to evaluate the efficacy of behavioral health and resiliency skills for leaders.  These results will be used to refine preventive and treatment interventions to enhance the psychological resilience of the Warfighter."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience - Suicide Prevention and Treatment of PTSD"
                                    },
                                    "Description": {
                                        "val": "This effort supports investigation of methods to treat PTSD in a military population and identifies causative and preventive factors in military suicides."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.133"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted a laboratory study to determine effects of PTSD on objectively measured sleep and neurocognitive performance; conducted studies to assess effectiveness of suicide interventions on suicide behavior."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.917"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct assessments to identify long-term effects of deployment (multiple and prolonged deployments, dwell time, and combat intensity) related to mental health symptoms (PTSD, etc.) and other illnesses (respiratory, hearing, functional, and cognitive); assess effectiveness of increasing suicide awareness training with decreasing suicide-related behaviors and intentions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.270"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.270"
                                            },
                                            "Text": {
                                                "val": "Will refine specific interventions for the most effective means of treating deployment-related PTSD.  These interventions include medications, psychotherapy, and complementary alternative medicine approaches.  Will refine valid screening and assessment measures for the Soldier at risk of suicide.  These early intervention strategies will be used to reduce suicide rates among service members.   Will determine efficacy of suicide prevention training for increasing suicide awareness and decreasing suicide-related behaviors and intent.  These results will help increase psychological resilience and mitigate the potential for suicide. Additionally, these results complement work in 6.3 Project MM3 and related DHP programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience - Concussion\/Mild Traumatic Brain Injury (mTBI) Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates methods to detect and treat concussion as well as identify and evaluate the effects of cognitive deficits in Soldiers during operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.225"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed the utility of neuropsychological measures for tracking\/monitoring recovery rate from concussion; conducted a study to determine predictive value of a neuropsychological test for subsequent pos-concussive symptoms; conducted a study to determine changes in sleep parameters coincident with concussion and correlated this data with changes in neuropsychological performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.696"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determine if concussion\/mTBI-related neurocognitive performance deficits predict other objective neurophysiological indicators of functional capability; assess impact of neurocognitive measures for tracking\/monitoring recovery rate and for providing guidance for the determination of return-to-duty status."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.434"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.434"
                                            },
                                            "Text": {
                                                "val": "Will refine an evidence (data)-based comparative analysis of the foremost neurocognitive (functions of the brain) tests for assessment of mild traumatic brain injuries in Soldiers; conduct an assessment to determine which post-concussion syndrome (PCS) symptoms are due to sleep disturbance; refine guidance on drug interventions to improve psychological and neurophysiological functioning post concussion.  These results will lead to the refinement of more effective interventions following concussive injury."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "870"
                    },
                    "ProjectTitle": {
                        "val": "DOD MED DEF AG INF DIS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.448"
                        },
                        "CurrentYear": {
                            "val": "16.842"
                        },
                        "BudgetYearOne": {
                            "val": "18.987"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.987"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "19.246"
                        },
                        "BudgetYearThree": {
                            "val": "19.397"
                        },
                        "BudgetYearFour": {
                            "val": "19.520"
                        },
                        "BudgetYearFive": {
                            "val": "19.631"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research for medical countermeasures to naturally occurring infectious diseases that pose a significant threat to the operational effectiveness of forces deployed outside the United States.  Effective preventive countermeasures (protective\/therapeutic drugs and vaccines, insect repellents and traps) protect the Force from disease and sustain operations by avoiding the need for evacuations from the theater of operations.  Diseases of military importance are malaria, bacterial diarrhea, and viral diseases (e.g., dengue fever and hantavirus).  In addition to countermeasures, this project funds refinement of improved diagnostic tools to facilitate early identification of infectious disease threats in an operational environment, informing Commanders of the need to institute preventive actions and improved medical care.  Major goals are to integrate genomics (DNA-based) and proteomics (protein-based) as well as other new biotechnologies into the refinement of new concepts for new vaccine, drug, and diagnostics candidates.\n\nResearch conducted in this project focuses on the following five areas:\n\n(1) Drugs to Prevent\/Treat Parasitic (symbiotic relationship between two organisms) Diseases\n(2) Vaccines for Preventing Malaria\n(3) Bacterial Threats\n(4) Diagnostics and Disease Transmission Control\n(5) Viral Threats\n\nFor the refinement of drugs and biological products, studies in the laboratory and in animal models provide a proof-of-concept for these candidate products including safety, toxicity, and effectiveness, and are necessary to provide evidence to the U.S. Food and Drug Administration (FDA) to justify approval for a product to enter into future human subject testing.  Additional non-clinical studies are often needed in Applied Research even after candidate products enter into human testing during Advanced Technology Development, usually at the direction of the FDA, to assess potential safety issues.  Drug and vaccine refinement bears high technical risk.  Of those candidates identified as promising in initial screens, the vast majority are eliminated after additional safety, toxicity, and\/or effectiveness testing.  Similarly, vaccine candidates have a high failure rate, as animal testing may not be a good predictor of human response, and therefore candidate technologies\/products are often eliminated after going into human trials.  Because of this high failure rate, a continuing effort to identify other potential candidates to sustain a working pipeline of countermeasures is critical for replacing those products that fail in testing.  \n\nWork is managed by the U.S. Army Medical Research and Materiel Command in coordination with the Naval Medical Research Center.  The Army is responsible for programming and funding all DoD naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.   \n\nPromising medical countermeasures identified in this project are further matured under PE 0603002A, project 810.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD, and its overseas laboratories; the U.S. Army Medical Research Institute of Infectious Diseases (USAMRIID), Fort Detrick, MD; and the Naval Medical Research Center (NMRC), Silver Spring, MD, and its overseas laboratories. \n\nEfforts in this project support the Soldier Portfolio and the principle area of Military Relevant Infectious Diseases."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Drugs to Prevent\/Treat Parasitic Diseases (harmful effects on host by an infecting organism)"
                                    },
                                    "Description": {
                                        "val": "This effort conducts assessments and improves candidate drugs coming from the DoD discovery program and from other collaborations for prevention and treatment of malaria to counter the continuing spread of drug resistance to current drugs.  Conducts assessments in animal models of currently available drugs for use against cutaneous leishmaniasis (a skin-based disease transmitted by sand flies).  This program selects the most effective and safe candidates for continued refinement and possible clinical testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.769"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Synthesized promising compounds in larger quantities to support preclinical studies. Drugs against malaria and\/or leishmaniasis were further screened in animal tests for toxicity and effectiveness. Completed testing and prepared for FDA application for clinical testing in humans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undertake preclinical effectiveness and toxicity evaluations of selected antiparasitic compounds, both in vitro (outside the body) and in vivo (within a living organism) in rat\/nonhuman primates and down-select for advancement to clinical studies in human."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.337"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.337"
                                            },
                                            "Text": {
                                                "val": "Will evaluate selected compounds for anti-parasitic effectiveness in animal models to further down-select for human trials; validate new malaria and leishmania models for predicting drug effectiveness and toxicity for future drug testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vaccines for Prevention of Malaria"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to investigate new candidate vaccines for preventing malaria and selects the best candidate(s) for continued refinement.  A highly effective vaccine would reduce or eliminate the use of anti-malarial drugs and would minimize the progression and impact of drug resistance to current\/future drugs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.182"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Down-selected among the vaccine candidates based on results from safety and effectiveness studies in animals; prepared for vaccine testing in locations where the disease occurs naturally."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.634"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Select candidate antigens (substance that when introduced into the body stimulates the production of an antibody) for further evaluation in preclinical testing and advance those candidates demonstrating effectiveness in primate testing toward further development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.522"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.522"
                                            },
                                            "Text": {
                                                "val": "Will optimize formulations of candidate antigens (substance that when introduced into the body stimulates the production of an antibody) in animal models for further evaluation in human clinical trials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostics and Disease Transmission Control:"
                                    },
                                    "Description": {
                                        "val": "This effort designs and prototypes new medical diagnostic and surveillance tools for the field, focusing on bedside and field-deployable diagnostic systems.  Refine interventions that protect Warfighters from biting insects such as sand flies, responsible for transmitting leishmaniasis, and mosquitoes, which transmit a variety of diseases including dengue fever, Japanese encephalitis, and malaria."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.070"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed super-attractant traps that remove biting insects from localized areas; conducted proof-of-concept testing of passive insect repellent systems; optimized hospital-based diagnostic devices for selected infectious disease agents to be transitioned to the Joint Biological Agent Identification System (JBAIDS) platform; increased repositories of clinical samples and reagents needed to develop and validate multiple new disease-specific diagnostic devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.709"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and optimize a multi-drug resistant organism diagnostic tool in collaboration with a commercial partner; transition the dengue virus diagnostic test for the JBAIDS platform to advanced development following preclinical trials; determine the next group of pathogens for which to develop rapid diagnostic tools with commercial partnership."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.949"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.949"
                                            },
                                            "Text": {
                                                "val": "Will refine diagnostic tools that provide on-the-spot identification of biting insects\/tick\/mites and their human\/animal pathogen infection status; evaluate new non-pesticidal technologies for insects population control; refine data package to obtain FDA clearance on the dengue JBAIDS assay; evaluate next generation diagnostic system platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Threats Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs and laboratory tests new vaccine candidates against Hhuman Immunodeficiency Virus (HIV), dengue and other hemorrhagic fever viruses such as hantaviruses (cause of Korean hemorrhagic fever) and other lethal viruses (i.e., Lassa fever and Crimean-Congo hemorrhagic fever), and assess other non-vaccine technologies to protect against such lethal viral diseases. Efforts also include establishment and maintenance of clinical trial sites worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.244"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed proof-of-concept molecular vaccines for viruses of military importance and supported vaccine candidate development by providing necessary laboratory and animal tests; provided laboratory support for dengue fever vaccine testing in humans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.989"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop proof-of-concept molecular vaccines for viruses of military importance; conduct effectiveness studies to develop and\/or maintain vaccine test site infrastructure; refine and validate assays in animal studies for future testing of dengue fever vaccine trials; establish partnerships with industry for pre-clinical and clinical evaluation of medical countermeasures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.726"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.726"
                                            },
                                            "Text": {
                                                "val": "Will refine vaccines for viruses of military importance; conduct effectiveness studies to refine and\/or maintain vaccine test site infrastructure; refine and validate assays in animal studies for future testing of dengue fever vaccine trials; establish partnerships with industry for pre-clinical and clinical evaluation of medical countermeasures; investigate the feasibility of combining vaccines against different agents into single-label, multi-agent vaccines. Will identify and characterize new populations who are at high risk of being infected with HIV for clinical evaluation of potential vaccine candidates at overseas sites; produce vaccines for various HIV subtypes and complete evaluation in animals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Threats"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to refine antibacterial countermeasures, including vaccine candidates, to prevent diarrhea (a common disease in deployed troops caused by E. coli, Campylobacter, and Shigella), meningitis (a threat to trainees, deployed troops, and military families), wound infection, and scrub typhus (a debilitating mite-borne disease that is developing resistance to currently available antibiotics)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.183"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Prepared an alternative E. coli vaccine for testing in humans; evaluated alternative Shigella constituents as potential vaccine candidates in animals; tested lead candidate Campylobacter vaccine in animals; continued to evaluate scrub typhus for drug resistance, identified new proteins as candidate vaccine components, and evaluated vaccine delivery methods in animals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.585"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determine level of protection of alternative E. coli vaccine in animal challenge studies (animal vaccinated and challenged with bacteria causing diarrhea); perform animal and toxicology studies on alternative (Invaplex-AR) Shigella vaccine; conduct human clinical trials on 12 to 24 healthy volunteers to determine safety of best lead candidate Campylobacter vaccine; perform animal wound infection studies on several candidate products to prevent wound infection and biofilm (thin resistant layer of microorganisms that helps bacteria survive in wounds) formation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.453"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.453"
                                            },
                                            "Text": {
                                                "val": "Will scale-up vaccine formulation process and conduct toxicity testing on additional E. coli vaccine candidates to ensure adequate safety and vaccine protection coverage; conduct preclinical animal studies to determine safety and immune response to live-attenuated Shigella bivalent (two types) vaccine; perform animal wound infection studies on candidate products to prevent wound infection and biofilm (an aggregate of microorganisms in which cells adhere to each other on a surface) formation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "873"
                    },
                    "ProjectTitle": {
                        "val": "HIV EXPLORATORY RSCH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.924"
                        },
                        "CurrentYear": {
                            "val": "9.377"
                        },
                        "BudgetYearOne": {
                            "val": "8.986"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.986"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.976"
                        },
                        "BudgetYearThree": {
                            "val": "8.969"
                        },
                        "BudgetYearFour": {
                            "val": "8.963"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts research on the human immunodeficiency virus (HIV), which causes acquired immunodeficiency syndrome (AIDS).  Work in this area includes refining improved identification methods to determine genetic diversity of the virus, and evaluating and preparing overseas sites for future vaccine trials.  Additional activities include refining candidate vaccines for preventing HIV and undertaking preclinical studies (studies required before testing in humans) to assess vaccine for potential to protect and\/or manage the disease in infected individuals.\n\nThis program is jointly managed through an Interagency Agreement between the U.S. Army Medical Research and Materiel Command and the National Institute of Allergy and Infectious Diseases of the National Institutes of Health.  This project contains no duplication of effort within the Military Departments or other government organizations.  \n\nWork is related to and fully coordinated with work funded in PE 0603105A, project H29. \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the Walter Reed Army Institute of Research (WRAIR) and the Naval Medical Research Center (NMRC), Silver Spring, MD, and their overseas laboratories.  The Henry M. Jackson Foundation (HMJF), located in Rockville, MD provides support for FDA testing and other research under a cooperative agreement.\n\nEfforts in this project support the Soldier Portfolio and the principle area of Military Relevant Infectious Diseases to include HIV."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HIV Research Program"
                                    },
                                    "Description": {
                                        "val": "This effort assesses new HIV vaccine candidates and worldwide vaccine test sites, tracks HIV disease outbreaks, and analyzes the genetic attributes of HIV threat."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.924"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Tested the new East African subtype-based candidate vaccine in animals; identified and characterized new HIV infections; developed new field sites in Tanzania and Nigeria for future testing of vaccine candidates in humans; identified manufacturing processes with multiple combinations of vaccine candidates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.377"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Characterize and develop new populations at high risk of being infected with HIV for clinical evaluation of potential vaccine candidates at overseas sites; study the impact of human genetics on HIV vaccine development, disease acquisition, and disease progression; manufacture vaccines for various HIV subtypes present worldwide and complete testing in animals; evaluate and implement methods of disease prevention through clinical research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.986"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.986"
                                            },
                                            "Text": {
                                                "val": "Will identify, refine, and maintain new clinical trial sites in Africa and Asia; manufacture vaccine candidates based on HIV subtypes present in Africa and Asia to perform pre-clinical testing in laboratory animals; test selected vaccine candidates in non-human, primate models to test safety and effectiveness of vaccine candidates to down-select best candidates for further testing in humans."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "874"
                    },
                    "ProjectTitle": {
                        "val": "CBT CASUALTY CARE TECH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.778"
                        },
                        "CurrentYear": {
                            "val": "17.017"
                        },
                        "BudgetYearOne": {
                            "val": "19.821"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.821"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "19.714"
                        },
                        "BudgetYearThree": {
                            "val": "16.446"
                        },
                        "BudgetYearFour": {
                            "val": "16.481"
                        },
                        "BudgetYearFive": {
                            "val": "16.565"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project refines and assesses concepts, techniques, and materiel that improve survivability and ensure better medical treatment outcomes for Warfighters wounded in combat and other military operations.  Combat casualty care research addresses: control of severe bleeding, revival and stabilization, prognostics and diagnostics for life support systems (predictive indicators and decision aids), treatment of burns, and traumatic brain injury (TBI).  Clinical and rehabilitative medicine research addresses: tissue repair including transplant technologies, orthopedic, eye injuries, and face trauma.\n\nResearch involves extensive collaboration with multiple academic institutions to refine treatments for combat wounds through the Armed Forces Institute of Regenerative Medicine.  This project is coordinated with the Military Departments and other government organizations to avoid duplication.\n\nResearch conducted in this project focuses on the following five areas:\n\n(1) Damage Control Resuscitation\n(2) Combat Trauma Therapies\n(3) Combat Critical Care Engineering\n(4) Clinical and Rehabilitative Medicine\n(5) Traumatic Brain Injury\n\nAll drugs, biological products, and medical devices are refined in accordance with U.S. Food and Drug Administration regulations, which governs testing in animals to assess safety, toxicity, and effectiveness prior to conducting human subject clinical trials.  \n\nPromising efforts identified in this project are further matured under PE 0603002A, project 840.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by the U.S. Army Institute of Surgical Research (USAISR), the U.S. Army Dental Trauma Research Detachment (USADTRD), Fort Sam Houston, TX; the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; and the Armed Forces Institute of Regenerative Medicine (AFIRM), Fort Detrick, MD. \n\nEfforts in this project support the Soldier Portfolio and the principle areas of Combat Casualty Care and Clinical and Rehabilitative Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort develop and refine knowledge products (such as manuals, protocols, studies, and media), materials, and systems for control of internal bleeding; minimizing the effects of traumatic blood loss; preserving, storing, and transporting blood and blood products; and resuscitation following trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.404"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed identification and characterization of frozen and freeze-dried blood substitutes and expanders; completed testing of interventions to stop internal bleeding and transitioned most promising candidates to safety and effectiveness testing in human subjects; continued to identify and assess potential ways to control blood clotting; began investigation of treatment interventions to mitigate effects of head injury on resuscitation; began to evaluate products to treat intracavitary (non-compressible) or junctional (compressible) hemorrhage; completed animal study of blood components and Complement Inhibitors (a series of disease-fighting proteins and their reactions in the body)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.155"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate studies of blood vessels, platelets (cell fragments that play a role in blood clotting), and coagulation (blood clotting) factor contributions to the body's ability to properly clot blood following trauma, as well as determine whether blood products cause inflammation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.003"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.003"
                                            },
                                            "Text": {
                                                "val": "Will continue coagulation (blood clotting) factor and inflammation studies; validate a portable, rapid, point-of-care device to measure clotting ability to guide providers administering resuscitation.  A diagnostic for coagulopathy of trauma (uncontrollable bleeding due to injury) will be transitioned to 6.3 and advanced development when sufficiently validated, then FDA approval for its use will be sought."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to enhance the ability to diagnose, stabilize, and accelerate wound healing and repair of damaged tissue for casualties with survivable wounds to the face and head, extremities, and brain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.168"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued poly-trauma studies (multiple injuries) of PBBI in large animals; completed oral surgical dressing study; continued to develop therapeutic strategies (drugs, stem cells and brain cooling) to manage TBI."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.634"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop local antibiotic delivery that can be used with Negative Pressure Wound Therapy; conduct studies of pre- vs. post-deployment dental classification; conduct research in skin, muscle, and bone repair. Work related to neuroprotection research moves to the TBI program.  Regenerative efforts in craniomaxillofacial trauma (soft tissue and skeletal injuries to the face, head and neck) moves to the Clinical and Rehabilitative Medicine Research Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.949"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.949"
                                            },
                                            "Text": {
                                                "val": "Will study how biofilms (an aggregate of microorganisms in which cells adhere to each other on a surface) reduce wound healing rate and impair wound closure in traumatic craniomaxillofacial wounds and begin to characterize biofilm diagnostics, dispersal agents, and therapies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort refines diagnostic and therapeutic medical devices as well as associated algorithms, software, and data-processing systems for resuscitation, stabilization, life support, and surgical support that can be applied across the pre-hospital, operational field setting, and initial definitive care facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.409"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated algorithms being developed to control devices delivering oxygen under conditions of varying rates and levels of respiration, as well as for ability to track resuscitation in real-time; continued testing devices for use in intensive care units."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.751"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop advanced monitoring technology to rapidly and accurately detect early-onset of blood loss, continuously estimate blood loss volume, and predict patient's risk for cardiovascular collapse."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.525"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.525"
                                            },
                                            "Text": {
                                                "val": "Will further refine algorithms to track blood loss under conditions of heat, cold, dehydration, varying rates of blood loss, etc. to determine possible causal relationships."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort conducts laboratory and animal studies on regenerating skin, muscle, nerve, and bone tissue, as well as studies regarding ocular and visual system traumatic injury for the care and treatment of battle-injured casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.797"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted studies using relevant animals to evaluate the most promising treatments for repairing traumatic eye injuries; continued regenerative medicine studies addressing ways to construct a nerve conduit scaffold to provide a guide for nerve regeneration; evaluated engineered cartilage; studied methods to reduce post-burn injury progression by use of inflammation inhibitors and agents to prevent cell death; explored the use of stem cells to repair soft and hard tissue defects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.694"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate novel drug delivery, diagnostic and\/or tissue repair strategies for eye injury; and evaluate candidate strategies for maxillofacial (head, neck, face and jaw) reconstruction, including wound-healing control and tissue engineering\/regeneration techniques to restore facial features. Continue development and standardization of animal models for an artificial means for guiding nerve regeneration; continue studies of chronic bone defect and burn repair; continue studies of soft tissue repair strategies; continue development and testing of experimental stem cell therapies and scaffolds (tissue-engineered grafts) in animal models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.798"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.798"
                                            },
                                            "Text": {
                                                "val": "Will continue to refine novel drug delivery, diagnostic and tissue repair strategies including stem cell therapies utilizing knowledge deliverables from FY 2012; further refine animal models to assess soft and hard tissue regeneration technologies; continue studies of burn, scar less wound, soft tissue, and bone repair strategies; expand refinement and testing of stem cell therapies and scaffolds (tissue-engineered grafts) in animal models. Building on promising approaches from FY 2012, by continuing the evaluation of candidate strategies for maxillofacial (head, neck, face and jaw) reconstruction, including wound-healing control and tissue engineering\/regeneration techniques to restore facial features."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement of drugs and therapeutic strategies to manage brain injury resulting from battlefield trauma, to include mature drug technologies, novel stem cell strategies, and selective brain cooling."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.783"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Realign neuroprotection research from the Combat Trauma Therapies task area to the TBI task area. Continue studies of a single and combination drug therapies of silent seizures, animal studies of stem cell therapy for repair of brain tissue, and optimizing cooling temperature and duration of cooling to improve functional recovery."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.546"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.546"
                                            },
                                            "Text": {
                                                "val": "Will further investigate selective brain cooling and non-embryonic stem cells derived from human amniotic fluid as non-traditional therapies for TBI."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FH2"
                    },
                    "ProjectTitle": {
                        "val": "FORCE HEALTH PROTECTION - APPLIED RESEARCH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.406"
                        },
                        "CurrentYear": {
                            "val": "9.122"
                        },
                        "BudgetYearOne": {
                            "val": "6.279"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.279"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.316"
                        },
                        "BudgetYearThree": {
                            "val": "6.436"
                        },
                        "BudgetYearFour": {
                            "val": "6.523"
                        },
                        "BudgetYearFive": {
                            "val": "6.568"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts research to support applied research directed toward the sustainment of a healthy force of Warfighters from accession through retirement.  This research focuses on enhanced protection of Soldiers against health threats in military operations and training.  Stressors that adversely affect individual Soldier health readiness are identified and studied to refine interventions that will protect Soldiers and improve their health and performance in stressful environments.  This is follow-on research that extends and applies findings from over a decade of research on Gulf War Illnesses and other chronic multi-symptom illnesses that have suspected nerve and behavioral alterations due to environmental contaminants and deployment stressors.  Key databases include the Millennium Cohort Study and the Total Army Injury and Health Outcomes Database.  These databases allow us to evaluate interactions of psychological stress and other deployment and occupational stressors that affect Warfighter health behaviors.\n\nForce Health Protection applied research is conducted in close coordination with the Department of Veterans Affairs.  This project contains no duplication with any effort within the Military Departments and includes direct participation by other Services working on Army projects.\n\nResearch conducted in this project focuses on the following three areas:\n\n(1) Physiological Response and Blast and Blunt Trauma Models of Thoracic (chest) and Pulmonary (lung) Injuries\n(2) Millennium Cohort Research\n(3) Biomarkers of Exposure and Environmental Biomonitoring\n \nPromising efforts identified in this project are further matured under PE 0603002A, project FH4.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.    \n \nWork in this project is performed by the U.S. Army Center for Environmental Health Research, Fort Detrick, MD; the Naval Health Research Center (NHRC), San Diego, CA; and the U.S. Army Research Institute of Environmental Medicine (USARIEM), Natick, MA. \n\nEfforts in this project support the Soldier Portfolio and the principle area of Combat Casualty Care."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Millennium Cohort Research"
                                    },
                                    "Description": {
                                        "val": "This effort supports a long-term study of Soldiers that includes psychological, physical, and spiritual impacts of military service throughout their lifetime. The Millennium Cohort and Deployment Health Task area employs a prospective epidemiological (study of health-event patterns in a society), surveillance research design to address mental health and comorbid (multiple) disorders, including neurological and other chronic degenerative disorders, fitness and readiness performance outcomes, and longer-term physical and mental health illnesses and disease over the lifecycle of military servicemen and women."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.943"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted analyses to determine resilience factors for PTSD symptoms over time; conducted analysis to determine factors that influence resistance to depression symptoms over time and enhance mental resilience in deploying forces; conducted death analysis with specific interest in modifying factors for post-combat suicide."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.393"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop policy recommendations and potential intervention strategies for reduction of PTSD, depression, and anxiety symptoms and factors with a goal to reduce overall mental health symptoms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.068"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.068"
                                            },
                                            "Text": {
                                                "val": "Will plan and conduct analyses to further identify gender risk differences for PTSD and depression associated with deployment; examine return-to-duty parameters related to multiple health and injury illnesses; disseminate strategic findings from studies that support policy formation and guide further research to promote the longer term physical and mental health of the force. These results will lead to the formulation of strategies designed to mitigate the adverse psychological effects of military deployments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biomarkers of Exposure and Environmental Biomonitoring"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement and evaluation of methods to detect environmental contamination and toxic exposure during military operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.581"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated biomarkers of exposure to additional Militarily Relevant Chemicals; evaluated and accelerated discovery methods for new biomarkers; optimized individual toxicity sensor performance and minimized system components to comply with logistical deployment requirements for use in the final increment of the Environmental Sentinel Biomonitor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.002"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide rapid toxicity identification for industrial and agricultural chemicals in Army field drinking water supplies; complete and submit prototype toxicity sensors for evaluation based on the U.S. Environmental Protection Agency's\nTechnology Testing and Evaluation Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.757"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.757"
                                            },
                                            "Text": {
                                                "val": "Will conduct assessment of high priority Army research needs in nano-material characterization, exposure assessment, toxicity studies, or risk assessment.  This will provide Soldiers with exposure risk health assessment to the potential health hazards associated with nano-materials in the environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physiological Response and Blast and Blunt Trauma Models of Thoracic (Chest) and Pulmonary (Lung) Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports modeling and assessment of the combined effects of blast, impact, and ballistic trauma on the chest and lung system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined combined thoracic (chest) blunt trauma\/physiology models against combined thoracic blunt trauma and inhalation large animal exposure tests; combined thoracic blast trauma model with performance decrement models to develop an integrated tool for survivability assessment and health hazard analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.727"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop software that evaluates the combined physiological effects of toxic gas exposure; assess software that estimates lung, heart, and rib injury from blunt trauma due to debris impact (secondary blast injury); assess increased functionality and support end-users for health hazard assessment, survivability assessment, and personal protection evaluation and improvement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.454"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.454"
                                            },
                                            "Text": {
                                                "val": "Will refine software that integrates blast, toxic gas, and blunt trauma injury prediction models into a combined application for integrated blast injury and performance assessment. This will provide Commanders with a single assessment tool for a myriad of health hazards.  This will also provide the Commander with an enhanced capability to assess injury-related risk for the Warfighter."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VB4"
                    },
                    "ProjectTitle": {
                        "val": "SYSTEM  BIOLOGY AND NETWORK SCIENCE TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.135"
                        },
                        "CurrentYear": {
                            "val": "4.741"
                        },
                        "BudgetYearOne": {
                            "val": "4.802"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.802"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.839"
                        },
                        "BudgetYearThree": {
                            "val": "4.792"
                        },
                        "BudgetYearFour": {
                            "val": "4.869"
                        },
                        "BudgetYearFive": {
                            "val": "4.948"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts research in systems biology to provide a highly effective mechanism to understand, compare and combine iterative biological tests, computer simulations, and animal studies that have the potential to significantly reduce the time and effort invested in medical product refinement.  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the U.S. Army Medical Research and Materiel Command, Fort Detrick, MD. \n\nEfforts in this project support the Soldier Portfolio and the principle area of Systems Biology\/Network Sciences."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Biology"
                                    },
                                    "Description": {
                                        "val": "This project conducts multidisciplinary applied research in systems biology designed to understand, compare and combine animal studies, computational simulations, and biologics (products derived from living organisms)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.135"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined experimental model systems, identified markers for prediction of multi-organ failure resulting from heat injury, and developed supporting computational models of regulatory systems of heat injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.741"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refine experimental systems for assessment and enhancement of computational models for identifying pharmacological interventions for heat stroke-caused multi-organ failure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.802"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.802"
                                            },
                                            "Text": {
                                                "val": "Will perform experiments and high-content screening for host responses to environmental hazards and disease states (initially PTSD and trauma coagulopathy (a condition affecting the blood's ability to clot)). Will refine and begin validating a computational platform and mathematical models for biological responses to toxicity, disease, and injury. Will identify candidate biomarkers for adverse host responses."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VJ4"
                    },
                    "ProjectTitle": {
                        "val": "SUICIDE PREVENTION\/MITIGATION"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.000"
                        },
                        "CurrentYear": {
                            "val": "9.984"
                        },
                        "BudgetYearOne": {
                            "val": "10.109"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.109"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "10.114"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds research over a planned five (5) year period to examine the mental and behavioral health of Soldiers to counter suicidal behavior.  This work will focus on advancing understanding of the multiple determinants of suicidal behavior, psychopathology (study of the causes and nature of abnormal behavior), psychological resilience, and role functioning.  A significant thrust area will focus on the refinement of better methods for preventing and mitigating suicidal behavior as well as to improve the overall mental health and behavioral function of Army personnel during and after their military service.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.   \n \nWork on this project is performed by The National Institute of Mental Health (NIMH) through extramural cooperative research grants in collaboration with the Department of the Army. \n\nEfforts in this project support the Soldier Portfolio and the principle area of Military Operational Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Suicide Prevention\/Mitigation"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to better understand the apparent increase in suicide deaths and nonfatal attempts among Active Duty Soldiers, as well as identify improved prevention\/intervention methods for individuals at risk for suicide based on data-driven recommendations. The efforts would be utilized to decrease suicide rates in both military populations as well as in the general public."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to conduct research to better understand the apparent increase in suicide deaths and nonfatal attempts among active duty Soldiers; continued epidemiological (population-based) studies to identify determinants of suicidal behaviors and potential modifiable risk factors;  continued to develop better methods for preventing suicidal behaviors based on data driven recommendations to mitigate or prevent suicidal behaviors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.984"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue epidemiological (population-based) studies to further identify determinants of suicidal behavior as well as potential modifiable risk factors; collect data for suicide-death case control study; conduct research efforts to assist in improved identification of individuals at greatest risk for suicide as well as to validate screening measures and enhance prevention\/intervention methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.109"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.109"
                                            },
                                            "Text": {
                                                "val": "Will continue epidemiological (population-based) studies to further identify determinants of suicidal behavior and potential modifiable risk factors; will collect data for suicide-death case control study; will conduct research efforts to assist in improved identification of individuals at greatest risk for suicide, validate screening measures, and enhance prevention\/intervention methods."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}