{
    "id": "eeeac8d1325e598fc15b74631b727cfdcefc5087",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602271N"
        },
        "ProgramElementTitle": {
            "val": "Electromagnetic Systems Applied Research"
        },
        "R1LineItemNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "86.965"
            },
            "CurrentYear": {
                "val": "108.185"
            },
            "BudgetYearOne": {
                "val": "78.228"
            },
            "BudgetYearOneBase": {
                "val": "78.228"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "79.538"
            },
            "BudgetYearThree": {
                "val": "81.645"
            },
            "BudgetYearFour": {
                "val": "78.581"
            },
            "BudgetYearFive": {
                "val": "80.100"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Applied Research (PE 0602750N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.2 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThe Electromagnetic Systems Applied Research Program addresses technology needs associated with Naval platforms for new capabilities in EO\/IR Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics.  The program supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution.  This program directly supports the Department of Defense Joint Warfighter Plan and the Defense Technology Area Plans.  Activities and efforts within this Program have attributes that focus on enhancing the affordability of warfighting systems.  The program also provides for technology efforts to maintain proactive connectivity and collaboration between Department of the Navy (DON) Science and Technology (S&T) and Joint, Navy, and Marine Corps commands worldwide.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "83.902"
                },
                "CurrentYear": {
                    "val": "108.329"
                },
                "BudgetYearOne": {
                    "val": "104.339"
                },
                "BudgetYearOneBase": {
                    "val": "104.339"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "86.965"
                },
                "CurrentYear": {
                    "val": "108.185"
                },
                "BudgetYearOne": {
                    "val": "78.228"
                },
                "BudgetYearOneBase": {
                    "val": "78.228"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.063"
                },
                "CurrentYear": {
                    "val": "-0.144"
                },
                "BudgetYearOne": {
                    "val": "-26.111"
                },
                "BudgetYearOneBase": {
                    "val": "-26.111"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.144"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.659"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.072"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-26.867"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-26.867"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.756"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.756"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.524"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Electromagnetic Systems Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "86.965"
                        },
                        "CurrentYear": {
                            "val": "108.185"
                        },
                        "BudgetYearOne": {
                            "val": "78.228"
                        },
                        "BudgetYearOneBase": {
                            "val": "78.228"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "79.538"
                        },
                        "BudgetYearThree": {
                            "val": "81.645"
                        },
                        "BudgetYearFour": {
                            "val": "78.581"
                        },
                        "BudgetYearFive": {
                            "val": "80.100"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses technology opportunities associated with Naval platforms for new capabilities in EO\/IR Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics.  The project supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution.  This project directly supports the Department of Defense Joint Warfighter Plan and the Defense Technology Area Plans.  Activities and efforts within this program have attributes that focus on enhancing the affordability of warfighting systems.  The program also provides for technology efforts to maintain proactive connectivity and collaboration between Department of the Navy (DON) Science and Technology (S&T) and Joint, Navy, and Marine Corps commands worldwide.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ELECTRONIC AND ELECTROMAGNETIC SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "This R2 activity is devoted to mid-term technology development in close concert with programs of record.  The products of these efforts are expected to transition at the end of their schedule into the associated program of record.  These Future Naval Capability (FNC) Enabling Capabilities (EC's) span across the Electronics, EW, Radar, Communications, and other technology areas supporting Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR).  This R2 activity also appears in PE 0603271N.  For Enabling Capabilities (EC) receiving funding from both PE's the PE 0602271N portion is generally focused on component design and development while the funding from PE 0603271N is focused on integration and demonstration.  The specific objectives of the current EC's are:\n\na) Next Generation Airborne Electronic Attack: Develop and demonstrate advanced capability Airborne Electronic Attack (AEA) sub-systems (e.g., broadband exciters, power amplifiers, and transmit arrays) that provide Suppression of Enemy Air Defenses (SEAD), deliver Non-Kinetic Fires, counter Integrated Air Defense Systems (IADS), and provide suppression of Command, Control & Communications (C3) links and data networks.\n\nb) Countermeasures Technologies for Anti-Ship Cruise Missiles (ASCM) and Anti-Ship Ballistic Missiles (ASBM) Defense: Improve ship survivability by disrupting the terminal engagement phase of hostile anti-ship cruise and ballistic missiles, including improvements to both onboard (Enhanced Surface Electronic Warfare Improvement Program,(SEWIP)) and offboard (Nulka) radio frequency (RF) Electronic Attack systems.\n\nc) Next Generation Countermeasure Technologies for Ship Missile Defense: Develop and demonstrate the fundamental technologies required to conduct next generation, persistent Electronic Warfare (EW) in support of ship, sea base, and littoral force missile defense operations in a distributed, coordinated manner across the entire battlespace.\n\nd) Long Range Detection and Tracking: Develop capability for simultaneous full volume radar coverage of contacts at long ranges and in a dense contact environment.\n\ne) Affordable Electronically Scanned Array Technology for Next Generation Naval Platforms: Develop and demonstrate electronics components technologies using wide bandgap semiconductors, mixed signal analog and digital, RF, microwave, millimeter wave and associated passive components thus enabling high efficiency transmitter element chains for arrays.\n\nf) Affordable Common Radar Architecture: Develop a common affordable, scalable, open radar architecture that provides affordable capability improvements and addresses total ownership cost challenges for 5 different radars.\n\ng) Low Cost over the Horizon Communications, Satellite Communications (SATCOM) and Line of Sight (LOS) Apertures: Develop technologies that provide the tools to implement a wideband tactical communications infrastructure.  Developments will include techniques for LOS relay and routing using airborne platforms, as well as a SATCOM on-the-move capability for United States Marine Corps (USMC) tactical ground vehicles.  Also included are technologies for pointing and tracking of airborne platforms, open architecture radio technologies, communications security (COMSEC), networking, and airborne apertures necessary for airborne relay and routing.  Further developments include techniques for integrating multiple shipboard apertures in a limited space, cosite mitigation and the investigation of digital radio technologies that permit digitization at the aperture itself.\n\nh) SATCOM Vulnerability Mitigation: Develop technologies for mitigating SATCOM vulnerabilities using a wideband airborne and air-to-surface infrastructure.  Technologies include approaches for development of ultra-low cost phased arrays and techniques for mitigating multi-path and scintillation on communications links.  Architecture and application development will include surface-to-air communications in the 14-17 gigahertz (GHz) band, and air-to-air communications in the millimeter wave bands.  Additionally, advanced techniques for the use of the ultra high frequency (UHF) spectrum will be developed which include beam forming techniques and alternative waveform designs that are used to support high bandwidth infrastructure establishment and control.\n\ni) Radar Electronic Attack Protection (REAP): Develop single platform precision passive electronic support measure (ESM) and electronic protection (EP) techniques and technology to counter hostile use of modern electronic attack (EA) self protection jammers.\n\nj) Data Exfiltration Nanosatellite Innovative Space Enabler (DENISE)(formerly known as Global Applications for Data Exfiltration(GLADEX)): Develop a nano-sat satellite bus with all its requisite structural, power, thermal, control, and separation subsystems and a nano-satellite compatible payload and ground terminal for monitoring and relay of unattended sensor data for global situational awareness.\n\nk) Joint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW) 3.3: Develop integrated RF communications and RF jammer capability that addresses the electromagnetic interference (EMI) issue to enable interoperability.\n\nl) Wide Area Surgical and Persistent Surveillance (WASPS) Capabilities For Tier 2\/3 UAVs:  Develop and integrate enhanced capability interactive autonomous, small, lightweight EO\/IR SAR, SIGINT sensors and integrate into an upgraded smaller lightweight, stabilized gimbal designed for 24\/7 persistent surveillance applications.\n\nm) Submarine Survivability-Electronic Warfare: Develop and demonstrate technologies that will provide submarines an EA capability against surveillance radar systems through EW payloads integrated with submarine masts, as well as networked offboard platforms.  These capabilities will improve the submarine's survivability in a hostile RF environment by providing a non-kinetic strike capability against enemy Intelligence, Surveillance and Reconnaissance (ISR) sensors\n\nn) Hostile Fire Suppression System: Develop effective non-lethal suppression against current and future non-guided threats through application of a visible laser with closed-loop power management to cause temporary loss of visual acuity to the weapon operator sufficient to defeat the weapon engagement.\n\no) Cooperative Networked Radar- Develop radar techniques to enhance sensitivity, improve electronic protection, expand intercept geometries, and save costs for advanced radars. \n\np) Long Range RF Find, Fix, and ID- Develop radar techniques and algorithms for airborne identification.\n\nThe increase from FY 2011 to FY 2012 is due to initiating EC programs \"Submarine Survivability - Electronic Warfare\" and \"Wide Area Surgical and Persistent Surveillance (WASPS) Capabilities For Tier 2\/3 UAVs\" and increased investment in JCREW.  \n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 Activity to a new FNC R2 activities titled, Expeditionary Maneuver Warfare, Enterprise and Platform Enablers, FORCEnet, Sea Shield, and Sea Strikes.  Efforts in this R2 Activity have been continued from FY 2012 to FY 2013 in the new R2 Activities to support all FNC program EC investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.647"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Next Generation Airborne Electronic Attack:\n- Continued the development of RF technologies that support advances in receiver architecture, antenna performance, subsystem miniaturization, decoys and advanced signal processing.\n- Continued the Next Generation Airborne Electronic Attack (NGAEA) effort by conducting a requirements validation and technology assessment review.\n\nCountermeasures Technologies for Anti-Ship Cruise Missiles (ASCM) and Anti-Ship Ballistic Missile (ASBM) Defense:\n- Continued establishment of an industrial standard appropriate for the demonstration of greater than 106(>1E6) hour lifetime for RF life testing of Gallium Nitride (GaN) based Monolithic Microwave Integrated Circuits (MMICs) and devices, and began to apply this standard to state-of-the-art (SOA) MMICs and devices.\n- Continued the Enhanced Nulka Payload FNC effort by conducting a Transmitter and Receiver Technology Trade Space study.\n- Continued the Enhanced Surface Electronic Warfare Improvement Program (SEWIP) Transmitter FNC effort by conducting a Transmitter and Cooling Technology Trade Space study.\n- Redesigned and fabricated a new cooling method due to an increase in the junction temperature from DARPA's Government Furnished Equipment (GFE) amplifier.\n- Redesigned and fabricated a new amplifier mounting design which is required to accommodate the reduction of amplifier temperatures.\n\nNext Generation Countermeasure Technologies for Ship Missile Defense:\n- Continued the Next Generation Countermeasures Technologies for Ship Missile Defense effort by development of techniques and technology for coordination of offboard surface\/air EW payloads to achieve wide area protection for defense against anti-ship missiles.\n\nLong Range Detection and Tracking:\n- Continued demonstration of packaging techniques to provide cost reduction and affordability for modules, including component architecture, packaging, and scale of integration optimization.\n- Continued design and development of a X-Band Digital Array Radar (DAR).\n- Continued development of Maritime Classification and Identification modes for APY-6.\n- Continued development of full volume surveillance capability of the DAR advanced development model prototype.\n\nAffordable Electronically Scanned Array Technology for Next Generation Naval Platforms:\n- Continued effort on Affordable Electronically Scanned Array Technology to include electronics component technologies supporting S-band radar, X-band radar and electronic attack.\n\nAffordable Common Radar Architecture (ACRA):\n- Continued development of an Affordable Common Radar Architecture to improve supportability and performance of multiple legacy radars.\n\nLow Cost over the Horizon Communication, SATCOM and LOS Apertures:\n- Completed development of technology to provide a set of apertures (LOS, Satellite Communications) and link electronics that are suitable for broad Naval applications.\n- Completed development of technology to provide open, programmable core terminal components applicable to multiple platforms to include airborne applications and Marine vehicles.\n- Completed development of low cost satellite, airborne and shipboard apertures; demonstrate components in laboratory and realistic field environments.\n\nSATCOM Vulnerability Mitigation:\n- Continued wideband infrastructure architecture design and development, development of alternative waveforms and development of advanced techniques for use of the spectrum.\n- Continued development of technology components (e.g., phased arrays\/apertures, cosite and fade mitigation techniques, advanced high band (14-17 GHz) signal processing radios) needed to support a wideband airborne infrastructure.\n\nRadar Electronic Attack Protection (REAP):\n- Progressed a Network \"Sentric\" Electronic Protection (EP) capability by developing hardware, software and algorithms to achieve a multiplatform networked EP.\n- Progressed the Identification and Defeat of Electronic Attack Systems (IDEAS) FNC effort by developing single platform precision passive electronic support measure (ESM) and EP techniques and technology to counter hostile use of modern electronic attack self protection jammers.\n\nData Exfiltration Nanosatellite Innovative Space Enabler (DENISE):\n- Developed a spacecraft bus structure, thermal, power, control, and command\/telemetry systems for 3-axis, maneuverable, 30cm cube, 10kg, 10watt orbital average nano-satellite.\n- Developed launch dispensing separation mechanisms.\n- Developed a multi-function Data-Ex payload and ground terminal for reception of low rate (<9600 bits\/sec) VHF - UHF transmissions.\n\nJoint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW) 3.3:\n- Developed JCREW 3.3 architecture analysis and design.\n- Developed JCREW 3.3 component development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.603"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Next Generation Airborne Electronic Attack:\n- Continue all efforts of FY 2011.\n\nCountermeasures Technologies for Anti-Ship Cruise Missiles (ASCM) and Anti-Ship Ballistic Missile (ASBM) Defense:\n- Continue all efforts of FY 2011.\n- Complete the Enhanced Nulka Payload FNC effort.\n\nNext Generation Countermeasure Technologies for Ship Missile Defense:\n- Continue all efforts of FY 2011.\n\nLong Range Detection and Tracking:\n-  Continue all efforts of FY 2011 less those noted as complete below.\n-  Complete demonstration of full volume surveillance capability of the DAR advanced development model prototype\n\nAffordable Electronically Scanned Array Technology for Next Generation Naval Platforms:\n- Continue all efforts of FY 2011.\n\nAffordable Common Radar Architecture (ACRA):\n- Continue all efforts of FY 2011.  \n\nSATCOM Vulnerability Mitigation:\n- Continue all efforts of FY 2011. \n\nRadar Electronic Attack Protection (REAP):\n- Continue all efforts of FY 2011.\n\nData Exfiltration Nanosatellite Innovative Space Enabler (DENISE):\n- Continue all efforts of FY 2011. \n\nJoint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW) 3.3:\n- Complete  JCREW 3.3 architecture analysis and design and component development.\n- Develop the Distributed Counter-RCIED FNC effort through algorithm development and assessment.\n- Develop the Integrated Counter-RCIED EW (ICEW) FNC effort by starting component design and integration plans.\n\nWide Area Surgical and Persistent Surveillance (WASPS) Capabilities For Tier 2\/3 UAVs:\n- Develop and integrate enhanced capability interactive autonomous, small, lightweight EO\/IR SAR, SIGINT sensors and integrate into an upgraded smaller lightweight, stabilized gimbal designed for 24\/7 persistent surveillance applications.\n\nSubmarine Survivability-Electronic Warfare: \n- Progress the Coherent Electronic Attack for Submarines (CEAS) FNC effort by commencing development of the compact EA payload and techniques for the multi-mission mast (MMM).\n- Progress the Distributed Coherent Electronic Attack for Submarines (D-CEAS) FNC effort by commencing an assessment of current capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ELECTRONIC WARFARE TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Electronic Warfare (EW) systems across the entire electromagnetic spectrum that will increase the operational effectiveness and survivability of U.S. Naval units.  Emphasis is placed on passive sensors and active and passive countermeasure (CM) systems that exploit and counter a broad range of electromagnetic threats.  The focus is on maintaining near perfect real-time knowledge of the enemy; countering the threat of missiles against deployed Naval forces; precision identification and location of threat emitters; and development of technologies that have broad application across multiple disciplines within the EW mission area.  This activity also includes developments to protect these technologies from external interference and modeling and simulation required to support the development of these technologies.  Also included is technology development in support of the Integrated Distributed Electronic Warfare System (IDEWS) concept.  The current specific objectives are:\n\na) Sensors for the Purpose of Detection, Localization, and Identification of Hostile Signals of Interest:\nDevelop sensors for the purpose of detection, localization, and identification of hostile signals of interest anywhere in the electromagnetic spectrum to provide autonomous and persistent Intelligence, Surveillance, and Reconnaissance (ISR) to forward deployed forces and detecting\/identifying terrorists\/hostiles and their communications networks.\n\nb) Components and Advanced Architectures\/Signal Processing Designs: \nDevelop components and advanced architectures\/signal processing designs to ensure effective and reliable threat detection of hostile emissions in dense environments.\n\nc) Countermeasures and Techniques to Defeat Advanced Radio Frequency (RF) Guided Threats:\nDevelop countermeasures and techniques to defeat advanced RF guided threats to protect high value assets from advanced weapon attack, develop forward deployed jamming systems to negate advanced RF surveillance systems, and deny enemy usage of Global Positioning System (GPS) navigation.\n\nd) Countermeasures and Techniques to Defeat Advanced Electro-Optic\/Infrared (EO\/IR) Guided Threats: \nDevelop countermeasures and techniques to defeat advanced EO\/IR guided threats to protect high value assets from advanced weapon attack, disrupt and attack EO\/IR ISR assets, and provide false\/misleading information to hostile EO\/IR targeting and tracking systems.\n\ne) Modeling and Simulation: \nUse modeling and simulation to assess the effectiveness of Electronic Attack (EA) engagements to develop an understanding of adversary threat characteristics to support countermeasures technique requirements\/development and assess\/predict engagement effectiveness to optimize combat system engagement resources.\n\nf) Electronic Protection from Electromagnetic Interference (EMI) and EA: \nDevelop Electronic Protection (EP)\/Electronic Counter-Countermeasures (ECCM) to prevent the disruption and denial of U.S. Naval RF and EO\/IR sensors and systems from both unintentional EMI and intentional EA and permit unimpeded usage of the electromagnetic spectrum by U.S. and allied forces.\n\ng) Joint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW): \nDevelop and demonstrate technologies to improve virtually all aspects of performance related to next generation JCREW equipment.\n\nh) Offboard\/Unmanned Platforms - Electronic Warfare: \nDevelop and demonstrate technologies that support the increased effectiveness of EW unmanned platforms.\n\ni) Integrated Distributed Electronic Warfare System (IDEWS) concept: Develop and demonstrate technologies that will enable the control of the electromagnetic (EM) spectrum over wide geographical areas, optimally utilizing all available off-board and on-board EW assets to provide synchronized and networked EW sensing and attack.\n\nj) Electronic Warfare (EW) Roadmap: \nDevelop classified advanced electronic warfare technology in support of current and predicted capability requirements. \n\nk)  Wideband Electronic Support (ES) - Sensing\/Processing: \nDevelop and demonstrate the capability of ES systems to provide wideband (1-110 gigahertz (GHz)) spectral coverage and improve naval (Navy and Marine Corps) battlespace awareness, which includes continuously monitoring this critical portion of the EMS; quickly and accurately classifying emitters and emitter functions; precisely and rapidly locating platforms, people, things, and events; and conducting accurate long-term monitoring and tracking of hostile forces.\n\nl) Wideband Electronic Attack (EA) - Components\/Techniques:\nDevelop and demonstrate the capability of EA systems to provide wideband (1-110 GHz) spectral coverage and improve naval (Navy and Marine Corps) ability to limit or deny enemy access to the EMS; provide false or misleading information to enemy C4ISR and targeting systems; and damage or degrade enemy sensing capabilities.\n\nm) Millimeter Wave (MMW) High Power Transmitters:\nTo improve the capability of naval (Navy and Marine Corps) EA systems to deny or deceive sensors or weapons guidance systems operating in the MMW bands of the Electro-Magnetic Spectrum (EMS).\n\nThe increase from FY 2011 to FY 2012 is due to increased emphasis and priority in research supporting the Sensors for the Purpose of Detection, Localization, and Identification of Hostile Signals of Interest, and Components and Advanced Architectures\/Signal Processing Designs research objectives.\n\nThe increase from FY 2012 to FY 2013 is due to increased emphasis and priority in research supporting Electronic Warfare technology development. \n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.140"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors for the Purpose of Detection, Localization, and Identification of Hostile Signals of Interest:\n- Continued technology development in the areas of Tactical Aircraft, Surface Ships, Submarines, Unmanned Aerial Vehicles (UAVs), and EW Enabling Technology.\n- Continued the development of techniques to identify and exploit the processing vulnerability of passive location systems. \n- Continued the Digital Directional Correlator (DDC) effort by building and refining a more complete simulation of the correlator and determining via simulation and analysis the primary characteristics required for the system.\n- Developed multispectral imaging capability in Short Wave Infrared (SWIR), Mid-Wave Infrared (MWIR) and Long Wave Infrared (LWIR) spectral bands using a rugged common aperture. \n- Advanced in the understanding of cognitive\/software defined radios used in communications. \n- Developed algorithms\/techniques to provide additional\/improved maritime domain awareness from existing sensor data. \n\nComponents and Advanced Architectures\/Signal Processing Designs:\n- Continued development of RF technologies that support advances in receiver architecture, antenna performance, subsystem miniaturization, decoys and advanced signal processing.\n- Continued development of a novel approach to near real time active digital augmentation to improve the isolation of shipboard EW systems.\n- Continued the Exploiting Non-Traditional Signals Using a Photonics Based Signal Processor effort by performing proof-of-concept demonstrations for the three main modes of operation for the spatial spectral optical materials when used for Electronics Support Measures (ESM) applications.\n- Completed the Direction Finding of Low Probability of Intercept (LPI) Emitters effort by conducting field testing\n\nCountermeasures and Techniques to Defeat Advanced RF Guided Threats:\n- Continued the investigation of MMW technologies to support the development of off board and onboard countermeasures.\n- Completed the Concurrent Multi-Spectral RF Carrier Generator effort to develop a single-chip, low power multi-spectral RF jamming subsystem that has programmable and automatic random mode switching and nanosecond frequency hopping over 1-18 GHz. \n\nCountermeasures and Techniques to Defeat Advanced EO\/IR Guided Threats:\n- Continued efforts to Detect and Deny EO\/IR ISR Systems by developing passive and active detection systems using advanced Focal Plane Array (FPA)-based sensors and multi-spectral laser transmitters.\n- Continued efforts to Detect and Defeat Imaging IR sensors by developing laser-based countermeasures and advanced IR expendable decoys.\n- Progressed the Multi-Wavelength Laser with Broad Spectrum Coverage effort by commencing quantum cascade (QC) and interband cascade (IC) chip design and fabrication in Band 4a.\n- Progressed the High Power LWIR QC Lasers for Shipboard Infrared Countermeasures (IRCM) effort with device design and thermal modeling tasks.\n- Progressed the Layered Multi-band Obscurant effort by commencing numerical analysis to optimize the predicted performance of potential materials for macroparticle design and fabrication.\n- Progressed the Directed Energy Defeat of Multi-Mode Threats effort by measuring missile seeker interference effects.\n\nModeling and Simulation:\n- Completed the Real-Time EA Effectiveness Monitoring effort to assess the effectiveness in real-time of jamming an RF guided missile by exploiting the missile's RF transmission characteristics.\n- Completed the Integrated Onboard\/Offboard EA Effectiveness effort by starting investigation with offboard decoy waveforms and structured ship targets.\n\nElectronic Protection from EMI and EA:\n- Continued efforts for Electronic Protection of RF Sensors by developing passive and active techniques to adaptively process RF signals in EA denied and RF saturation environments.\n- Continued efforts for Electronic Protection of EO\/IR Sensors by developing passive and active techniques to adaptively filter EO\/IR radiation in EA denied and EO\/IR saturation environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.163"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors for the Purpose of Detection, Localization, and Identification of Hostile Signals of Interest:\n- Continue all efforts of FY 2011.\n- Progress technology development in the area of network enabled coherent Electronic Warfare Support (ES).\n- Progress technology development to detect and defeat passive sensing systems.\n- Progress technology development in the area of coordinated coherent EA waveforms.\n- Progress development in cross-platform EA techniques.\n- Progress technology development in the area of wideband cueing receivers.\n\nComponents and Advanced Architectures\/Signal Processing Designs:\n- Continue all efforts of FY 2011 less those noted as completed above.\n- Progress technology development in components and architectures for ES payloads.\n- Progress technology development in ES adaptive signal processing.\n- Develop compact high power RF emulators.\n- Progress technology development in the area of wideband distributed decoys and control.\n- Progress technology development in the area of transmitters and EA techniques. \n- Progress technology development in the areas of wideband critical receiver components and wideband adaptive RF signal processing.\n\nCountermeasures and Techniques to Defeat Advanced RF Guided Threats:\n- Continue all efforts of FY 2011 less those noted as completed above.\n- Progress technology development in the areas of wideband high power critical EA components, wideband EA techniques and technique generators, and millimeter wave high power transmitters.\n\nCountermeasures and techniques to Defeat Advanced EO\/IR Guided Threats:\n- Continue all efforts of FY 2011.\n\nModeling and Simulation:\n- Progress technology development in the area of advanced architectures for modeling and simulation of networked EW assets.\n\nElectronic Protection from EMI and EA: \n- Continue all efforts of FY 2011.\n- Progress technology development in the area of advanced architectures for modeling and simulation of networked EW assets.\n\nJoint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW):\n- Progress development of technologies to improve capabilities and effectiveness of JCREW equipment.\n\nOffboard\/Unmanned Platforms - Electronic Warfare:\n- Progress technology development in the area of autonomous control, high efficiency engines and EW payloads suitable for use in offboard and unmanned platforms.\n\nIntegrated Distributed Electronic Warfare System (IDEWS) concept:\n- Progress technology development in the area of networked-enabled coordinated and spatially distributed EW.\n\nElectronic Warfare (EW) Roadmap: \n- Progress development of classified advanced electronic warfare technology in support of current and predicted capability requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "47.803"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "47.803"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors for the Purpose of Detection, Localization, and Identification of Hostile Signals of Interest:\n- Continue all efforts of FY 2012\n\nComponents and Advanced Architectures\/Signal Processing Designs:\n- Continue all efforts of FY 2012\n\nCountermeasures and Techniques to Defeat Advanced RF Guided Threats:\n- Continue all efforts of FY 2012\n\nCountermeasures and Techniques to Defeat Advanced EO\/IR Guided Threats:\n- Continue all efforts of FY 2012\n\nModeling and Simulation:\n- Continue all efforts of FY 2012\n\nElectronic Protection from EMI and EA:\n- Continue all efforts of FY 2012\n\nJoint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW):\n- Continue all efforts of FY 2012\n\nOffboard\/Unmanned Platforms - Electronic Warfare:\n- Continue all efforts of FY 2012\n\nIntegrated Distributed Electronic Warfare System (IDEWS) concept:\n- Continue all efforts of FY2012\n\nElectronic Warfare (EW) Roadmap:\n- Continue all efforts of FY2012\n\nWideband ES - Sensing\/Processing:\n- Progress technology development in the areas of wideband cueing receiver concepts. \n- Progress development in critical receiver components that operate across the entire 1-110 GHz spectral range.\n- Progress technology development in wideband adaptive RF signal processing methods and techniques.\n\nWideband EA - Components\/Techniques:\n- Progress technology development in high power critical EA system components that operate across the entire 1-110 GHz spectral range.\n- Progress development in wideband EA techniques (waveforms) and techniques generators.\n- Progress technology development in transmit-to-receive isolation technologies and techniques, relevant to the spectral range of 1 to 110 GHz.\n\nMillimeter Wave (MMW) High Power Transmitters:\n- Progress development in transmitter systems (consisting of power amplifier(s), matching network, and radiating element) capable of achieving 4-10 kW or greater ERP for small decoy applications or capable of being combined to achieve 100 kW or greater ERP for large platform applications across the entire 18-45 GHz frequency range."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EO\/IR SENSOR TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this thrust is to develop technologies that enable the development of affordable, wide area, persistent surveillance optical architectures, day\/night\/adverse weather, adaptable, multi-mission sensor technology comprised of optical sources, detectors, and signal processing components for search, detect, track, classify, identify (ID), intent determination, and targeting applications and includes developments to protect these technologies from external interference.  Also included are modeling and simulation required to support the development of these technologies.  Efforts will also include the development of optical RF components, infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors. The current specific objectives are:\n\na) Optically Based Terahertz (THz) and Millimeter Wave (MMW) Distributed Aperture Systems: \nDevelop optically based terahertz (THz) and millimeter wave distributed aperture systems for imaging through clouds, fog, haze and dust on air platforms.\n\nb) Wide Area Optical Architectures: Develop wide area optical architectures for persistent surveillance for severely size constrained airborne applications.\n\nc) Hyperspectral sensors and processing:\nDevelop visible, shortwave IR, mid-wave IR, and long-wave IR hyperspectral sensors, along with processing algorithms to detect anomalies and targets.\n\nd) Coherent Laser Radar (LADAR):\nDevelop and improve components for LADAR applications including fiber lasers, coherent focal planes, and advanced processing.\n\ne) Autonomous and Networked sensing: \nDevelop algorithms and processing that supports autonomous sensing for UAV platforms and that supports networked sensing over multiple sensors and\/or sensor platforms.\n\nThe decrease from FY 2011 to FY 2012 is associated with reduced efforts in EO\/IR Sensor Technologies. \n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.299"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optically Based Terahertz (THz) and Millimeter Wave (MMW) Distributed Aperture Systems:\n- Continued miniaturization and modularization of MMW imaging system components for small platform systems.\n- Completed demonstration and testing of 94 gigahertz (GHz) passive MMW imaging system.\n- Completed the development of techniques to combine current EO\/IR technology and recent findings on the characteristics of the eye to classify and identify optical devices and individuals in real time at militarily significant ranges. \n- Completed the development of a process to detect hostile camouflaged or hidden targets in shadows and diverse backgrounds of militarily challenging environments.  \n- Progressed the integration of spectrally agile multi-band sensors into integrated system for use in persistent and time critical surveillance.\n- Progressed the processing architecture for data analysis and fusion of multi-spectral images.\n\nWide Area Optical Architectures:\n- Continued development of mid and long wave IR focal plane arrays using graded-bandgap Wtype-II superlattices with much higher detectivity than state-of-the-art Mercury Cadmium Telluride (HgCdTe,MCT) FPAs. \n- Continued design of read-out integrated circuits for temporally adaptive focal plane arrays.\n- Continued development of spectrally agile visible, near-infrared, short-wave infrared and midwave infrared imaging technology.\n- Completed effort to develop ultra-high-sensitivity detectors suitable for use in focal plane arrays (FPAs) for the short-wave infrared (SWIR) spectral band. \n- Completed integration of optically and temporally adaptable imaging technologies into sensor for networked persistent surveillance system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.880"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optically Based Terahertz (THz)and Millimeter Wave Distributed Aperture Systems:\n- Continue all efforts of FY 2011 less those noted as completed above.\n- Develop and complete field demonstration and testing of 77 gigahertz (GHz) passive MMW imager.  The 77 GHz band will be used in place of 94 GHz for decreased cost and risk.\n\nWide Area Optical Architectures: \n- Continue all efforts of FY 2011 less those noted as completed above.\n- Develop the development of super-resolution techniques in WFOV MWIR sensors.\n\nHyperspectral sensors and processing:  \n- Develop integration of hyperspectral instruments onto test platforms.\n- Develop the processing of hyperspectral data from a maritime environment.\n\nCoherent Laser Radar (LADAR):\n- Develop fiber lasers and coherent focal plane arrays suitable for LADAR applications.\n\nAutonomous and Networked sensing:\n- Develop algorithms and processing that supports autonomous sensing for UAV platforms \n- Develop algorithms and processing that supports networked sensing over multiple sensors and\/or sensor platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.931"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.931"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optically Based Terahertz (THz)and Millimeter Wave Distributed Aperture Systems:\n- Continue all efforts of FY 2012 less those noted as complete above.\n\nWide Area Optical Architectures:\n- Continue all efforts of FY 2012.\n\nHyperspectral sensors and processing:\n- Continue all efforts of FY 2012.\n\nCoherent Laser Radar (LADAR):\n- Continue all efforts of FY 2012.\n\nAutonomous and Networked sensing:\n- Continue all efforts of FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVIGATION TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Position, Navigation and Timing (PNT) capabilities using the GPS, non-GPS navigation devices, and atomic clocks.  This project will increase the operational effectiveness of U.S. Naval units. Emphasis is placed on GPS Anti-Jam (AJ) Technology; Precision Time and Time Transfer Technology; and Non-GPS Navigation Technology (Inertial aviation system, bathymetry, gravity and magnetic navigation). The focus is on the mitigation of GPS electronic threats, the development of atomic clocks that possess unique long-term stability and precision, and the development of compact, low-cost Inertial Navigation Systems (INS). The current specific objectives are:\n\na) GPS AJ Antennas and Receivers: \nDevelop anti-jam and anti-spoofer antennas and antenna electronics for Navy platforms for the purpose of providing precision navigation capabilities in the presence of emerging electronic threats.\n\nb) Precision Time and Time Transfer Technology: \nDevelop tactical grade atomic clocks that possess unique long-term stability and precision for the purpose of providing GPS-independent precision time, and the capability of transferring precision time via radio frequency links precision time.\n\nc) Non-GPS Navigation Technology: \nDevelop inertial\/bathymetric\/gravity navigation system for the purpose of providing an alternative means of providing precision navigation for those Naval platforms which may not have GPS navigation capabilities and\/or loss of GPS signals.\n\nThe decrease of funding from FY 2011 to FY 2012 is the result of decreased investment as a result of completing efforts in GPS Anti-Jam Antennas and Receivers.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this\nactivity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.356"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers:\n- Continued the Precise at-Sea Ship System for Indoor Outdoor Navigation (PASSION) project.\n- Completed the GPS Threat Assessment project.\n- Completed the Multi-Frequency Continuously Operating GPS Anomalous Event Monitor (GAEM) project.\n- Completed the development of GPS AJ Antenna Electronics (AE) with low-cost analog processor technique for Direction of Arrival (DOA) estimation and nulling (up to 60dB nulling capability).\n- Completed the development of Space-Frequency Adaptive Processing (SFAP) for GPS Anti-Spoofer using the existing Code Gated Maximum Likelihood (CGML) receiver.\n- Completed the GPS Dual Receiver Hot Start Acquisition (DRHSA) project.\n- Developed Time-transfer via IEEE 1588 effort.\n- Developed Military User Equipment Integrated Fault Analysis effort.\n\nPrecision Time and Time Transfer Technology:\n- Continued the Evolved Global Navigation Satellite System (GNSS) Signal Monitoring Receiver Element project.\n- Completed the Self-Locked Intra-Cavity Alkali Vapor Laser (ICAL) Opto-Atomic Clock project.\n- Developed Advanced-Development of a Miniature Atomic Clock.\n\nNon-GPS Navigation Technology:\n- Continued the Optically Transduced Inertial Navigation System (INS) Sensor Suite (OPTIMUSS) project.\n- Continued development of the Three-Axis Resonant Fiber Optic-based Inertial Navigation System with the accuracy of 10 milli(m)-degrees per hour and the angle random walk (ARW) of 10 milli (m)-degrees per root hour.\n- Completed the Deeply Integrated Navigation Grade GPS Inertial System project.\n- Completed the Micro Fiber Optical Gyro (MFOG) project.\n- Completed the Ship's Passive Inertial Navigation System (SPINS) project.\n- Completed the Sonar Aided Inertial Navigation Technology (SAINT) project.\n- Completed development of the SAINT system for littoral application; the SAINT will be applied to the existing Precision Underwater Mapping (PUMA) device.\n- Developed Micro-Electro-Mechanical System (MEMS) Gyro effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.885"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers: \n- Continue all efforts of FY 2011 less those noted as completed above.\n- Complete Time-transfer via IEEE 1588 effort.\n- Develop Modernized User Equipment (MUE) Integrated Fault Analysis Technology. \n- Develop and complete Anti-tamper Investigation Support.\n- Develop and complete System for enhanced electronic protection, electronic support and precision navigation.\n\nPrecision Time and Time Transfer Technology: \n- Continue all efforts of FY 2011 less those noted as completed above.\n- Develop Effects of Code Distortion in Modernized GPS Signals on GPS Timing Receiver.\n- Develop Compact and versatile passively CEP (carrier envelope phase)-stabilized optical clock system.\n- Develop Micro cold atom atomic frequency standard (CAAFS).\n\nNon-GPS Navigation Technology:\n- Continue all efforts of FY 2011 less those noted as completed above.\n- Develop Portable Precision Celestial Navigation System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.883"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.883"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers:\n- Continue all efforts of FY 2012 less those noted as complete above.\n- Develop and complete Automatic Dependant Surveillance-Mode B (ADS-B) National Airspace Air Traffic Control (ATC) System to Naval Aviation applications.\n- Develop Cognitive Modernized GPS User Equipment (MGUE) with Chaotic Timing Signals for GPS Denied Environments project.\n\nPrecision Time and Time Transfer Technology:\n- Continue all efforts of FY 2012. \n- Develop Ultra-Precise Timing Using GPS project.\n\nNon-GPS Navigation Technology:\n- Continue all efforts of FY 2012.\n- Develop Alternative Image-based Navigation"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOLID STATE ELECTRONICS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop higher performance components and subsystems for all classes of military RF systems that are based on solid state physics phenomena and are enabled by improved understanding of these phenomena, new circuit design concepts and devices, and improvements in the properties of electronic materials.  An important subclass are the very high frequency (VHF), ultra-high frequency (UHF), microwave (MW), and millimeter wave (MMW) power amplifiers for Navy all-weather radar, surveillance, reconnaissance, electronic attack, communications, and smart weapons systems.  Another subclass are the analog and high speed, mixed signal components that connect the electromagnetic signal environment into and out of digitally realized, specific function systems.  These improved components are based on both silicon (Si) and compound semiconductors (especially the wide bandgap materials and narrow bandgap materials), low and high temperature superconductors, novel nanometer scale structures and materials.  Components addressed by this activity emphasize the MMW and submillimeter wave (SMMW) regions with an increasing emphasis on devices capable of operating in the range from 50 gigahertz (GHz) to 10 terahertz (THz).  The functionality of the technology developed cannot be obtained through Commercial-Off-the-Shelf (COTS) as a result of the simultaneous requirements placed on power, frequency, linearity, operational and instantaneous bandwidth, weight, and size.  Effort will involve understanding the properties of engineered semiconductors as they apply to quantum information science and technology. The current specific objectives are:\n\na) Solid State Transistors and Devices: Develop solid state transistors and devices for high frequency analog and digital operation.\n\nb) High Efficiency, Highly Linear Amplifiers: Develop high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications.\n\nc) Superconducting Electronics: Develop components for RF systems utilizing superconducting and other technologies which are designed to deliver software defined, wide band, many simultaneous signal functionality over a wide range of frequencies, in increasingly field-ready packaging and demonstrate the ability of these components to be combined into chains to deliver superior functionality in conventional system contexts, including, but not limited to, SATCOM, Electronic Warfare (EW), signal intelligence (SIGINT), and communications.\n\nd) Control, Reception, and Processing of Signals: Develop electronics technology that provides for the control, reception, and processing of signals.\n\ne) Novel Nanometer Scale Logic\/Memory Devices and Related Circuits and Architectures: Develop novel nanometer scale (feature size at or below 10nm) logic\/memory devices and related circuits and architectures to deliver ultra-low power, light weight and high performance computational capability for autonomous vehicles and individual warfighters.\n\nThe increase from FY 2011 to FY 2012 is due to emphasis in Solid State Electronics research in response to naval need.   \n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.578"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solid State Transistors and Devices:\n- Continued development of an integrated tunable frequency selective and low noise integrated module.\n- Continued effort to develop W-band high-power Gallium Nitride (GaN) Metal Insulator Semiconductor (MIS) transistors.\n- Continued MMW field plate GaN High Electron Mobility Transistor (HEMT) development.\n- Completed development of Antimony (Sb)-based diodes and multipliers for the exploitation of the frequency spectrum from 94-1000 GHz. \n- Progressed mixed-signal GaN Monolithic Microwave Integrated Circuit (MMIC) technology development.\n- Progressed effort to develop on-wafer integrated enhancement\/depletion mode GaN transistors for mixed-signal applications. \n\nHigh Efficiency, Highly Linear Amplifiers:\n- Continued development of MMW AlGaN\/GaN wide bandgap HEMT.\n- Continued development of AlGaN HEMT broadband amplifiers for electronic warfare decoys with increased power and efficiency than achieved with conventional solid state amplifiers.\n- Continued high-efficiency microwave GaN HEMT amplifier development.\n- Continued work on GaN MMW components at >44 GHz to allow for EHF SATCOM insertion and other MMW applications spanning to 95GHz.\n- Continued the expansion of scope of the GaN MMW device program.\n- Continued component development in support of multifunctional electronic warfare.\n- Continued transition of GaN high-efficiency microwave HEMT amplifiers to radar and communications applications.\n- Continued development of MMW high efficiency amplifiers for satellite communications and compact high efficiency MMW sources for active denial systems.\n- Continued development of high-efficiency broadband GaN HEMT amplifiers for electronic warfare applications.\n- Continued Sub-MMW GaN Device technology for communications, target identification and high speed data processing.\n- Developed GaN Monolithic Microwave Integrated Circuit (MMIC) Amplifier Technology for operation greater than (>)100 GHz.\n- Developed high efficiency GaN amplifier MMICs for 50-100 GHz operation.\n\nSuperconducting Electronics:\n- Completed development of a second generation superconducting digital channelizer which includes a 1xk multiplier.\n- Completed demonstration of an improved signal processing technique that can be applied to state-of-the-art L, S, X, and Ka-band superconducting bandpass ADCs to realize an improvement in dynamic range of greater than 6dB.\n- Developed first packaged prototype of 1 cm squared HF-UHF antenna for space limited platforms such as UAVs.\n- Developed effort to improve superconducting analog to digital converter performance by more than 2 bits as well as 2x in sample rate.\n\nControl, Reception, and Processing of Signals:\n- Continued development of Gallium Nitride-based low-noise components for Interference Immune Navy Satcom receivers.\n- Completed development of an integrated tunable frequency selective and low noise integrated module. \n\nNovel Nanometer Scale Logic\/Memory Devices and Related Circuits and Architectures:\n- Continued effort to develop a highly linear, low-noise RF amplifier using aligned arrays of single-walled carbon nanotubes.\n- Completed development of three dimensional (3D)-integrated CNN image sensing processing architecture research.\n- Developed new research in graphene synthesis and device concepts.\n- Developed effort to develop the synthesis, fabrication and testing of grapheme-based electromechanical structures and devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.116"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solid State Transistors and Devices:\n- Continue all efforts of FY 2011 less those noted as completed above.\n- Develop investigations into ultra-low noise Group III-Nitride transistor structures for RF and mm-wave receivers and transmitters.\n- Developed group III-Nitride transistor development for 1 THz circuits.\n \nHigh Efficiency, Highly Linear Amplifiers:\n- Continue all efforts of FY 2011.  \n- Develop low-noise, high dynamic range Group-III Nitride amplifier development for W-band receivers.\n\nSuperconducting Electronics:\n- Continue all efforts of FY 2011 less those noted as completed above.\n- Progress development of mixed superconducting\/semiconducting output circuits that allow energy efficient data transfer to room temperature at >10 Gbps per line and precision amplification of signals returned to the superconducting domain.  These technologies are critical to the delivery of maximum system functionality from superconducting electronics and enable transmitter interference mitigation in wideband receivers. \n\nControl, Reception, and Processing of Signals:\n- Continue all efforts of FY 2011 less those noted as completed above.\n- Develop investigations into low-noise, high dynamic range group-III Nitride receiver components for W-band and higher signal detection.\n\nNovel Nanometer Scale Logic\/Memory Devices and Related Circuits and Architectures:\n- Continue all efforts of FY 2011 less those noted as completed above.\n- Develop work on graphene based devices and circuits for low power flexible electronics.\n- Develop research on graphene-organic hybrid materials interfaces and device structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.185"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.185"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solid State Transistors and Devices:\n- Continue all efforts of FY 2012.\n- Progress development of discrete channelized Gallium Nitride Transistors for linear and low noise transmit and receive amplifiers.\n- Progress development of high power density mm-wave transistor technology.\n\nHigh Efficiency, Highly Linear Amplifiers:\n- Continue all efforts of FY 2012.\n- Progress development of group III-Nitride amplifiers for terahertz amplification.\n- Progress development of high power density, high output power solid state mm-wave amplifiers.\n\nSuperconducting Electronics:\n- Continue all efforts of FY 2012.\n- Develop research on components needed to achieve improved interference immunity.\n\nControl, Reception, and Processing of Signals:\n- Continue all efforts of FY 2012\n- Progress development of group III-Nitride terahertz receive technologies.\n- Develop work on multi-THz real-time signal processing using combination of high speed electronic, photonic, and metamaterial techniques.\n- Develop research into affordable digital array interfacing technologies using low power mixed signal approaches, wafer scale antennas, and analog photonic transmission techniques.\n- Develop research into compact, broadband filter and channelizer components targeting multi-octave operation in the range from VHF to W-band.\n\nNovel Nanometer Scale Logic\/Memory Devices and Related Circuits and Architectures:\n- Continue all efforts of FY 2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURVEILLANCE TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop advanced sensor and sensor processing systems for continuous high volume theater-wide air and surface surveillance, battle group surveillance, real time reconnaissance and ship defense.  Major technology goals include long-range target detection and discrimination, target identification (ID) and fire control quality target tracking in adverse weather, background clutter and electronic countermeasure environments and includes modeling and simulation required to support the development of these technologies.  The current specific objectives are:\n\na) Radar Architectures, Sensors, and Software which Address Ballistic Missile and Littoral Requirement Shortfalls: Develop radar architectures, sensors, and software which address Ballistic Missile and Littoral requirement shortfalls including: sensitivity; clutter rejection; and flexible energy management.\n\nb) Algorithms, Sensor Hardware, and Signal Processing Techniques for Automated Radar Based Contact Mensuration and Feature Extraction: Develop algorithms, sensor hardware, and signal processing techniques for automated radar based contact mensuration and feature extraction in support of asymmetric threat classification and persistent surveillance and to address naval radar performance shortfalls caused by: man-made jamming and Electronic Counter Measures (ECM), unfavorable maritime conditions, and atmospheric and ionosphere propagation effects.\n\nc) Software and Hardware for a Multi-Platform, Multi-Sensor Surveillance System: Develop software, and hardware for a multi-platform, multi-sensor surveillance system for extended situational awareness of the battlespace.\n\nd) Small UAV Collision Avoidance\/Autonomy Technology: Develop small UAV collision avoidance\/autonomy technology.\n\ne) Long Range Radio Frequency (RF) Identification (ID): Develop, hardware, software, algorithms, and RF techniques to extend identification capabilities in support of Intelligence Surveillance and Reconnaissance (ISR).\n\nIncrease from FY 2011 to FY 2012 is due to emphasis in Surveillance Technology research in response to naval need.  \n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this\nactivity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.138"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Radar Architectures, Sensors, and Software which Address Ballistic Missile and Littoral Requirement Shortfalls:\n- Continued the Horizon Extension Sensor System (HESS) project with form factored integration of High Power Amplifier (HPA) and development of a Silicon Germanium (SiGe) downconverter in support of HESS and Digital Array Radar (DAR) efforts.\n- Continued an element level DAR effort on down conversion and digital beam formers.\n- Continued the requirements analysis and trade studies of an Advanced Common Radar Architecture.\n- Continued development of a millimeter wave active\/passive identification sensor.\n\nAlgorithms, Sensor Hardware, and Signal Processing Techniques For Automated Radar Based Contact Mensuration And Feature Extraction:\n- Continued development efforts to demonstrate signal processing, waveform generation and one dimensional active phased array apertures for harbor surveillance and situational awareness.\n- Continued demonstrations of advanced Non-Cooperative Target Recognition (NCTR) algorithms in congested harbor environments.\n- Continued the development of a process to detect hostile camouflaged or hidden targets in shadows and diverse backgrounds of militarily challenged environments.\n- Continued investigation of means of optimally combining mensuration, classification, and noncooperative target recognition of surface craft.\n- Continued development of a technology architecture for the Persistent Autonomous Surveillance System.\n- Continued development of automated controls for an airborne persistent multi-node sensor network.\n- Progressed development of algorithms and signal processing for Electronic Protection in airborne radars.\n- Progressed development of software and algorithms for multi-platform radar controls.\n\nSoftware and Hardware for a Multi-Platform, Multi-Sensor Surveillance System:\n- Continued the development of signal processing techniques to improve situational awareness and autonomous detection of hostile fire events in a dynamic urban clutter environment.\n - Progressed the development of technologies for a distributed, coherent surveillance network embedded in the background electromagnetic environment of a broadband wireless communication network. \n\nSmall UAV Collision Avoidance\/Autonomy Technology:\n- Continued development of research technologies and analytical algorithms for an effective and highly reliable collision avoidance system"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.421"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Radar Architectures, Sensors, and Software which Address Ballistic Missile and Littoral Requirement Shortfalls:\n- Continue all efforts of FY 2011 less those noted as completed above.  \n- Complete the Horizon Extension Sensor System (HESS) project with form factored integration of High Power Amplifier (HPA) and development of a Silicon Germanium (SiGe) down converter in support of HESS and Digital Array Radar (DAR) efforts.\n- Complete an element level DAR effort on down conversion and digital beam formers.\n- Complete the requirements analysis and trade studies of an Advanced Common Radar Architecture.\n- Progress Advanced Common Radar Architecture, and mode development.\n\nAlgorithms, Sensor Hardware, and Signal Processing Techniques for Automated Radar Based Contact Mensuration And Feature Extraction:\n- Continue all efforts of FY 2011 less those noted as completed above.\n- Complete development efforts to demonstrate signal processing, waveform generation and one dimensional active phased array apertures for harbor surveillance and situational awareness.\n\nSoftware and Hardware for a Multi-Platform, Multi-Sensor Surveillance System:\n- Continue all efforts of FY 2011. \n\nSmall UAV Collision Avoidance\/Autonomy Technology:\n- Continue all efforts of FY 2011.\n\nLong Range Radio Frequency (RF) Identification (ID):\n- Develop studies for Long Range RFID techniques and initial hardware designes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Radar Architectures, Sensors, and Software which Address Ballistic Missile and Littoral Requirement Shortfalls:\n- Continue all efforts of FY 2012 less those noted as complete above.  \n- Complete development of a millimeter wave active\/passive identification sensor.\n\nAlgorithms, Sensor Hardware, and Signal Processing Techniques for Automated Radar Based Contact Mensuration And Feature Extraction:\n- Continue all efforts of FY 2012 less those noted as complete above.\n\nSoftware and Hardware for a Multi-Platform, Multi-Sensor Surveillance System:\n- Continue all efforts of FY 2012.\n\nSmall UAV Collision Avoidance\/Autonomy Technology:\n- Complete development of research technologies and analytical algorithms for an effective and highly reliable collision avoidance system.\n\nLong Range Radio Frequency (RF) Identification (ID):\n- Continue all efforts of FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPECTRUM SHARING"
                                    },
                                    "Description": {
                                        "val": "Research in this activity addresses the need to develop innovate new and improved methods and technologies for management of the RF Spectrum to compensate for decreased RF Spectrum frequencies reserved for military use and increasing demand from Navy sensor and communications systems.  Navy platforms rely on the RF Spectrum for both sensing and communication capabilities.  Efficient sharing of the RF Spectrum requires the development of new concepts and technologies to manage spectrum demands.  Spectrum Sharing will develop concepts and technologies that will optimize spectrum management and sharing across within individual systems, platforms, and across the battlegroup."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.296"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop research for RF Spectrum Management for Navy communications and sensor systems and platforms.  This effort is classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "VACUUM ELECTRONICS POWER AMPLIFIERS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop millimeter wave (MMW) and sub-MMW power amplifiers for use in Naval all-weather radar, surveillance, reconnaissance, electronic attack, and communications systems.  The technology developed cannot, for the most part, be obtained through commercial off the shelf (COTS) as a result of the simultaneous requirements placed on power, frequency, bandwidth, weight, and size.  Responding to strong interests from the various user communities, efforts are focused on the development of technologies for high-data-rate communications, electronic warfare and high-power radar applications at MMW and upper-MMW regime.  The emphasis is placed on achieving high power at high frequency in a compact form factor.  Technologies include utilization of spatially distributed electron beams in amplifiers, such as sheet electron beams and multiple-beams, and creation of simulation based design methodologies based on physics-based and geometry driven design codes.\n\nThe current specific objectives are:\n\na) High Power Millimeter and Upper Millimeter Wave Amplifiers: Develop science and technology for high power millimeter and upper millimeter wave amplifiers including high current density diamond cathodes, sheet and multiple electron beam formation and mode suppression techniques in overmoded structures.\n\nb) Lithographic Fabrication Techniques: Develop lithographic fabrication techniques for upper-millimeter wave amplifiers.\n\nc) Accurate and Computationally Effective Device-Specific Multi-Dimensional Models for Electron Beams: Develop accurate and computationally effective device-specific multi-dimensional models for electron beam generation, large-signal and stability analysis to simulate device performance and improve the device characteristics.\n\nThe increase from FY 2011 to FY 2012 is due to expanded effort in Vacuum Electronics Power Amplifiers research.  \n\nThe decrease from FY 2012 to FY 2013 is due to completion of efforts and subsequent reduced investment\/emphasis in ONR sponsored Vacuum Electronics Power Amplifiers research.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.807"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "High Power Millimeter and Upper Millimeter Wave Amplifiers:\n- Continued the development of high-current-density cathodes based on diamond current amplifier.\n- Continued effort to produce a compact, high-power, W-band amplifier by developing an extended interaction klystron circuit that will be mated to a novel sheet-beam gun, permanent magnet & collector.\n- Continued the development of new spatially-distributed electron beam traveling-wave amplifier structures incorporating novel mode suppression techniques.\n- Developed non-linear multi-frequency stability analysis of wide-band traveling wave tub amplifiers in order to extend millimeter-wave output power limits to >2 kilowatts. \n\nLithographic Fabrication Techniques:\n- Continued effort to develop 220 GHz millimeter-wave amplifiers employing electromagnetic structures that are microfabricated using lithographic techniques.\n\nAccurate and Computationally Effective Device-Specific Multi-Dimensional Models for Electron Beams:\n- Continued the effort on developing algorithms and models in large signal code Telegrapher's Equation Solution for Linear Amplifiers (TESLA) for multiple beam klystrons.\n- Continued the effort on the development and implementation of models and algorithms in a large signal klystron code to model sheet electron beam - wave interaction.\n- Continued the effort on developing models and algorithms based on generalized model expansion (GENOME) techniques for large signal modeling of extended interaction klystrons (EIK).\n- Continued the effort on the development and implementation of models and algorithms in a large signal Traveling Wave Tube (TWT) code to model sheet electron beam - wave interaction.\n- Continued development of coupled-cavity 2D algorithms in TESLA for the CC-TWT.\n- Completed effort on the gun\/collector code MICHELLE with improved interface with the large signal codes CHRISTINE for Helix TWT's and TESLA for klystrons.\n- Developed parallel version of MICHELLE for gun\/collector code to reduce computational time by factor of 10 for realistic 3D electron beams.\n- Developed effort of stability analysis for broadband extended interaction klystrons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.821"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "High Power Millimeter and Upper Millimeter Wave Amplifiers:\n- Continue all efforts of FY 2011 .\n\nLithographic Fabrication Techniques:\n- Continue all efforts of FY 2011.\n\nAccurate and Computationally Effective Device-Specific Multi-Dimensional Models for Electron Beams:\n- Complete the effort on developing algorithms and models in large signal code Telegrapher's Equation Solution for Linear Amplifiers (TESLA) for multiple beam klystrons.\n- Complete the effort on the development and implementation of models and algorithms in a large signal klystron code to model sheet electron beam - wave interaction.\n- Complete the effort on developing models and algorithms based on generalized model expansion (GENOME) techniques for large signal modeling of extended interaction klystrons (EIK).\n- Complete the effort on the development and implementation of models and algorithms in a large signal Traveling Wave Tube (TWT) code to model sheet electron beam - wave interaction.\n- Complete development of coupled-cavity 2D algorithms in TESLA for the CC-TWT.\n- Complete development of parallel version of MICHELLE for gun\/collector code to reduce computational time by factor of 10 for realistic 3D electron beams.\n- Complete effort in the development of stability analysis for broadband extended interaction klystrons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.926"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.926"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "High Power Millimeter and Upper Millimeter Wave Amplifiers:\n- Continue all efforts of FY 2012\n\nLithographic Fabrication Techniques:\n- Continue all efforts of FY 2012"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "This PE supports the development of technologies that addresses technology needs associated with Naval platforms for new capabilities in EO\/IR Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics. The program supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution. Each PE Activity has unique goals and metrics, some of which include classified quantitative measurements.  Overall metric goals are focused on achieving sufficient improvement in component or system capability such that the 6.2 applied research projects meet the need of or produce a demand for inclusion in advanced technology that may lead to incorporation into acquisition programs or industry products available to acquisition programs.\n\nSpecific examples of metrics under this PE include:\n\n- Provide a secure, over the horizon, on-the- move capability to communicate with higher headquarters at a data rate of 256-512 Kbps at a cost of $75,000.\n- Provide an array configuration suitable for installation on aircraft that will support TCDL data rates of 10.7 and 45 Mbps at greater than 150 nautical mile range.\n- Develop prototype Ku band phased array apertures in a form factor suitable for installation on the CVN-78."
                        }
                    }
                }
            ]
        }
    }
}