{
    "id": "f0389140d93be71ceb771cb2bf778a199d1c4fa4",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602670D8Z"
        },
        "ProgramElementTitle": {
            "val": "Human Social Culture Behavior (HSCB) Modeling Applied Research"
        },
        "R1LineItemNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.199"
            },
            "CurrentYear": {
                "val": "8.602"
            },
            "BudgetYearOne": {
                "val": "6.771"
            },
            "BudgetYearOneBase": {
                "val": "6.771"
            },
            "BudgetYearTwo": {
                "val": "6.923"
            },
            "BudgetYearThree": {
                "val": "7.100"
            },
            "BudgetYearFour": {
                "val": "7.305"
            },
            "BudgetYearFive": {
                "val": "7.438"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Human Social Culture Behavior (HSCB) Modeling Program is a vertically integrated effort to research, develop, and transition technologies, tools, and systems to programs of record and users in need. The Program exists to optimize U.S. forces’ ability to perform population-centric sensing, understand behaviors driven by social and cultural variables, and take effective courses of action in the full range of military operations. Program research will enhance intelligence, surveillance, and reconnaissance (ISR) capabilities for understanding the Irregular Warfare environment and meeting the challenges of instability and violent extremism. In three integrated program elements (PEs), the Program will conduct applied research, mature and demonstrate advanced technology, and develop transitionable  methods, technology, tools and prototypes. Work under PE 0602670D8Z  will focus on developing an applied science base, to include validated theory and methods, along with knowledge products and resources to support sociocultural behavior data collection, analysis and forecasting of sociocultural behavior, course of action planning, and effects analysis. Research will address needs in two areas: modeling, and data. It will develop and validate theoretical constructions, generate knowledge products, and develop stand-alone computational models of sociocultural behavior; and develop improved methods for valid collection of quality sociocultural data that will facilitate subsequent model development and validation. The Program will ensure that supported research is clearly tied to warfighters and their needs. \n\nHuman behavior based theory, knowledge products, and stand-alone models will support development of software to help users represent, understand, and forecast sociocultural behavior at strategic, operational, and tactical levels.\n\nImproved data collection methods will help build the sociocultural science base and facilitate subsequent model development and validation and address emerging data types and sources, such as social media."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.499"
                },
                "CurrentYear": {
                    "val": "14.923"
                },
                "BudgetYearOne": {
                    "val": "17.057"
                },
                "BudgetYearOneBase": {
                    "val": "17.057"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.199"
                },
                "CurrentYear": {
                    "val": "8.602"
                },
                "BudgetYearOne": {
                    "val": "6.771"
                },
                "BudgetYearOneBase": {
                    "val": "6.771"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.300"
                },
                "CurrentYear": {
                    "val": "-6.321"
                },
                "BudgetYearOne": {
                    "val": "-10.286"
                },
                "BudgetYearOneBase": {
                    "val": "-10.286"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.532"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.198"
                    },
                    "CurrentYear": {
                        "val": "-0.261"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.500"
                                },
                                "CurrentYear": {
                                    "val": "-6.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.041"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.027"
                                },
                                "CurrentYear": {
                                    "val": "-0.060"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOne": {
                                    "val": "-10.286"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.286"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P270"
                    },
                    "ProjectTitle": {
                        "val": "Human Social Culture Behavior (HSCB) Modeling Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.199"
                        },
                        "CurrentYear": {
                            "val": "8.602"
                        },
                        "BudgetYearOne": {
                            "val": "6.771"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.771"
                        },
                        "BudgetYearTwo": {
                            "val": "6.923"
                        },
                        "BudgetYearThree": {
                            "val": "7.100"
                        },
                        "BudgetYearFour": {
                            "val": "7.305"
                        },
                        "BudgetYearFive": {
                            "val": "7.438"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Human Social Culture Behavior (HSCB) Modeling Program is a vertically integrated effort to research, develop, and transition technologies, tools, and systems to programs of record and users in need. The Program exists to optimize U.S. forces’ ability to perform population-centric sensing, understand behaviors driven by social and cultural variables, and take effective courses of action in the full range of military operations. In three integrated program elements (PEs), the Program will conduct applied research, mature and demonstrate advanced technology, and develop transitionable  tools and prototypes. Work under PE 0602670D8Z will focus on developing an applied science base, to include validated theory and methods, along with knowledge products and resources to support sociocultural behavior data collection, analysis and forecasting of sociocultural behavior, course of action planning, and effects analysis. Research will address needs in two areas: modeling, and data. It will develop and validate theoretical constructions, generate knowledge products, and develop stand-alone computational models of sociocultural behavior; and develop improved methods for valid collection of quality sociocultural data that will facilitate subsequent model development and validation. The Program will ensure that supported research is clearly tied to warfighters and their needs. \n\nHuman behavior based theory, knowledge products, and stand-alone models will support development of software to help users represent, understand, and forecast sociocultural behavior at strategic, operational, and tactical levels.\n\nImproved data collection methods will help build the sociocultural science base and facilitate subsequent model development and validation and address emerging data types and sources, such as social media."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Behavior Based Theory and Model Development"
                                    },
                                    "Description": {
                                        "val": "Conduct the research necessary to develop and refine theoretical constructs and validate them using empirical data. Develop knowledge products (including conceptual models, decision frameworks, ontologies, and databases) that will support population-centric sensing. Apply validation techniques to quantitative models of sociocultural factors in coalition warfare and sociocultural factors of military significance for emerging conflicts. Develop stand-alone models that instantiate social science theoretical constructs to address mission-specific needs to support population centric sensing and warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.519"
                                            },
                                            "Text": {
                                                "val": "Developed flexible, scalable agent-based modeling game engine that handles multiple scales and multiple theoretical disciplines, along with real-world, current example of what it can do. For U.S. European Command (J2), provided analysis framework to support planning of strategic communications and future planning against the extremist ideological threat. Applied model for analysis of extremist rhetoric as part of support to ISAF Network Effects Cell (NEC). Delivered operational support that demonstrated techniques for compensating for sparse data when performing network analysis. Significant contributions to the knowledge base that advances the state of the art in understanding human social cultural dynamics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.265"
                                            },
                                            "Text": {
                                                "val": "Deliver and test models that can assist in measuring non-kinetic effects, including forecasting instability. Further develop methods and technology for tracking narrative to monitor and mitigate violent extremism. Develop theoretically-grounded methods for analyzing from social media to support situation awareness and forecasting of behaviors. Provide methods to detect and measure changes in population and group sentiment that can be done by U.S. forces. Mature software that supports combining of computational models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.794"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.794"
                                            },
                                            "Text": {
                                                "val": "Demonstrate model-based tools for understanding terrorist networks and tracking the impacts of terrorist communications. Extend and mature computational models for understanding and forecasting violent extremism and instability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visualization Methods"
                                    },
                                    "Description": {
                                        "val": "Develop common categorization of meta-information (i.e., the data source and pedigree, what types of uncertainty are associated with it, how old is the data, etc.) in existing visualization tools\/decision aiding systems. Develop methods for visually and digitally depicting the incomplete, subjective, volatile, and\/or imprecise nature of cultural information to support manual and automated analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "In support of International Security Assistance Force Network Effects Cell (ISAF NEC), applied prototypes for visualizing networks and for developing visualization products for analytical reports. Developed techniques for visualizing analysis of extremist narratives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.366"
                                            },
                                            "Text": {
                                                "val": "Research and identify concepts for human-system interaction (HSI) capabilities that will enable an interactive exploration environment. Continue development of visualization infrastructure that displays hybrid data sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Research on visualization methods discontinued starting FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sociocultural Competencies and Training Methods"
                                    },
                                    "Description": {
                                        "val": "Define sociocultural behavior competencies, tailored to Military Occupational Specialties. Develop conceptual model for sociocultural training of military personnel, including specification of competencies focused on relevant operational scenarios. Develop methods and resources to support training of personnel, including non-experts, in most appropriate and effective use of computational models and model-based tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.440"
                                            },
                                            "Text": {
                                                "val": "Provided training materials that leverage archival research on the Soviet Experience in Afghanistan for the ISAF International COIN CT Training Center. Developed set of cross-cultural competencies. Completed study of Military Operational Specialty-specific requirements for sociocultural behavior training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Research on training discontinued starting FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Collection Methods"
                                    },
                                    "Description": {
                                        "val": "Develop scientifically validated strategies to collect cultural and societal information in denied or difficult to penetrate areas. Develop methodologies and supporting technologies capable of extracting relevant data into databases for further modeling to support denied, restricted, or unavailable area sociocultural data. Develop technologies capable of leveraging extracted data, and processing and validating it, with a particular focus on data from social media."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.440"
                                            },
                                            "Text": {
                                                "val": "Collected data from Saudi Arabia, Iran, Lebanon, and Egypt to inspect and explain the extent of the penetration of Western values in those nations. At Cobra Gold Exercise, demonstrated concept for system that models use of social media technologies to support Humanitarian and Disaster Relief operations. Applied network analysis and related tools to enable much more efficient translation of ethnographic data into tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.971"
                                            },
                                            "Text": {
                                                "val": "Research novel methods for accurate, non-polling collection of data on sentiment, beliefs, and opinions, especially in denied areas.  Work will focus on methods and approaches for harvesting data from social media.  Research is required on how representative this information is about a society or social group.  Research multi-scale analysis of conflict and stability based upon micro-scale geographical data on violent events and potential causal factors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.977"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.977"
                                            },
                                            "Text": {
                                                "val": "Advance the testing and validation of new methods for collection of data from open source and social media. Develop new techniques for geo-referencing of sociocultural behavior data. Discontinue research and development of an HSCB data collection, analysis and interpretation capability for small units (e.g. platoons, squads)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0603670D8Z BA 3"
                                    },
                                    "Title": {
                                        "val": "HSCB Advanced Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.299"
                                        },
                                        "CurrentYear": {
                                            "val": "12.724"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.235"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.235"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.398"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.606"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.853"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.016"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0604670D8Z BA 4"
                                    },
                                    "Title": {
                                        "val": "HSCB Research and Engineering"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.038"
                                        },
                                        "CurrentYear": {
                                            "val": "7.252"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.131"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.131"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.234"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.355"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.522"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.622"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}