{
    "id": "f0996e7bb5d2c0daf66ce34daa95c9d3a4de11c9",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603826D8Z"
        },
        "ProgramElementTitle": {
            "val": "Quick Reactions Special Projects (QRSP)"
        },
        "R1LineItemNumber": {
            "val": "60"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "58.763"
            },
            "CurrentYear": {
                "val": "58.970"
            },
            "BudgetYearOne": {
                "val": "107.002"
            },
            "BudgetYearOneBase": {
                "val": "107.002"
            },
            "BudgetYearTwo": {
                "val": "88.155"
            },
            "BudgetYearThree": {
                "val": "115.628"
            },
            "BudgetYearFour": {
                "val": "119.125"
            },
            "BudgetYearFive": {
                "val": "121.381"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2013,  the Strategic Multi-Layered Assessment (SMA) project (P833) was inserted as a result of a functional transfer of resources and mission from United States Strategic Command (STRATCOM). \n\nThe program increase from FY 2012 to FY 2013 is attributable to two major factors. \n\nIn FY 2013, $16.000 million has been allocated to two new focal areas, within P828, related to Combatant Commanders, DoD and other Government Agencies concerns and requirements. The new focal area “Biometrics and Forensics” has been allocated $11.000 million to resource emerging technologies as DoD seeks to attribute enemy activity to specific individuals. The new focal area “Urban Characterization” has been allocated $5.000 million to resource development of intelligence, surveillance and reconnaissance (ISR), electronic warfare, kinetic and other capabilities needed for future military operations in a wide range of urban areas. \n\nThe remaining factor relative to the FY 2012 to FY 2013 increase reflects the restoral to baseline of a FY 2012 budget reduction and DoD's continued emphasis on QRSP's proven ability to expedite development and transition of new technologies to the warfighter."
        },
        "ProgramElementMissionDescription": {
            "val": "The QRSP Program supports five separate projects that provide rapid funding to expedite development and transition of new technologies to the warfighter.  The projects that are part of the QRSP are the Quick Reaction Fund (QRF), the Rapid Reaction Fund (RRF), the RDT&E Architecture and Integration (RAI) program, Joint Rapid Acquisition Cell (JRAC) support, and Strategic Multi-Layered Assessment (SMA) support.  QRSP provides the flexibility to respond to emergent DoD issues and address technology surprises and needs within the years of execution outside the two-year budget cycle. \n\nP826:    Projects supported by Quick Reaction Funds (QRF) focus on responding to emergent conventional warfare needs during the execution years that take advantage of breakthroughs in rapidly evolving technologies.  Examples of the types of projects that are envisioned include:  force protection projects to enhance anti-access and area denial capabilities, and broad electronic warfare capabilities.  QRF focuses on maturing technologies critically needed for the combatant commands and produces prototypes or demonstrates capabilities for evaluation within 12 months. \n\nP828:    The Rapid Reaction Fund (RRF) objectives are to leverage the DoD science and technology base and those of the other federal departments; stimulate interagency coordination and cooperation; accelerate the fielding of capabilities and concepts to counter emerging threats; and provide feedback to the S&T community to guide long term developmental strategies.  The RRF is executed by the Rapid Reaction Technology Office (RRTO).  RRTO works to anticipate adversaries' exploitation of new technologies and advanced capabilities and develop counters to those capabilities.  Additionally, the office works to leverage technology developed outside of DOD in the commercial sector, academia, international arenas and small, non-traditional businesses to expose them to specific DoD needs areas as identified by Combatant Commanders, Military Service organizations and other Defense Agencies and interagency organizations. The typical length of an RRTO program falls within a six to twelve month range in order to more effectively aid the warfighter. RRF consistently exceeds the transition objective of 30 percent for demonstration programs (DOD Strategic Objective 4-3).  \n\nP830:    The RDT&E Architecture and Integration program objectives are to enhance and expand Yuma Proving Grounds rapid technology assessment capability in general and to enhance the Joint Experimentation Range Complexes (JERCs) venue in particular.  This include:  improving the broad-spectrum of evaluations to include analysis of a cohesive Forward Operating Base (FOB) defensive architecture; emerging homemade explosives (HME); future Improvised Explosive Devices (IEDs); counter IED capability development; and, characterization of evolving electro-magnetic environments.  These focal align under the Quadrennial Defense Review (QDR) focal area “Institutionalizing Rapid Acquisition Capability” and its third tenant “Assessing Alternatives and Executing a Solution (Acquisition).”\n\nP831:  The Joint Rapid Acquisition Cell (JRAC) objectives are focused on responding to Joint Urgent Operational Needs (JUONS) that have been submitted by Combatant Commanders and validated by the Joint Staff.  The JRAC’s objective is to manage the delivery of capability as requested by the Combatant Command (COCOM) in a time frame acceptable to the COCOM.  The JRAC manages the overall effort to fulfill JUONS.  Efforts, in most instances, are conducted outside of the processes described for the Defense Acquisition System in DoD Directive 5000.1 and utilize contingency and other rapid acquisition authorities.\n\nP833:  The objective of the Strategic Multi-Layered Assessment (SMA) Cell is to support all COCOMs, Joint Force Commanders and all other government agencies by assessing complex operational\/technical challenges which require multi-agency and multi-disciplinary approaches.  With input from across the United States Government, academia and the private sector, the SMA cell develops solution options to COCOM generated challenging problems and informs the command’s senior leadership.  Each SMA effort is initiated at the request of senior COCOM leadership.  Products are typically produced within six months and directly contribute to the decision making process of COCOM’s senior leaders."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "78.244"
                },
                "CurrentYear": {
                    "val": "89.925"
                },
                "BudgetYearOne": {
                    "val": "103.089"
                },
                "BudgetYearOneBase": {
                    "val": "103.089"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "58.763"
                },
                "CurrentYear": {
                    "val": "58.970"
                },
                "BudgetYearOne": {
                    "val": "107.002"
                },
                "BudgetYearOneBase": {
                    "val": "107.002"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-19.481"
                },
                "CurrentYear": {
                    "val": "-30.955"
                },
                "BudgetYearOne": {
                    "val": "3.913"
                },
                "BudgetYearOneBase": {
                    "val": "3.913"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.235"
                    },
                    "CurrentYear": {
                        "val": "-1.389"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.913"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.913"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-17.720"
                                },
                                "CurrentYear": {
                                    "val": "-29.160"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.296"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.213"
                                },
                                "CurrentYear": {
                                    "val": "-0.406"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.017"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2013,  the Strategic Multi-Layered Assessment (SMA)) project (P833) was inserted as a result of a functional transfer of resources and mission from United States Strategic Command (STRATCOM).  In FY 2012, two new project codes were created to reflect DOD priorities (P830 – RDT&E Architecture and Integration, and P831 – Joint Rapid Acquisition Cell Support.\n\nBaseline Adjustment.  ASD(R&E) baseline adjustments reflective of DoD priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P826"
                    },
                    "ProjectTitle": {
                        "val": "Quick Reaction Fund"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.451"
                        },
                        "CurrentYear": {
                            "val": "15.883"
                        },
                        "BudgetYearOne": {
                            "val": "37.902"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.902"
                        },
                        "BudgetYearTwo": {
                            "val": "27.308"
                        },
                        "BudgetYearThree": {
                            "val": "49.637"
                        },
                        "BudgetYearFour": {
                            "val": "51.986"
                        },
                        "BudgetYearFive": {
                            "val": "54.032"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The FY 2012 to FY 2013 increase reflects the restoral to baseline of a FY 2012 budget reduction and continued DoD emphasis on QRF's ability to address conventional, disruptive, catastrophic, and irregular threats."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Quick Reaction Special Projects (QRSP) Program supports five separate projects that provide rapid funding to expedite new development and transition of new technologies to the war-fighter.  QRSP provides the flexibility to respond to emergent Department of Defense (DOD) issues and addresses technology surprises and needs that may arise outside the two-year budget cycle. \n\nProjects supported by Quick Reaction Funds (QRF) focus on responding to emergent conventional warfare needs during the execution years that take advantage of breakthroughs in rapidly evolving technologies.  Examples of the types of projects that are envisioned include:  force protection projects to enhance anti-access and area denial capabilities, and broad electronic warfare capabilities.  QRF focuses on maturing technologies critically need for the combatant commands and  produces prototypes or demonstrates capabilities for evaluation within 12 months. \n\nThe QRF Program also provides Services, Components, Combatant Commanders and force providers opportunities to capitalize on technologies that are at a relatively high Technology Readiness Level (TRL) and to rapidly field-test promising new operational prototypes that can have immediate impact on military operations.  It should be noted that QRF initiatives are limited to those that will deliver a military operational prototype application within twelve months of being funded.  \n\nThe QRF program focuses on projects that have the potential to address conventional, disruptive, catastrophic, and irregular threats.  More specifically, initiatives that address the following interest areas:  Anti-Access\/Area Denial,  Base Protection; Electromagnetic Bandwidth and Spectrum Enhancement; Persistent Intelligence, Surveillance, and Reconnaissance (ISR); Newly Emerging National Threats; Directed Energy Capabilities; Low-Cost Precision Engagement Capabilities; Operational Field Demonstrations; Unmanned and Robotics Systems; Over the Horizon-Radar Technologies; and Counter-Electronic Warfare Technologies.\n\nIn FY 2012 and FY 2013 QRF will continue to identify and fund new projects that are best equipped to respond to critical operational needs and new technology opportunities.  Current and future efforts that show significant effectiveness can be leveraged by additional investments in order to accelerate transition of capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "S150 Fuel Cell Charging System"
                                    },
                                    "Description": {
                                        "val": "This project addressed the need for portable battery chargers sized for small squad operation, and advanced the state of technology of the S125 battery charging system to Technical Readiness Level (TRL) seven.  This effort culminated in a robust, lightweight system capable of charging military batteries from a liquid fuel source.  The performer developed a 150-Watt portable generator based on solid oxide fuel cells.  This generator used hydro-treated renewable jet fuel or de-sulfurized JP8 as fuels and will be capable of operating as a battery charger or direct power unit.  With a mass of less than six kilogram (14 pounds), the battery charger-based system fits within a backpack, saves 60 percent of the weight of current solutions, and saves more than 80 percent of the weight of primary batteries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Four Solid Oxide Fuel Cell (SOFC) Systems were designed, manufactured, tested and delivered.  The in-process reports and a final report have been completed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Afghanistan Micro-grid Project (AMP) (Formerly Prototype Operations Warfare Energy Efficiency and Reduction Demonstration (POWERED)"
                                    },
                                    "Description": {
                                        "val": "This project installed and is assessing “micro-grid” power distribution technology in the Afghanistan Area Of Responsibility (AOR).  AMP is validating the utility of micro-grids in a relevant operational environment, scientifically demonstrating a reduction of DOD Fossil Fuel consumption, establishing a verifiable business case analysis for micro-grid technology, developing specifications for standardized micro-grids, identifying relevant standards\/interfaces, and facilitating Logistics Civil Augmentation Program (LOGCAP) contract language for micro-grid technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "Integration of a one-megawatt (MW) micro-grid into a battalion-sized Forward Operating Base (FOB).  The AMP micro-grid continues to provide relevant energy savings data in FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air-to-Air Combat Engagement"
                                    },
                                    "Description": {
                                        "val": "The project focused on mitigating losses due to the effect of Electronic Warfare (EW) in the air-to-air engagement.  Laboratory, ground based and air-to-air testing was included in the effort.  Information resulting from this effort informed decision makers on the art of the possible, with the first technical data arriving 30 days after commencement of effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.379"
                                            },
                                            "Text": {
                                                "val": "This project identified a vulnerability where near peer target systems can be significantly degraded.  Technical data derived from this project has directly supported development of improvements to our defensive capabilities. Additional details of this project are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Interruption of Wide Area Sensing Capabilities (IWAS)"
                                    },
                                    "Description": {
                                        "val": "This project developed an electronic attack (EA) technique effective against wide-area surveillance sensors to disrupt the adversary’s kill chain.  A phased program plan began with a feasibility demonstration and culminated with the development and demonstration of a full-scale deployable prototype."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "This project demonstrated concept feasibility to include modeling and simulation, validated by basic measurements using primarily existing equipment.  Additional details of IWAS are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chimera"
                                    },
                                    "Description": {
                                        "val": "This project developed a special electronics payload to be deployed on two different platforms that addressed classified requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "Completed Stability Analysis Report and developed and delivered Prototype Platform one with payload.  Additional details of Chimera are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Ship Technologies"
                                    },
                                    "Description": {
                                        "val": "Pelican is a hybrid airship that will be able to vertically land and take off at maximum gross weight.  Additionally, it will be a heavier than air vehicle during ground operations.  This makes Pelican unique among existing airships or other hybrid airships in development.  This project will assist in the acceleration of the Pelican flight demonstration, moving its planned execution from late FY 2013 to late FY 2012."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.722"
                                            },
                                            "Text": {
                                                "val": "Completion of internal skeleton and accelerated development and application of external skin to facilitate a late FY 2012 flight demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "P621"
                                    },
                                    "Description": {
                                        "val": "This project provides improvement and demonstration of an end-to-end collection system designed to address information needs that are either not being addressed or have limited collection resources assigned due to target attributes such as complexity, location, operating characteristics or operating regime.  The P-621 system will include a self-contained Tasking, Collection, Processing, Exploitation and Dissemination (TCPED) capability that will demonstrate a limited operational capability to support COCOM and Intelligence Community (IC) customers.  The details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Accomplished a demonstration of a new, multi-mission capability for use by deployed forces in a COCOM theater of operations to address a wide range of collection needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Macy (Black Dart)"
                                    },
                                    "Description": {
                                        "val": "This project enabled the assessment of current and near-term counter-unmanned air system (UAS) capabilities in a littoral and maritime environment, and supported the development and assessment of associated tactics, techniques, and procedures (TTPs).  The specific target set addressed by the Macy project is classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Current and near-term counter-UAS capabilities in a littoral and maritime environment were assessed.  TTP’s were developed and passed to operational users."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IMAGNAV"
                                    },
                                    "Description": {
                                        "val": "This project accelerated the maturation of technology for insertion into the Tomahawk cruise missile.  Key technology developed by this project was an optical sensor to conduct Tomahawk flight trials and mission planning\/data reduction software."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "The project facilitated a six month reduction in program development time, produced a more robust flight data set and delivered data reduction software to support future tests. This project transitions to Navy in FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (CREW) Comparative Test"
                                    },
                                    "Description": {
                                        "val": "This project will conduct comparative performance tests of Navy JCREW 3.3 and Army Dule Technology Insertion (DTI) CREW mounted systems to inform the Office of the Secreatry of Defense (OSD) Program Reviews."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "This project facilitated the OSD decision-making process by providing comparative test data on the competing duplicative programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BEAST Pod"
                                    },
                                    "Description": {
                                        "val": "Developed an advanced electronic attack (EA) pod for captive carriage on U.S. tactical aircraft platforms.  The pod provides operator training in advanced threat environments and supports the development of counter-EA Techniques, Tactics, and Procedures (TTPs).  In addition, the pod provides an advanced capability test asset for use in developing radar Electronic Protection algorithms for developmental and existing radar programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "This project delivered an advanced capability electronic EA pod for use on tactical aircraft to support training and developmental radar programs.  The pod utilized government laboratory developed Digital RF Memory (DRFM) EA technologies designed to counter late-generation phased array radars.  The jamming payload was packaged within the shell of the AIM-120 Advanced Medium range Air-to-Air Missile (AMRAAM) body.  It maintains the outer mold line and mass properties of the existing AIM-120 to allow rapid flight certification on a wide variety of tactical aircraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air\/Event Information Sharing Service (A\/EISS)"
                                    },
                                    "Description": {
                                        "val": "Project produced and shared actionable air event decision support data and visualization track data for Operation NOBLE EAGLE Engagement Authorities, US and Canadian senior leaders, and all mission partners.  It provided accurate and timely debriefs via event capture and record capability and provided the same data, and the same picture, at the same time – fixed or mobile."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "A\/EISS provided critical near-real time decision support information to Air Defense and Security mission partners, US and Canadian senior leaders, and Operation NOBLE EAGLE Engagement Authorities responsible for civilian aircraft shoot-down decisions over North America.  Air web applications (web apps) accessible from web browsers and mobile devices enable joint, interagency, intergovernmental, and multinational (JIIM) partners to consume data from new and emerging Enterprise Services and to produce and share critical decision information with all mission partners, whether fixed or on the move.  A\/EISS assists DOD in establishing web app technical standards and provided a cost-effective alternative to heavy client\/server applications currently in use."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Access\/Area Denial"
                                    },
                                    "Description": {
                                        "val": "Focus area for FY 2012 and FY 2013 QRF Anti-Access Area Denial - new project starts include efforts to develop capabilities in anticipation of emerging needs to mitigate losses due to the effect of Electronic Warfare (EW) in the air-to-air engagement.  Rapid Reaction Technology Offense (RRTO) will ensure QRF efforts are not duplicative with other electromagnetic bandwidth and spectrum enhancement efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.483"
                                            },
                                            "Text": {
                                                "val": "Anti-Access\/Area Denial investment decisions during the budget year will respond to Combatant Commander, Service and other government organization requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD, Federally Funded Research and Development Centers (FFRDCs), other government agencies, industry and academia will help identify areas critical to developing future anti-access\/area denial technological enhancement efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.251"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.251"
                                            },
                                            "Text": {
                                                "val": "As emerging requirements and threats within the Anti-Access\/Area Denial  focal area surface, programmatic and investment decisions will be resourced to respond to Combatant Commanders, Services and other government organizations requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Bandwidth and Spectrum Enhancement"
                                    },
                                    "Description": {
                                        "val": "Focus areas for FY 2012 anticipation of emerging needs to include: technologies to reduce prime power, weight and space of RF components, increased level of integration of related components.  In addition, projects will include novel bandwidth compression techniques with emphasis on on-board data processing and reduction technologies.  Rapid Reaction Technology Offense (RRTO) will ensure QRF efforts are not duplicative with other Electromagnetic Bandwidth and Spectrum Enhancement efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Bandwidth and Spectrum Enhancement investment decisions during the budget year will respond to Combatant Commander, Service and other government organization requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD, Federally Funded Research and Development Centers (FFRDCs), other government agencies, industry and academia will help identify areas critical to developing future Electromagnetic Bandwidth and Spectrum Enhancement efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.548"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.548"
                                            },
                                            "Text": {
                                                "val": "As emerging requirements, threats and opportunities within the Electromagnetic Bandwidth and Spectrum Enhancement  focal area surface, programmatic and investment decisions will be resourced to respond to Combatant Commanders, Services and other government organizations requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy Capabilities"
                                    },
                                    "Description": {
                                        "val": "Focus areas for FY 2012 and FY 2013 QRF Directed Energy Capabilities new project starts include efforts to develop capabilities in anticipation of emerging needs to include technologies to counter threats with speed-of-light, precision, deep magazine, and low collateral engagement modalities.  Emphasis will be on Laser engagement technologies to include Short Pulse, Ultra Short Pulse, and High Energy Laser technologies integrated and demonstrated on tactical manned and unmanned vehicles with Joint mission applicability.  Rapid Reaction Technology Office (RRTO) will ensure QRF efforts are not duplicative with other Directed Energy Capabilities efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Text": {
                                                "val": "Directed Energy Capabilities investment decisions during the budget year will respond to Combatant Commander, Service and other government organization requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DOD, FFRDCs, other government agencies, industry and academia will help identify areas critical to Directed Energy Capabilities efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.048"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.048"
                                            },
                                            "Text": {
                                                "val": "As emerging requirements, threats and opportunities within the Directed Energy Capabilities focal area surface, programmatic and investment decisions will be resourced to respond to Combatant Commanders, Services and other government organizations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Precision Engagement Capabilities"
                                    },
                                    "Description": {
                                        "val": "Focus area for FY 2012 and FY 2013 QRF Low Cost Precision Engagement Capabilities new project starts include efforts to develop capabilities in anticipation of emerging needs to include technologies to address the need for low cost precision engagement systems applicable to small, tactical, manned and unmanned systems.  Emphasis will be on modification and enhancement of conventional munitions components and systems.  Rapid Reaction Technology Office (RRTO) will ensure QRF efforts are not duplicative with other Low Cost Precision Engagement Capabilities efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Text": {
                                                "val": "Low Cost Precision Engagement Capabilities investment decisions during the budget year will respond to Combatant Commander, Service and other government organization requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DOD, FFRDCs, other government agencies, industry and academia will help identify areas critical to Low Cost Precision Engagement Capabilities efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.904"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.904"
                                            },
                                            "Text": {
                                                "val": "As emerging requirements, threats and opportunities within the Low Cost Precision Engagement Capabilities focal area surface, programmatic and investment decisions will be resourced to respond to Combatant Commanders, Services and other government organizations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational Field Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Focus area for FY 2012 and FY 2013 QRF operational field demonstrations new project starts include efforts to develop capabilities in anticipation of emerging needs to include operational prototyping and field demonstration of technologies, components and fully integrated systems in direct response to critical operational needs.  Emphasis will be on demonstration of conventional technologies with transition within a period of no more than one year.  Rapid Reaction Technology Office (RRTO) will ensure QRF efforts are not duplicative with other Operational Field Demonstrations efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Operational Field Demonstrations investment decisions during the budget year will respond to Combatant Commander, Service and other government organization requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DOD, FFRDCs, other government agencies, industry and academia will help identify areas critical Operational Field Demonstrations efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.151"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.151"
                                            },
                                            "Text": {
                                                "val": "As emerging requirements, threats and opportunities within the Operational Field Demonstrations focal area surface, programmatic and investment decisions will be resourced to respond to Combatant Commanders, Services and other government organizations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "The QRF Program provided funding to twelve projects in FY 2011.  Although each project is unique, all QRF projects were monitored for schedule deviation and transition outcome, as well as for meeting reporting requirements.  Additionally, some projects were monitored for the delivery of additional deliverables, such as test reports, studies, components, and equipment.  Generic performance metrics applicable to the Quick Reaction Fund (QRF) includes attainment of DOD Strategic Objective 4-2D.  The title of this objective is \"Speed Technology Transition Focused on Warfighting Needs\" and the metrics for this objective is to transition 30 percent of completing demonstrations program per year.  For projects that were completed in FY 2011, the QRF achieved a transition rate of approximately 60 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P828"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Reaction Fund"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "38.312"
                        },
                        "CurrentYear": {
                            "val": "30.950"
                        },
                        "BudgetYearOne": {
                            "val": "55.054"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.054"
                        },
                        "BudgetYearTwo": {
                            "val": "47.151"
                        },
                        "BudgetYearThree": {
                            "val": "51.705"
                        },
                        "BudgetYearFour": {
                            "val": "52.307"
                        },
                        "BudgetYearFive": {
                            "val": "52.126"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2013, the RRF reflects the addition of two new focal areas related to Combatant Commanders, DoD and other Government Agencies concerns and requirements. The new focal area “Biometrics and Forensics”  has been allocated $11.000 million to resource emerging technologies as the department seeks to attribute enemy activity to specific individuals. The  new focal area “Urban Characterization” has been allocated $5.000 million to resource development of intelligence, surveillance and reconnaissance (ISR), electronic warfare, kinetic and other capabilities needed for future military operations in a wide range of urban areas. \n\nThe FY 2012 to FY 2013 increase reflects the above new focal areas, a restoral to baseline of a FY 2012 budget reduction, and  DoD emphasis on RRF's ability to address and anticipate adversaries' exploitation of new technologies and develop counters to those capabilities."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Quick Reaction Special Projects Program (QRSP) (Program Element 0603826D8Z) supports five separate projects that provide rapid funding to expedite the development and transition of new technologies or initiatives that support the warfighter.   \n\nThe Rapid Reaction Fund (RRF) (Project P828) is fully executed through the Rapid Reaction Technology Office (RRTO).  The RRTO was stood up to provide rapid response to enhance operations in Iraq, Afghanistan and other theaters in support of Overseas Contingency Operations (OCO); and, to accelerate the transition of high-potential science and technology projects into operationally useful products in the execution years.  RRTO leverages the Department of Defense (DoD) science and technology base and those of the other Federal Departments; stimulates interagency coordination and cooperation; accelerates the fielding of capabilities and concepts to counter emerging threats; and, provides feedback to the Science & Technology (S&T) community to guide long term developmental strategies.  RRTO anticipates adversaries' exploitation of technology, including available and advanced commercial capabilities.  In prior years, RRTO has explored methods and approaches of persistent surveillance stimulation for counterinsurgency; developed alternate power sources for sensors and systems; expanded human, social and cultural knowledge; increased small unit situational awareness; advanced the interface between law enforcement and military operations; developed biometrics and forensics capabilities; supported denied area operations; strategic multi-layer assessment; and, established an innovation outreach cell that is facilitating better interactions with small companies with emerging technologies that do not normally do business with the DoD.  In FY 2012 and FY 2013, RRTO will continue to explore new and emerging capabilities to support irregular warfare operations while working to support Under Secretary of Defense (Advanced Technology & Logistics) (USD (AT&L)) and the Assistant Secretary of Defense (Research and Engineering) (ASD(R&E)) goals.  With project selection occurring during the execution year, potential focus areas for FY 2012 and FY 2013 Rapid Reaction Technology Office projects include:  Forward Operating Base (FOB) protection; persistent Intelligence, Surveillance, and Reconnaissance (ISR) architecture; ISR sensors; interface of law enforcement and military operations; biometrics and forensics; autonomous operations; data processing, exploitation and dissemination (PED); cyber security; exploitation of new and emerging cell phone technologies; support to border patrol initiatives; counter proliferation initiatives; capabilities to exploit denied areas; strategic communications and multi-layer assessments; and nontraditional approaches to leverage innovative businesses.  The typical length of a RRTO project falls within a six to twelve month range in order to more effectively aid the Warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Submerged Launch System for a Fuel Cell Powered Long Endurance Expendable Unmanned Aerial System (UAS) for Intelligence, Surveillance, and Reconnaissance (ISR)"
                                    },
                                    "Description": {
                                        "val": "This project developed a fuel cell powered long endurance UAS for ISR.  The UAS is capable of being launched from a submerged submarine."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.550"
                                            },
                                            "Text": {
                                                "val": "Fully autonomous Electrically Assisted Take Off launch of UAV; launcher system design\/build; launcher system pond test; in water pre-demo flight tests.  Submerged launch test planned for 1Q FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Inflatable Satellite Communications (SATCOM) Antenna"
                                    },
                                    "Description": {
                                        "val": "This project developed a lightweight, portable SATCOM antenna for use with the Support Wide Area Network (SWAN) SATCOM Terminals.  The portable antennas can replace the current rigid 1.2 meter and 1.8 meter antennas.  Inflatable SATCOM antennas pack smaller and have a larger aperture that enables increased data throughput to include Full Motion Video."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.720"
                                            },
                                            "Text": {
                                                "val": "Developed X-band tracking capability for the SATCOM terminals.  Obtained Army Strategic Command certification of the X and Ka Band terminal.  Produced technical manuals and training materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Architectures"
                                    },
                                    "Description": {
                                        "val": "This project provided the overarching concepts for an integrated information architecture that enables the capture, processing, and distribution of almost all of the data that DOD, the Intelligence community Intelligence, Surveillance, and Reconnaissance (ISR) related systems generate globally in a rapid, relatively low cost, secure and open systems manner."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Delivered a Strategic Issues Report and enhanced capabilities descriptions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Continuing efforts to expand an advanced architecture enabling multiple DOD ISR initiatives to achieve a strategic level of significance by providing cohesion across initiative issues and describing the aspects of successful approaches to development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Imaging and Multifunction Sensing System (AIMS)"
                                    },
                                    "Description": {
                                        "val": "This effort developed an advanced multifunction sensor that can provide revolutionary sensing and imaging capabilities.  The effort significantly expands the capability of current systems by adapting and applying recent advances in ultra-wideband optical waveform technology and developing new device technologies to greatly expand the operational utility of Laser Detection & Ranging systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.474"
                                            },
                                            "Text": {
                                                "val": "Integrated the system aboard a manned aircraft and demonstrated the capability at tactically significant ranges.  Successfully collected 2-dimensional ISAL imagery with 1-mm resolution on both man-made targets and on human faces.  Currently completing characterization of improved retro-reflective sensors. Pursuing transition opportunities within the intelligence community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layer Assessment (SMA):  Deterring Violent Extremist Organizations (VEO)"
                                    },
                                    "Description": {
                                        "val": "In direct support of Combatant Commander senior leadership Strategic Multi-Layer Assessment (SMA) employs research and analysis techniques to develop a context and strategy for determining future deterrence options against Violent Extremist Organizations (VEO)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Conducted theoretical review and case study of deterring violent extremists.  Modeled development of a conceptual VEO deterrence model.  Used the VEO deterrence model to test the performance of the framework via additional exercise scenarios and roundtable workshops.  Further project details are classified based on the results of the case study to inform construction."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology Assessments at Yuma Proving Grounds (YPG)"
                                    },
                                    "Description": {
                                        "val": "The Joint Experimental Range Complex (JERC) is a remote test site located at the YPG that is designed to rapidly test prototype technologies.  These limited proof-of-concept tests allow for integration and development of Intelligence, Surveillance, and Reconnaissance (ISR), training, and Concept of Operation (CONOPS) development.  Since its establishment in late 2003, Rapid Reaction Technology Office (RRTO) has sponsored evaluation of more than 275 systems at the JERC.  This funding is utilized to provide emergent upgrades and capabilities to the site."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Sponsored six two-weeks evaluation periods for interested industry and government representatives to test emerging capabilities in a realistic desert environment.  Evaluated 14 technologies during these test periods.  Used the results of these evaluations to inform the development\/procurement process for future enhanced capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.780"
                                            },
                                            "Text": {
                                                "val": "Continuation of the five to six two-weeks evaluation periods a year for interested industry and government representatives to test emerging capabilities in a realistic desert environment.  Use the results of these evaluations to inform the development\/procurement process for future enhanced capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Covert Modulating Retroreflector (CMR) for High Speed Asymmetric Lasercom"
                                    },
                                    "Description": {
                                        "val": "This effort provided a high speed covert laser data link capable of transmitting live, high quality video and other data.  This program built on the successes of previous Rapid Reaction Fund (RRF) modulating retroreflector lasercom efforts and will incorporate the downlink capability aboard a small Unmanned Aerial Vehicle (UAV)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Conducted a successful demonstration of data link.  This technology is transitioning to a classified user."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hostile Fire Detection System (HFDS) – High Speed"
                                    },
                                    "Description": {
                                        "val": "This project developed a high speed infrared imaging system designed to identify the accurate location of a small arms shooter with a reduced number of false alarms. This project utilized a sensor developed for space operations and adapted it to detect ground based events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "The project developed three hardened prototypes for an operational demonstration.  Test and evaluation with US Army (G-2) planned for early FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "APEX and ASPEN"
                                    },
                                    "Description": {
                                        "val": "These two projects addressed the problem of increasingly sophisticated communications protocols being used against Blue Forces.  Through development of a better understanding of emerging communications standards and protocols and developing tools to take best advantage of these changes, these projects provided DOD the technical underpinnings required to address the evolving communications environment.  Details of the outcomes of this research are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.975"
                                            },
                                            "Text": {
                                                "val": "The projects delivered communications protocol information that is being used by the operational community of interest.  Further project details are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wide Area Chemical Sensing"
                                    },
                                    "Description": {
                                        "val": "This project developed a chemical sensing system that enables the detection and mapping of atmospheric chemical effluents over large geographic areas at high spatial-resolution and high-sensitivity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Developed the pointing mirror control system, conducted flight readiness review, conducted air-to-ground local demonstration, and a remote field test of the completed system.  Representatives from United States Southern Command (USSOUTHCOM) express strong support for the program and possible transition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synthetic Aperture Radar (SAR) Coherent Change Detection (CCD) for Thunderstorm"
                                    },
                                    "Description": {
                                        "val": "Participation of tactical, near real time SAR CCD capability in Thunderstorm Spiral 4 exercise.  SAR\/CCD utilizes complex algorithms to detect minute changes in terrain, infrastructure, troop movement, and other objects over time in imagery gleaned from two passes over the same path by a synthetic aperture radar."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Participation in Thunderstorm exercise, delivery of all SAR and SAR CCD data collected to operational users.  The SAR\/CCD capability will operationally deploy in mid FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FLASH 3-D Light Detection and Ranging (LIDAR)"
                                    },
                                    "Description": {
                                        "val": "This project field demonstrated real-time, full motion 3-dimensional imaging for the warfighter from an airborne LIDAR system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Conducted a flight demonstration for operational users. Proved capability to provide geo-referenced, orthorectified 3-dimensional stitched images in near real time.   This project will continue to exploring transition opportunities with US Army Special Operations, and the Intelligence, Surveillance, and Reconnaissance (ISR) Task Force."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Motion Imagery Synthetic Aperture Radar"
                                    },
                                    "Description": {
                                        "val": "This project demonstrated adding a millimeter wave (MMW) radar capability to an electro-optic and infrared camera-ball system.  Data fusion of the complementary optical and radar images enhance detection and information extraction while co-registration improves long range geo-location accuracy.  MMW capability will enhance foliage, fog, and weather penetration and facilitate the ability to detect changes in a given field of view."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Designed an engineering prototype capability, mounting the sensors in the camera ball on a turret, and developed a data collection system with a real time processing capability.  Flight demonstration is planned for 2Q FY2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Instant Eye"
                                    },
                                    "Description": {
                                        "val": "Semi-autonomous small Unmanned Aerial System (UAS) designed to support the individual soldier by providing instantaneous overhead video surveillance on demand.  Once launched, InstantEye will provide a live Electro-Optical\/Infra-Red video feed for up to 20 minutes.  The vehicle’s small size and quiet propulsion system make it inaudible at 30 feet and visually indistinguishable at 50 feet."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Completed the design and development of the MK-2 Instant Eye system; delivered 20 Instant Eye MK-2 prototypes and five ground stations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Text": {
                                                "val": "Complete the design and development of the MK-3 Instant Eye system with semi-autonomous control; deliver MK-3 Instant Eye prototypes for operational evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Qualitative Data Collection Strategy for Africa"
                                    },
                                    "Description": {
                                        "val": "The objective of this task was to design a qualitative data collection plan that will service the needs of the modeling & simulation community and users of computational models relating to Africa, while ensuring that data requirements are attuned to the interests of African partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Developed summary report of United States government modeling and simulation activities and summary report of African qualitative data requirements; provided qualitative data collection and engagement strategy for the way ahead to US Africa Command (AFRICOM)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tracking Illicit Networks and Linkages Facilitating Jihadist Terrorist Attacks Using New Methods of Analysis & Communication"
                                    },
                                    "Description": {
                                        "val": "This project is a collaborative research effort involving the Institute for the Study of Violent Groups (ISVG) and Midshipmen at the United States Naval Academy who will study patterns of interaction and communication among various types of illicit networks operating within and across U.S. boundaries.  The results of these analyses were summarized and linked to earlier studies in an existing semantic wiki database at the U.S. Naval Academy that is designed to track transnational Jihadist terrorist activities worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Produced six original case studies and circulated to interested consumers in the DOD and intelligence community.  Developed two inter-related sets of findings integrated within the existing Media wiki data at the U.S. Naval Academy.  Developed a new web-based Drupal Interface for accessing the wiki database and related data and research.  This project produces junior naval and marine officers trained to use state-of-the-art analytical techniques to understand and track evolving transnational illicit networks and may result in new approaches to quickly train future terrorism analysts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blue Team Assessments"
                                    },
                                    "Description": {
                                        "val": "This project provided inter-organizational technical support on various topics including Ground-Penetrating Radar and Synthetic Aperture Radar Coherent Change Detection capabilities.  Leveraging a wide range of expertise, the project helped ensure future projects are relevant to the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Text": {
                                                "val": "Provided technical review of proposals and submitted recommendations for development of capabilities supporting operational users."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.630"
                                            },
                                            "Text": {
                                                "val": "Reassess the evolving enemy threat then provide technical review of proposals and submit recommendations for development of capabilities supporting operational users."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR) Analysis and Architectures Support"
                                    },
                                    "Description": {
                                        "val": "The project assessed the value of ISR systems quantitatively by analyzing their role in the architecture of systems providing end-to-end mission effectiveness.   The goal of this analysis was to provide information to the government to make better development, deployment and employment decisions with new ISR systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.190"
                                            },
                                            "Text": {
                                                "val": "Assessed value of ISR systems quantitatively by analyzing their role in the architecture of systems providing end-to-end mission effectiveness.  This analysis was provided to the Rapid Reaction Technology Office, the Joint Improvised Explosive Device Defeat Organization, and the Intelligence, Surveillance, and Reconnaissance (ISR) Task Force to enable a more informed understanding of the development, deployment, and employment decisions with new ISR systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wide Area Video Exploitation Library (WaveLib) Phase II"
                                    },
                                    "Description": {
                                        "val": "WaveLib was developed as a modular toolkit of video processing functions designed to ingest raw imagery and metadata from wide area airborne sensors, such as Constant Hawk, and produce accurately geo-stabilized contrast-enhanced imagery, vehicle detections and tracks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Customized the WaveLib Single Target Tracker (STT) for use with the Massachusetts Institute of Technology Lincoln Lab MASIVS sensor data and the MASIVS APIX viewer for the Yellow Jacket sensor system. Enhanced and customized the WaveLib Shape File Refinement Tool for use by NGA Constant Hawk Analysts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Launched Cooperative Multiple Unmanned Aerial Vehicles (UAVs) for Intelligence, Surveillance and Reconnaissance (ISR) Missions"
                                    },
                                    "Description": {
                                        "val": "The project developed a cooperative multiple autonomous vertical take-off and landing (VTOL) UAV system that provides warfighters with capabilities to continuously collect intelligence, conduct surveillance, and perform reconnaissance for mission planning and execution, friendly force protection, and exploitation of enemy weaknesses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.490"
                                            },
                                            "Text": {
                                                "val": "Delivered final heterogeneous system (five VTOL UAVs, one ground station, and cooperative technologies payloads) to an operational user; demonstrated a prototype surveillance and reconnaissance system; and developed recommended CONOPS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HADWAV"
                                    },
                                    "Description": {
                                        "val": "The Human Activity Detection in Wide Area Video (HADWAV) software tool was developed to automatically detect vehicle starts and stops within a wide area of interest (AOI), as well as human activity within the same AOI.  The objective of this effort was to provide the capability to detect slow moving vehicles, two-wheelers, and people in operational full motion video imagery."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Improved HADWAV start and stop detection performance with the goal of transitioning the capability to operational cells within NGA, Counter-IED Operational Intelligence Center, and Distributed Common Ground System."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FROGGER"
                                    },
                                    "Description": {
                                        "val": "Supporting Special Operations warfighters, this project leverages a state-of-the-art chip-scale radio transceiver to implement a miniaturized Tagging, Tracking, and Locating (TTL) system capable of GPS-like geolocation accuracy against stationary or moving targets in various environments including jungles and cities from air, ground, and hand-held platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Delivery of prototype FROGGER TTL hardware system.  Demonstration of technology planned for March 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SHIVA XP"
                                    },
                                    "Description": {
                                        "val": "This effort provided comprehensive and actionable intelligence regarding the manufacturing and storage of ammonium nitrate.  SHIVA XP research supports a robust change-detection and tip-off capability for a broader range of problems, using commercial satellite sensor data and automatic algorithms.  Further details of this effort are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Conducted eight Applications Test Cases (ATCs) in support of United States Southern Command (USSOUTHCOM)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Surveillance Test Bed (PSTB) Automated Online Data Repository (AODR)"
                                    },
                                    "Description": {
                                        "val": "This project enabled the continued distribution of a 50 terabyte set of electro-optical (EO) and ground moving target indicator (GMTI) data for the development of Intelligence, Surveillance, and Reconnaissance (ISR) analysis algorithms.  The data set, with ground truth information, was instrumental in the development and validation of numerous Intelligence, Surveillance, and Reconnaissance analysis tools.  PSTB has developed and will use the AODR to process requests for classified and unclassified data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "Provided uninterrupted test data distribution (data duplication and processing for distribution) to developers and systems administration for the automated online data repository."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Altitude Air Defense (LAAD) Integrated Picture"
                                    },
                                    "Description": {
                                        "val": "The Low Altitude Air Defense (LAAD) Section Leader Vehicle (SLV) and Fire Unit Vehicle (FUV) have the ability to display air tracks via Link 16 messages.  This project used the System Integration Environment technology (a software solution) to overlay the air and ground tracks on the Joint Range Extension (JRE) application currently fielded in the SLVs and FUVs.  This project eliminated the need to install the Binary File Transfer (a hardware solution) in the FUVs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.950"
                                            },
                                            "Text": {
                                                "val": "Developed a prototyped Joint Range Extension gateway and client with an integrated air\/ground picture which will be used by the Marine Corps for acquisition certification."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Self-Contained Underwater Dispersant Delivery System (SCUDDS)"
                                    },
                                    "Description": {
                                        "val": "In support of Special Operations warfighters, this project developed a dispersal system to improve covert capabilities in littoral waters.  Project details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Prototype developed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Conduct operational testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Roman Intern"
                                    },
                                    "Description": {
                                        "val": "This project extended existing government owned technology for Iris Biometric Identification on Android mobile phones to produce a functional prototype system for field evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.550"
                                            },
                                            "Text": {
                                                "val": "Delivery of prototype and demonstration of adaptation of Commercial-Off-The-Shelf (COTS) Android handsets for Iris identification. After a robust evaluation in FY 2012, this capability will transition to multiple Government Agencies with biometric and intelligence interests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned Aerial Vehicle (UAV) Outer Control"
                                    },
                                    "Description": {
                                        "val": "This project demonstrated the potential ease and effectiveness of outer control of small tactical Unmanned Aerial Vehicles.  Student researchers demonstrated outer control capabilities using commercial off-the-shelf radio control systems and autopilots.  Their ability to achieve control was documented with their approaches, equipment selection, and effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Demonstrated of outer control of small, tactical UAVs.  Delivered final report and findings to observers.  Results of this experiment will inform development of countermeasures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Heterogeneous Cooperative UAVs"
                                    },
                                    "Description": {
                                        "val": "This project developed a collaborative framework that supports cross-domain transfer of information between a heterogeneous mix of unmanned vehicles and advancement of unmanned systems autonomous technologies to demonstrate collaborative behavior while minimizing human command and control.  This effort simulated a surveillance scenario involving multiple aerial and underwater vehicles communicating via a network."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Demonstrated surveillance, detection, tracking, and handoff using the simulation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Afghan Endgames"
                                    },
                                    "Description": {
                                        "val": "This project developed a range of options to effectively and efficiently achieve objectives in Afghanistan.  A comprehensive framework was developed to understand the dynamics of war and politics in Afghanistan, and options to transition from combat operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.325"
                                            },
                                            "Text": {
                                                "val": "A range of options was developed with strategies to achieve objectives in Afghanistan.  A published book was generated upon completion of the project.  The book is a reference tool for International Security Assistance Force (ISAF) personnel."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aluminum Combustor"
                                    },
                                    "Description": {
                                        "val": "This project developed a fuel feed system for an aluminum combustion power system.  The project significantly improved the availability and economy of aluminum fuel to power a high energy air independent power source for unmanned underwater vehicles (UUVs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Delivered a large bulk fuel feed system capable of supporting a greater than four hour combustor test at full power and greater than 20 hour combustor test at reduced power.  Results of this effort will inform the development of the Navy’s advanced UUVs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis and Targeting for Radicalization Intervention"
                                    },
                                    "Description": {
                                        "val": "This project piloted the use of its suite of graph, text, and web analytics to identify promising locations, websites, groups and individuals where intervention to prevent or reduce radicalization is most needed and can be most effective.  Primarily using open-source information, the project identified and mapped relevant social and information networks, determined their virulence and effectiveness, mapped current influence flows and effects, and identified opportunities and candidate means for positive change."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Delivered final report to include a counter-radicalization analysis as well as conclusions and recommendations regarding the general utility of these analytics for counter-radicalization targeting and planning.  The report includes a plan laying out a path forward for full development, test, and deployment of software tools implementing the analytical process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Foliage Penetrating (FOPEN) Light Detection and Ranging  (LIDAR) Red Team"
                                    },
                                    "Description": {
                                        "val": "This project provided a construct to assess the susceptibility of the FOPEN LIDAR sensor to defeat by parties not intimately familiar with the technology.  The project developed a construct that current or future Intelligence, Surveillance, and Reconnaissance (ISR) systems and sub-systems can be gamed against in a distributed desk top\/table top environment against traditional and nontraditional players."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Delivery of Red Team Assessment including recommendations on system operational employment, potential vulnerabilities, likely countermeasures taken by the threat, and potential counter-countermeasure to increase functionality or operational effectiveness of the system.  This assessment is being used by operational commanders with FOPEN LIDAR deployed in their area of responsibility."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis of High Frequency (HF) Communications"
                                    },
                                    "Description": {
                                        "val": "This project identified HF voice and data targets in an operational area of interest, captured existing tactical\/national capabilities against the target set; recommended commercial off-the-shelf based gap-filling capabilities; and developed and operationally tested a prototype capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Provided operational users characterization of the current, emerging, and projected HF environment in an operational area of interest, recommended capabilities to inform investment decisions, provided a template for other theaters, and tested a prototype in a representative environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Remote Detection of Explosives"
                                    },
                                    "Description": {
                                        "val": "This project sought new solutions to the technical challenge of detection of explosive chemical indicators using “crowdsourcing,” an alternative approach engaging thousands of expert scientists, engineers, and entrepreneurs practicing in many disciplines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Selected several solutions for modest awards.  Explored the most promising approach for a novel solution to be able to detect explosives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CellRad"
                                    },
                                    "Description": {
                                        "val": "This project will show that a large number of commercial off-the-shelf (COTS) cellular phones could be cheaply modified via software changes in order to build a large scale, deployable, mobile, network sensor array for radiation detection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.775"
                                            },
                                            "Text": {
                                                "val": "Performed isotope group identification testing; developed cell phone deployable software; developed data acquistion tracking, analysis, and display system; developed cell phone to host communications and compression software; Perfoemed integrated test for cell phone system; Performed demonstration of prototype cell phone system at Idaho National Laboratory (INL)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.900"
                                            },
                                            "Text": {
                                                "val": "Develop cell phone software for detecting radiological sources;  cell phone to host computer compression and communications software;  system modeling tools; host computer software for collection and visualization of radiological event data; simulations of phone and network utilization.  Perform field test with multiple cell phones and radiological sources.  Validate and analyze simulations against Demo results.  Document field test results in final report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Yellow Box"
                                    },
                                    "Description": {
                                        "val": "This project developed a wireless commercial device discovery, tracking, and identification system.  Yellow Box data can then be used not only to survey areas and identify specific devices, but associate those devices with specific users.  Once users are associated with specific devices, Yellow Box output can be pulled into systems like Palantir and Maltego, to develop rich and detailed patterns of life."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.325"
                                            },
                                            "Text": {
                                                "val": "Developed and produced prototype, documentation, and tactics, techniques, and procedures (TTPs). Trained operational users for assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sprayable Antenna"
                                    },
                                    "Description": {
                                        "val": "Sprayable antenna technology can be sprayed or painted onto any surface in minutes.  These applications can be customized to specific users and provide a Low Probability of Detection capability by eliminating the need for large detectable antenna arrays."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "This project delivered 6 Soft Antenna Kits for use by Special Operations Scout Sniper Teams and 4 Vehicle Kits of various frequency configurations as specified by users."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Exploitation of Space-Based Assets"
                                    },
                                    "Description": {
                                        "val": "This project provided Situational Awareness (SA) and trend analysis of small commercial Tactical Satellites (TACSATs) through market research and baseline satellite operational data.  The details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Project provided a user-validated TACSAT database describing capabilities and characteristics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Conduct demonstration of the database as decision process tool."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Exploitation of Low-Level Communications"
                                    },
                                    "Description": {
                                        "val": "This effort provides a material and technical solution to acquire and immediately exploit tactical Communications Intelligence (COMINT) by intercepting and simultaneously translating enemy chatter from Pashto into English, enabling our forces to hear enemy communications in English, in near real-time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Completed technical validation report\/demonstration of concept including an analysis of data collected and machine translation capabilities for the Pashto to English language pair."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Text": {
                                                "val": "Prototype development and operational assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Language Exploitation and Analysis from Dynamic Sources (LEADS)"
                                    },
                                    "Description": {
                                        "val": "This project generates cues for analysts and sensors from intelligence data.  The effort includes content extraction and representation tasks, and network analysis and exploitation tasks.  Geospatial relationships between entities, networks, and events are analyzed to identify high-activity areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.550"
                                            },
                                            "Text": {
                                                "val": "Developed prototype tools and analysis results including baseline dataset ingestion and representation, baseline entity extraction, and initial social network construction of subset intelligence data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Develop sentiment and dynamic network analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hydrogen Power Unit"
                                    },
                                    "Description": {
                                        "val": "The Hydrogen Power Unit (HPU) is a self-contained, stackable electrical generation system when combined with a fuel cell.  It is fueled by a water-based, non-flammable, and non-toxic Liquid Safety Fuel (LSF).  Hydrogen can be delivered “on-demand‟ directly into integrated fuel cell(s) for real-time, immediate use."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Text": {
                                                "val": "In coordination with Central Command (CENTCOM),  the project succesfully demonstrated the capability to efficiently produce hydrogen as a self-contained stackable fuel cell."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "A follow on demonstration in an instrumental lab is planned for FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Tactical High Frequency EXploitation (ETHEX)"
                                    },
                                    "Description": {
                                        "val": "The Enhanced Tactical HF EXploitation (ETHEX) project develops new tools to support the collection and targeting of High Frequency communications and data signals known to be employed by insurgent, terrorist and narcotics trafficking organizations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.475"
                                            },
                                            "Text": {
                                                "val": "Identified current HF Near Vertical Incident Skywave (NVIS) targets of interest to US Southern Command, US Pacific Command, and US Central Command.  The initial assessment included the evolution and deployment of target communications, data, and Improvised Explosive Device-related equipment, mapping available tactical HF exploitation systems against the target set; developed and refined techniques for tactical collection and geolocation of HF-NVIS and HF – Automatic Link Evaluation (HF-ALE) targets; and validated candidate techniques and algorithms through limited laboratory and range experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Modeling of HF propagation, and communication systems; Monitoring & surveillance techniques for HF-NVIS targets; Fabrication of field-testable prototype equipment for HF Radio Direction Finding and position fixing of HF-NVIS and HF-ALE signals.  Prototype will undergo an operational evaluation in FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensitive Chemical Vapor Sensor"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the feasibility of simultaneous, sensitive chemical detection of multiple vapor constituents.  This remote detection system is more sensitive than long-wave infrared hyperspectral systems while covering a broader spectral range than differential absorption Light Detection and Ranging  (LIDAR) systems and would be suitable for close-in or modest standoff detection of a host of explosive and\/or chemical weapon related threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.575"
                                            },
                                            "Text": {
                                                "val": "Demonstrated open-air detection of homemade explosive materials from a remote distance.  Developed link budget models and provided design for scaled system capable of detection at distances greater than 50 meters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Swimmer Detection Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "The Swimmer Detection Sonar Network (SDSN) is based on an integrated network of independent sonar nodes and is designed to provide enhanced situational awareness in harbor areas.  The operational demonstration of the SDSN system indicates that US Naval Forces, Central Command (USNAVCENT) can employ a sonar capability to detect the presence of swimmers within their harbor areas effectively."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.869"
                                            },
                                            "Text": {
                                                "val": "Delivery to United States Naval Center (USNAVCEN) and installation of capability, training of users, operational assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accedo"
                                    },
                                    "Description": {
                                        "val": "This project demonstrated a new Doppler-based Frequency-Of-Arrival approach that enables fast geo-location of intermittent signal emitters, significantly reducing the time requirement for geo-location and allowing both detection from an unmanned aerial system and detection of intermittent sources."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.919"
                                            },
                                            "Text": {
                                                "val": "Prototype development completed; field testing will be conducted February 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Integrity Global Positioning System (iGPS)"
                                    },
                                    "Description": {
                                        "val": "The iGPS program will provide prototype iGPS navigation hardware for Combatant Commander testing in dense jungle canopy, mountainous terrains, urban canyons, and on naval platforms.  Early Warfighter assessments of the performance of prototype iGPS equipment in these environments will be employed in enhancing iGPS User Equipment for fielding and assist in Concept of Operations (CONOPS) refinement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Initiated planning for installation of iGPS prototype Hardware and field testing on a Pacific Command (PACOM) naval platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Begin Joint field testing with Combatant Commanders, draft initial Warfighter assessments of hardware and operations and initiate iGPS design trades for militarized options."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CLOUDBREAK Campaign Initiative"
                                    },
                                    "Description": {
                                        "val": "CLOUDBREAK will bring together JCTDs that focus on Command and Control among all Combatant Commands.  Cloudbreak will drive a common \"plug and fight\" architecture that provides services and consumes data based on the Defense Information Enterprise Architecture (DIEA) and the Defense Intelligence Information Enterprise (DI2E) framework.  CLOUDBREAK will demonstrate capabilities which can be provided as composable services on the Global Information Grid (GIG).  Success will be achieved when capabilities from multiple Programs of Record (PoR), JCTDs and other tools are reused by multiple COCOMs, based on common standards to meet changing needs.  The CLOUDBREAK campaigns will demonstrate existing mature capabilities in Cyber, Ops\/Intel, Situational Awareness and Regional Domain Awareness that meet COCOM priorities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Initiated system engineering and planning for CLOUDBREAK Campaign 1 to be executed in FY 2012 in USPACOM during Terminal Fury 12.  Efforts accomplished include requisite planning for campaign execution, developing test plans, metrics, and training to deliver the following services:  Common Operation Picture (COP) integration of he National Decision Support Service (NSLDSS) JCTD and Maritime COP; synchronization of J6\/Network and Cyber tools, and a Quick Reaction Capability (QRC) for the J2 Intelligence and Operations Center (JIOC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Partner funding required.  Complete CLOUDBREAK Campaign 1 during Terminal Fury 12 and Valiant Shield 12.  CLOUDBREAK will provide Operations and Intellengece services from a DI2E enabled JIOC; integrated data sources; dynamic, reconfigurable COP services including widget Mashups; Cyber Situational Awareness Services; and automated tools to sync Ops, Intel, and Cyber thereby automating the Command and Control (C2) of C2 services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Partner funding required.  Provide CLOUDBREAK Campaign during a relevant exercise with a theme of Humanitarian Assistance\/Disaster Response (HA\/DR).  The services planned for demonstration include Maritime\/Regional Domain Awareness Services, unclassified sensor integration, interagency Situational Awareness and Collaborative services that facilitate the automation of HA\/DR C2."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blue Dart III"
                                    },
                                    "Description": {
                                        "val": "A focused experiment exploring the asymmetric attack threat posed by unmanned underwater vehicles (UUVs) built using publicly available information and low cost, commercial-off-the-shelf (COTS) components.  Independent red teams consisting of college students with little or no maritime experience were sponsored in order to demonstrate the capability of educated, motivated individuals to design and develop UUV homemade devices to meet specific mission profiles."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "A Blue Dart III field demonstration will be held to assess the viability of student solutions to the proposed asymmetric attack mission.  The objective will be to provide intelligence assets indicators, warnings, threat capabilities, and limitations of US defenses in the maritime scenario, and to enhance the awareness in countering asymmetric threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alpha Act"
                                    },
                                    "Description": {
                                        "val": "This project will develop and deploy an advanced After Action Review (AAR) software tool for National Guard Agribusiness Development Teams (ADTs) based on the AlphaACT® crisis decision support platform.  The AlphaACT AAR Tool for ADTs will be a hosted, automated web application that will:  facilitate after action reviews of ADT missions; archive the information in an unclassified, minable database; automatically produce and distribute key mission reports; and make the information immediately available for mission planning and lessons learned."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.720"
                                            },
                                            "Text": {
                                                "val": "The AAR Tool will be designed, built, and tested in collaboration with the Kansas National Guard ADT Program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ADDCAP"
                                    },
                                    "Description": {
                                        "val": "This project will deploy a suite of portable (from hand-held to enterprise level) automated handwriting identification tools to support real-time sensitive site exploitation, law-enforcement, and other uses."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "US Africa Command (AFRICOM) will utilize Siemen’s D-Scribe software suite to conduct document comparisons in real world applications to explore the range of tactical applications, concepts of operations, and requirements for automated writer identification tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sky SharpEye"
                                    },
                                    "Description": {
                                        "val": "The Sky SharpEye program will demonstrate the feasibility, and product utility, of integrating a modified maritime SharpEye X-Band Solid State radar in an Unmanned Aerial System (UAS), in other light reconnaissance aircraft to generate Intelligence, Surveillance and Reconnaissance (ISR) products responsive to the needs of  ground and maritime forces."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "The program will develop and demonstrate the required Concept of Operations (CONOPS) and Concept of Employment (CONEMP) for use of a solid state power amplifier (SSPA) radar in a UAS, as well as the hardware, software and power supply interfaces with the test airborne platforms.  The anticipated test platforms include initially a manned helicopter (Huey), and then will transition to a Fire Scout MQ-80 rotary wing UAS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Manufacturing and Prototyping Initiative (AMPI)"
                                    },
                                    "Description": {
                                        "val": "This project will utilize Pennsylvania State University’s capabilities to establish a collaboration hub for advancing manufacturing technologies within DoD and industry.  The AMPI will develop, document, demonstrate, and test new products; provide expertise for process technology, prototyping, scale-up, and manufacturing demonstrations; provide technology & requirements forecasting; and, provide a secure integrated data environment for design, manufacturing support in training and education."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Conduct DoD\/Industry planning meeting to identify high priority technologies, products and technology needs and project selection criteria; define facility requirements, identify resources; develop an information and cyber security training and support plan; define Intellectual Property (IP) rights, licensing and ownership policy; develop a feedback process and metrics with industry and DoD clients\/sponsors; establish a focused pilot project and perform proof-of-concept process development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Commercial Product Vulnerabilities and Applications (FY 2012 and FY 2013 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2012 and FY 2013 Commercial Product Vulnerabilities and Applications projects will explore the use of commercial-off-the-shelf products to address immediate operational needs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.058"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities to identify commercial product vulnerabilities and applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.100"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities to identify commercial product vulnerabilities and applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming in Support of Rapid Fielding (FY 2012 and FY 2013 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2012 and FY 2013 Red Teaming projects will assess the susceptibility of Rapid Fielding technologies to defeat by parties not intimately familiar with the technology.  RRTO will leverage the innovative capabilities of Federally Funded Research and Development Centers to develop a construct that current or future systems can be gamed against in a distributed table top environment against traditional and non-traditional players."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify key technologies and systems to be assessed by red teams.  Deliverables will include recommendations on system operational employment, potential vulnerabilities, likely countermeasures taken by the threat, and potential counter-countermeasures to increase functionality or operational effectiveness of the system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.300"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify key technologies and systems to be assessed by red teams.  Deliverables will include recommendations on system operational employment, potential vulnerabilities, likely countermeasures taken by the threat, and potential counter-countermeasures to increase functionality or operational effectiveness of the system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Source Data Analysis and Applications (FY 2012 and FY 2013 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2012 and FY 2013 Open Source Data Analysis and Applications projects include the development of capabilities, software, and tools to analyze open source information."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.458"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  RRF will support development of open source data analysis tools and applications"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.512"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.512"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  RRF will support development of open source data analysis tools and applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Countering Violent Extremism and Planning Support (FY 2012 and FY 2013 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2012 and FY 2013 Countering Violent Extremism and Planning Support projects include studies of violent groups, collection of best-practices from a variety of federal organizations, deterrence, social network analysis, effective communication techniques in tribal environments, science and tech capabilities in support of strategic communications, social analysis to support counter-insurgency efforts, and development of multi-disciplinary multi-agency approaches to complex operational challenges."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.958"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities to counter the spread of violent extremism."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.415"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.415"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities to counter the spread of violent extremism."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Systems and Behaviors (FY 2012 and FY 2013 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2012 and FY 2013 Autonomous Systems and Behaviors projects include improvement to power systems to facilitate increased performance of unmanned systems, enhanced capabilities for multiple autonomous systems to cooperatively interact, development of sensors for integration aboard unmanned platforms, improvements to data ex-filtration from unmanned sensors and “red teaming” to counter emerging unmanned threats from potential adversaries."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.980"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  RRF will support development of unmanned autonomous aerial, surface and subsurface systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.677"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.677"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  RRF will support development of unmanned autonomous aerial, surface and subsurface systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Interface of Military ops with Law Enforcement and Border Patrol (FY 2012 and FY 2013 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2012 and FY 2013 Interface of Military ops with Law Enforcement and Border Patrol new start projects include collaboration and exercises with law enforcement organizations to identify overlap and synergies between military and law enforcement operations, exploitation of law enforcement data for use in an irregular warfare environment, development of improved border protection capabilities that can be used in military base protection, and expanding the capabilities of biometrics and forensics tools."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.616"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities of interest to multiple federal organizations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities of interest to multiple federal organizations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR) (FY 2012 and FY 2013 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2012 and FY 2013 ISR new start projects include improved surveillance sensors, tools to facilitate analysis of large data sets, methods to harvest meaningful intelligence from open and classified sources and establishment of an more effective processing, exploitation, and dissemination capabilities to facilitate integration of new and existing systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future ISR capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.950"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.950"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future ISR capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Urban Characterization Focus Areas (FY 2013 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 Urban Characterization projects will identify, analyze, and describe typical urban areas for modeling, simulation, and planning purposes.  These efforts will inform and enable development of intelligence, surveillance and reconnaissance (ISR), electronic warfare, kinetic and other capabilities needed for future military operations in a wide range of urban areas."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to combatant commander, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented. RRF will support development of open source data analysis tools and applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biometrics and Forensics Science and Technology Focus Area (FY 2013 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 Biometrics and Forensics projects will address the technology gaps that limit our ability to quickly and accurately identify anonymous individuals who threaten our physical and virtual assets either overseas or in the Homeland.  Additionally, the Biometrics and Forensics projects will collaborate with interagency partners to attribute enemy activity to a specific individual; and, will operationally evaluate and test biometrics and forensics systems and technologies.  Biometrics and Forensics projects will develop emerging technologies that support evolving identity operations and forensic capabilities required by commanders and warfighters in ongoing and future military activities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "The biometric portfolio will support gaps identified by commanders in the areas of increasing standoff distance for collection, exploration of the use of emerging biometric modalities and collection of biometric data from non-cooperative subjects.  The forensic portfolio will support gaps identified by commanders in the areas of reducing time to collect forensic data, improving accuracy of analysis of data, increasing the types of forensics data collected and increasing the amount of analysis that can be done in a field environment vice a laboratory environment.  Projects will be selected after coordination throughout DoD and across other U.S. Government Departments and Agencies to maximize collaborative investment and prevent redundant research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance metrics are specific to each effort and include measures identified in the specific project plans.  In addition, project completions and success are monitored against schedules and deliverables stated in the proposals and statements of work. The metrics include items such as target milestone dates, production measures, fielding dates, and demonstration goals and dates.  Generic performance metrics applicable to the Rapid Reaction Fund (RRF) includes attainment of DoD Strategic Objective 4-2D.  The title of this objective is \"Speed Technology Transition Focused on Warfighting Needs\" and the metrics for this objective is to transition 30 percent of completing demonstrations program per year.  For projects completed in FY 2010 and FY 2011, the RRF achieved a transition rate of greater than 75 percent.\n\nIn FY 2012 and FY 2013, RRF investment decisions will be made during the execution year, to rapidly respond to combatant commander requirement and new threats\/new opportunities."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P830"
                    },
                    "ProjectTitle": {
                        "val": "RDT&E Architecture and Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "10.403"
                        },
                        "BudgetYearOne": {
                            "val": "10.316"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.316"
                        },
                        "BudgetYearTwo": {
                            "val": "10.040"
                        },
                        "BudgetYearThree": {
                            "val": "10.496"
                        },
                        "BudgetYearFour": {
                            "val": "10.817"
                        },
                        "BudgetYearFive": {
                            "val": "11.106"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The National Counterterrorism\/Counterinsurgency Integrated Test and Evaluation Center (NACCITEC) at Yuma Proving Grounds consists of three Joint Experimentation Range Complexes (JERCs), which to date have been leveraged primarily to support development of counter Improvised Explosive Device (IED) technologies.  The JERCs, with additional investments, are capable of functioning as a venue for a much wider spectrum of evaluations designed to support the Quadrennial Defense Review (QDR) mandated development of an institutionalized “Rapid Acquisition Capability.”  The requested funding supports the development of a representative forward operating base (FOB) infrastructure designed to assess force protection systems and to support future rapid prototyping and rapid fielding initiatives.  This expanded focus into FOB defense technologies and to future threat and capabilities assessments will continue to be updated and enhanced as the threat evolves.  Potential focal areas include analysis of future homemade explosives (HME), future IEDs, counter IED capability development, characterization of future electro-magnetic environments and the integration of multiple sensors and weapons in a cohesive FOB defensive architecture.  This initiative aligns under the QDR focal area “Institutionalizing Rapid Acquisition Capability” and its third tenant “Assessing Alternatives and Executing a Solution (Acquisition).”"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Experimentation Range Complex Expansion"
                                    },
                                    "Description": {
                                        "val": "To support the expanded JERC capabilities, these resources support a modest level of testing infrastructure improvement, personnel and test equipment.  Additionally, resources will support the ability to create and test, in a representative environment, counters to future commercial wireless capabilities (4G phones) and IED activations, forward operating base protection systems, characterization of future Homemade Explosives precursor materials and assessment of Intelligence, Surveillance, and Reconnaissance (ISR) systems in both stand alone operations and within an operational context.  This enhancement will complement the Assistant Secretary of Defense (Research and Engineering) (ASD R&E) and Joint Improvised Explosive Device Defeat Organization (JIEDDO) Science & Technology (S&T) investment and acquisition strategy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.403"
                                            },
                                            "Text": {
                                                "val": "To support the expanded JERC capabilities, these resources support a modest level of testing infrastructure improvement, personnel and test equipment.  Additionally, resources will support the ability to create and test, in a representative environment, counters to future commercial wireless capabilities (4G phones) and IED activations, forward operating base protection systems, characterization of future Homemade Explosives precursor materials and assessment of Intelligence, Surveillance, and Reconnaissance (ISR) systems in both stand alone operations and within an operational context.  This enhancement will complement the Assistant Secretary of Defense (Research and Engineering) (ASD R&E) and Joint Improvised Explosive Device Defeat Organization (JIEDDO) Science & Technology (S&T) investment and acquisition strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.316"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.316"
                                            },
                                            "Text": {
                                                "val": "Evaluate trends of the emerging threat to blue forces and continue improvements to the testing infrastructure to support evaluation of emerging technologies to counter the evolving threat.  Potential future focus areas could include 5G cellular networks, novel enhanced explosives, comprehensive force protection capabilities, more robust Intelligence Surveillance and Reconnaissance (ISR) sensors large data processing, exploitation, and dissemination data handling.  These investments will continue to support the ASD(R&E) and JIEDDO S&T investment and acquisition strategy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NA"
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance metrics are specific to each effort and include measures identified in the specific project plans.  In addition, project completions and successes are monitored against schedules and deliverables stated in the proposals and statements of work. The metrics include items such as target dates, production measures, fielding dates, and demonstration goals and dates.  Generic performance metrics applicable to the RDT&E Architecture and Integration initiative includes attainment of DOD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology (S&T) program\"  and the metrics for this objective is to transition 30 percent of completing demonstration programs per year.  \n\nIn FY 2013, investment decisions will be made during the execution year, to rapidly respond to combatant commander requirement and new threats or new opportunities as they relate to technologies emerging from non-traditional sources."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P831"
                    },
                    "ProjectTitle": {
                        "val": "Joint Rapid Acquisition Cell Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.734"
                        },
                        "BudgetYearOne": {
                            "val": "1.760"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.760"
                        },
                        "BudgetYearTwo": {
                            "val": "1.756"
                        },
                        "BudgetYearThree": {
                            "val": "1.860"
                        },
                        "BudgetYearFour": {
                            "val": "2.055"
                        },
                        "BudgetYearFive": {
                            "val": "2.117"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This funding includes support for the Joint Rapid Acquisition Cell (JRAC) to enable management and tracking of Combatant Commander (COCOM) identified and Joint Staff validated immediate warfighter needs.  FY 2012 is the first year for a dedicated funding line for this effort. The funding in this project is under the cognizance of the JRAC and is responsible to: \n(1)  Coordinate review of validated Joint Urgent Operational Needs (JUON) and assign responsibility to appropriate DOD Components for timely funding and resolution. \n(2)  Serve as the review and approval authority for the DOD Components’ strategy to fund and mitigate the identified JUON capability gap. \n(3)  Continually assess actions taken by the DOD Components to resolve JUONs and recommend to the USD(AT&L) any changes determined appropriate to improve their responsiveness to JUONs.\n(4)  Provide periodic reports to the Secretary of Defense on new and outstanding JUONs.   \n(5)  In coordination with Under Secretary of Defense Comptroller (USD(C)), manage the Rapid Acquisition Fund (RAF) to allocate resources to priority unfunded JUONs.\n(6)  In coordination with the Office of the Chairman of the Joint Chiefs of Staff and the USD(C), make programmatic, budget, and acquisition recommendations for JUONs and identified capability gaps to the Secretary of Defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Rapid Acquisition Cell (JRAC) Management Support"
                                    },
                                    "Description": {
                                        "val": "This funding is utilized to support the staff manning of the JRAC to enable management and tracking of COCOM identified and Joint Staff validated immediate warfighter needs.  This baseline is being initiated in FY 2012 to preclude ad hoc and unstable historical programmatic and financial support to the JRAC staff."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.734"
                                            },
                                            "Text": {
                                                "val": "Support for the JRAC to enable management and tracking of COCOM initiated and Joint Staff validated immediate warfighter needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.760"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.760"
                                            },
                                            "Text": {
                                                "val": "Support for the JRAC to enable management and tracking of COCOM initiated and Joint Staff validated immediate warfighter needs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NA – Capabilities acquired to fulfill JUONs are provided by other DOD components."
                        },
                        "PerformanceMetrics": {
                            "val": "JRAC performance metrics are specific to each JUON and include measures identified in the management approach for each JUON.  In addition, JUON completions and successes are monitored against schedules and deliverables stated in the JUON management approach.  The metrics to which JRAC support correlates is to the number of full time personnel identified in the JRAC support contract with associated pay rates and shall not exceed the specified amounts or hourly rates and\/or firm fixed price."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P833"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Multi-Layered Assessment (SMA) Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.970"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.970"
                        },
                        "BudgetYearTwo": {
                            "val": "1.900"
                        },
                        "BudgetYearThree": {
                            "val": "1.930"
                        },
                        "BudgetYearFour": {
                            "val": "1.960"
                        },
                        "BudgetYearFive": {
                            "val": "2.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Strategic Multi-Layered Assessment (SMA) project was added in FY 2013 as a result of a net zero functional transfer of resources and mission from United States Strategic Command (STRATCOM)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Strategic Multi-Layered Assessment Cell supports all Combatant Commanders (COCOMs), Joint Force Commanders and all other government agencies by assessing complex operational\/technical challenges which require multi-agency and multi-disciplinary approaches.  With input from across the United States Government, academia and the private sector, the SMA cell develops solution options to COCOM generated challenging problems and informs the command’s senior leadership.  Priorities for SMA problems are set by the Joint Staff Deputy for Operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layered Assessment (SMA) Support"
                                    },
                                    "Description": {
                                        "val": "In FY 2011 and FY 2012 the SMA project has been supported by STRATCOM and the Rapid Reaction Fund (PE 0603826D8Z).  In FY 2013 a net zero functional transfer of resources and mission responsibilities from STRATCOM to Office of the Secretary of Defense (OSD) resulted in funding this project."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.970"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.970"
                                            },
                                            "Text": {
                                                "val": "In FY 2013 the SMA cell will continue to actively work with the COCOMs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of the Combatant Commanders and may include areas such as: counter terrorism; counter weapons of mass destruction (state and non-state); counter global or regional social and cultural assessments; and, individual state or national level deterrence studies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "SMA performance metrics are specific to each effort and include measures identified in the specific project plans.  In addition, project completions and success are monitored against schedules and deliverables stated in the execution documents.  Each project results are reviewed by a senior review group that is comprised with representatives from the Office of the Secretary of Defense, the Joint Staff, the COCOMs and outside subject matter experts.  The ultimate measure of success is adaption and transition of SMA products by the COCOM and supporting entities."
                        }
                    }
                }
            ]
        }
    }
}