{
    "id": "f1de55ba00324d6c90ed73c5d0b29122fa1b1793",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604875D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Systems Architecture Development"
        },
        "R1LineItemNumber": {
            "val": "136"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.802"
            },
            "CurrentYear": {
                "val": "4.570"
            },
            "BudgetYearOne": {
                "val": "3.845"
            },
            "BudgetYearOneBase": {
                "val": "3.845"
            },
            "BudgetYearTwo": {
                "val": "4.102"
            },
            "BudgetYearThree": {
                "val": "4.354"
            },
            "BudgetYearFour": {
                "val": "5.928"
            },
            "BudgetYearFive": {
                "val": "6.034"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Quadrennial Defense Review (QDR) and acquisition reform initiatives call for top down, national security strategy-driven capabilities-based planning. Department of Defense (DoD) Instruction 5000.02 and Chairman of the Joint Chiefs of Staff Instruction 3170.01 promulgate capabilities-based requirements and acquisition processes. The Joint System Architecture Development (JSAD) program enables collaborative efforts to achieve these goals. These efforts include providing support to conduct warfighting capability-based analysis; performing assessments of joint capability areas and joint integrating concepts; developing and supporting needed sets of system and system-related data; creating integrated roadmaps to support acquisition investment decisions; and performing assessments of major defense acquisition programs and major automated information systems in a capability area context.  Activities in the JSAD project are divided into three areas:  (1) capability-based analysis; (2) roadmaps; and (3) support tools and guidance. Capability-based analysis provides analysis of the different technology, functionality, and integration impacts of systems on warfighting capability.  Acquisition roadmaps guide systems development and associated investment plans.  JSAD support tools and guidance initiatives develop systems data, and tools, exploit modeling and simulation and architecture efforts to improve DoDs overall assessment capability.  These efforts guide the development and improve the testing and fielding of integrated systems of systems in order to achieve Joint mission capabilities.  The QDR also lays out the need for an institutional reorientation or shift in emphasis from organization-specific to enterprise-wide approaches. This means:  (1) horizontal integration within the Department and unity of effort through greater interagency collaboration; (2) engaging in a coordinated and portfolio-based approach to planning,  programming, budgeting and execution; and (3) significant reforms at the governance, management and execution levels.  To accomplish this direction, there needs to be a focused  goal and concerted emphasis on shifting from systems acquisition to capabilities-based portfolio management (or portfolio systems acquisition).  Starting in FY 2008, this  program enables collaborative efforts to implement the QDR direction outlined above in order to achieve portfolio systems acquisition goals.  The program is broken up into two  focus areas (Portfolio Management and Reform Initiatives) and consolidates work previously performed under various other Program Elements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.052"
                },
                "CurrentYear": {
                    "val": "4.731"
                },
                "BudgetYearOne": {
                    "val": "3.876"
                },
                "BudgetYearOneBase": {
                    "val": "3.876"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.802"
                },
                "CurrentYear": {
                    "val": "4.570"
                },
                "BudgetYearOne": {
                    "val": "3.845"
                },
                "BudgetYearOneBase": {
                    "val": "3.845"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.250"
                },
                "CurrentYear": {
                    "val": "-0.161"
                },
                "BudgetYearOne": {
                    "val": "-0.031"
                },
                "BudgetYearOneBase": {
                    "val": "-0.031"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.181"
                    },
                    "CurrentYear": {
                        "val": "-0.129"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Defense Efficiency - Report, Studies, Board, and Commissions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.577"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Efficiency - Contractor Staff Support"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.446"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Efficiency - Baseline Review"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.041"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "1.021"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.031"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.031"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.026"
                                },
                                "CurrentYear": {
                                    "val": "-0.032"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P875"
                    },
                    "ProjectTitle": {
                        "val": "Joint Systems Architecture Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funds have been transferred from this Program Element (PE) to the new Systems Engineering PE, in response to the Weapon System Acquisition Reform Act of 2009 which directed the Secretary of Defense to appoint a Director for Systems Engineering reporting to the Undersecretary of Defense for Acquisition, Technology and Logistics (USD(AT&L))."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Advanced Concepts Initiatives"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Funds have been transferred from this Program Element (PE) to the new Systems Engineering PE, in response to the Weapon System Acquisition Reform Act of 2009 which directed the Secretary of Defense to appoint a Director for Systems Engineering reporting to the Under Secretary of Defense for Acquisition, Technology and Logistics (USD(AT&L)).  \n\nThe USD(AT&L) initiated implementation of the Act by establishing a new office of the Director, Systems Engineering, and a new Office of the Director, Developmental Test and Evaluation and reallocating resources from the former office of the Director, Systems and Software Engineering."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Not applicable."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P876"
                    },
                    "ProjectTitle": {
                        "val": "Portfolio Systems Acquisition (PSA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.802"
                        },
                        "CurrentYear": {
                            "val": "4.570"
                        },
                        "BudgetYearOne": {
                            "val": "3.845"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.845"
                        },
                        "BudgetYearTwo": {
                            "val": "4.102"
                        },
                        "BudgetYearThree": {
                            "val": "4.354"
                        },
                        "BudgetYearFour": {
                            "val": "5.928"
                        },
                        "BudgetYearFive": {
                            "val": "6.034"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Departments 2005 Quadrennial Defense Review (QDR) laid out the need for an institutional reorientation or shift in emphasis from organization-specific to enterprise-wide approaches.  This meant:  (1) horizontal integration within the Department and unity of effort through greater interagency collaboration; (2) engaging in a coordinated and portfolio-based approach to planning, programming, budgeting and execution; and (3) significant reforms at the governance, management and execution levels.  The Department’s 2010 QDR report further addressed reforming how we buy, noting that the conventional acquisition process is too long and too cumbersome to fit the needs of the many systems that require continuous changes and upgrades—a challenge that will become only more pressing over time. The Department will improve how it matches requirements with mature technologies, maintains disciplined systems engineering approaches.   To accomplish this direction, there needed to be a focused goal and concerted emphasis on shifting from acquisition of individual systems to portfolio management (or portfolio systems acquisition).  This program enables collaborative efforts to implement the QDR direction outlined above and to achieve portfolio systems acquisition goals and to develop and implement acquisition reform initiatives.  The program is broken up into two focus areas (Portfolio Management and Reform Initiatives) and consolidates work previously performed under various other Program Elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Portfolio Systems Acquisition Initiatives"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.802"
                                            },
                                            "Text": {
                                                "val": "-Conducted assessments of Capability Portfolios for cost savings opportunities.\n-Participated in an analysis of current and future adequacy of the military aircraft industrial base.\n-Participated in Unmanned Systems portfolio reviews and the Maritime ISR review.\n-Provided analytical support to the Unmanned Aircraft Systems Task Force, Airspace Integration IPT, and in reviews of Unmanned Systems program execution.\n-Performed a study of the solid rocket motor industrial base\n-Performed a review of the Integrated Air and Missile Defense portfolio\n-Prepared Counter Weapons of Mass Destruction roadmap and provided technical and analytical support for CWMD System of Systems work\n-Performed Ground Moving Target Indicator cost-benefit analysis\n-Conducted system support and analyses of rotary wing aviation programs including Future Vertical Lift.\n-Assessed progress of enhanced DoD fuze enabling technologies.\n-Maintained the Conventional Munitions Database.\n-Provided technical expertise for strategy development, making recommendations on programmatic direction, and for developing DoD positions relating to Global Nuclear Defense and to Conventional Prompt Global Strike.\n-Coordinated issues related to DoD equities with Global Nuclear Defense throughout the Department and with the interagency.\n-Articulated DoD courses of action and views on homeland defense implementation and compliance issues in multiple bilateral and multilateral fora.\n-Continued implementation support of program management initiatives.\n-Conducted analyses and support implementation of acquisition reform initiatives (e.g., WSARA, IMPROVE).\n-Provided analytical support to the Homeland Defense Coordinator function within OUSD(AT&L) \n-Conducted analyses of warfare areas to reduce duplication and identify opportunities for cost savings.\n-Supported development of US\/UK Ground Moving Target Indicator (GMTI) collector interoperability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.570"
                                            },
                                            "Text": {
                                                "val": "-Conduct assessments of Capability Portfolios for cost savings opportunities.\n-Participate in an analysis of current and future adequacy of the military aircraft industrial base.\n-Participate in Unmanned Systems portfolio reviews and the Maritime ISR review.\n-Provide analytical support to the Unmanned Aircraft Systems Task Force, Airspace Integration IPT, and in reviews of Unmanned Systems program execution.\n-Perform a study of the solid rocket motor industrial base\n-Perform a review of the Integrated Air and Missile Defense portfolio\n-Prepare Counter Weapons of Mass Destruction roadmap and provided technical and analytical support for CWMD System of Systems work\n-Perform Ground Moving Target Indicator cost-benefit analysis\n-Conduct system support and analyses of rotary wing aviation programs including Future Vertical Lift.\n-Assess progress of enhanced DoD fuze enabling technologies.\n-Maintain the Conventional Munitions Database.\n-Provide technical expertise for strategy development, making recommendations on programmatic direction, and for developing DoD positions relating to Global Nuclear Defense and to Conventional Prompt Global Strike.\n-Coordinate issues related to DoD equities with Global Nuclear Defense throughout the Department and with the interagency.\n-Articulate DoD courses of action and views on homeland defense implementation and compliance issues in multiple bilateral and multilateral fora.\n-Continued implementation support of program management initiatives.\n-Conduct analyses and support implementation of acquisition reform initiatives (e.g., WSARA, IMPROVE).\n-Provide analytical support to the Homeland Defense Coordinator function within OUSD(AT&L) \n-Conduct analyses of warfare areas to reduce duplication and identify opportunities for cost savings.\n-Support development of US\/UK Ground Moving Target Indicator (GMTI) collector interoperability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.845"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.845"
                                            },
                                            "Text": {
                                                "val": "-Conduct assessments of Capability Portfolios for cost savings opportunities.\n-Conduct analyses and support implementation of acquisition efficiencies.\n-Articulate DoD courses of action and views on homeland defense implementation and compliance issues in multiple bilateral and multilateral fora.\n-Provide technical expertise in support of warfare area portfolios.\n-Provide analytical support to the Homeland Defense Coordinator function within OUSD(AT&L).\n-Prepare roadmaps to guide investments in critical areas (e.g., future vertical lift).\n-Conduct analyses of warfare areas to reduce duplication and identify opportunities for cost savings.\n-Assess progress of program management initiatives and implement new initiatives."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Not Applicable"
                        }
                    }
                }
            ]
        }
    }
}