{
    "id": "f3d5277ee126b4bd675ebb0cfe643e75fff7d730",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602716A"
        },
        "ProgramElementTitle": {
            "val": "HUMAN FACTORS ENGINEERING TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.583"
            },
            "CurrentYear": {
                "val": "21.767"
            },
            "BudgetYearOne": {
                "val": "19.872"
            },
            "BudgetYearOneBase": {
                "val": "19.872"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "21.339"
            },
            "BudgetYearThree": {
                "val": "20.988"
            },
            "BudgetYearFour": {
                "val": "20.912"
            },
            "BudgetYearFive": {
                "val": "21.081"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) is to conduct applied research on aspects of human factors engineering that impact the capabilities of individual and teams of Soldiers operating in complex, dynamic environments.  The results of the research will enable maximizing the effectiveness of Soldiers and their equipment for mission success.  The aspects of human factors that will be studied include sensing, perceptual and cognitive processes, ergonomics, biomechanics and the tools and methodologies required to manage interaction within these areas and within the Soldiers' combat environment.  Project H70 research is focused on decision-making; human robotic interaction; crew station design; improving Soldier performance under stressful conditions such as time pressure, information overload, information uncertainty, fatigue, on-the-move and geographic dispersion; and enhancing human performance modeling tools.   \n\nWork in this project complements and is fully coordinated with PE 0602601A (Combat Vehicle and Automotive Advanced Technology), PE 0602786A (Warfighter Technology), PE 0602120A (Sensors and Electronic Survivability), PE 0602784A (Military Engineering Technology), PE 0602783A (Computer and Software Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0602785 (Manpower\/Personnel\/Training Technology), PE 0603005A (Combat Vehicle and Automotive Technology), PE 0603710A (Night Vision Advanced Technology), PE 0603015A (Next Generation Training and Simulation), and PE 0603007A (Manpower, Personnel, and Training Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy..\n\nWork in this project is performed by the Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.042"
                },
                "CurrentYear": {
                    "val": "21.801"
                },
                "BudgetYearOne": {
                    "val": "21.484"
                },
                "BudgetYearOneBase": {
                    "val": "21.484"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.583"
                },
                "CurrentYear": {
                    "val": "21.767"
                },
                "BudgetYearOne": {
                    "val": "19.872"
                },
                "BudgetYearOneBase": {
                    "val": "19.872"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.459"
                },
                "CurrentYear": {
                    "val": "-0.034"
                },
                "BudgetYearOne": {
                    "val": "-1.612"
                },
                "BudgetYearOneBase": {
                    "val": "-1.612"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.090"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.612"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.612"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.369"
                                },
                                "CurrentYear": {
                                    "val": "-0.034"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H70"
                    },
                    "ProjectTitle": {
                        "val": "HUMAN FACT ENG SYS DEV"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.583"
                        },
                        "CurrentYear": {
                            "val": "21.767"
                        },
                        "BudgetYearOne": {
                            "val": "19.872"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.872"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "21.339"
                        },
                        "BudgetYearThree": {
                            "val": "20.988"
                        },
                        "BudgetYearFour": {
                            "val": "20.912"
                        },
                        "BudgetYearFive": {
                            "val": "21.081"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on human factors to maximize the effectiveness of Soldiers in concert with their equipment.  The resulting data are the basis for weapon systems and equipment design standards, guidelines, handbooks, and Soldier training as well as manpower requirements to improve equipment operation and maintenance.  Application of this research will yield reduced workload, fewer errors, enhanced Soldier protection, user acceptance, and allows the Soldier to extract the maximum performance from the equipment.  \n\nMajor efforts research sources of stress, potential stress moderators, intervention methods and identifies and quantifies human performance measures and methods to address future warrior performance issues.  Individual efforts exploit adaptive learning methods and strategies, enhance and validate human performance modeling tools; investigate integration of advanced concepts in crew stations designs, optimizes interfaces for information systems and improves human robotic interaction (HRI) in a full mission context.\n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nWork in this project complements and is fully coordinated with PE 0602601A (Combat Vehicle and Automotive Advanced Technology), PE 0602786A (Warfighter Technology), PE 0602120A (Sensors and Electronic Survivability), PE 0602784A (Military Engineering Technology), PE 0602783A (Computer and Software Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0602785 (Manpower\/Personnel\/Training Technology), PE 0603005A (Combat Vehicle and Automotive Technology), PE 0603710A (Night Vision Advanced Technology), PE 0603015A (Next Generation Training and Simulation), and PE 0603007A (Manpower, Personnel, and Training Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research Laboratory (ARL), Aberdeen, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Learning Methods and Strategies"
                                    },
                                    "Description": {
                                        "val": "Identify areas where innovative training methods can be used to reduce mismatches between Soldier performance and technological capabilities.   Identify adaptive learning tools and assessment measures which have the potential to improve decision quality for leaders and teams."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.353"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and developed a Soldier-organization-information modeling capability for use in real-time military simulation exercises."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate Soldier-organization-information modeling in laboratory and field research; further mature and validate tools and methods developed to train, improve, assess information sharing, decision making as well as collaboration in network-enabled operations that support decision making."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.308"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.308"
                                            },
                                            "Text": {
                                                "val": "Will focus efforts on the data rich environment of C2 planning and execution; enhance FY12 methods\/tools by investigating mission context data aggregation and alert capabilities; investigate and design user personalization alternatives and techniques for decision-specific queries, summarization, and extraction; refine human-in-the-loop evaluation methods and establish initial evaluation criteria for human decision making and collaboration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Performance Modeling"
                                    },
                                    "Description": {
                                        "val": "Enhance human performance modeling tools to reduced workload and human errors and increase user acceptance of developing technologies allowing the Soldier to extract the maximum performance from the equipment.  Collect and analyze empirical data on human perception (vision and hearing) to support human and system performance models used for equipment design and training.  Efforts are coordinate with PE 0602786\/Project H98."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.234"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Verified networked, collaborative versions of select Soldier centered design tools; compared spatial vision, color vision and motion sensitivity in three discrete retinal regions, and translated those data for use in the ACQUIRE model.  Conducted human-observer studies to examine human perceptual performance with prototype low-light cameras, monochrome displays, and objective-lens optics fabricated for: on-chip processing, high-speed video transmission, high resolution, high dynamic range and no-focus digital filtering\/closed loop control."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.578"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate empirical data on the effects of Soldier Load on physical and cognitive performance to enhance models; create and distribute a protected web-based repository of human performance models used in Manpower and Personnel Integration (MANPRINT) analyses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.490"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.490"
                                            },
                                            "Text": {
                                                "val": "Will investigate Soldier Load physical and cognitive algorithms developed in FY12 and their application to the Human Performance models; and assess a theory-based decision quality metric for the Command, Control, and Communications module for future evaluations of decision effectiveness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Mobility Systems"
                                    },
                                    "Description": {
                                        "val": "Investigate intelligent, indirect-vision-based vehicle mobility; advanced crew stations; 360\/90 degree situational awareness systems; crew and dismount scalable interfaces; and neurophysiologically as well as behavior-based technologies. Implement guidelines for: sensor and data handling; algorithms for characterizing Soldier brain activity in operational contexts; real-time techniques to integrate neurally-based information into systems designs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Devised potential designs to enable secure mobility with reduced manning, indirect vision and drive-by-wire systems;  developed techniques for using real-time knowledge of Soldier neuro-cognitive state in optimizing Soldier-system performance and developed guidelines for Soldier state-based crew station design; and transition cognitive state measurement technologies for assessment in operational environments to TARDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.052"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess and extend cognitive state modeling and simulation efforts to enhance operational relevance of experimental scenarios and real-time, state-based technologies for improving Soldier-system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.254"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.254"
                                            },
                                            "Text": {
                                                "val": "Will utilize cognitive state modeling and simulation efforts to enhance Soldier-system performance by investigating cognitive state and performance levels using emerging brain-computer neuro-technologies for future applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Man-Machine Interfaces"
                                    },
                                    "Description": {
                                        "val": "Investigate equipment design standards and human performance measures and create guidelines for maneuver team information systems solutions that improve situational understanding and decision cycle time ; identify, mature, and quantify human performance limitationsto address future warrior performance issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.473"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Examined the effects of information management and information flow on individual Soldier performance and team performance in an operational environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.978"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Examine effects and impact of rifle and optic remedies for shooting performance decrements associated with full facial protection; conduct research and analysis on the effects of Soldier Load on Soldier physical and cognitive performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.889"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.889"
                                            },
                                            "Text": {
                                                "val": "Will examine measures and methods to assess the effects and impact of recoil and recoil mitigation devices on Soldier shooting performance; conduct applied research and analysis on the effects of physical and cognitive loads on Soldier performance for step-wise improvements in equipment design that will contribute incementally to lightening the Soldier load."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human-Robotic Interaction (HRI)"
                                    },
                                    "Description": {
                                        "val": "Design requirements and technologies for supervision and Soldier intervention for multiple semi-autonomous unmanned vehicles (UVs) in an urban environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.061"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Simulated supervisory control using ground and aerial UVs for multiple perspectives for robotic missions.  Performed Soldier robotic controller interface evaluations in realistic venues."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.771"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support evaluation of soldier monitoring crew station design as well as develop experimental designs and support final capstone field experiments to evaluate local situational awareness, assisted mobility, and soldier monitoring technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.712"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.712"
                                            },
                                            "Text": {
                                                "val": "Will assist with FY13 capstone field assessments by designing supporting experiments to measure and assess local situational awareness for assisted mobility and Soldier monitoring technologies; conduct modeling and simulation studies to examine manned-unmanned teaming concepts to create measures and methods for assessing current and future technology capabilities needed to provide manned-unmanned teaming capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding Socio-cultural Influence"
                                    },
                                    "Description": {
                                        "val": "Investigate and model cognitive aspects of socio-cultural influences on Soldier\/Commander decision making and communication to enhance Soldier performance with systems, within teams and in the mission context. This work is complementary to and coordinated with PE 62784\/T41 Socio-Cultural Modeling and PE 62785\/790 Leader Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.712"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed cognitive framework and models depicting influence of socio-cultural factors on Soldier\/Commander decision making and communication."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop cognitive framework and models depicting influence of socio-cultural factors on Soldier\/Commander decision making and communication."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.219"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.219"
                                            },
                                            "Text": {
                                                "val": "Will assess the potential impact to Soldier\/Commander decision making and communication by using the FY12 developed cognitive framework and begin validation and verification of models."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}