{
    "id": "f569adb1191779b2f8e9f86bdd67b12ec6d15ebe",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0804767D8Z"
        },
        "ProgramElementTitle": {
            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2)"
        },
        "R1LineItemNumber": {
            "val": "180"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "47.050"
            },
            "CurrentYear": {
                "val": "37.255"
            },
            "BudgetYearOne": {
                "val": "77.475"
            },
            "BudgetYearOneBase": {
                "val": "77.475"
            },
            "BudgetYearTwo": {
                "val": "59.060"
            },
            "BudgetYearThree": {
                "val": "62.374"
            },
            "BudgetYearFour": {
                "val": "62.653"
            },
            "BudgetYearFive": {
                "val": "63.512"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "These programs are part of a coordinated effort to develop and deploy capabilities for rapidly linking and integrating Live, Virtual, and Constructive (LVC) forces for Services, Combatant Commanders (COCOMs), coalition, and other government agencies.  These programs will create a realistic battlespace environment in which to train as a Joint Warfighting force to meet emerging mission requirements including adapting to new and future realities.  These investments support the Secretary of Defense’s (SECDEF) Commanders Exercise and Engagement Training Transformation (CE2T2) initiative to enable and enhance Joint Warfighting readiness by training as we intend to fight.  The elements associated with this coordinated effort consist of:\n\n- Joint National Training Capability (JNTC)\n- Joint Simulation Systems (JSS)\n- Joint Knowledge Development & Distribution Capability (JKDDC)\n- U.S. Forces Korea Training & Exercise Support (USFK)\n- Immersive Trainer \n- Air Force JNTC\n- Navy JNTC\n\nJNTC:  Established in 2003, JNTC continues to develop and integrate Advanced Training Technologies into a seamless Joint training environment.  JNTC establishes the overarching Joint framework and context necessary for COCOMs and Services to achieve a Joint training environment through an integrated network of training sites and nodes.  JNTC provides the common standards, architecture, and development processes required to link Joint training programs.  By leveraging existing training programs or initiating specific actions, JNTC is developing credible opposing force capabilities and expanded access to assets from other Services and locations which are typically unavailable to the training audience by developing and integrating modeled and simulated representations of these capabilities. This furthers the integration of Joint training objectives into Service training events, while capturing the objective data necessary to provide a complete and accurate after action review.  This program develops and enhances current and future Joint training enterprise capabilities.\n\nJSS:  This effort provides warfighters with Joint Simulations and Tools that enhance and enable Joint training across Services, COCOMs, Agencies and Coalition partners.  These Joint Simulations and Tools are part of an overall Joint Live, Virtual, and Constructive (JLVC) baseline of training capabilities resident in the Joint Force Trainer Toolkit (JFTT).  The JFTT is a set of training enablers, and “certified systems” that are interoperable and acceptable for usage within the Joint training environment.  The Joint Simulations and Tools provided by JSS are critical enablers that support the delivery of trained, capable, and interoperable Joint Forces.  \n\nJKDDC:  Develop a Joint Individual Training Toolkit of web-enabled individual and small group training products and services.  Products and services are developed in response to JKDDC Joint Knowledge Online (JKO) Stakeholder (COCOMs, Services, and Combat Support Agencies) prioritized training requirements.  JKDDC JKO supports a career-long joint learning continuum, joint professional military education and tailored common training standards to Service members for tasks that are jointly executed, resulting in trained, capable, and interoperable joint forces.  JKDDC JKO technology initiatives principally include Virtual Cultural Awareness Training (VCAT) web-based gaming, Small Group Scenario Trainer (SGST), and mobile courseware training devices.  These capabilities facilitate the training and preparation of tens of thousands of military and civilian personnel deploying to COCOM theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. Specifically, VCAT supports one of the top  identified training shortcomings of returning warriors from United States Central Command (USCENTCOM) based C\/JTFs (cultural awareness training). C\/JTF ‘battle staffs’ will be adequately trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise. JKO mobile courseware training device development facilitates the global distribution of web-based joint training content on portable, hand-held platforms for joint warriors.  The future learning environment will provide training and learning to promote adaptability and agility in the workforce with the capability to tailor and adapt instructional material to fit the learner's strengths and weaknesses, learning style, and level of proficiency.\n      \nUSFK:  This program will develop a Jointly Accredited and Supported Modeling & Simulation federation of constructive simulations capable of satisfying all joint exercise training requirements in the Korean Theater of Operations.  This simulation system is also interoperable with the Republic of Korea developed Korean Simulation System.  This solution will be capable of interoperating in a common battle space that realistically represents the operating environment to all levels of training audiences, tactical to strategic, in Korean theater exercises.  While supporting USFK’s specific requirements, this solution will contain enhancements that will benefit all users of the JLVC.\n\nImmersive Trainer:  This program supports a broader national effort to advance and integrate emerging technologies to increase the effectiveness of training in dismounted, small-unit operations in the contemporary operating environment.  Today’s dismounted forces when placed in a complex, culturally rich  environment require a training capability that challenges their mental agility as they are required to rapidly adapt in a dynamic environment which ranges from  conventional battles to irregular warfare (IW).  In close coordination with the Services, the Immersive Trainer imitative will create a realistic virtual environment to train small military units with the required level of complexity while creating sensory overload and decision-making under extreme stress.  Additionally, the Immersive Trainer will capture detailed data during complex scenarios to facilitate in-depth debrief and capture lessons learned for training audiences.  To date, this detailed debrief capability has been limited to operators of high-end platforms like fighter aircraft.  Now the infantry squad will be provided a comparable capability as aircraft crew to conduct mission rehearsals and after action reviews before and after critical missions. This capability for our dismounted general purpose and special operations forces is vital to saving lives and ensuring effective and ethical small unit operations in the future.  The immersive trainer also is a key component in development of small unit leaders by allowing them to train in a realistic environment which can be altered to stress different learning objectives.\n\nAir Force JNTC:  Supports the SECDEF's Transformation in Training\/Joint National Training Capability (JNTC).  Develops capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment.  Using a scientific and phased approach and focusing on modeling air and space capabilities, researches new technologies and methods that provide a crucial technology-based foundation supporting all JNTC operations.\n\nNavy JNTC:  Supports SECDEF Transformation of DoD training and Joint National Training Capability. These funds enable Navy in developing unique maritime capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment. Navy continues to develop and integrated joint training technologies that play a crucial role in its ability to address current and future joint operational training requirements. Navy program activities include conducting research, development, test and evaluation and cross-service architecture certification on all T2 capable systems, developing cross-domain architectures for US and Coalition Forces as well as ensure sister service modeling\/simulation and instrumentation efforts follow a common unified standard."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "92.253"
                },
                "CurrentYear": {
                    "val": "59.958"
                },
                "BudgetYearOne": {
                    "val": "78.677"
                },
                "BudgetYearOneBase": {
                    "val": "78.677"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "47.050"
                },
                "CurrentYear": {
                    "val": "37.255"
                },
                "BudgetYearOne": {
                    "val": "77.475"
                },
                "BudgetYearOneBase": {
                    "val": "77.475"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-45.203"
                },
                "CurrentYear": {
                    "val": "-22.703"
                },
                "BudgetYearOne": {
                    "val": "-1.202"
                },
                "BudgetYearOneBase": {
                    "val": "-1.202"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-21.868"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.196"
                    },
                    "CurrentYear": {
                        "val": "-0.581"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment of Funds to Support  Higher Priorities"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.901"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.901"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "General Program Reductions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-44.007"
                                },
                                "CurrentYear": {
                                    "val": "-0.254"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.210"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.210"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "General Program Increases"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.909"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.909"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "1.  As part of the SECDEFs efficiency cuts, the Joint Irregular Warfare training capability research and development was eliminated.  Research and development for Joint IW training is adequately addressed within the Services budgets.\n\n2.  The Joint Simulation System increased funding provides minimal required enhancements to Joint simulations and tools. This critical enabler enables a relevant training environment for Joint training of Combatant Commands, Joint Task Forces, and Service Functional Components.  \n\n3.  Increased funding for the JNTC is attributed to the rebalancing of priorities and focus of delivering Joint training enterprise enablers that support Joint training across the Services and Combatant Commands.  This increased funding also addresses the ability to create Joint training environments that must respond to emerging threats and emerging warfighter training requirements such as Cyber, Integrated Air and Missile Defense, and Cross Domain Information Sharing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "758"
                    },
                    "ProjectTitle": {
                        "val": "Joint National Training Capability (JNTC)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.921"
                        },
                        "CurrentYear": {
                            "val": "11.559"
                        },
                        "BudgetYearOne": {
                            "val": "24.381"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.381"
                        },
                        "BudgetYearTwo": {
                            "val": "22.711"
                        },
                        "BudgetYearThree": {
                            "val": "25.256"
                        },
                        "BudgetYearFour": {
                            "val": "27.908"
                        },
                        "BudgetYearFive": {
                            "val": "28.767"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DoD directed USJFCOM to establish the JNTC research and development program to develop future training concepts and capabilities.  The mission is to develop a robust Joint training environment that represents the complexities of the operational environment through the seamless integration of Live, Virtual, and Constructive (LVC) elements.  JNTC creates Joint warfighting conditions through a networked collection of interoperable training sites, ranges, and nodes that synthesize personnel, doctrine, and technology to deliver and achieve “Joint Context” for COCOM and Service training requirements.  JNTC provides RDT&E within an LVC distributed test-bed supporting the advancement of training technologies in the context of a Joint integrated battle space.  The test bed operates as a continuous training RDT&E environment, providing the foundation for a distributed and deployable Mission Rehearsal System, integrating live Intelligence, Surveillance and Reconnaissance feeding the Common Operational Picture.  These funds provide critical Joint\/Coalition Service members and interagency partner’s enhanced training to allow requisite enhancements to existing training systems, capabilities, and technologies. These enhancements improve training efficiencies and provide an integrated LVC environment.  This capability precludes the necessity for conducting large-scale live exercises to achieve the SECDEF’s Combatant Commanders Exercise and Engagement Training and Transformation (CE2T2) vision."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "P758 Joint National Training Center (JNTC)"
                                    },
                                    "Description": {
                                        "val": "Initially established in 2003, JNTC continues to develop and integrate Advanced Training Technologies into a seamless Joint training environment.  JNTC establishes the overarching Joint framework and context necessary for COCOMs and Services to achieve a Joint training environment through an integrated network of training sites and nodes.  JNTC provides the common standards, architecture, and development processes required to link Joint training programs.  By leveraging existing training programs or initiating specific actions, JNTC is developing credible opposing force capabilities and expanded access to assets typically unavailable to the training audience by developing and integrating modeled and simulated representations of these capabilities. This furthers the integration of Joint training objectives into Service training events, while capturing the objective data necessary to provide a complete and accurate after action review.  This program develops and enhances current and future Joint training enterprise capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.921"
                                            },
                                            "Text": {
                                                "val": "•  Completed initial and full operational capability of United States portion of Afghanistan Mission Network Training Federation (AMN-TF).  The AMN is the primary coalition, Command, Control, Communications and Computers Intelligence, Surveillance, and Reconnaissance (C5ISR) network in Afghanistan for all ISAF forces and operations. It consists of the ISAF SECRET network as the core with connections to national extensions from numerous country participants.  The U.S. portion of the AMN is called Combined Enterprise Regional Information Exchange System-International Security Assistance Force (CX_I). AMN-TF provides a common network for coalition forces to train in an environment that accurately replicates the operational environment to which they will deploy.\n•  Demonstrated (first use case) extension of the AMN-TF to trusted mission partner, Australia, in preparation for a persistent on-demand connection.  The persistent connectivity will be used to facilitate coalition training and mission rehearsal exercises with Australia prior to deployment.\n•  Initiated Joint Live Virtual Constructive\/Cross Domain Information Sharing  Synchronization (JLVC\/CDS) Project. The JLVC federation is an integrated training capability that generates a realistic simulation of the real world in order to facilitate a live training audience’s accomplishment of joint training objectives.  It provides an integrated and coherent LVC training environment that includes appropriate joint context, and allows global training and mission rehearsal in support of specific joint requirements. Each JLVC software update invalidated the current CDS and delays implementation of enhancements.  This project with provide a certified\/accredited CDS within 30 day of a JLVC release.\n•  Developed a strategy and roadmap for the incorporation of Internet Protocol version 6 into the Joint Trainer Toolkit. \n•  Initiated redesign of Australia, Canada, Great Britain and United States (ACGU) Training Enclave.  ACGU provides a training network, which does not contain a network guard, for trusted mission partners to conduct bi-lateral and multi-lateral training.  Redesign will equally share responsibilities, capabilities and resources among trusted mission partners.\n•  Continued the communication technologies research and develop initiative that will facilitate the distribution of mixed reality training around the globe.  The technologies will facilitate home-station operations vice having to relocate operators to remote locations and will ensure warfighter’s pre-deployment training would mirror real-world operations as closely as possible.\n•  Developed and demonstrated an initial JTEN Expeditionary (JTEN-X) prototype capability using existing commercial and Government off the shelf (GOTS) capabilities for remote areas using cellular technologies.  Project completed and assessed data and bandwidth limitations on existing G3 Cellular technologies that are free of any fixed communication infrastructure. This will facilitate Joint training at home-stations and\/or remote locations.\n•  Researched and engineered migration of current JTEN to JTEN 2.0 capability.  The JTEN 2.0 is essential in order to continue operational capability of a distributed training network as the legacy JTEN technology is sunset by DISA and commercial vendors.  This migration also provides alignment of the JTEN 2.0 within DISA’s Global Information (GIG) and enables future transition of the Joint training environment through a GIG service.\n•  Conducted developmental testing of the JTEN 2.0 within at select distributed nodes across CONUS sites in order to validate design parameters and performance metrics. Leveraged JTEN Test bed infrastructure to produce, test, and evaluate new technologies and methods to implement leading edge training capabilities in the areas of Irregular Warfare, non-lethal\/non-kinetic, Chemical Biological Radiological Nuclear Environments (CBRNEs), and Intel integration into the only all service Live, Virtual, and Constructive federation of service models to support mission rehearsal and joint training to prepare deploying forces for operations at the tactical, operational, and strategic levels of war.\n•  Completed Phase II development, and integration of the Operational Forces (OPFOR) C2 network at Naval Air Station (NAS) Fallon Range Complex which will provide a threat Integrated Air Defense System and enhance training environment realism.  Initiated Phase III development.\n•  Completed software\/hardware capabilities for the display of Link-16 data on the Large Area Training Range displays. \n•  Completed the Battlefield Communications Simulation System (BCSS) increment one capability enhancements requested by the Air Force.\n•  Completed the Multi-Spectral Threat System Remote C2 and durability upgrade development, and full ERP and reactive electronic attack response into existing systems. \n•  Completed the Massachusetts Institute of Technologies (MIT) Lincoln Laboratory “Lariat” Information Operation Traffic Generation tool development enhancements in support of Cyber \/ IO training.\t\n•  Completed Network Electronic Attack Simulator coding development and installation.\n•  Initiated the development of Target Data Fusion Engine\/ Adaptable Range Exercise System for incorporation into the 9C2 OPFOR Network at Pacific Alaska Range Complex (PARC) and NAS Fallon.\n•  Initiated the development and upgrade to the Multiple Integrated Laser Engagement System (MILES) threat weapon system Pk\/Ph data.\n•  Initiated Phase 1 Navy Fury III training system development in support of Joint EW training requirements. \n•  Developed and released block 4 of an enterprise solution to enable near-real time and post event assessment of the Joint Warfighters performance;successfully developed, tested, and integrated version 2.0 of the Joint After Action Review Resource Library (JAAR-RL) into the JLVC constructive federation. \n•  Continued to integrate the Marine Air Ground Task Force Tactical Warfare Simulation into the JLVC federation.\n•  Developed draft Initial Capabilities Document (ICD) to document All Things Missile (ATM) Joint training capability requirements. This ICD is serving as a baseline document to focus Integrated Air and Missile Defense training capability investments across the Combatant Commands and Services. \n•  Maintained the Joint Advanced Training Technologies Laboratory (JATTL), a 28,000 square foot state-of-the-art laboratory that replicates the Joint Training Environment, and is the nucleus that enables JNTC research and development activities.\n•  Analyzed, certified and assessed two training systems for Joint interoperability with and integration into the Joint Training Enterprise thereby reducing future costs and exercise preparation time.\n•  Completed updates of the System Certification Nomination Form and the System Certification Scorecard used as part of the System Certification process to increase efficiency and currency.\n•  Effectively archived all System Certification documents and shut down system certification efforts at direction of the command.\n•  Developed and released JTDS version 2.0 (addition of a weather capability), a rapid scenario generation capability for the Joint training environment to 3 Joint training sites. \n•  Developed 30 simulation terrain databases used for a wide variety of model and simulations in support of joint training events and exercises enabling a usable, standardized, lower cost terrain database. \n•  Developed and documented useful joint standards for integrating Service\/Special Operations Command (SOCOM) virtual simulators into the Joint training environment.\n•  Integrated National level intelligence capabilities into the Joint training environment by integrating the NSA’s JCMS into the JLVC federation.\n•  Developed system interfaces for machine-to-machine information exchanges for on-demand data access by Web Service connections to external DoD systems of record.  \n•  Completed automation for data input, key word search, and report generation functions related to the full life-cycle of the J7 Training Development process.  \n•  Implemented automated web services to query Joint Task data through a Service Oriented Architecture approaches for Joint training information applications and information resources that interface to the external systems, services, or data sources.  This provides real time cross reference to the authoritative Joint Task definitions for planning and training development.\n•  Researched and lab tested the GOTS product entitled, Distributed Training Network Guard.  The product is one of the candidate initiatives that address Cross Domain Information Sharing shortfalls inherent in the Joint training environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.559"
                                            },
                                            "Text": {
                                                "val": "•  Further develop AMN-TF capabilities by taking advantage of technology advances and incorporate lessons learned into development of a Future Mission Network (FMN)-TF, which will provide similar capabilities as AMN-TF to any coalition mission.  \n•  Accomplish second use case for extension of CX-I TF into Australia. \n•  Complete redesign and implementation of ACGU Training Enclave.\n•  Demonstrate proof of concept on Navy requirements for JCW\/Navy\/Air Force Cross Domain Solution Pilot Program, a consolidation of requirements necessary to achieve an enterprise and eliminate artificial boundaries between disperate organizations with similar requirements. Redirect focus to Air Force requirements.\n•  Continue JTEN Test Bed systems certification, product evaluation, JTEN problem replication and troubleshooting, to be conducted off the production JTEN.  This significantly mitigates risk to the operational JTEN, permits simultaneous test & evaluation without impact to JTEN events, and permits fielding capabilities at a much quicker rate than waiting for windows of availability on the production JTEN.\n•  Complete communication technologies research and develop initiative that will facilitate the distribution of mixed reality training around the globe. This would facilitate home-station operations vice having to relocate operators to remote locations.  The technologies would also ensure warfighter’s pre-deployment training would mirror real-world operations as closely as possible.\n•  Continue development of the JAAR-RL to improve stability and usability in order to enhance near-real time and post event assessment of Joint Warfighters performance. Begin development of web-based user interface and JAAR-RL as an enterprise service via cloud computing prototype. \n•  Complete integration of the Marine Air Ground Task Force Tactical Warfare Simulation into the JLVC federation. Begin research and testing of a prototype solution for a web services framework that will enable seamless information exchange between J7 information systems and NCES information services available on the GIG.\n•  Develop an irregular warfare capability that models civilian population and provides cause and effect linkage.\n•  Develop a rapid synthetic civilian environment capability to support service level tactical gaming. \n•  Complete the All Things Missile (ATM) initial capabilities document and establish the initial operational capability by fielding the initial prototype increment of a scalable, dynamic, low cost and overhead technical solution in support of missile mission training from the strategic to tactical level for COCOM and Service stakeholders. \n•  Complete software modification of the NSA’s JCMS system in order to integrate with the JLVC training federation.  This will deliver when completely integrated the full capability of the NSA into the Joint training environment thus providing an enhanced capability to train all Service Signals Intelligence (SIGINT) analysts and allow joint and Service staffs to integrate SIGINT capabilities into training events prior to deployment.\n•  Continue research and development efforts to mitigate or resolve identified Joint training cross-domain information sharing issues and release increment 1 of a cross domain enterprise solution for Joint training environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.381"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.381"
                                            },
                                            "Text": {
                                                "val": "•  Accomplish persistent connectivity of CX-I TF with Australia and explore feasibility of extending CX-I TF to other trusted mission partners. \n•  Establish a proof of concept for development of FMN-TF. \n•  Demonstrate proof of concept on Air Force requirements for JCW\/Navy\/Air Force Cross Domain Solution Pilot Program.\n•  Continue Next Generation JTEN research, integration, and fielding in support of Joint National Training Capability (JNTC) road map and Federal Inter-Agency requirements. \n•  Continue JTEN Test Bed systems certification, product evaluation, JTEN problem replication and troubleshooting, to be conducted off the production JTEN.  This significantly mitigates risk to the operational JTEN, permits simultaneous test & evaluation without impact to JTEN events, and permits fielding capabilities at a much quicker rate than waiting for windows of availability on the production JTEN. \n•  Continue development of the JAAR-RL to add additional data collection and reporting capabilities in order to enhance near-real time and post event assessment of Joint Warfighters performance.  Continue development of the web-based user interface and JAAR-RL as an enterprise service via cloud computing prototype.\n•  JLVC will implement a terrain service prototype that will provide a common environment service for a large number of simulations in the Joint Training Enterprise.\n•  Develop and implement a Service Oriented Architecture (SOA) approach for Joint training information applications by creating interfaces between Joint training web applications and the JCWM Enterprise document management system.  This will provide greater access to information and reference document resources. The focus will be on eliminating redundancy and providing a consistent set of services.\n•  Develop and implement the capability to represent civilian infrastructure networks. This will enable JLVC to provide more realistic Battle Damage Assessment to training audiences."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "46.190"
                                        },
                                        "CurrentYear": {
                                            "val": "38.160"
                                        },
                                        "BudgetYearOne": {
                                            "val": "33.990"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "33.990"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "34.780"
                                        },
                                        "BudgetYearThree": {
                                            "val": "34.590"
                                        },
                                        "BudgetYearFour": {
                                            "val": "35.400"
                                        },
                                        "BudgetYearFive": {
                                            "val": "35.400"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z-"
                                    },
                                    "Title": {
                                        "val": "JNTC Procurement Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.841"
                                        },
                                        "CurrentYear": {
                                            "val": "6.817"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.999"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.998"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.999"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.119"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Deputy Director Joint Staff J7 Joint Coalition Warfare (DD J7 JCW) boards, cells, and working group (BCWG) structure approved in December 2011 reviews all RDT&E equities.  The BCWG structure consists of senior technical, operational, and program manager representatives within the Joint Force Trainer Community.  Responsibilities encompass merging and prioritizing technical training requirements, apportioning work to the RDT&E elements based on an assessment of where the work is best accomplished and evaluating the efficacy of development efforts based on performance metrics.  This process will ensure the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "759"
                    },
                    "ProjectTitle": {
                        "val": "Joint Innovative Training Methods & Tools (JITMT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.994"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Force Trainer supports development capabilities in Joint simulations to eliminate training gaps identified by the Combatant Commanders (COCOMs) and in accordance with Secretary of Defense’s Training and Transformation objectives.  In accordance with DJ7 90 day plan, dated 17 Oct 11, DD J7 JCW leads the development of constructive simulations to support joint exercises that stress operating in the environment of the next 8-10 years including hybrid threats, ballistic and cruise missile threats, anti-access\/area denial, and degraded networks due to cyber threats.  The DD J7 JCW BCWG structure reviews the effectiveness of the tools and the providers.  Management of the toolkit, which is a set of capabilities, and system certified technologies that are interoperable and acceptable for usage within the Joint training environment and supports; Joint Exercises, Doctrine, Lessons Learned, Distributed Learning, and Modeling & Simulation (M&S). There will be a government-led Consortium with industry and academia that ensures the tools in the toolkit comply with the requirements of the common architecture.  A number of emerging technologies from Industry, Government and Academic sources that offer the greatest potential to reengineer Joint training are considered for training use.  These technologies include Light Simulations, Light Federations, Story-Driven Training, Massively-Multi-player Games, Training Objective Driven Simulation, Embedded Training, and Joint Community Unique Simulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "P759 Joint Innovative Training Methods & Tools (JITMT)"
                                    },
                                    "Description": {
                                        "val": "The JITMT effort focused on comparing current training capabilities with training requirements in order to identify gaps in our current Joint training capability, to identify alternatives for resolution and to assess the cost and effectiveness of these alternatives. Specifically, the JITMT focuses on: (1) developing and integrating enhancements to the existing and programmed constructive simulations, (2) pursuing selected alternative training methodologies, (3) developing an innovative acquisition prototype, (4) developing solutions to implement recommendations from the Joint Staff’s comprehensive study to re-engineer Joint training and (5) developing a clear management and oversight structure to meet future Joint training requirements.  These efforts provide solutions to the 35 gaps and seams in Joint and Service training requirements identified by the COCOM’s in the SECDEF 2004 JITMT study.  These efforts increase warfighter Joint training capabilities with improved constructive simulations and streamlined acquisition processes, leveraging industry training methodologies and technologies to provide on-demand Joint training tailorable to COCOM requirements for Joint Task Force headquarters staffs and individuals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.994"
                                            },
                                            "Text": {
                                                "val": "•  Enhanced emerging technologies such as immersive virtual technologies, story driven training and massive-multiplayer online game technology by developing two new prototypes for Joint community unique simulations in support of JITMT gaps.\n•  Implemented DSCA Front End Analysis recommendations.\n•  Developed and Refined DSCA courseware proof of concept.\n•  Investigated and Identified other National Planning scenario candidates for inclusion in the JLVC and DSCA Small Team Immersive Training Capability (STITC).\n•  Designed the multi-architecture framework proof of concept exercise planning and execution.\n•  Developed LVC Architecture Framework (LVCAF) repository proof of concept. \n•  Performed Front End Analysis (FEA) for Joint Theater Level Simulation (JTLS). \n•  Developed innovative acquisition package for restructure of JTLS.\n•  Enhanced existing web-based, immersive technologies simulations to enable advanced problem solving, enhanced decision-making, and leadership skills for the Joint, Interagency, Intergovernmental and multi-national players deployed in Global War on Terrorism.\n•  Commenced implementation of an over-arching M&S vision strategy (gaming, immersive, etc.) that is Joint training focused, yet coordinated with Service training capability requirements and RDT&E plans to identify future innovative prototypes and acquisition strategies (long term Measures of Effectiveness).\n•  Researched and developed a Service Orientated Architecture (SOA) construct for Joint training federation, and implement a live, virtual, and constructive capability to support COCOM and North Atlantic Treaty Organization (NATO) events. \n•  Developed Net-Centric Data Strategy (NCDS) for terrain, order of battle, weather, targeting, and infrastructure that provide faster and higher-fidelity mission rehearsals through improved interoperability.\n•  Analyzed the effectiveness of using Massively Multiplayer Games, Story-Driven Training, and Light Simulations\/Federations for COCOM training requirements.\n•  Enhanced small unit home station training through inoculation of cognitive, visual, audio, thermal, olfactory effects, and chaos of battle in a fully immersive live virtual constructive environment"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "PROC-Joint Innovative Training Methods & Tools (JITMT)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.110"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "761"
                    },
                    "ProjectTitle": {
                        "val": "Joint Simulations Systems (JSS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.208"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.017"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.017"
                        },
                        "BudgetYearTwo": {
                            "val": "3.119"
                        },
                        "BudgetYearThree": {
                            "val": "3.243"
                        },
                        "BudgetYearFour": {
                            "val": "3.395"
                        },
                        "BudgetYearFive": {
                            "val": "3.395"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program supports the development of capabilities in Joint simulations to eliminate COCOM identified training gaps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "P761\tJoint Simulation System (JSS)"
                                    },
                                    "Description": {
                                        "val": "This effort provides warfighters with Joint Simulations and Tools that enhance and enable Joint training across Services, COCOMs, Agencies and Coalition partners.  These Joint Simulations and Tools are part of an overall Joint Live, Virtual, and Constructive (JLVC) baseline of training capabilities resident in the Joint Force Trainer Toolkit (JFTT).  The JFTT is a set of training enablers, and “certified systems” that are interoperable and acceptable for usage within the Joint training environment.  The Joint Simulations and Tools provided by JSS are critical enablers that support the delivery of trained, capable, and interoperable Joint Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.208"
                                            },
                                            "Text": {
                                                "val": "•  Documented existing standards and protocols needed to enable greater virtual trainer integration into the JLVC. \n•  Provided an initial Integrated Air and Missile Defense M&S capability for training audiences from the Strategic to Service component level within the JLVC.\n•  Identified and document technical requirements for an initial M&S Space training capability. \n•  Enhanced and integrated Marine Corps air and amphibious capabilities through the integration Marine Air Ground Task Force Tactical Warfare System within the JLVC.\n•  Provided an initial low cost\/low overhead M&S training capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.017"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.017"
                                            },
                                            "Text": {
                                                "val": "•  Develop integrating Service Oriented Architecture (SOA) architecture using High Level Architecture (HLA) 1516-2010, to support JLVC federation evolution to next generation of M&S and joint training support.\n•  Develop one M&S Joint training environment made up of multiple simulation capabilities to support the Joint Training Enterprise (includes coalition and interagency partners).\n•  Provide a multi-resolution\/multi-echelon M&S capability for training audiences from the Strategic to tactical level within an LVC environment. \n•  Develop enhancements to constructive simulation models to support integration with virtual simulators and live and instrumented ranges.\n•  Develop enhancements in JLVC to address hybrid warfare, area denial and ballistic missile defense capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JSS O&M Funding"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "1.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Joint Staff J-7 Joint and Coalition Warfighting boards, cells, and working group (BCWG) structure approved in December 2011 reviews all RDT&E equities.  The BCWG structure consists of senior technical, operational, and program manager representatives within the Joint Force Trainer Community.  Responsibilities encompass merging and prioritizing technical training requirements, apportioning work to the RDT&E elements based on an assessment of where the work is best accomplished and evaluating the efficacy of development efforts based on performance metrics.  This process will ensure the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nShort Term MOEs:\n•  Provide the JLVC Federation version 6.0 by 30 September 2012 to enable Services, COCOMS, Agencies and Coalition partners to deploy trained, capable, and interoperable joint forces. \n•  JLVC version 6.0 is delivered on time with less than ten priority one and two problem trouble reports.  \n•  JLVC version 6.0 has an exercise availability rating of 95%.\n\nLong Term MOEs:\n•  Reduce future joint exercise technical support and model operator cost by 15% as measured against the Event Definition Brief cost figures that will be given at the March 2012 World-Wide Joint Scheduling and Training Conference."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "764"
                    },
                    "ProjectTitle": {
                        "val": "Irregular Warfare (IW)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.522"
                        },
                        "CurrentYear": {
                            "val": "11.263"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This research and development effort closes training gaps at the tactical and operational level and ensures our General Purpose Forces (GPF) receive immersive, pre-deployment training equal to that provided to Special Operations Forces (SOF).  JNTC IW researches, develops and integrates human terrain\/cueing\/profiling training, enhanced and distributed interagency team training, cultural awareness training, mixed reality training, and distributed training technologies that enhance IW training for GPF.  As part of a national effort, IW will integrate and leverage Joint, Service, Interagency and academic initiatives for improving ground combat performance of small unit individuals, leaders and teams in the operating environment-focusing on the hybrid threat-to avoid duplication of efforts to achieve integration and synergy.  JNTC IW integrates human, cultural and social science subject matter experts, establishing laboratory and training facilities with access to urban live fire, and maneuver training facilities and civilian population centers.  Develops rapid reach back and reach forward mechanisms to convert current operational practices into training practices, and by providing state of the art simulations on par with aviation and maritime simulation and training capabilities. While highlighted by the need to adapt simulation now to IW demands, the value of enhanced infantry small unit immersive simulation will contribute to small unit proficiency and survival across the range of military operations, from irregular to conventional."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "P764 Irregular Warfare"
                                    },
                                    "Description": {
                                        "val": "This research and development effort closes training gaps at the tactical and operational level and ensures our General Purpose Forces (GPF) receive immersive, pre-deployment training equal to that provided to Special Forces.  This effort researches, develops and integrates human terrain\/cueing\/profiling training, enhanced and distributed interagency team training, cultural awareness training, mixed reality training, and distributed training technologies that enhance IW training for GPF.  As part of a national effort, IW will integrate and leverage Joint, Service, Interagency and academic initiatives for improving ground combat performance of small unit individuals, leaders and teams in the operating environment-focusing on the hybrid threat-to avoid duplication of efforts can achieve integration and synergy.   JNTC IW integrates human, cultural and social science subject matter experts, establishing laboratory and training facilities with access to urban live fire, and maneuver training facilities and civilian population centers.  Develop rapid reach back and reach forward mechanisms to convert current operational practices into training practices, and by providing state of the art simulations on par with aviation and maritime simulation and training capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.522"
                                            },
                                            "Text": {
                                                "val": "•  Conducted feasibility and risk analysis study to assess the best practices and mitigate risks in building a mobile van that provides the capability to enable JLVC models and simulators to be forwarded  to conduct JTAC\/CAS training linking Live traffic, ROIP, VOIP, live, radios, Tactical JTEN, JREAP, SATCOM in a JLVC IW environment.\n•  Integrated Coalition initiatives and investments in IW Simulation and Immersive training capabilities.\t\n•  Developed close combat infantry immersive training capabilities that fully replicate the effects and conditions of the operational environment; developed a state of the art close combat environment to enable enhanced decision making, increased military effectiveness, reduce friendly and non-combatant casualties, increase lethality, contribute to combat team proficiency, increase survival and success rates, and improve small unit performance in current and future complex threat environments.\n•  Continued initial development of an Immersive Virtual Mission Rehearsal training capability for SOFs which will prepare them for real-world rehearsal activities; expands on the software and hardware integration engine that allows multiple inputs into a near-real time gaming systems for mission rehearsal practice.  \n•  Established a permanent Virtual Predator simulation at Fort Polk and Nellis Tactical Training 60 series ranges which provide U.S. and Coalition Joint Terminal Attack Controllers essential and realistic operational and tactical training prior to deploying to an OIF\/OEF AOR."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.263"
                                            },
                                            "Text": {
                                                "val": "•  Conduct research and development for future modeling and simulation approaches for interoperability.\n•  Develop the Joint Conflict and Tactical Simulation (JCATS) and JCATS Joint Low Overhead Driver (JLOD) to integrate human high performance cognition and decision-making best practices into joint training.\n•  Develop consensus from COCOMs, Services and Combat Support Agencies on critical tasks and essential IW training requirements to build an IW training M&S support strategy.\n•  Continue analysis on the identification of IW training gaps, adaptation to emerging requirements and incorporation into Service training and pre-mission rehearsal exercises.  \n•  Implement Service Oriented Architecture (SOA) in JLVC and joint simulations federations directed at closing the 35 gaps and seams identified by the Joint Training Analysis of Alternatives (TCAoA) and prioritized by the Training Gaps Analysis Forum (TGAF) chaired by JCW. Develop prototype M&S net-centric capability to train adaptive training.\n•  Continue research into IW areas in order to develop artificial intelligence and simulation models for live units to train with reactive virtual OPFOR and neutral civilian personnel through state-of-the-art software technologies such as virtual battle space 2 (VBS2) worlds and other gaming technologies.\n•  Continue gathering, defining, and validating Modeling and Simulation functionality requirements pertaining to IW and the associated overall technical Management of Systems engineering and development efforts. \n•  Continue management of Joint Modeling and Simulation Development Programs. Tracking and managing of software delivery schedules and contracts. Fully integrate proven\/certified training initiatives and capabilities into Service and Joint Training programs of record."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "IW O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.678"
                                        },
                                        "CurrentYear": {
                                            "val": "5.202"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.956"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.956"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.230"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.282"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.019"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.019"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Joint Staff J-7 Joint and Coalition Warfighting boards, cells, and working group (BCWG) structure approved in December 2011 reviews all RDT&E equities.  The BCWG structure consists of senior technical, operational, and program manager representatives within the Joint Force Trainer Community.  Responsibilities encompass merging and prioritizing technical training requirements, apportioning work to the RDT&E elements based on an assessment of where the work is best accomplished and evaluating the efficacy of development efforts based on performance metrics.  This process will ensure the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nShort Term MOE:\n•  Provide a 10% increase in capacity for the number of Soldiers, Sailors, Airmen, and Marines able to be trained in the IW operating environment. \n•  Increase the cognitive and temporal ratings of IW training environments by 10%, thereby increasing realism and reducing the number of close combat casualties sustained by US forces by ensuring that a Soldier, Sailor, Airmen, or Marine's next combat experience is no worse than his last training experience.\n•  Combine IW with JLVC federation forum to correctly model (provide realism) to the human dimension, immersive training and joint capabilities at the small unit level through M&S. \n•  Contribute to DOD-wide immersive training related initiatives.\n\nLong Term MOEs:\n•  Provide a robust and efficient capability to conduct IW Joint Force training that address 90% of the required training objectives and a capacity to support all units that are preparing to deploy into harm’s way.\n•  Provide a combined Joint roadmap of an immersive IW training environment and M&S supported training environment that allows the Services to reduce duplicated efforts and enables them to discern logical touch points and leverage each other's work.\n•  Complete identification of authorities and roles and responsibilities for multi-national consortium that results in sharing of immersive training capabilities."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "769"
                    },
                    "ProjectTitle": {
                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.194"
                        },
                        "CurrentYear": {
                            "val": "1.207"
                        },
                        "BudgetYearOne": {
                            "val": "4.656"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.656"
                        },
                        "BudgetYearTwo": {
                            "val": "5.292"
                        },
                        "BudgetYearThree": {
                            "val": "4.901"
                        },
                        "BudgetYearFour": {
                            "val": "5.378"
                        },
                        "BudgetYearFive": {
                            "val": "5.378"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department’s requirement is to develop a Joint Individual Training Toolkit of web-enabled individual and small group training products and services.  Products and services are developed in response to JKDDC Joint Knowledge Online (JKO) Stakeholder (COCOMs, Services, and Combat Support Agencies) prioritized training requirements.  JKDDC JKO supports a career-long joint learning continuum, joint professional military education and tailored common training standards to Service members for tasks that are jointly executed, resulting in trained, capable, and interoperable joint forces.  This initiative supports advanced technology development and enhancement for the Joint Advanced Distributive Learning enabled training community.  JKDDC JKO advanced technology initiatives primarily include Virtual Cultural Awareness Training (VCAT) web-based gaming, the Small Group Scenario Trainer (SGST), and mobile courseware training devices.  These capabilities facilitate the training and preparation of tens of thousands of military and civilian personnel deploying to COCOM theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. Specifically, VCAT supports one of the top identified training shortcomings of returning warriors from United States Central Command (USCENTCOM) based C\/JTFs (i.e. cultural awareness training). C\/JTF ‘battle staffs’ are becoming more adequately trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise. JKO mobile courseware training device development facilitates the global distribution of web-based joint training content on portable, hand-held platforms for joint warriors. All of these web-based training products mitigate training deficiencies in critical joint ‘go to war’ tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "P769 Joint Knowledge Development & Distribution Capability (JKDDC)"
                                    },
                                    "Description": {
                                        "val": "This requirement is to develop a Joint Individual Training Toolkit of web-enabled individual and small group training products and services.  Products and services are developed in response to JKDDC Joint Knowledge Online (JKO) Stakeholder (COCOMs, Services, and Combat Support Agencies) prioritized training requirements.  JKDDC JKO supports a career-long joint learning continuum, joint professional military education and tailored common training standards to Service members for tasks that are jointly executed, resulting in trained, capable, and interoperable joint forces.  This initiative supports advanced technology development and enhancement for the Joint Advanced Distributive Learning enabled training community.  JKDDC JKO advanced technology initiatives primarily include Virtual Cultural Awareness Training (VCAT) web-based gaming, the Small Group Scenario Trainer (SGST), and mobile courseware training devices.  These capabilities facilitate the training and preparation of tens of thousands of military and civilian personnel deploying to COCOM theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. Specifically, VCAT supports one of the top identified training shortcomings of returning warriors from United States Central Command (USCENTCOM) based C\/JTFs (i.e. cultural awareness training). C\/JTF ‘battle staffs’ are becoming more adequately trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise. JKO mobile courseware training device development facilitates the global distribution of web-based joint training content on portable, hand-held platforms for joint warriors. All of these web-based training products mitigate training deficiencies in critical joint ‘go to war’ tasks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.194"
                                            },
                                            "Text": {
                                                "val": "•  Developed Virtual Culture Awareness Trainer (VCAT) South America web-based training game.  This SOUTHCOM AOR required cultural awareness training product focuses on 5 dominant SOUTHCOM mission scenarios, in 10 different countries, integrates Defense Language Institute (DLI) approved language training content, while simultaneously demonstrating an improved capability to deliver training via an innovative training technique.  The training readiness and operational proficiency of tactical units from all Services deploying to SOUTHCOM’s AOR improved via this JKO provided training product.\n•  Developed Small Group Scenario Trainer (SGST) version 2, a small group training capability focused on improving the training readiness of individuals and small joint headquarters staffs.  Version 1 prototype was developed with JFCOM Training Capability Analysis of Alternatives RDT&E funding.  Version 2 enhances joint warrior provided recommendations from version 1, and targeted development of six additional SGST scenario usecases for representative JTF staffs, all designed to complement existing COCOM mission rehearsal exercises in preparation for deployment to COCOM theaters of operation.  Thousands of joint, interagency, intergovernmental and multinational participants are better trained as individuals and collectively as small teams prior to and during deployment in COCOM environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.207"
                                            },
                                            "Text": {
                                                "val": "•  Develop Virtual Culture Awareness Trainer (VCAT) South America Phase II web-based training game.  Based on the FY11 success with VCAT South America training utility in the SOUTCHCOM AOR, SOUTHCOM requires an enhanced training product focusing on 5 expanded mission scenarios, in the Andean Ridge geographic region, integrating Defense Language Institute (DLI) approved language training content, while simultaneously demonstrating an improved capability to deliver training via an innovative training technique on JKO.\n•  Operationalize JKO training simulation by developing SGST version 3, a small group training capability focused on improving the training readiness of individuals and small joint headquarters staffs.  Version 2 enhanced joint warrior provided recommendations from version 1, and targeted development of six additional SGST scenario use cases for representative JTF staffs, all designed to complement existing Combatant Command mission rehearsal exercises in preparation for deployment to their respective theaters of operation.  Version 3 will increase training audience participant size to 40 concurrent players (vice current 8-10).  Additionally, users will be able to create their training scenarios more efficiently with minimal resources.  Thousands of joint, interagency, intergovernmental and multinational participants will be better trained as individuals and collectively as small teams prior to and during deployment in COCOM environments.\n•  Develop select mobile training device capabilities based on JKO ‘high payoff’ courseware. Targeted courses include (but not limited to) Cross Culture Competency Trainer, Virtual Cultural Awareness Trainer + Language Afghanistan, US Army’s Headstart2 Language Training, US Forces Korea Theater Specific Training, US SOUTHCOM’s Human Rights Awareness, & Survival, Escape, Resistance, and Evasion training products.  These joint training courses will be playable from the JKO web-based desktop and from iOS, Android and BlackBerry operating systems based portable, hand-help devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.656"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.656"
                                            },
                                            "Text": {
                                                "val": "•  Craft and implement a comprehensive plan to develop mobile training device capabilities focused on JKO’s entire Joint Individual Training Toolkit.  Plan components include existing JKO courseware conversion to portable, hand-held devices; emerging training courseware requirements interoperable with portable, hand-held devices; and the leveraging of other DoD agencies, Interagency, and Multinational training courseware ported to mobile training devices.  \n•  Introduce SGST version 4, developed to continue achieving joint warrior directed training requirements and improve training readiness of individuals and small joint headquarters staffs.  Version 4 will enhance joint warrior provided recommendations from versions 1 through 3, and target development of four additional SGST scenario use cases for representative JTF staffs, all designed to complement existing Combatant Command mission rehearsal exercises in preparation for deployment to their respective theaters of operation.  Thousands of joint, interagency, intergovernmental and multinational participants will be better trained as individuals and collectively as small teams prior to and during deployment in COCOM environments.   \n•  Develop emerging Virtual Culture Awareness Trainer (VCAT) web-based game training requirements. Products will take advantage of joint warrior provided recommendations from  the five existent VCAT games, expand the number of training audience AOR environments (as prioritized by DoD senior leaders), integrate DLI approved language training content, while simultaneously demonstrating an improved capability to deliver training via an innovative training technique.\n•  Develop a future learning ecosystem that will provide training and learning environments (software agents) with the capability to tailor and adapt instructional material to fit the individual's cognitive strengths and weaknesses, learning style, level of proficiency, and the learner's present state of being and understanding across a broad range of content."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JKDDC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.695"
                                        },
                                        "CurrentYear": {
                                            "val": "3.650"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.160"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.160"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.210"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.370"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.510"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.510"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z-"
                                    },
                                    "Title": {
                                        "val": "JKDDC Procurement Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.279"
                                        },
                                        "CurrentYear": {
                                            "val": "0.284"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Staff prescribed performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nThe JCW Performance  Management Working Group is the directed forum where the outcomes of performance relative to our external customers, stakeholders, and strategic stewardship of resources are the focus of discussion.  Performance against the targets will be assessed and reported frequently, briefed periodically to the JCW leadership, and rolled up into the JCW Joint Training End-of-Fiscal Year Performance Report to ensure transparency and accountability.\n\nShort Term MOEs:\n•  Augment the ability to provide cultural context training for COCOM’s Joint Mission Essential Task functional areas by one geographic area of responsibility, and two mission areas per year.\n•  Provide small group training focused on Joint Exercise Life Cycle specified mission areas for pre-requisite in exercise augmentation, or post exercise remediation training for three exercise response cells per year.\n•  Add context sensitive remediation to five existing Joint Distributed Learning courses per year.\n\nLong Term MOEs:\n•  Provide a systematic, steady-state process for integrating cultural context, small group training, and intelligent remediation requirements into the Joint Training System Phase I of the initiative, resulting in improved training and readiness for the warfighter.\n•  Provide cost model for evaluating level of effort, additional conditions and standards for cultural context, small group training, and intelligent remediation to Joint Mission Essential Task training solutions for the Joint Training System Phase II, resulting in improved readiness, while providing improved training to the warfighter, will be in place by year five of the initiative."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "770"
                    },
                    "ProjectTitle": {
                        "val": "U.S. Forces Korea Training and Exercise Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.211"
                        },
                        "CurrentYear": {
                            "val": "7.339"
                        },
                        "BudgetYearOne": {
                            "val": "6.497"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.497"
                        },
                        "BudgetYearTwo": {
                            "val": "6.451"
                        },
                        "BudgetYearThree": {
                            "val": "4.483"
                        },
                        "BudgetYearFour": {
                            "val": "1.378"
                        },
                        "BudgetYearFive": {
                            "val": "1.378"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "USFK’s current federation of models, including the overarching Joint Training Transformation Initiative Korea is used only at USFK, does not meet Coalition interoperability requirements, and cannot fully utilize the Joint Live Virtual Constructive (JLVC) Federation’s capabilities.  Joint Staff J-7, in collaboration with USFK and appropriate Republic of Korea agencies, integrate Warfighters’ Simulation (WARSIM) into the JLVC Training Federation in order to field a functioning JLVC federation to USFK.  This new training environment will support the extensive ground order of battle required to accurately simulate operations on the Korean Peninsula.  It also maximizes existing JLVC training standards and investments, and fully leverages Service training capabilities and roadmaps.  This solution will provide the initial effort to link coalition training architectures into the JLVC as well.  It will also promotes the Joint Training Environment vision and goals and implement selected pieces of recommendations identified in the LVC report, the Flagship Study."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "USFK Training & Exercise"
                                    },
                                    "Description": {
                                        "val": "This program will develop a Modeling & Simulation solution that is a jointly accredited, supported, and funded federation of constructive simulations capable of satisfying all joint exercise training requirements in the Korean Theater of Operations and that is interoperable with the Republic of Korea developed Korean Simulation System.  This solution will be capable of interoperating in a common battlespace that realistically represents the operating environment to all levels of training audiences, tactical to strategic, in Korean theater exercises.  While supporting USFK’s specific requirements, this solution will contain enhancements that will benefit all users of the JLVC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.211"
                                            },
                                            "Text": {
                                                "val": "•  Initial design, development, integration, test, document and integration of the Joint Deployment Logistics Model (JDLM) into the Joint Live Virtual Constructive (JLVC) Federation.\n•  Initial collection and assessment of data related to changes in current JLVC operations, processes, and procedures to provide systems engineering approaches to improve USFK-JLVC capabilities.  \n•  Initial Joint Terrain Data Services data enhancement to support US Army Warfare Simulation (WARSIM, US Army Warfare Intelligence Model (WARSIM-WIM), and to provide rapid scenario generation.\n•  Initial technical and engineering Joint Semi Automated Forces modeling and simulation software design\/BUS enhancements\n•  Initial Joint Theater Level Simulation (JTLS) research and development of Service Oriented Architecture (SOA) and associated web services application programming interface (API) in accordance with HLA 1516-2010 to support a JTLS, Joint Conflict and Tactical Simulation (JCATS) and Virtual Battlespace 2 (VBS2) federation.\n•  Initial research and development of integrated initial Integrated Air and Missile Defense Modeling & Simulation (M&S) training capability within M&S training capability for USFK.\n•  Conducted modeling and simulation research, design and development in support of United States Air Force training requirements.\n•  Exploratory development of a battle simulation training capability by Air Force Modeling and Simulation Agency (AFAMS) and Electronic Systems Command (ESC-USAF) for integration of software prototypes involving data distribution systems and common interfaces into the synthetic environments of simulations.\n•  Research, development, test and evaluation for the Joint Conflict and Tactical Simulation Low Overhead Driver (JCATS-JLOD) program to expand current capabilities and of Joint, Live, Virtual, and Constructive Federation and integration of KORCOM modeling and simulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.339"
                                            },
                                            "Text": {
                                                "val": "•  Initial WARSIM and WIM (test suite) software design, development and testing •Enhanced technical planning to include development of detailed implementation plan.\n•  Research WARSIM Data Initialization requirements.\n•  Developed network evaluation and implementation plan and timeline.\n•  Integrated Navy\/Air Force models with WARSIM as a part of USFK’s M&S training capability.\n•  Provided cross domain information sharing solution between USFK and ROK forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.497"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.497"
                                            },
                                            "Text": {
                                                "val": "•  Research, development, test and evaluation for JCATS-JLOD scalability.\n•  Conduct WARSIM Scalability testing.\n•  Continue development of integrated Air and Missile Defense Modeling & Simulation (M&S) training capability within M&S training capability for USFK (Tier 1-3).\n•  Development of MTWS aggregated composable models."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "U.S. Forces Korea Training & Exercise Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.495"
                                        },
                                        "CurrentYear": {
                                            "val": "0.330"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.303"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.303"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.305"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.295"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.300"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.300"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Joint Staff J-7 Joint and Coalition Warfighting boards, cells, and working group (BCWG) structure approved in December 2011 reviews all RDT&E equities.  The BCWG structure consists of senior technical, operational, and program manager representatives within the Joint Force Trainer Community.  Responsibilities encompass merging and prioritizing technical training requirements, apportioning work to the RDT&E elements based on an assessment of where the work is best accomplished and evaluating the efficacy of development efforts based on performance metrics.  This process will ensure the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nShort Term MOEs:\n•  Develop software for JLVC simulations with initial integration of the Army’s WARSIM Model along with a validated approach for Cross Domain Information Sharing technologies for the joint training enterprise, to provide common ground truth and a realistic warfighter training environment.\n\nLong Term MOEs:\n•  Integrate WARSIM into the JLVC to the level of conducting basic direct and indirect fire integration with other federates.\n•  To provide a training capability for Korean Simulation center to operate within the 5.0\/5.1 upgrade of the JLVC."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "754"
                    },
                    "ProjectTitle": {
                        "val": "Immersive Simulation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "32.900"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.900"
                        },
                        "BudgetYearTwo": {
                            "val": "15.000"
                        },
                        "BudgetYearThree": {
                            "val": "17.415"
                        },
                        "BudgetYearFour": {
                            "val": "17.127"
                        },
                        "BudgetYearFive": {
                            "val": "17.127"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "A state of the art simulated close combat environment will enable enhanced decision-making by squads and platoons, increasing their military effectiveness, reducing friendly and non-combatant casualties and increasing lethality against foes.  It will contribute to combat team proficiency and decision making across the full range of military operations, from irregular to conventional.  This training capability will increase survival and success rates in first and subsequent combat actions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Simulation"
                                    },
                                    "Description": {
                                        "val": "Accelerate fielding of immersive training systems and capabilities inclusive of integrated hardware with virtual enhancements, modular systems and video capture within individual and collective tracking systems.\n\nAccelerate development of autonomous behavior capabilities through development of Opposing Force and Blue Force Behavior, Common SAF in Synthetic Environment, and enhancement of current software (Virtual Battlespace 2).  These expenditures will improve 119 behaviors models, establish 50 new entities, 50 new visual models\/year, 50 BLUEFOR Behaviors, improve Avatar capability and enhance interactions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.900"
                                            },
                                            "Text": {
                                                "val": "•  Highly Detailed Scenarios.  Develop scenario data that is sufficiently detailed to satisfy training requirement.  Develop training scenarios that replicate the contemporary operating environment.  Develop a comprehensive set of IW tasks, conditions and standards to enable training relevant to ethical and tactical decision making. Develop specific scenario requirements that support mission-specific rehearsal, including representation of second and third order effects of ethical and tactical decisions made under conditions simulating combat stress.\n •  Geo-typical Data Repositories. Develop standardized repositories for geo-typical data such as terrain features, vegetation, population appearance, cultural behaviors (i.e., correct form of greeting in a specific location), language and dialect. \n•  External Enablers Representation.  Identify and create processes to leverage a pool of expertise for each external capability to be represented. Develop training standards for controllers representing external enablers. Enhance automated responses for required external enablers. Establish habitual relationships with organizations representing and or providing external enablers at the tactical level, in order to enhance interoperability, maintain currency and ensure validity of the scenario.\n•  Natural Verbal and Non-Verbal Communication.  Develop a broader selection of gestures available through a range of interface devices. Further develop Voice over Internet Protocol (VOIP) technology for use with live, virtual and gaming technologies. Further develop natural gesture recognition capabilities. Further develop natural voice recognition capabilities.\n•  Autonomous Behavior. Develop methodology to characterize and organize entity behaviors. Expand library of scripted behaviors and supporting animations (including individuals, cells and units) to allow limited interactions with trainees. Develop improved game engine and virtual Semi-Automated Forces (SAF) behaviors in order enhance tactical and ethical decision making. Develop a detailed response library for certain conditions and behaviors. Develop virtual human with capability to perceive and understand the environment.\n•  Sensory Stimulation.  Further develop and integrate current olfactory systems for both live and virtual environments. Further develop and integrate current hap tic feedback devices for both live and virtual environments. Further develop and integrate higher resolution display technologies for both live and virtual environments. Further develop and integrate enhanced audio technologies for both live and virtual environments. Integrate all sensory stimulation capabilities in order to maximize overall effectiveness within the training environment. Conduct research into best methods to stimulate the senses in a training environment. Conduct research into the effectiveness and value of sensory stimulation in a training environment.\n•  Interactions. Conduct research to determine optimal level of interaction within the training environment, with respect to the training requirements. Develop tools to eliminate the capability gaps in Sensory Stimulation, Natural Verbal and Non-Verbal Communication Methods, Visual Representation of Terrain, and Visual Representation of Individuals.\n•  Visual Representation of Terrain.  Develop a central repository of correct textures, models and objects. Leverage technology advancements from the commercial gaming industry to improve visualization engines.\n•  Visual Representation of Individuals.  Develop a library of common body 3D frameworks to represent a variety of visual characteristics. Develop and utilize body-mapping technology to enable live role-players to drive avatar movement. Develop and utilize facial mapping technology to enable live role players to provide realistic avatar facial expressions. Develop a library of cut scenes and pre-recorded video segments for common human motions and movements. Develop and maintain a database of highly realistic animations. Leverage commercial gaming technology to allow rapid generation of unique avatars. Leverage technology resident in the entertainment industry to enhance immersive training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Immersive Trainer O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.800"
                                        },
                                        "CurrentYear": {
                                            "val": "16.316"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.744"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.744"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.943"
                                        },
                                        "BudgetYearThree": {
                                            "val": "23.214"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.101"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.101"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The funds allocated for Immersive Simulation are designed to speed delivery of capability for small teams for training.  Use of the funds will be audited against the metric of how quickly improvements for immersive simulation are delivered. These metrics will be evaluated by a panel of flag and general officers on a quarterly basis. Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow\n•  Cost – Enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow\n•  Realism – Enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow\n•  Fidelity – Enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "701"
                    },
                    "ProjectTitle": {
                        "val": "Air Force JNTC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.355"
                        },
                        "BudgetYearOne": {
                            "val": "2.041"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.041"
                        },
                        "BudgetYearTwo": {
                            "val": "2.307"
                        },
                        "BudgetYearThree": {
                            "val": "2.716"
                        },
                        "BudgetYearFour": {
                            "val": "2.794"
                        },
                        "BudgetYearFive": {
                            "val": "2.794"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Supports the SECDEF's Transformation in Training\/Joint National Training Capability (JNTC). Develops capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment. Using a scientific and phased approach and focusing on modeling air and space capabilities, researches new technologies and methods that provide a crucial technology-based foundation supporting all JNTC operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AF JNTC"
                                    },
                                    "Description": {
                                        "val": "Supports the Secretary of Defense (SECDEF) Transformation in Training\/Joint National Training Capability (JNTC). Develops capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment. Using a scientific and phased approach and focusing on modeling air and space capabilities, researches new technologies and methods that provide a crucial technology-based foundation supporting all JNTC operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.355"
                                            },
                                            "Text": {
                                                "val": "Air Warfare Simulation (AWSIM) Upgrades:  Continue development of Air Force Modeling and Simulation Tool Kit (AFMSTT) Scenario and Terrain modules.\nCONTINUE:  Multi-Level Security (MLS):  Enables Virtual and Constructive entities of various classification levels to be accessed by users with different security clearances and needs-to-know, and prevent users from obtaining access to information for which they lack authorization.\nCONTINUE:  Concept of Operations for Space Distributed Mission Operations Center (DMOC):  Continue space effects and Global Positioning System (GPS) jamming integration into JNTC.  Net effect will be a single validated and authoritative Modeling and Simulation data source for the Space Order of Battle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.041"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.041"
                                            },
                                            "Text": {
                                                "val": "USAFE Joint Live Virtual Constructive Training Annex (ULTrA):  Projects Joint Live Virtual Constructive capability to austere locations in Africa and Eastern\/Northern Europe to support Building Partnership and nation building efforts.  ULTrA provides models, simulators, end integration equipment, and a distribution capability in a mobile platform to train Coalition Joint Terminal Attack Controllers (JTACs) and small unit tactics."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Air Force JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.045"
                                        },
                                        "CurrentYear": {
                                            "val": "15.480"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.796"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.796"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.497"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.387"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.359"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.109"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z-"
                                    },
                                    "Title": {
                                        "val": "Air Force JNTC Procurement Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.528"
                                        },
                                        "CurrentYear": {
                                            "val": "0.255"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Joint Coalition Warfare (JCW) Financial Management Board (FMB) and Contract Acquisition Management Board (CAMB) review all Research Development Test and Evaluation (RDT&E) equities.  The JCW FMB\/CAMB consists of senior technical, operational, program manager, and stakeholder representatives within the Joint Force Trainer Community.  The board’s responsibilities encompass merging and prioritizing technical training requirements.  It apportions work to the RDT&E elements based on an assessment of where the work is best accomplished.  The boards evaluate the efficacy of development efforts based on performance metrics and will vote on whether or not to continue the effort.  This process will ensure the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nThe Performance Improvement and Information Management Board is the strategic forum where the outcomes of performance relative to our external customers, stakeholders, and strategic stewardship of resources are the focus of discussion.  Performance against the targets will be assessed and reported monthly, briefed quarterly to the FMB\/CAMB, and rolled up into the JCW Joint Training End-of-Fiscal Year Performance Report to ensure transparency and accountability.\n\nUSAFE ULTrA:  \n•  Feasibility study of six (6) month duration to determine optimum configuration and suggest acquisition strategy.\n•  Contract award within four (4) months of funds receipt.\n•  Engineering design complete (software integration\/hardware integration\/mobile platform developed) within six (6) months of contract award.\n•  Initial Operational Capability (IOC) (system tested and capability validated) within two (2) years of contract award.\n•  Full Operational Capability (FOC) (field use meeting requirements of all accepted missions) eighteen (18) months after IOC."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "772"
                    },
                    "ProjectTitle": {
                        "val": "Navy JNTC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.532"
                        },
                        "BudgetYearOne": {
                            "val": "3.983"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.983"
                        },
                        "BudgetYearTwo": {
                            "val": "4.180"
                        },
                        "BudgetYearThree": {
                            "val": "4.360"
                        },
                        "BudgetYearFour": {
                            "val": "4.673"
                        },
                        "BudgetYearFive": {
                            "val": "4.673"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These funds enable Navy in developing unique maritime capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment. Navy continues to develop and integrate joint training technologies that play a crucial role in its ability to address current and future joint operational training requirements.\n\nNavy JNTC RDT&E program conducts cross-service architecture certification on all T2 capable systems, developing cross-domain architectures for US and Coalition Forces as well as ensure other military service modeling\/simulation and instrumentation efforts follow a common unified standard."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Joint National Training Center"
                                    },
                                    "Description": {
                                        "val": "Supports the Secretary of Defense (SECDEF) Transformation in Training\/Joint National Training Capability (JNTC). Develops unique maritime capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment. Using a scientific and phased approach and focusing on modeling ground, air, space and maritime capabilities, researches new technologies and methods that provide a crucial technology-based foundation supporting all JNTC T2 operations.  \n\nNavy JNTC T2 RDT&E efforts (JSAF M&S Development & JNTC\/JLVC Navy Federation Object Model (FOM) Integration) directly support the Unified Command Plan (UCP) and is aligned with the DOD information Operations (IO) Roadmap."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.532"
                                            },
                                            "Text": {
                                                "val": "•  Navy will further develop capabilities to address ASW improvements, information operations, BLUFOR capability representation including Littoral Combat Ship (LCS), P-8A, Surface Warfare Enterprise Advanced Capability Build (ACB) development and integration and emergent threats. Navy will further address additional Coalition Partner Integration, LCS Shore Based Training Facility (SBTF) integration, Combined Armed Forces (CAF) -Distributed Mission Operations (DMO) integrations and Korean Simulation Battle Center (KSBC) integration.\n•  Navy will further develop capabilities to address Irregular Warfare, Information Operations ASW improvements and respond to emergent threats.  Navy will concentrate on advanced coalition integration technology while keeping pace with coalition partner integration.  Other integration efforts include: DDG 1000, UAS BAMS, ASW, continued KSBC, and Surface Warfare Advanced Capability Build."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.983"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.983"
                                            },
                                            "Text": {
                                                "val": "•  Navy will provide capabilities that support Ballistic Missile Defense (BMD) training - tailored to the Navy's DDG\/CG onboard BMD capability. This effort involves continuous integration of numerous BMD models at the Missile Defense Agency (MDA) as well as the communication links\/data paths that allow us to provide this training to DDG\/CG even while at sea.  Navy will further develop capabilities to address ASW improvements, information operations, BLUFOR capability representation including Littoral Combat Ship (LCS), P-8A, Surface Warfare Enterprise Advanced Capability Build (ACB) development and integration and emergent threats.\n•  Navy will further address additional Coalition Partner Integration, Integrated Undersea Surveillance System (IUSS)\/Surveillance Towed Array Sensor System (SURTASS) integration, Combined Armed Forces (CAF) -Distributed Mission Operations (DMO) integrations, Korean Simulation Battle Center (KSBC) integration, and Cooperative Engagement Capability (CEC).\n•  Navy will make significant improvements to JSAF's representation of a realistic threat environment to address high priority training gaps. These threat environment improvements include a more tactically-realistic electronic signals environment; unmanned intelligence, surveillance and reconnaissance (ISR) platform representation and employment; support and stimuli for US signals collection models, training systems and combat systems; electronic attack (EA) representation; and an improved threat common operational picture representation for two-sided event support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Navy JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.838"
                                        },
                                        "CurrentYear": {
                                            "val": "7.814"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.816"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.816"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.735"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.736"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.352"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.352"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Coalition Warfare (JCW) Financial Management Board (FMB) and Contract Acquisition Management Board (CAMB) review planned Research Development Test and Evaluation (RDT&E) equities. The JWFC FMB\/CAMB consists of senior technical, operational, program manager, and stakeholder representatives within the Joint Force Trainer Community. The board’s responsibilities encompass merging and prioritizing technical training requirements. It apportions work to the RDT&E elements based on an assessment of where the work is best accomplished. The boards evaluate the efficacy of development efforts based on performance metrics and will vote on whether or not to continue the effort.  This process will ensure the Joint Force Trainer capabilities development effort synchronizes with war-fighter requirements.\n\nSpecific performance metrics for FY 2012 include, but are not limited to:\n\n•  Navy will produce one JSAF software release to include documentation; will design and implement upgrades to JSAF consistent with approved requirements and CRs and document the effects of JSAF capabilities (robustness) and stability.  Will design, implement, test, and integrate JSAF enhancements in accordance with requirements.\n\n•  Navy will produce one Navy Training Federation Object Model (FOM) (NTF) release to include applicable documentation updates for the Guidance, Rational, and Interoperability Manual (GRIM) and Federation Agreement document (FAD). Will implement JSAF capability enhancements to support evolving joint and Coalition training requirements.\n\n•  Navy will deliver a JSAF\/JNTC-JLVC FOM interoperability Guide.\n\n•  Navy will facilitate integration by providing dedicated support to the effort, improving the quality of participation and documentation of Navy efforts in the JNTC.  Refine and mature the Navy Training Federation Object Model (NTF), it is improving interoperability and integration with other services and the Joint community.  Provides a standardized FOM for integration across the Navy training simulations.\n\n•  Navy’s current Joint Live-Virtual-Constructive (JLVC) and other federation simulation distribution is accomplished by tying simulation data to multicast groups. This is neither a scalable solution nor is it an effective one as federates are not able to publish and subscribe with fine enough precision. The Simulation Aware Software Router will address this shortcoming, and additionally provide a flexible solution for federating heterogeneous networks and on-the-wire protocols without forcing all federates onto a single, uniform, lowest common denominator solution for each training event.  Ultimately, a simulation aware router will allow simulation users to optimize the network for both simulation scalable traffic and for voice and Command, Control, Communications, (Computers), Intelligence (C4I) traffic."
                        }
                    }
                }
            ]
        }
    }
}