{
    "id": "f687b6ba9ea81532755ca2ea8071bf8027482506",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603663D8Z"
        },
        "ProgramElementTitle": {
            "val": "Data to Decisions Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "40"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "3.888"
            },
            "CurrentYear": {
                "val": "4.117"
            },
            "BudgetYearOne": {
                "val": "13.754"
            },
            "BudgetYearOneBase": {
                "val": "13.754"
            },
            "BudgetYearTwo": {
                "val": "13.797"
            },
            "BudgetYearThree": {
                "val": "18.677"
            },
            "BudgetYearFour": {
                "val": "18.681"
            },
            "BudgetYearFive": {
                "val": "19.021"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Joint Data Management program will be restructured in FY 2012 to evolve into the revised Data to Decisions program that addresses challenges from the Quadrennial Defense Review and Combatant Commanders. This revised program builds on the FY 2010 and FY 2011 accomplishments with increased objectives and technology development goals critical to on-going operations. This Data to Decisions program focuses on information management architecture needs located at the seams between ongoing Service research efforts."
        },
        "ProgramElementMissionDescription": {
            "val": "A critical element in nearly all defense missions is the Decision Support System, which manages the accumulation of important data and provides tools to help commanders and other operational leaders make relevant decisions. These “Data-to-Decision” systems have become increasingly more important as our operations have shifted from large-scale force-on-force engagements to asymmetric conflicts. Terrorists and insurgents are deeply buried within local populations and employ operational concepts that blend in with urban clutter. Subsequently, finding these asymmetric targets has driven an explosion in sensing capabilities and modalities. This exponential growth in sensing volume has so stressed our current technologies that the majority of data now collected is thrown away.  Additionally, because the targets are diffuse and rapidly adapt to countermeasures, there has been a rapid proliferation of decision support systems. At last count, the Research & Engineering Database had over 388 references to Decision Support programs.\n\nThe goal of this program is to develop an Information Open System Architecture (IOSA) that provides a common platform for rapidly developing and integrating new Data-to-Decisions systems. This IOSA will be based on a canonical decision support architecture and support a physical infrastructure for multi-source data management as well as user-driven innovation tools for analytics. The data management infrastructure will provide easy access and management of current and emergent data sources through plug-and-play modules. Data will be contextualized, indexed, conditioned and intelligently stored with approved formats to allow rapid search and retrieval of tactically relevant data sets. The effort will integrate existing analytics tools, and develop applicable new ones where gaps exist. A library of analytic tools will be built and research into end user programming methods will support new innovation models that mimic commercially successful products. The program consists of both applied research and technology development efforts focused on solving challenge problems each year with spiral developments to a prototype system."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.289"
                },
                "CurrentYear": {
                    "val": "9.235"
                },
                "BudgetYearOne": {
                    "val": "14.140"
                },
                "BudgetYearOneBase": {
                    "val": "14.140"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.888"
                },
                "CurrentYear": {
                    "val": "4.117"
                },
                "BudgetYearOne": {
                    "val": "13.754"
                },
                "BudgetYearOneBase": {
                    "val": "13.754"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.401"
                },
                "CurrentYear": {
                    "val": "-5.118"
                },
                "BudgetYearOne": {
                    "val": "-0.386"
                },
                "BudgetYearOneBase": {
                    "val": "-0.386"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.301"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.063"
                    },
                    "CurrentYear": {
                        "val": "-0.090"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.000"
                                },
                                "CurrentYear": {
                                    "val": "-5.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.022"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.014"
                                },
                                "CurrentYear": {
                                    "val": "-0.028"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.386"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.386"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P366"
                    },
                    "ProjectTitle": {
                        "val": "Data to Decisions Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.888"
                        },
                        "CurrentYear": {
                            "val": "4.117"
                        },
                        "BudgetYearOne": {
                            "val": "13.754"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.754"
                        },
                        "BudgetYearTwo": {
                            "val": "13.797"
                        },
                        "BudgetYearThree": {
                            "val": "18.677"
                        },
                        "BudgetYearFour": {
                            "val": "18.681"
                        },
                        "BudgetYearFive": {
                            "val": "19.021"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Data Management (JDM) program will be restructured in FY 2012 to become a more encompassing Data-to-Decision program. This Data-to-Decision program builds on the FY 2010 and FY 2011 accomplishments with objectives and technology developments critical to on-going operations. The JDM program is described below and included two tasks as outlined in the accomplishments\/planned program section.\n\nAs the Department of Defense increases the capability and capacity to generate increasing amounts of data from numerous sensors in the battlespace, the issue of handling very large data sets has become more challenging. This is in part due to Department of Defense response to a changing threat environment where there is an expansion of the types of sensors deployed, new types of information collected, and different features used to classify these new threats. From a technical perspective, data creation speeds have outpaced the speed and ability to transport, store and process the data created. Science and technology (S&T) investigation into new and novel ways to manage and exploit this data is required to more efficiently use sensor assets and effectively use information in a timely fashion.\n\nThis advanced technology demonstration program establishes the demonstration and experimentation environment to conduct independent evaluations of research efforts that have the most potential of minimizing the impact of the increasing amount of information available and required to support military operational decision-making. The intent is to leverage existing research investments within defense S&T and provide proper evaluations and assessments to facilitate technology transition. These objective assessments will be conducted and coordinated across the defense research base and with other parts of government to include Director, National Intelligence and Department of Homeland Security. \n\nThe new Data-to-Decisions program builds on the JDM program by focusing on the development of open-architecture technologies for decision support systems to help reduce future development time and cost of data management, analytics and user interface subsystems. The program will use a spiral development model with four-steps. Each year Operational teams will choose a series of cross-service challenge problems dominated by a specific sensing modality. Representative data for each of those problems will then be collected for testing against that problem. A Development team will design algorithms and data management architectures using high-level languages and self test on controlled data sets to address those challenge problems. Independent assessment will occur with sequestered data sets, but each development tool will also be tested against new sensors not included in the self-testing to determine fragility and applicability. A Transition team will host the developed algorithms as services in a spiraling prototype system that will support rapid prototyping and transition. \n   \nThe Applied Research program concentrates on the Development portion of this collaborative effort, while the Advanced Technology Development program focuses on the infrastructure piece. This piece includes an Operational, Assessment and Transition initiative."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Initiative"
                                    },
                                    "Description": {
                                        "val": "The Operational team is responsible for choosing a set of cross-service challenge problems to form a basis for developing and testing the processing and exploitation algorithms developed by the Development team. The team collects and manages the relevant data sets used in both development and testing. Because this program is designed to specifically encourage non-traditional, highly innovative companies to participate, this team is responsible for determining methods for providing unclassified data sets to the performers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.989"
                                            },
                                            "Text": {
                                                "val": "- Several Counter Insurgency (COIN)-related missions were chosen as challenge problems for the development team. The immediate technology problem common and necessary to all the challenge missions is robust tracking of objects. The focus this year was on developing a set of tools to assess progress on vehicle tracking.\n- Unclassified and Classified existing Wide Area Motion Imagery (WAMI) and Ground Moving Target Indication (GMTI) data sets were gathered and prepared for use by the development team to build advanced trackers. Methods to declassify data sets were investigated for use by the academic members of the consortium. These methods include traffic simulators and detection-derived data sets.\n- The sanitization effort created options for methods to “sanitize” an experimental dataset and reviewed the legal\/security approvals required to make the data public releasable.\n- Hosted two Analysis workshops to focused on challenge problems, data, and metrics to define end to end assessment methodologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.047"
                                            },
                                            "Text": {
                                                "val": "- Develop top-down challenge problem for African theatre relevant to Moving Intelligence (MOVINT), Human Intelligence (HUMINT), and Open Source Intelligence (OSINT). Will drive development and analysis for new theatres that will be of interest to U.S. Africa Command, U.S. Central Command, and U.S. Special Operations Command.\n- Continue generating MOVINT data sources for the Development team.\n- Begin assembling an operational team centered on OSINT. Find representative data sets to capture these problems and generate a set of significant challenge problems for the Development team.\n- Continue to explore technical approaches, including investigating technical and legal challenges, for sanitizing data sets for use by non-U.S. citizens."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.499"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.499"
                                            },
                                            "Text": {
                                                "val": "- Continue generating MOVINT data sources for the Development team.\n- Continue generating challenge problems for the Development team.\n- Expand Challenge Problems to include Logistics Domain."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assessment Initiative"
                                    },
                                    "Description": {
                                        "val": "The Assessment team is responsible for test and evaluation, as well as architectural analysis. The team is the primary vehicle by which algorithm developers test their data on sequestered data sets.  The team provides feedback to the Developers and Operational team and guides future test vectors. This team is also responsible for architectural analysis of the processing and user interface layers. To this end, the team conducts quantitative analysis of algorithm performance requirements, and conducts user interface experiments in human factors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.359"
                                            },
                                            "Text": {
                                                "val": "- Built infrastructure to allow testing of tracking modules as a function of extended operating conditions.\n- Conducted early tests of infrastructure using experimental data.\n- Began joint program to experiment in collaboration models through red-blue experiments and human factor studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.439"
                                            },
                                            "Text": {
                                                "val": "- Continue assessment of MOVINT modules, provide extensive feedback to Operational Team on test results to guide FY 2012 collections.\n- Continue experimenting with user interfaces through red-blue exercises and human factor studies. Develop roadmap for algorithm advances in the user interface layer.\n- Conduct quantitative analysis to develop a processing architecture for text analytics. Work with the Operational team on specific problem sets.\n- Provide data analysis to evaluate tools and applications for temporal\/spatial resolutions and space\/time correlations for cueing, entity tracking, and data layering of disparate data sets into a single picture. This includes independent assessment and evaluation of tools and algorithms.\n- Bottom-Up architecture analysis for error propagation and Top-Down analysis for uncertainty management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.807"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.807"
                                            },
                                            "Text": {
                                                "val": "- Continue assessment of MOVINT modules, provide extensive feedback to Operational Team on test results to guide FY 2013 collections.\n- Develop ground-truth data for text\/imagery analysis relevant to challenge problem.\n- Extend Automated Online Data Repository (AODR) to wider development community by including additional datasets with analytic studies of tools\/applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transition Initiative"
                                    },
                                    "Description": {
                                        "val": "This team is responsible for transitioning the prototype algorithms developed by the Applied Research program into a library of Data-to-Decisions modules. This team is also responsible for building the consortium infrastructure for storage, revision control, development and testing. The final Data-to-Decisions system architecture will be developed by this team using an internal testbed to conduct architectural analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.540"
                                            },
                                            "Text": {
                                                "val": "- Built and deployed a development platform for the Data-to-Decision Development consortium.\n- Populated the system with data and developed a user manual and process for developing test modules.\n- Implemented a version control and security system for consortium members to use in collaborating on track developments.\n- Conducted tests to assess architectural issues related to the cyber-infrastructure portion of this program. \n- Used tests to begin defining a multi-core architecture for the data management layer of Data-to-Decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.631"
                                            },
                                            "Text": {
                                                "val": "- Build multi-core testbed with approximately 100+ nodes on a 10 GB Ethernet backbone that is fully partitionable.\n- Begin initial experiments in scalability of algorithms and modules over large data sets. \n- Develop roadmap for algorithm advancements in data management layer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.448"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.448"
                                            },
                                            "Text": {
                                                "val": "- Continue experiments in scalability of algorithms and modules over large data sets.\n- Continue to develop roadmap for algorithm advancements in data management layer."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 2, PE# 0602663D8Z, P266"
                                    },
                                    "Title": {
                                        "val": "Data-to-Decisions Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "4.128"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.753"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.753"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.796"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.677"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.680"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.021"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}