{
    "id": "f6a7cb8096bb2d3dd68a8c4f055d701c91af49bf",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DTRA_JustificationBook_Defense_Threat_Reduction_Agency_PB_2013.zzz_unzipped_JustificationBook_Defense_Threat_Reduction_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602718BR"
        },
        "ProgramElementTitle": {
            "val": "WMD Defeat Technologies"
        },
        "R1LineItemNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "197.984"
            },
            "CurrentYear": {
                "val": "196.083"
            },
            "BudgetYearOne": {
                "val": "172.352"
            },
            "BudgetYearOneBase": {
                "val": "172.352"
            },
            "BudgetYearTwo": {
                "val": "170.483"
            },
            "BudgetYearThree": {
                "val": "174.084"
            },
            "BudgetYearFour": {
                "val": "177.832"
            },
            "BudgetYearFive": {
                "val": "180.828"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Defense Threat Reduction Agency (DTRA) is to safeguard America and its allies from Weapons of Mass Destruction (WMD) by reducing the present threat and preparing for the future threat.  This mission directly reflects several national and Department of Defense level guidance\/vision documents to include the National Security Strategy, Unified Command Plan, National Strategy to Combat WMD, Counterproliferation Interdiction, National Strategy for Combating Terrorism, National Military Strategy, Global Development of Forces, Global Employment of Forces, National Military Strategy for Combating WMD, National Military Strategic Plan for the War on Terrorism, Joint Strategic Capabilities Plan (including the Nuclear Annex), and Nuclear Posture Review.  To achieve this mission, DTRA has identified principal objectives along with strategies and tasks to ensure the objectives are met.  Three of these objectives are to deter the use of WMD, reduce the present threat, and to prepare for the future threat.  A focused and strong threat reduction technology base is critical to achieving these objectives and is closely tied with the operational support programs that make up its combat support mission.  DTRA has taken the steps to develop this technology base and provide a foundation for transformational activities within the WMD arena.\n  \nProject RA provides systems engineering and analysis support across all other Projects, innovative counterproliferation research, and technical advisory reachback support on WMD effects and consequences.   \n\nProject RE provides research and development support to the U.S. Special Operations Command (USSOCOM) Combating Weapons of Mass Destruction – Terrorism Support Program (SCSP) to forecast plausible terrorist WMD threats for planning and conducting operations to combat WMD terrorism. Follow-on funding for this project can be found in the Proliferation Prevention and Defeat; 0603160BR, budget exhibit.\n\nProject RF develops technologies, systems and procedures to detect, identify, track, tag, locate, monitor and interdict strategic and improvised nuclear and radiological weapons, components, or materials in support of Department of Defense (DoD) requirements for combating terrorism, counterproliferation and nonproliferation, homeland defense, and international initiatives and agreements.  \n\nProject RG develops advanced technologies and weapon concepts and validates their applicability as counter WMD weapon systems.\n\nProject RI provides the capability for DoD nuclear forces and their associated control and support systems and facilities in wartime to avoid, repel, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action.  \n\nProject RL develops nuclear and radiological assessment modeling tools to support military operational planning, weapon effects predictions, and strategic system design decisions.  \n\nProject RM provides (1) full-scale testing of counter WMD weapon effects, sensor performance, and weapon delivery optimization, (2) weapon effects modeling, and (3) the Defense Threat Reduction Agency Experimentation Lab.  \n   \nProject RR provides a unique national test bed capability for simulated WMD facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the DoD, the Services, the Combatant Commanders and other federal agencies to evaluate the implications of WMD, conventional, and other special weapon use against U.S. military or civilian systems and targets. \n\nProject RT provides the Combatant Commands and the Intelligence Community with technologies and processes to find and characterize Weapons of Mass Destruction (WMD) targets located in underground facilities and then, in near-real-time, assess the results of attacks against those targets.  Follow-on funding for this project can be found in the Proliferation Prevention and Defeat; 0603160BR, budget exhibit.  \n\nProject RU provides (1) strategic studies to support DoD, (2) Decision support tools and analysis to support combating WMD research and development investments, and (3) early applied research for technology development."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "212.742"
                },
                "CurrentYear": {
                    "val": "196.954"
                },
                "BudgetYearOne": {
                    "val": "191.786"
                },
                "BudgetYearOneBase": {
                    "val": "191.786"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "197.984"
                },
                "CurrentYear": {
                    "val": "196.083"
                },
                "BudgetYearOne": {
                    "val": "172.352"
                },
                "BudgetYearOneBase": {
                    "val": "172.352"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-14.758"
                },
                "CurrentYear": {
                    "val": "-0.871"
                },
                "BudgetYearOne": {
                    "val": "-19.434"
                },
                "BudgetYearOneBase": {
                    "val": "-19.434"
                }
            },
            "AdjustmentDetails": {
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-10.435"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.685"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.227"
                                },
                                "CurrentYear": {
                                    "val": "-0.871"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.081"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Realignment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.330"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.688"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.688"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Programmatic - Fiscal Guidance Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-23.198"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-23.198"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.076"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.076"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease from the previous President’s Budget submission in FY 2011 is the net effect of the Congressional Rescission, the Federally Funded Research and Development Center (FFRDC) reduction, the Economic Assumption reduction, and a transfer of funding to WMD Defeat Capabilities; 0605000BR for increased investment in the Joint Collaborative Analysis Module of the Integrated Weapons of Mass Destruction Toolset (IWMDT). The decrease from the previous President’s Budget submission in FY 2013 is predominately due to decreased efforts in Advanced Energetics, University Strategic Partnerships, CWMD-T, Innovation, System Engineering, Test and Technology Support, DTRA Wargaming, Environmental Restoration Support and WMD National Test Bed."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RA"
                    },
                    "ProjectTitle": {
                        "val": "Systems Engineering and Innovation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "44.923"
                        },
                        "CurrentYear": {
                            "val": "41.456"
                        },
                        "BudgetYearOne": {
                            "val": "33.396"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.396"
                        },
                        "BudgetYearTwo": {
                            "val": "31.924"
                        },
                        "BudgetYearThree": {
                            "val": "32.454"
                        },
                        "BudgetYearFour": {
                            "val": "32.780"
                        },
                        "BudgetYearFive": {
                            "val": "33.152"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Systems Engineering and Innovation project provides (1) systems engineering and analysis support across all other Projects, (2) innovative counterproliferation research and development, and (3) technical advisory reachback support on Weapons of Mass Destruction (WMD) effects and consequences.   The systems engineering effort provides research and development with requirements, technology, architecture analyses and proof-of-principle capability necessary for making decisions on strategic planning, research and development investments, new initiatives, cooperation, ventures with new customers, and accomplishment of high-level, short notice special projects.  It also conducts the development, validation and fielding of the Arms Control Enterprise System (ACES) as a part of the U.S. commitment under arms control treaties.  The innovative counterproliferation effort conducts research and development to investigate, identify, develop and transition short term, high payoff technologies from Defense Threat Reduction Agency (DTRA), other government agencies, industry, academia and international Science and Technology partners into the respective DTRA and other research and development programs and to end user organizations.  The technical reachback effort provides 24 hours, 7 days per week information and analyses on potential impacts of a WMD event to Warfighters and First Responders in consult with DTRA’s Combating WMD Research and Development subject matter experts.  This project also provides support to international Counter-WMD science and technology cooperation through the DTRA London Office.\n\t\nThe decrease from FY 2012 to FY 2013 is predominantly due to reduced investment in systems engineering collaboration with external partners and customers and the slowing development and fielding of innovative technologies to the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RA: Systems Engineering and Innovation"
                                    },
                                    "Description": {
                                        "val": "Project RA provides the research and development both for systems engineering and analysis support across all other projects and innovative counterproliferation research and technical reachback support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "44.923"
                                            },
                                            "Text": {
                                                "val": "- Finalized operational capability for systems engineering decision support tools.  Provided direct support to DTRA programs and projects for analyzing and determining key performance and key technical parameters to support investment strategies.\n- Continued requirements and gap analyses to enable research and development efforts to meet combating WMD capability gaps.  Supported program and project managers by translating Agency goals and Concept of Operations into actionable products.\n- Completed 21st century nuclear threat assessment resulting in increasing our knowledge of current threats and providing a solid basis for future analysis.\n- Completed the Distributed Decision Support and Analysis architecture and Manufacturing Readiness Level Assessment studies vis-a-vis the DTRA Mission and active projects resulting in the development of refined analytical and systems engineering tools.\n- Completed Nuclear Enterprise architecture analysis resulting in the delivery of the Strategic Stockpile Force Structure Planning Tool.\n- Initiated three new systems-engineering based special projects focusing on the New START Treaty Arms Control Enterprise System, a new research and development portfolio management tool demonstrating radiological and nuclear stand-off detection technologies.\n- Solicited new innovative research projects resulting in ongoing development efforts for needed new technologies and increased end-user capabilities, while leveraging resources from other DoD and USG agencies.\n- Completed reconstructing the current networks to produce the DTRA Integration Technical Experimentation Center (DITEC) as an environment to test and assess new technologies and configuration changes. \n- Developed and integrated secure core infrastructure enhancements that remediate vulnerability issues.\n- Engineered and deployed full virtual infrastructure modeling and anomaly detection capability.\n- Successfully closed the Advanced Systems and Concepts Office (ASCO).\n- Completed proof-of-concept and development efforts in areas of enhanced remote access, collaboration, and virtualization technologies supporting WMD Analysis.\n- Demonstrated feasibility of virtualization of WMD Analysis support systems, some of which were rapidly provisioned to meet capability gaps in support of Operation Tomodachi.\n- Conducted code-based vulnerability assessments on DTRA-developed software.  Findings presented to program office for remediation in future revisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.456"
                                            },
                                            "Text": {
                                                "val": "- Develop next generation WMD Analysis Reachback Tool capabilities.\n-  Solicit at least 5 new innovative research projects focused on Chemical-Biological detection, Countering Weapons of Mass Destruction (CWMD) \/ Improvised Explosive Device and Special Nuclear Materials detection.  \n- Continue requirements and gap analyses to enable research and development efforts to meet combating WMD capability gaps.  Support program and project managers by translating Agency goals and Concept of Operations into actionable products.\n- Complete initial concept demonstrations for Standoff Detection in the Continental United States (CONUS) and Outside the Continental United States (OCONUS) environments to Combat WMD proliferation.\n- Facilitate Joint Concept Development & Experimentation (JCDE) for the CWMD Community of Interest.\n- Investigate and explore developmental technologies, such as Virtual Worlds.\n- Analyze, explore, and identify gaps, and barriers associated with CWMD Warfighter Challenges\n- Support STRATCOM requirements for an integrated strategic stockpile force structure planning tool.\n- Support Office of the Secretary of Defense Capability Assessment and Program Evaluation (OSD CAPE) with standoff nuclear detection analysis and modeling.\n- Perform analysis studies to predict new WMD threats.\n- Stimulate, identify, and execute high-impact projects to address long term resolution of WMD issues.\n- Provide long-range analytical support to the warfighter. \n- Develop and innovate a Nuclear Weapon-Related Materiel (NWRM) module in Defense Integration and Management of Nuclear Data Services with the ability to evolve to keep up with emerging mainstream technologies to consolidate various Department of Defense (DoD) tracking systems into a single worldwide accountability system that provides the ability to account, maintain, report, and track NWRM during peacetime, crisis, and wartime.  \n-  Design and implementation of Mission Domain IT architecture.  Includes migration and integration of current R&D IT capabilities leveraged by DTRA operational and combat support customers into the operational IT infrastructure.\n-  Contract support to design, implement and manage the DTRA Integration, Test and Experimentation Center.\n-  Provide capability to model, simulate and analyze existing DTRA systems, networks, enclaves and communications capabilities and perform regression testing for system changes and upgrades (including Information Assurance patches).\n- Building partner capacity through applied research to improve the security capabilities of our international partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.396"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.396"
                                            },
                                            "Text": {
                                                "val": "- Continue requirements and gap analyses to enable research and development efforts to meet combating WMD capability gaps.  Support program and project managers by translating Agency goals and Concept of Operations into actionable products.\n- Support STRATCOM requirements for an integrated strategic stockpile force structure planning tool.\n- Integrate first person virtual environments into the suite of CWMD Modeling and Simulation capabilities.\n- Facilitate Joint Concept Development & Experimentation (JCDE) for the CWMD Community of Interest.\n- Integrate Joint Semi-Automated Forces (JSAF) mission planning, constructive analysis, and virtual training toolkit into the Integrated Weapons of Mass Destruction (WMD) Toolset (IWMDT).\n- Continue to support OSD-CAPE and OSD-Nuclear Matters office (NM) strategic planning efforts and force analyses.\n- Deploy advanced Countering WMD (CWMD) operational virtual\/live training capabilities for Technical Support Group (TSG) and related DOE activities.\n- Integrate Defense Intelligence Operations Coordination Center\/Defense Intelligence Agency (DIOCC\/DIA) collection planning tools into NIMBLE ELDER mission capabilities.\n- Deploy 1st generation real time radiation modeling capabilities into DTRA Reachback support.\n- Continue to solicit new innovative research projects for developing needed new technologies and increased end-user capabilities (leveraging other DoD and USG resources where possible) focused on Chemical, Biological, Radiological, Nuclear, and High Explosives (CBRNE) detection, CWMD, Improvised Explosive Device detection and defeat, and\/or Special Nuclear Materials detection.\n- Continue development of capability to model secondary and tertiary effects supporting optimal course of action and tactical decisions for WMD operations, including power and communication infrastructures.\n- Organize\/conduct senior Combatant Command (COCOM), Interagency, and International workshops, symposiums, and table top exercises to address key national\/international strategies for reducing\/combating the WMD threat.\n- Refine and enhance WMD lessons learned process with international staff and across the other COCOMs, incorporating lessons learned from partner activities.\n- Develop and update DTRA Support Plan as directed in the Defense Planning and Programming Guidance (DPPG) to further the Combating WMD mission across all theaters while balancing DTRA assets and managing risks as prioritized within the Guidance for Employment of the Force (GEF).\n- Utilize institutionalized linkage with NATO\/SHAPE and USEUCOM in international research and development collaboration to further develop similar international research and development collaboration within the Pacific Region in accordance with the GEF. \n- Continue to conduct strategic analyses and assessments on emerging WMD threats using various strategic research methodologies.  Expand the use of Second Track Dialogues to meet future CWMD challenges.\n- Manage the Threat Reduction Advisory Committee (TRAC).\n- Build a professional network of up-and-coming professionals (post-BS\/BA and pre-PhD) through effective management of the Bio Initiative for the Next Generation.\n- Complete modernization of infrastructure and extend enhanced enterprise services.\n- Complete documentation and architecture development for migrated mission systems.\n- Begin code-based vulnerability scanning and documentation.  Expand capability to perform code analysis earlier in the develop life-cycle as well as interfacing passive code exploitation reporting to the DTRA Computer Network Defense Service Provider (CNDSP)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "28\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.815"
                                        },
                                        "CurrentYear": {
                                            "val": "13.641"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.455"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.455"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.448"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.215"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.771"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.946"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Number of customer requests for data analysis compared to historical level.\nNumber of changes to investments based on systems engineering analyses.\nNumber of exercise and operations supported.\nNumber of Defense Acquisition Workforce Improvement Act certified systems engineers. \nNew capabilities delivered and transitioned to operational capabilities.\nManage the strategic weapons stockpile and Nuclear Weapon-Related Materiel; maintain 100% accountability.\nMission Enclave moves from development to Initial Operational Capability (IOC).\nMission Enclave moves from IOC to Full Operational Capability (FOC) by FY13.\nSegment architectures for the mission enclave and supported mission systems.  \nIntegrate segment architectures into the DTRA Enterprise Architecture.\nDevelopment of network modeling and system-in-the-loop testing capabilities within the DTRA Integration, Test and Experimentation Center (DITEC)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RE"
                    },
                    "ProjectTitle": {
                        "val": "Counter-Terrorism Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.946"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The USSOCOM Combating Weapons of Mass Destruction – Terrorism Support Program (SCSP) supports processes to forecast plausible terrorist WMD threats for planning and conducting operations to combat WMD terrorism.  The SCSP specifically addresses Commander USSOCOM responsibilities under the Chairman, Joint Chiefs of Staff (CJCS) Unified Command Plan (UCP) for integrating and synchronizing Defense-wide operations and activities to prevent terrorists from developing, acquiring, proliferating, or using WMD.\n\nFollow-on funding for this project can be found in the Proliferation Prevention and Defeat; 0603160BR, budget exhibit."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RE: Counter-Terrorism Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RE provides research and development support to the U.S. Special Operations Command (USSOCOM) Combating Weapons of Mass Destruction – Terrorism Support Program (SCSP) to forecast plausible terrorist WMD threats for planning and conducting operations to combat WMD terrorism. Follow-on funding for this project can be found in the Proliferation Prevention and Defeat; 0603160BR, budget exhibit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.946"
                                            },
                                            "Text": {
                                                "val": "- SCSP established an initial capability to provide a dynamic picture of the global WMD-T operating environment.\n- SCSP established an initial advanced IT infrastructure (Phase I) to accommodate data analysis processing and network conductivity.\n- SCSP provided WMD data to COCOMs to support real-time contingency planning."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Number of technologies developed and delivered, and\/or proof of concept, or successful Military Utility Assessments conducted that increase the potential mission success and reduces the number of current gaps in SOF capabilities to counter weapons of mass destruction when conducting Overseas Contingency Operations."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RF"
                    },
                    "ProjectTitle": {
                        "val": "Detection Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.697"
                        },
                        "CurrentYear": {
                            "val": "49.677"
                        },
                        "BudgetYearOne": {
                            "val": "44.998"
                        },
                        "BudgetYearOneBase": {
                            "val": "44.998"
                        },
                        "BudgetYearTwo": {
                            "val": "47.223"
                        },
                        "BudgetYearThree": {
                            "val": "47.722"
                        },
                        "BudgetYearFour": {
                            "val": "48.417"
                        },
                        "BudgetYearFive": {
                            "val": "49.330"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Detection Technology project develops technologies, systems and procedures to detect, identify, track, locate, monitor and interdict strategic and improvised nuclear and radiological weapons, components, or materials in support of Department of Defense requirements for combating terrorism, counterproliferation and nonproliferation, homeland defense, and international initiatives and agreements.  This project researches, develops, demonstrates, and transitions advanced technologies to improve: operational capability to detect and identify nuclear and radiological weapons, and support to the attribution process through development, demonstration, and transition of improved post-detonation National Technical Nuclear Forensics operational capabilities.  Efforts under this project also support international peacekeeping and nonproliferation objectives, on-site and aerial inspections and monitoring, on-site sampling and sample transport, and on-site and off-site analysis to meet forensic, verification, monitoring and confidence-building requirements.\n\nThe Detection Technology project under Weapons of Mass Destruction Proliferation Prevention and Defeat emphasizes the advanced technology development and engineering portion of the overall effort.\n\nThe decrease from FY 2012 to FY 2013 is predominately due to the redirection of the nuclear detection portfolio toward a more holistic nuclear THREAT detection portfolio that integrates both passive and active radiation detection into a comprehensive Intelligence, Surveillance, and Reconnaissance (ISR) solution. This resulted in a decreased investment in advanced detector technology to fund increased investment in nuclear weapons effects in Project RI - Nuclear Survivability and system vulnerability and assessment capabilities in Project RL - Nuclear and Radiological Effects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF: Detection Technology"
                                    },
                                    "Description": {
                                        "val": "Project RF develops technologies, systems and procedures to detect, identify, track, tag, locate, monitor and interdict strategic and improvised nuclear and radiological weapons, components, or materials in support of Department of Defense (DoD) requirements for combating terrorism, counterproliferation and nonproliferation, homeland defense, and international initiatives and agreements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "43.697"
                                            },
                                            "Text": {
                                                "val": "- Continued development of a fieldable standoff active interrogation system for standoff detection and warning of hidden and shielded nuclear material. This standoff active interrogation system will also provide a new reference standard for evaluating progress and capabilities in standoff detection and warning of hidden and shielded nuclear material. \n- Performed field demonstrations of new detector technologies for handheld detectors, distributed sensors, and vehicle mountable detector systems, to improve the ability of fielded forces to detect, locate, and identify nuclear materials in the battle space.  \n- Continued to improve performance of new detector materials, imaging and spectroscopy systems, and signals analysis methods through rigorous field testing.\n- Continued to develop fieldable and improved technical capabilities for post-detonation prompt diagnostics, ground and airborne debris sample collection, sample analysis, modeling to support nuclear device reconstruction, and forensics data to lower uncertainties\/increase confidence in technical nuclear forensics (TNF) conclusions.\n- Combined all research and development projects to improve prompt diagnostics capabilities under projects DISCREET OCULUS and MINIKIN ECHO to demonstrate and field a prototype of an integrated ground sensor capability to augment and enhance current yield estimation and other prompt diagnostic capabilities. Includes continued development of methods to rapidly determine nuclear weapon yields and reaction history post-event.  \n- Began development, validation and transition of seismic\/air blast\/infrasound\/craterology model to improve yield accuracy.\n- Continued execution, technical management and development of yield estimation and airborne\/ground debris sample collection capabilities in support of the FY2010-initiated National Technical Nuclear Forensics (NTNF) Joint Capability Technology Demonstration (JCTD)\n- Investigated the use of muon and proton beams for standoff stimulation of fission in nuclear materials.  Conducted experiments to validate the feasibility of the approach.\n- Investigated alternative methods to detect fissions in nuclear materials from operationally relevant distances.\n- Started development of methods to rapidly determine nuclear weapon yields post-event, by investigating alternative prompt nuclear weapons effects on the environment.\n- Developed improved correlation tools, signature databases, and modeling of device\/production design space to increase confidence, decrease uncertainties and timelines, to better support production of consensus technical nuclear forensics (TNF) results.\n- Continued to mature alternative neutron detection materials and systems as an alternative to the use of helium-3. \n- Investigated potential of a compact superconducting source in active interrogation systems.\n- Investigated the concept of a pulsed millimeter wave system which detects radioactive sources in both passive detection and active interrogation scenarios.\n- Improved a probabilistic code to enhance its modeling capabilities for specific problems.\n- Began efforts to improve accelerator design for improved capabilities with reduced weight and size."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.677"
                                            },
                                            "Text": {
                                                "val": "- Continue to mature passive interrogation systems for determining the location of nuclear material.\n- Complete design of man-portable field instrument capable of passively locating and identifying nuclear materials.\n- Continue to mature passive interrogation systems for determining the location of nuclear material.\n- Complete design of man-portable field instrument capable of passively locating and identifying nuclear materials.\n- Continue to develop and demonstrate neutron detection technology as an alternative to helium-3 neutron detectors.\n- Begin development of a rugged, mobile stand-off radiation detection system to provide detection and identification of nuclear materials in a field environment.\n- Research and develop new detector materials intended to improve the capability to detect, locate, and identify threat materials. Improve the manufacturing readiness level by maturing technologies, designs, and production processes.\n- Transition compact, high performing replacement electronics for detectors to commercial production. \n- Develop an advanced algorithm to increase speed and reliability of isotope identification in fielded hand-held and portable detectors.\n- Begin to incorporate radiation transport into existing operational modeling tools.\n- Begin development of compact superconducting cyclotrons as a source in active interrogation systems.\n- Continue to develop and field (prototype) upgraded technical capabilities for prompt and debris sample collection, sample analysis, and integration of design modeling and forensic data to support development of technical conclusions.\n- Complete execution, transition and fielding of the National Technical Nuclear Forensics (NTNF) Joint Concept Technology Demonstration (JCTD) capabilities and begin Limited Operational Use \/ Employment and Follow-on Sustainment activities.\n- Complete development of a fieldable standoff active interrogation system for standoff detection and warning of hidden and shielded nuclear material.\n- Continue to perform field demonstrations of new detector technologies for handheld detectors, distributed sensors, and vehicle mountable detector systems, to improve the ability of fielded forces to detect, locate, and identify nuclear materials in the battle space.  \n- Continue to improve performance of new detector materials, imaging and spectroscopy systems, and signals analysis methods through rigorous field testing.\n- Expand the functionality of the Mobile Field Kit – Radiological (MFK-R) to add radiological situational awareness to the current suite of chemical sensors in the kit.\n- Investigate alternative methods to detect fissions in nuclear materials from standoff ranges, including the use of high-power lasers to generate beams of mono-energetic x-rays.\n- Investigate the use of muon and proton beams for standoff stimulation of fission in nuclear materials.  Conduct experiments to validate the feasibility of the approach.\n- Progressively advance the laboratory physics demonstrations of target stimulation, signature detection, and validated modeling capability.\n- Develop a system to produce, capture, steer, cool and re-accelerate negative muons in a reduced footprint and with fewer components than are being used in comparable muon generating systems.\n- Develop the ability and Concept of Operations (CONOPS) to detect radiation induced air fluorescence from special nuclear material (SNM) by passive and active means.\n- Investigate concept of a pulsed millimeter wave system which detects radioactive sources in both passive and active interrogation scenarios.\n- Improve the Monte Carlo N-Particle (MCNP) code to enhance its modeling capability for specific problems.\n- Continue development of a large standoff, directionally oriented, monoenergetic gamma (e.g. laser Wakefield\/inverse Compton scattering accelerator) source for integration with an active interrogation system.\n- Continue efforts to improve accelerator designs for higher acceleration gradients and reduced weight and size."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "44.998"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "44.998"
                                            },
                                            "Text": {
                                                "val": "- Continue development of a compact superconducting source in active interrogation systems.\n- Continue to identify all-source nuclear threat signatures, characteristics, and corresponding detection modalities; identify the proper tipping, queuing, and data fusion techniques and algorithms to enable the rapid and effective accumulation of all-source intelligence on nuclear threat scenarios. \n- Investigate alternative methods to detect fissions in nuclear materials from standoff ranges.\n- Investigate the use of proton beams for standoff stimulation of fission in nuclear materials.  Conduct experiments to validate the feasibility of the approach.\n- Progressively advance the laboratory physics demonstrations of target stimulation, signature detection, and validated modeling capability.\n- Investigate concept of a radio wave-type system to detect radioactive sources in multiple scenarios.\n- Improve a probabilistic code to enhance its modeling capability for specific problems.\n- Continue efforts to improve accelerator designs for improved capabilities with reduced weight and size.\n- Continue to incorporate radiation transport into existing operational modeling tools.\n- Test and evaluate developmental large-area detection systems.\n- Research and develop new detector materials intended to improve the capability to detect, locate, and identify threat materials. Improve the manufacturing readiness level by maturing technologies, designs, and production processes.\n- Continue to develop and demonstrate neutron detection technology as an alternative to helium-3 neutron detectors.\n- Continue to develop, accelerate development where appropriate, demonstrate, and field (prototype) upgraded technical capabilities for prompt diagnostics (under DISCREET OCULUS and MINIKIN ECHO) and debris sample collection, sample analysis, modeling to support nuclear device reconstruction, and forensics data to lower uncertainties\/increase confidence in technical nuclear forensics (TNF) conclusions. Includes development of new debris collection and field analysis concepts and supporting technologies that take advantage of higher activity level samples and the ability to collect\/analyze short-lived isotopes to significantly shorten the timeline from weeks to days. \n- Begin development of methods to rapidly determine post-event nuclear weapon yields and reaction history by investigating alternative prompt nuclear weapons effects, effects on the environment, and developing\/fielding prototype capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "28\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "77.472"
                                        },
                                        "CurrentYear": {
                                            "val": "77.784"
                                        },
                                        "BudgetYearOne": {
                                            "val": "76.298"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "76.298"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "77.863"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.528"
                                        },
                                        "BudgetYearFour": {
                                            "val": "80.321"
                                        },
                                        "BudgetYearFive": {
                                            "val": "81.651"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Successful completion of the individual digital dosimeter project.\n\nIncreased standoff detection distance using a mobile active interrogation system to stimulate characteristic neutron and gamma ray signals from nuclear material.\n\nSuccessful acceptance and operational development of transitional detection technologies.\n\nSuccessful demonstrations of a forensics capability to support attribution involving both Radiological Dispersal and Improvised Nuclear Devices. \n\nDelivery of technical equipment prototypes to reduce their current gaps in technology, to locate, characterize and provide advanced diagnostics to defeat Weapons of Mass Destruction devices in support of a classified Chairman Joint Chiefs of Staff plan. \n\nImproved forensics evaluation tool capabilities.\n\nSupport development of National Technical Nuclear Forensics (NTNF) capabilities through development of technologies\/prototypes addressing gaps and shortfalls in Department of Defense (DoD) NTNF capabilities, and through participation in the interagency process.  Note: Specific metrics associated with NTNF are classified.\n\nUse an active interrogation system to interrogate and differentiate Special Nuclear Materials and an inert material at extended ranges.\n\nDelivery of a series of documents that discuss the technical aspects of radiation detection applied to realistic concepts of operations (CONOPS) for detecting radiological and nuclear threats, along with their supporting documents."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RG"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Energetics & Counter WMD Weapons"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.432"
                        },
                        "CurrentYear": {
                            "val": "17.771"
                        },
                        "BudgetYearOne": {
                            "val": "14.645"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.645"
                        },
                        "BudgetYearTwo": {
                            "val": "14.750"
                        },
                        "BudgetYearThree": {
                            "val": "13.595"
                        },
                        "BudgetYearFour": {
                            "val": "13.521"
                        },
                        "BudgetYearFive": {
                            "val": "14.004"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Counter Weapon of Mass Destruction Hard Target Defeat (CWMD HTD) Weapons Development project develops, matures, and demonstrates innovative kinetic and non-kinetic weapon capability for the physical or functional defeat of WMD agents, processes, and support networks with a minimum of collateral effects from incidental release of agent.  This is directly linked to the 2010 Quadrennial Defense Review (QDR) priority objectives to prevent and deter conflict and prepare to defeat adversaries and succeed in a wide range of contingencies, and the key missions of deter and defeat aggression in anti-access environments; and prevent proliferation and counter weapons of mass destruction.  It does so through the systematic identification and maturation of advanced technologies capable of defeating WMD agents or agent based processes, then integrating the technologies into the weapons and delivery systems most relevant to the COCOMs’ WMD Defeat CONOPS for their Area of Responsibility (AOR).  The primary focus of current efforts is defeating an adversary's WMD capability protected in the confines of hardened and protected bunker and tunnel facilities.  Included in this program is the development of offensive defeat capabilities, WMD agent\/agent-based process simulants, test infrastructure, and sampling capability required for effective development, testing, and evaluation of the next generation capability as well as the advanced modeling and simulation necessary for ensuring optimum weapon solutions are achieved based on this technology.  The program addresses requirements delineated in the QDR and Strategic Planning Guidance as codified in Joint Capability Integrated Development (JCID) documents, Service requirements documents, and COCOMs and Agency Priority Lists for lethal and non-lethal C-WMD capability.  The efforts contained in the program further develop, mature, and demonstrate technology and weapon system concepts that greatly enhance the warfighters' capability to defeat the spectrum of weapons of mass destruction in hard and deeply buried targets (HDBTs) and elsewhere throughout the lifecycle functions from production to weaponization, storage, and employment.\n\nThe program’s investment approach is based on a strategic top-down analysis of threat vulnerabilities and aligned with stated organizational core competencies and lines of operations aimed at the defeat of (1) the chemical, biological, radiological, and nuclear (CBRN) threat materials, (2) the ability to deliver the same, and (3) the support networks, both physical and non-physical, enabling both.  The program places a high priority on understanding, characterizing, and validating potential weapon effects within some mathematical confidence as it relates to the unintended release of hazardous threat materials.  Our end-state is to provide COCOMs with accurate and timely WMD defeat expertise, tailored technologies, and customized solutions that provide offensive weapons and capabilities to combat WMD in any target while mitigating collateral contamination effects.  Without these capabilities our nation cannot effectively hold at risk our adversaries’ WMD capabilities thus giving them strategic advantage.\n\n\nThe decrease from FY 2012 to FY 2013 represents an efficiency reduction to contract support services as part of the DoD reform agenda to reduce reliance on service support contractors."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RG: Advanced Energetics & Counter WMD Weapons"
                                    },
                                    "Description": {
                                        "val": "Project RG develops advanced technologies and weapon concepts and validates their applicability as counter WMD weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.432"
                                            },
                                            "Text": {
                                                "val": "- Continued development and small-scale testing of new energetic materials for counter-WMD weapons payloads.\n- Continued maturing of advanced non-energetic WMD Defeat payload components.\n- Conducted scaled penetrator tests versus High Strength Concrete (HSC) and steel-encased concrete targets to further characterize breakthrough penetrator technologies.\n- Continued investigation of CWMD payloads capable of neutralizing large amounts of WMD agent.\n- Designed fuze well redundant data recorder for field and flight testing of both legacy and developmental hard target defeat weapons.\n- Initiated advanced testing of WMD Defeat sub-munitions (Kinetic Fireball).\n- Made Kinetic Fireball design improvements to address target equipment damage effectiveness and related small- and full-scale testing.\n- Designed low-cost layer and void sensing target detection device for hard target defeat fuzes.\n- Continued investigating thermite energetic materials to identify multi-effort research areas, trade studies, tests, and demonstrations that will inform how to best use thermite for WMD agent defeat.\n- Designed miniature shock survivable fuze based on current manufacturing technologies.\n- Continued development of a WMD process computer model useful for testing non-kinetic-based CWMD capabilities and applied it to specific CWMD targets.\n- Performed flight test of operational Battle Damage Information (BDI) Link Advanced Demonstrator (BLADE) system demonstrating capability to transmit BDI data into an Air Operations Center (AOC).\n- Performed flight testing of prototype Joint Direct Attack Munition (JDAM) Micro Air Vehicle (MAV) system demonstrating post-impact video coverage of target site and integration with BLADE hardware.\n- Explored integration of kinetic and non-kinetic capabilities into single CWMD payload.\n- Performed laboratory and field testing of hardware demonstrating capability to record and transmit weapon data during a harsh shock environment.\n- Conducted small-scale chemical and biological simulant defeat testing using new materials.\n- Demonstrated data reception portion of infrastructure for long haul communication of BDI data from battlefield back to command centers.\n- Refined, validated, and transitioned an algorithm for improving the capability to conduct test and evaluation of non-kinetic C-WMD payloads.\n- Conducted flight tests to support multi-hit weapon tactics and penetration model development.\n- Conducted kinetic and functional simulant neutralization experiments.\n- Conducted additional detonations in a scaled complex tunnel facility in support of weapon and model development efforts.\n- Initiated concept studies for BLU-119\/B conversion using a safer, lower lifecycle cost payload fill.\n- Conducted thermal evaluation of the Joint Multi-Effects Warhead System (JMEWS) warhead and evaluated its potential for use against WMD.\n- Began development and testing of model improvements to Second-order Hydrodynamic Automatic Mesh Refinement Code (SHAMRC) (those identified in the 2010 evaluation).\n- Completed fabrication and installation of cluster molecule production equipment.\n- Began production of candidate cluster molecule energetic materials.\n- Began characterization and evaluation of cluster molecule energetic material candidates.\n- Developed highly metalized explosive formulation optimized using SHAMRC model guidance for maximized blast performance.\n- Continued to evaluate metalized explosive formulations optimized for maximum energy content.\n- Conducted model code comparison evaluation exercise to identify model code capabilities and needs.\n- Evaluated Advanced Energetics best candidate concepts for enhanced internal blast packet charges, metal-augmented charges, and structural reactive cases.\n- Completed development of explosive additive fuels optimized for defeat of chemical and biological agent threats.\n- Began development of explosive formulations using additive fuels for defeat of chemical and biological agent threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.771"
                                            },
                                            "Text": {
                                                "val": "- Select the most promising and enhanced survivable energetic material fill and inert simulant for CWMD weapon development.\n- Continue maturing advanced non-energetic WMD Defeat payload components. \n- Conduct subscale experiments to develop and verify prediction capability for countermeasure effects on projectile penetration.\n- Continue advanced testing of WMD Defeat sub-munitions.\n- Develop and test fuze well redundant data recorder for field and flight testing of both legacy and developmental hard target defeat weapons.\n- Begin testing and demonstrations of CWMD weapons payloads for use against bulk chemical agent.\n- Develop a low-cost layer and void sensing target detection device for hard target defeat fuze and transition hardware to a fuze development.\n- Continue to explore new energetic CWMD payloads by performing sub-scale characterizations of the next generation survivable penetrator energetic material fill.\n- Develop miniature shock survivable fuze and integrate low cost layer and void sensing target detection device hardware.\n- Continue development of process modeling capability for non-kinetic-based CWMD and apply it to specific CWMD targets. \n- Conduct flight testing of operational BLADE system, demonstrating capability to transmit BDI data into long haul communication infrastructure.\n- Continue to explore combining integration of kinetic and non-kinetic payloads into a single weapon for counter WMD.\n- Demonstrate entire infrastructure for long haul communication of BDI data from battlefield back to command centers leveraging BDI flight tests.\n- Begin testing and demonstrations of non-energetic CWMD payloads.\n- Conduct full-scale test against target with penetration countermeasures.\n- Begin integration of WMD Defeat sub-munitions into a weapon warhead.\n- Determine and catalog the accuracy and precision of bio-aerosol sampling equipment utilized in counter-WMD testing.\n- Conduct the investigations necessary to develop a capability that can determine how much chemical or biological agent is released in an explosive plume while achieving acceptable accuracy and precision.\n- Complete testing with insensitive munitions and other High Energy fills to determine how well they can neutralize large quantities of WMD agent.\n- Begin reduced scale target testing of CWMD payloads and capabilities.\n- Initiate testing for BLU-119\/B conversion to safer, lower Life Cycle Cost payload fill."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.645"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.645"
                                            },
                                            "Text": {
                                                "val": "- Continue small-scale testing in support of BLU-121\/B bomb development focusing on development of low lifecycle cost payload fills.\n- Initiate warhead integration of enhanced survivable explosive material fill and inert simulant.\n- Continue advanced testing of non-energetic WMD Defeat sub-munitions.\n- Continue testing and demonstrations of CWMD payloads.\n- Continue to explore integration of kinetic and non-kinetic capabilities into single payload for counter-WMD testing.\n- Continue testing and demonstrations of payloads capable of neutralizing large amounts of WMD agent.\n- Determine and catalog the accuracy and precision of bio-aerosol sampling equipment used in counter-WMD testing.\n- Continue development of a capability to conduct full-scale agent defeat testing with acceptable accuracy and precision.\n- Conduct large-scale target testing of functional and kinetic defeat technologies.\n- Conduct flight tests of Hard Target Void Sensing Fuze.\n- Conduct Next Generation AFX-757 Explosive Survivable Formulation that demonstrates enhanced survivability against hard and deeply buried targets.\n- Conduct flight testing of Robust Fuzewell Instrumentation System (RFIS) prototype to fully demonstrate capability of RFIS to support high shock munitions testing.\n- Develop robust forensic tools for an automated analysis of susceptibility of electronics to electromagnetic fields.\n- Demonstrate the capabilities of the JDAM tailkit BDI systems to provide near-real-time munition effectiveness estimates to the warfighter. \n- Demonstrate BDI system prototype.\n- Initiate potential WMD target access denial or denial-of-use technologies.\n- Evaluate small new inventory weapons effectiveness against WMD threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "28\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.273"
                                        },
                                        "CurrentYear": {
                                            "val": "15.186"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.682"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.682"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.540"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.780"
                                        },
                                        "BudgetYearFour": {
                                            "val": "22.487"
                                        },
                                        "BudgetYearFive": {
                                            "val": "23.212"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Mature weapon system component technologies required for development of at least one new capability to counter WMD in tunnels during the FYDP, to Technology Readiness Level 2\/3."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RI"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Survivability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.525"
                        },
                        "CurrentYear": {
                            "val": "17.503"
                        },
                        "BudgetYearOne": {
                            "val": "18.810"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.810"
                        },
                        "BudgetYearTwo": {
                            "val": "18.965"
                        },
                        "BudgetYearThree": {
                            "val": "20.142"
                        },
                        "BudgetYearFour": {
                            "val": "21.428"
                        },
                        "BudgetYearFive": {
                            "val": "21.490"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear Survivability project provides enabling technologies for Department of Defense (DoD) nuclear forces and their associated control and support systems and facilities in wartime to avoid, repel, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action.  Emphasis is on ionizing radiation effects. The Nuclear Survivability project provides Radiation Hardened (RadHard) Microelectronics and Nuclear Weapons Effects (NWE) experimentation research.  Funding in this project also supports the expanding role of the Nuclear Test Personnel Review (NTPR) program into Science & Technology development for human survivability.\n\nThe NWE simulators are available to validate nuclear survivability requirements for DoD missile and space systems, conduct research in radiation effects, and validate computational models.  The Nuclear Survivability Experimental Capabilities program is working with the National Nuclear Security Administration and the United Kingdom Atomic Weapons Establishment to jointly develop new, enabling technologies for improved NWE experimentation capabilities for x-rays, gamma rays and neutrons.\n \nThe Nuclear Technology Analysis Support provides support for the Joint Atomic Information Exchange Group (JAIEG) and the international Weapon Effects Steering Committee (WESC) that was called the NWE Users’ Group.  The WESC establishes standards for U.S. and U.K nuclear weapons effects simulation codes and models as defined and prioritized by the nuclear community, and serves as a forum for sharing information on nuclear technologies, gaps and plans.\n\nThe increase from FY 2012 to FY 2013 is predominately due to increased investment in nuclear weapons effects efforts as part of a redirection of the nuclear detection portfolio toward a more holistic nuclear THREAT detection portfolio that integrates both passive and active radiation detection into a comprehensive Intelligence, Surveillance, and Reconnaissance (ISR) solution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RI: Nuclear Survivability"
                                    },
                                    "Description": {
                                        "val": "Project RI provides the capability for DoD nuclear forces and their associated control and support systems and facilities in wartime to avoid, repel, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.525"
                                            },
                                            "Text": {
                                                "val": "- Demonstrated a new circuit upset mechanism involving power transients.\n- Demonstrated Radiation-Hardened Designs for Data Conversion and timing stability.\n- Demonstrated radiation hardening by use of charge cancellation technique.\n- Conducted risk mitigation experiments for a high-temporal fidelity gamma experimentation capability.\n- Demonstrated advanced laser-driven x-ray sources on National Ignition Facility (NIF) for potential NWE experimentation capabilities.\n- Demonstrated warm x-ray sources on Saturn to support certification of survivable DoD systems.\n- Conducted a demonstration of lower energy x-ray test capability for the certification of solar arrays and optic systems for survivable satellites and missile defense interceptors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.503"
                                            },
                                            "Text": {
                                                "val": "- Develop 45nm RadHard-By-Design mitigation techniques. \n- Investigate 32nm technology Total Ionizing Dose mitigation methods. \n- Demonstrate compatibility of 90nm RadHard by design library cells and macro with 90nm RadHard by process enhancements.\n- Initiate fabrication of a high temporal fidelity prompt gamma simulator for satellite electronics certification.\n- Conduct laser-driven x-ray source demonstrations to support space telescope subsystem survivability.\n- Investigate potential neutron sources for survivability certification on the Z-machine at Sandia National Laboratories.\n- Integrate fast-running urban radiation transport algorithms into operational code."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.810"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.810"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate initial 45nm RadHard prototype circuits to develop RadHard by design methods.\n- Continue development of Technology Computer-Aided Design modeling for 45nm circuit devices.\n- Characterization and mitigation of radiation effects in graphene devices.\n- Implementation of human radiation induced performance decrement model into operational code.\n- Perform a full-scale space interceptor telescope survivability test on NIF in collaboration with the Missile Defense Agency (MDA).\n- Initiate an investigation of advanced concepts to generate >10X the existing warm x-ray test capability to support strategic system life extension programs in collaboration with the National Nuclear Security Administration (NNSA)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "28\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.702"
                                        },
                                        "CurrentYear": {
                                            "val": "6.985"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.129"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.129"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.654"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.571"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.712"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.104"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Reduce facility overhead costs by disposition of excess government-owned simulator hardware at the West Coast Facility (WCF).\n\nDevelopment of cold and warm x-ray capabilities on the Saturn machine at Sandia National Laboratory that meet or exceed the equivalent capabilities at the WCF.\n\nWeapon Effects Steering Committee: Coordinate and integrate nuclear weapon effects needs, capabilities and programs across the United States and United Kingdom defense communities and provide accreditation authority for all nuclear-related modeling and simulation."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RL"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear & Radiological Effects"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.891"
                        },
                        "CurrentYear": {
                            "val": "25.343"
                        },
                        "BudgetYearOne": {
                            "val": "25.752"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.752"
                        },
                        "BudgetYearTwo": {
                            "val": "23.904"
                        },
                        "BudgetYearThree": {
                            "val": "25.202"
                        },
                        "BudgetYearFour": {
                            "val": "25.539"
                        },
                        "BudgetYearFive": {
                            "val": "25.964"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear and Radiological Effects project develops nuclear and radiological assessment modeling tools to support military operational planning, weapon effects predictions, and strategic system design decisions; consolidate validated Defense Threat Reduction Agency modeling tools into net-centric environment for integrated functionality; predict system response to nuclear and radiological weapons producing electromagnetic, thermal, blast, shock and radiation environments - key systems include Nuclear Command and Control System, Global Information Grid, missiles, structures, humans and environment; provide detailed adversary nuclear infrastructure characterization to enhance counterforce operations and hazard effects; conduct analyses in support of nuclear and radiological Science and Technology and address the priority needs of the Combatant Commands and the Department of Defense, develop and provide electromagnetic pulse assessment capabilities to support national and military operational planning, weapon effects predictions, and national strategic systems designs; and develop foreign nuclear weapon outputs.\n\nThe increase from FY 2012 to FY 2013 is predominately due to increased investment in system vulnerability and assessment efforts as part of a redirection of the nuclear detection portfolio toward a more holistic nuclear THREAT detection portfolio that integrates both passive and active radiation detection into a comprehensive Intelligence, Surveillance, and Reconnaissance (ISR) solution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RL: Nuclear & Radiological Effects"
                                    },
                                    "Description": {
                                        "val": "Project RL develops nuclear and radiological assessment modeling tools to support military operational planning, weapon effects predictions, and strategic system design decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.891"
                                            },
                                            "Text": {
                                                "val": "- Began Electro Magnetic Pulse (EMP) E1 physics-based code for better modeling\/predictions of EMP effects.\n- Continued Effects Manual-1 (EM-1) development (3 chapters published); continued publication of Joint Radiation Effects documentation.\n- Continued to validate code for system response to High Altitude Nuclear Effects (HANE); validate and integrate Modeling and Simulation (M&S) capability to understand HANE; validate and integrate M&S capability.\n- Demonstrated prototype sensor visualization capability.\n- Completed an Electromagnetic Pulse (EMP) Survivability Test on a Maritime Ship (USS Makin Island).\n- Completed an EMP Survivability Test on a B2 Bomber and an E4 NAOC in accordance with military test standards.\n- Conducted Survivability Verification Tests on military satellite communication facilities.\n- Conducted an EMP Power Grid experiment at Idaho National Laboratory, to test survivability of power infrastructures against EMP from high-altitude nuclear bursts.\n- Performed a High Altitude EMP (HEMP) assessment on the Emergency Ultra-High Frequency (UHF) network, to test survivability against EMP from high-altitude nuclear bursts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.343"
                                            },
                                            "Text": {
                                                "val": "- Standup of the Nuclear Weapons Effects Network (NWEN) plans are designed to do the following:\n-- Model and code development, performing analyses at all computational levels of fidelity and run times.\n-- Emphasize re-initiation of quality NWE science via balanced modeling and simulation and experimentation.\n-- Focus initially on first-principles model development and Uncertainty Quantification.\n- Complete non-ideal Source Region Electromagnetic Pulse (SREMP) Study.\n- Complete new version of United States Strategic Command’s (USSTRATCOM) official strategic targeting code used to determine the probability of damage from nuclear weapon.  \n- Update trapped radiation belt model.\n- Continue EM-1 development (3 chapters); continue publication of Joint Radiation Effects documentation, continue to upgrade database of foreign nuclear weapon outputs for DoD and the Services.\n- Update Nuclear Weapons Effects Database (NWEDS) used by the Army for survivability and targeting calculations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.752"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.752"
                                            },
                                            "Text": {
                                                "val": "- Prototype first principles urban effects model for nuclear detonations.\n- Deliver improved HANE model for better modeling\/predictions of nuclear effects from space detonations.\n- Complete three dimensional models of nuclear fallout for better modeling\/predictions of fallout from ground or low-altitude detonations.\n- Begin component level EMP response model for better modeling\/predictions of effects on electronic systems.\n- Continue EM-1 development (4 chapters); continue publication of Joint Radiation Effects documentation, continue to upgrade database of foreign nuclear weapon outputs for DoD and the Services.\n- Deliver hazard source terms to the Chemical – Biological Defense Program’s Joint Effects Model Block II, enhancing our ability to predict hazards associated with weapons of mass destruction.\n- Complete and publish MIL-STD-423 review to provide improved EMP protection for command and control facilities. \n- Conduct Maritime EMP Standard Ship Test to provide improved techniques for testing Navy vessels against EMP threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "28\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention, and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.661"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "117\/0605000BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Capabilities"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.826"
                                        },
                                        "CurrentYear": {
                                            "val": "5.888"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.749"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.749"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.995"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.077"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.359"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.541"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Complete transition of all hazard source terms to the Chemical and Biological (Chem-Bio) Defense Program’s Joint Effects Model (JEM) Block II enhancing our ability to predict hazards associated with weapons of mass destruction.\n\nProvide Department of Defense the ability to predict the survival and mission impact of military critical systems exposed to nuclear weapon environments within acceptability criteria defined during the model accreditation process.\n\nComplete new version of United States Strategic Command (USSTRATCOM) official strategic targeting code used to determine the probability of damage from nuclear weapons."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RM"
                    },
                    "ProjectTitle": {
                        "val": "WMD Battle Management"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.255"
                        },
                        "CurrentYear": {
                            "val": "13.761"
                        },
                        "BudgetYearOne": {
                            "val": "18.969"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.969"
                        },
                        "BudgetYearTwo": {
                            "val": "19.066"
                        },
                        "BudgetYearThree": {
                            "val": "19.988"
                        },
                        "BudgetYearFour": {
                            "val": "20.593"
                        },
                        "BudgetYearFive": {
                            "val": "20.729"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Weapons of Mass Destruction (WMD) Battle Management project provides applied research to support full and sub-scale testing required to investigate countering WMD weapon effects, and sensor performance, weapon effects modeling algorithm development, and the set-up of the Defense Threat Reduction Agency (DTRA) Experimentation Lab (DEL).\n\nThis project provides combatant commanders the prediction capability and the attack options to engage Hard & Deeply Buried Targets (HDBTs) as the proliferation and hardness of this class of targets increases.  The project conducts weapon effects phenomenology (WEP) tests, analyzes data, conducts high performance computer simulations, and creates\/modifies software to more accurately model cratering effects, fragmentation (both primary & secondary), internal air blast, equipment\/container damage, structural response, and penetration.  These efforts will lead to advanced modeling capability in the countering WMD tools, Integrated Munitions Effects Assessment (IMEA) weaponeering and Vulnerability Assessment and Protection Option (VAPO) force\/structure protection.  The Advanced Energetics & Counter WMD Weapons Program develops new novel energetic materials and weapon design technology for rapid, directed and enhanced energy release, providing new capability to defeat difficult WMD\/HDB targets. The Advanced Energetics Program also develops new high energy systems well above chemical energy levels to defeat WMD targets beyond the reach of traditional high explosive blast\/frag warhead technology.\n  \nThe DTRA Experimentation Lab Capability is an Agency-wide capability that assures the timely acquisition, synchronization, correlation and delivery of Chemical, Biological, Radiological, Nuclear and Explosive (CBRNE) consequence management and mitigation data necessary in combating WMD.  The DTRA Experimentation Lab will be the “key enabler” allowing the Agency to transform successfully into an interoperable DoD Science and Technology environment.  Through the use of the DTRA Experimentation Lab, DTRA will be able to shape and improve military situational awareness independent of time or location, effectively shorten decision cycles in a CBRNE event, and extend DTRA’s knowledge base externally through collaborative technologies.\n\nThe increase from FY 2012 to FY 2013 is predominately due to the reallocation of funds from infrastructure development in Project RR - Test Infrastructure to weapons effects and planning tools in Project RM – Battle Management to properly align mission responsibilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RM: WMD Battle Management"
                                    },
                                    "Description": {
                                        "val": "Project RM provides (1) full-scale testing of counter WMD weapon effects, sensor performance, and weapon delivery optimization, (2) weapon effects modeling, and (3) the Defense Threat Reduction Agency Experimentation Lab."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.255"
                                            },
                                            "Text": {
                                                "val": "- Conducted Ultra High Performance Concrete (UHPC) penetration tests and material analysis.  Continued modeling and finalized evaluation of current models.\n- Delivered 15 additional validated equipment fragility models to support DoD need for accurate weapons effects modeling and simulation for counter-WMD planning tools.\n- Updated the WMD Agent Release database to support DoD need for accurate weapons effects modeling and simulation for counter-WMD planning tools.\n- Conducted blast door model testing and model modifications.\n- Completed Phase 1 progressive collapse testing and model development for concrete frame structures.  Two column removal tests were conducted in a full-scale 4-story concrete test structure.\n- Completed five internal detonation tests for validation of Internal Detonation (quasi-static and dynamic pressure) models with bare explosives in conventional construction.\n- Improved Second-order Hydrodynamic Automatic Mesh Refinement Code (SHAMRC) to model flow of densely packed particles as well as very small sized particles.\n- Demonstrated new production process for aluminum nanoparticles with improved stability and safety.\n- Quantified Explosively Generated Plasma effects used for enhanced target damage.\n- Designed high performance reactive cases for explosive payloads, made from pressed powders, to enhance weapon performance.\n- Prepared conceptual enhanced blast design for high performance missile payload.\n- Continued to provide leading technological integration capabilities to the combating WMD mission through utilization of the DTRA Experimentation Lab (DEL).\n- Continued to support demonstrations and experimentation events for the Countering Weapons of Mass Destruction (C-WMD) Community of Interest (COI) to include participation in Noble Resolve, Coalition Warrior Interoperability Demonstration, Urban Resolve, and efforts to prevent loose nukes experimentation campaigns.\n- Continued facilitation of the internal Continuity of Operations Table Top Experiment through the DEL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.761"
                                            },
                                            "Text": {
                                                "val": "- Integrate first principle modeling codes into Graphical User Interface (GUI)-based hazard prediction models.\n- Facilitate Joint Concept Development & Experimentation (JCDE) for the C-WMD COI.\n- Investigate and explore developmental technologies, such as Virtual Worlds.\n- Analyze, explore, and identify gaps and barriers associated with CWMD warfighter challenges.\n- Complete facilitation of the internal Continuity of Operations Table Top Experiment through the DEL.\n- Plan, design, execute, and analyze warfighting experimentation in support of DTRA, and in coordination with the Services, Combatant Commands, Defense agencies, and the interagency as appropriate.\n- Perform annual cycle of requirements collection, challenge proposals, resource allocation, and tech support through High Performance Computing.\n- Support two DTRA DoD high performance computing challenge projects, “Improve parallel scalability of important Computational Fluid Dynamics (CFD)” and “Computational Structural Mechanics (CSM) codes to reduce time to solution.”\n- Provide interface between important CFD & CSM codes to analysis software to facilitate Validation, Sensitivity Studies, and Uncertainty Quantification.\n- Develop capability to model equipment fragility for any generic equipment.\n- Conduct testing and modeling improvements to the WMD Agent Release Model to support DoD need for accurate weapons effects modeling and simulation for counter-WMD planning tools.\n- Complete blast door model verification and validation.\n- Conduct Phase 2 progressive collapse testing and begin modeling effort for steel frame structures.\n- Finalize Internal Detonation testing and (quasi-static and dynamic pressure) model.\n- Begin test program for blast propagation through failing bunker walls from blast and fragmentation.\n- Incorporate SHAMRC workshop recommendations into improved SHAMRC; compare the simulated results with test results.\n- Evaluate technology transfer to cruise missile payload using DTRA-developed reactive case technology.\n- Integrate enhanced blast explosives and reactive cases into designs for weapon payloads.\n- Study performance of payloads based on enhanced blast explosives and reactive cases for agent defeat.\n- Begin efforts to develop novel energy storage capabilities based on antimatter storage, super halogen chemistry, warm dense matter at high pressure, hydrogen isotope reactions, and high nitrogen explosives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.969"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.969"
                                            },
                                            "Text": {
                                                "val": "- Facilitate Joint Concept Development & Experimentation (JCDE) for the CWMD Community of Interest.\n- Integrate virtual environments into DTRA wargaming activities.\n- Analyze, explore, and identify gaps, and barriers associated with CWMD Warfighter Challenges through the use of wargaming and tabletop exercises.\n- Perform annual cycle of requirements collection, challenge proposals, resource allocation, and technical support through High Performance Computing.\n- Submit two DTRA Challenge Proposals for improved quality of service in time limit, allowed job size, and job throughput on DoD high performance computers.\n- Improve computational methods for prediction of progressive collapse.\n- Complete blast through failing walls test series and provide new model for blast through failing walls from inventory weapons.\n- Start delivery of validated high fidelity models for air blast in complex tunnels.\n- Start delivery of validated models for blast and fragmentation through failing blast doors.\n- Improve computational methods for prediction of progressive collapse.\n- Provide modeling support for the transfer of novel energetic concepts to selected weapon systems.\n- Complete formulation testing, perform in-depth fragmentation test and analysis with reactive liners in sub-scale warheads.\n- Continue testing of agent defeat mechanisms using hybrid enhanced blast explosives and reactive cases.\n- Begin work to develop warhead energy release tailored to target environment and to develop directed blast energy release to enhance target damage.\n- Continue development of warm dense matter at high pressure; demonstrate novel use of this material state for x-ray generation.\n- Complete synthesis and lab tests of one new explosive compound."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "28\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.143"
                                        },
                                        "CurrentYear": {
                                            "val": "22.303"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.503"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.503"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.527"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.937"
                                        },
                                        "BudgetYearFour": {
                                            "val": "23.700"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.328"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Confidence in engineering models based on software validation and testing.\n\nNumber of targets successfully planned.\n\nTime required completing assessments.\n\nThe DTRA Experimentation Lab (DEL) is occupied by planning or execution efforts 75% of the year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RR"
                    },
                    "ProjectTitle": {
                        "val": "Test Infrastructure"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.509"
                        },
                        "CurrentYear": {
                            "val": "21.941"
                        },
                        "BudgetYearOne": {
                            "val": "13.782"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.782"
                        },
                        "BudgetYearTwo": {
                            "val": "14.135"
                        },
                        "BudgetYearThree": {
                            "val": "14.414"
                        },
                        "BudgetYearFour": {
                            "val": "15.005"
                        },
                        "BudgetYearFive": {
                            "val": "15.610"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Test Infrastructure project provides a unique national test bed capability for simulated Weapons of Mass Destruction (WMD) facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the Department of Defense (DoD), the Services, the Combatant Commanders, and other federal agencies to evaluate the implications of WMD, conventional, and other special weapon use against U.S. military or civilian systems and targets.  It leverages fifty years of testing expertise to investigate weapons effects and target response across the spectrum of hostile environments that could be created by proliferate nations or terrorist organizations with access to advanced conventional weapons or WMD (nuclear, biological and chemical).  The project maintains testing infrastructure to support the testing requirements of warfighters, other government agencies, and friendly foreign countries on a cost reimbursable basis.  It creates testing strategies and a WMD Test Bed infrastructure focusing on the structural response of buildings and Hard & Deeply Buried Targets that house nuclear, biological, and chemical facilities.  It provides support for full and sub-scale tests that focus on weapon-target interaction with fixed soft and hardened facilities to include aboveground facilities, cut-and-cover facilities, and deep underground tunnels.  This capability does not exist anywhere else within the DoD and supports the counterproliferation pillar of the National Strategy to Combat WMD.\n\nThe decrease from FY 2012 to FY 2013 is predominately due to the reallocation of funds from infrastructure development in Project RR - Test Infrastructure to weapons effects and Planning tools in Project RM - Battle Management, and reduced investment in test infrastructure environment restoration support and the WMD National Test Bed (TB)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RR: Test Infrastructure"
                                    },
                                    "Description": {
                                        "val": "Project RR provides a unique national test bed capability for simulated WMD facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the DoD, the Services, the Combatant Commanders and other federal agencies to evaluate the implications of WMD, conventional, and other special weapon use against U.S. military or civilian systems and targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.509"
                                            },
                                            "Text": {
                                                "val": "- Augmented funding of test articles, design and drawings, construction and tunnel operation for Massive Ordinance Penetrator (MOP) Quick Reaction Capability (QRC) testing at White Sands Missile Range (WSMR).\n- Completed construction of add-on structures to Component Test Structure-3 to develop weapons effects and mitigation test data models for fire and blast in cooperation with the Singapore government.  Test executed first quarter of FY 2011.  Follow-on test construction scheduled to begin second quarter FY 2012, estimated test execution third quarter FY 2012.\n- Conducted upgrade and integration of instrumented mobile wireless “Mesh” infrastructure capabilities and improvements in support of the Department of Homeland Security\/Domestic Nuclear Detection Office (DHS\/DNDO) tests conducted at DTRA and DHS\/DNDO defined CONUS-wide sites for the DHS\/DNDO Secure the Cities (STC), Lower Manhattan Security Initiative (LMSI), and other functional tests.\n- Conducted Interagency Biological Restoration Demonstration (IBRD) testing in conjunction with DoD & DHS to reduce the time and resources necessary to recover and restore wide urban areas, military installations, and critical infrastructure following a biological incident.  \n- Conducted testing on Chemical, Biological, Radiological, Nuclear and Explosive (CBRNE) sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking targets used for WMD activities.\n- Conducted WMD Aerial Collection System (WACS) testing that is designed to meet U.S. Forces Korea’s requirement of an “all-in-one” Chemical, Biological, Radiological, and Nuclear (CBRN) sensor system for post-strike assessment (Battle Damage Assessment) of suspected WMD facilities and mobile time-sensitive targets.\n- Conducted nuclear detection and forensics testing to prevent weapons grade material\/dirty bombs from entering the U.S., U.S. territories, and Allied Nations.\n- Conducted Weapons of Mass Destruction sensor testing at the Technical Evaluation Assessment and Monitor Site (TEAMS) to detect nuclear grade material from entering the U.S., U.S. territories, and Allied Nations through rail, ship, and air ports.\n- Continued environmental remediation and compliance activities at the Nevada National Security Site (NNSS), Dugway Proving Ground (DPG), WSMR, and Kirtland Air Force Base (KAFB) in accordance with Environmental Protection Agency (EPA), Safety, and Environmental guidelines.\n- Developed Cost Analysis Tool for Test Sites database to develop Rough Order of Magnitude estimates for different types of tests as well as different test bed.\n- Conducted tunnel work detection testing at NNSS for the Customs and Border Patrol to be able to detect tunnel work or tunnels along northern and southern borders of CONUS.\n- Continued infrastructure and instrumentation upgrades to ensure test beds meet customers’ advanced technology testing needs.\n- Partnered with the National Laboratories and conducted Source Physics Experiment I and II at NNSS to support Comprehensive Test Ban Treaty Initiatives, new START Warhead Verification.\n- Completed installation of test instrumentation support systems at U12u tunnel NNSS.\n- Obtained a Highly Enriched Uranium Sphere for use at the TEAMS, KAFB for support radiation detection testing.\n- Finalized effort to transfer DECADE module II nuclear simulator from West Coast Facility, CA to University of Alabama-Huntsville, AL.\n- Placed the Hard Target Defeat “Capitol Peak Tunnel Complex,” WSMR in mothball status.\n- Completed the deactivation of Detachment Two Test Support Division, DPG.\n- Documented, prioritized, and supported test infrastructure requirements.\n- Conducted and evaluated field-level facility biological remediation studies, decontamination sampling & analysis protocol (Bio Response Operational Test and Evaluation), jointly managed by EPA and DHS, DTRA serving as the interagency test coordinating\/execution lead."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.941"
                                            },
                                            "Text": {
                                                "val": "- Develop and implement prototype Voice Over Internet Protocol (VOIP) system that can transfer both classified and unclassified data, voice communications, video, etc., to support test program execution starting first quarter FY 2012.\n- Modify existing test infrastructure or develop test infrastructure to support revitalized Weapons Effects Phenomenology Program supporting DTRA test programs.\n- Make improvements to existing test infrastructure and test articles, or construct new test articles to support DTRA Detection Technology Program starting in first quarter FY 2012.\n- Conduct testing in support of Treaty Verification Technologies Program and Source Physics Experiments to support Comprehensive Test Ban Treaty Initiatives, New START Warhead Verification, and detection and verification of Biological and Chemical Weapons.\n- Continue support of Weapons of Mass Destruction sensor testing at the Technical Evaluation Assessment and Monitor Site (TEAMS) to detect and prevent nuclear grade material from entering the U.S., U.S. Territories, and Allied Nations through rail, ship, and air ports.\n- Continue Interagency Biological Restoration Demonstration (IBRD) testing in conjunction with DoD and DHS to reduce the time and resources necessary to recover and restore wide urban areas, military installations, and critical infrastructure, following a biological incident.\n- Continue testing Chemical, Biological, Radiological, Nuclear, and Explosive sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking targets used for WMD activities.\n- Continue WMD Aerial Collection System testing that is designed to meet U.S. Forces Korea’s requirement of an “all-in-one” Chemical, Biological, Radiological, and Nuclear sensor system for post-strike assessment (Battle Damage Assessment) of suspected WMD facilities and mobile time-sensitive targets.\n- Continue nuclear detection and forensics testing to prevent weapons grade material\/dirty bombs from entering the U.S., U.S. Territories, and Allied Nations.\n- Continue Weapons of Mass Destruction sensor testing at the Technical Evaluation Assessment and Monitor Site to detect and prevent nuclear grade material from entering the U.S., U.S. Territories, and Allied Nations through rail, ship, and air ports.\n- Continue environmental remediation and compliance activities at the Nevada National Security Site (NNSS), Dugway Proving Grounds (DPG), White Sands Missile Range (WSMR), and Kirtland Air Force Base (KAFB) in accordance with EPA, Safety, and Environmental guidelines throughout FY 2012.\n- Continue development of a Cost Analysis Tool for Test Sites database to develop Rough Order of Magnitude estimates for different types of tests as well as different test beds during FY 2012.\n- Continue tunnel work detection testing at Nevada National Security Site for the Customs and Border Patrol to be able to detect tunnel work or tunnels along northern and southern borders of CONUS.\n- Continue infrastructure and instrumentation upgrades to ensure test beds meet customers’ advanced technology testing needs.\n- Document, prioritize, and support test infrastructure requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.782"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.782"
                                            },
                                            "Text": {
                                                "val": "- Complete Integrated Technology Demonstration (ITD) at NNSS to defeat credible and threat-based scenarios; continue with transition into several related projects\/planned events through FY 2017.\n- Begin Directorate ITD testing at WSMR prioritizing requirements to support reduced architectural and engineering design efforts and construction of future CWMD test beds.\n- Support development and demonstration of Transatlantic Collaboration Biological Resiliency Demo (TACBRD), a DoD capability to shape interagency approach to counter a wide area biological event impacting U.S. and partner nations’ key civilian\/military infrastructure.\n- Begin research of Biological Reaerolization in conjunction with DoD\/DHS\/EPA to help develop precise measurement technologies for residual biological pathogens reentering air after settling.\n- Conduct intergovernmental test program between DTRA and Defence Research and Development Canada (DRDC), Biological Agent Defeat testing.\n- Begin testing in support of “Speed of Sound” nuclear forensic program estimated to continue through FY 2015\n- Maintain current version of VOIP system that can transfer classified and unclassified data, voice communications, video, etc. to support test program execution.\n- Maintain existing test infrastructure in current configuration to support revitalized Weapons Effects Phenomenology Program supporting DTRA test programs; make improvements through funding provided by external program managers.\n- Improve existing test infrastructure and test articles or construct new test articles to support DTRA Detection Technology Program through funding provided by external program managers.\n- Conduct testing in support of Treaty Verification Technologies Program and Source Physics Experiments to support Comprehensive Test Ban Treaty Initiatives, New START Warhead Verification, and detection and verification of Biological and Chemical Weapons.\n- Continue support of Weapons of Mass Destruction sensor testing at the TEAMS to detect and prevent nuclear grade material from entering the U.S., U.S. territories, and Allied Nations through rail, ship, and air ports with funding provided by external program managers.\n- Continue IBRD testing in conjunction with DoD and DHS to reduce the time and resources necessary to recover and restore wide urban areas, military installations, and critical infrastructure, following a biological incident.\n- Dependent on external program manager funding, continue testing CBRNE sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking targets used for WMD activities.\n- Complete WACS testing that is designed to meet U.S. Forces Korea’s requirement of an “all-in-one” CBRN sensor system for post-strike assessment (Battle Damage Assessment) of suspected WMD facilities and mobile time-sensitive targets.\n- Continue nuclear detection and forensics testing to prevent weapons grade material\/dirty bombs from entering the U.S., U.S. territories, and Allied Nations through funding provided by external program managers.\n- Continue environmental remediation and compliance activities at the NNSS, DPG, WSMR, and KAFB in accordance with EPA, Safety, and Environmental guidelines. Defer major demolition and restoration efforts of major test articles while ensuring they are safely closed and sealed at minimal acceptable standards.\n- Maintain the current version of a Cost Analysis Tool for Test Sites database to develop Rough Order of Magnitude estimates for different types of tests as well as different test beds.\n- Continue tunnel work detection testing at NNSS for the Customs and Border Patrol to be able to detect tunnel work or tunnels along northern and southern borders of CONUS.\n- Maintain current inventory of infrastructure and instrumentation, extending life-cycle of these items as long as possible to ensure test beds meet customers’ advanced technology testing needs.\n- Document, prioritize, and support test infrastructure requirements; pass on test support and execution costs to external program managers.\n- Close the Large Blast Thermal Simulator eliminating ability to execute test requirements on these nuclear effects.\n- Evaluate and determine courses of action for current usefulness of remaining existing nuclear simulators within management control of Test Support Division."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "28\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention, and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.790"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Number of tests executed safely, i.e., no loss of life or limb, no unintentional significant damage of property.\nFY11 – No safety issues\/incidents during scheduled test events.\n\nNumber of tests that are evaluated through the milestone review process.\n100% of all tests completing scheduled milestones.\n\nNumber of tests that undergo environmental assessment consistent with existing Environmental Impact Statements.\nAll test executed undergo environmental review consistent with existing Environmental Impact Statements.\nFY 11 - 123 Tests"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RT"
                    },
                    "ProjectTitle": {
                        "val": "Target Assessment Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.845"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "For some hard and deeply buried targets, physical destruction is neither possible, nor practical, with current conventional weapons and employment techniques.  It may be possible, however, to achieve target defeat objectives by denying or disrupting the mission or function of the target facility.  Functional defeat, however, requires more information, more detailed analysis of the target.  The functional defeat process includes finding and identifying a facility, characterizing its function and physical layout, determining its vulnerabilities to available weapons, planning and executing an attack, assessing damage, and if necessary, suppressing reconstitution efforts and re-attacking the facility.  Target Assessment Technologies provides the Combatant Commands and the Intelligence Community with technologies and processes to find and characterize Weapons of Mass Destruction (WMD) targets located in underground facilities and then, in near-real-time, assess the results of attacks against those targets.  Overall objectives are to develop new methodologies, processes and technologies for detecting, locating, identifying, physically and functionally characterizing, modeling, and assessing new and existing hard and deeply buried targets to support either physical or functional defeat.  Extending this activity and applying these processes to Weapons of Mass Destruction (WMD) target characterization and threat analysis presents the next technical challenge.  The Target Assessment Technologies project now consists of three subordinate and related activities: (1) Targeting and Intelligence Community Technology Development; (2) Find, Characterize, Assess Technology Development; and (3) Counter-WMD Analysis Cell (C-WAC) Technology Support.  Follow-on funding for this project can be found in the Proliferation Prevention and Defeat; 0603160BR, budget exhibit."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RT - Target Assessment Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RT provides the Combatant Commands and the Intelligence Community with technologies and processes to find and characterize Weapons of Mass Destruction (WMD) targets located in underground facilities and then, in near-real-time, assess the results of attacks against those targets.  Follow-on funding for this project can be found in the Proliferation Prevention and Defeat; 0603160BR, budget exhibit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.845"
                                            },
                                            "Text": {
                                                "val": "- Initiated development of additional universal rock models (URM) for specific types of rock for use in characterizing the geological properties associated with underground targets.\n- Developed new Standard Operating Procedures (SOPs) for “Quicklooks” and characterizations of foreign WMD developments for use in support of crisis operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "28\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention, and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.047"
                                        },
                                        "CurrentYear": {
                                            "val": "33.493"
                                        },
                                        "BudgetYearOne": {
                                            "val": "31.298"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "31.298"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "31.883"
                                        },
                                        "BudgetYearThree": {
                                            "val": "32.743"
                                        },
                                        "BudgetYearFour": {
                                            "val": "33.413"
                                        },
                                        "BudgetYearFive": {
                                            "val": "34.139"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Complete development of three additional Universal Rock Models (URMs) for use in Underground Targeting and Analysis System (UTAS) target characterizations.\n\nImprove Counter-WMD Analysis Cell capabilities and processes for the analysis and assessment of foreign development of WMD."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "Fundamental Research for Combating WMD"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.961"
                        },
                        "CurrentYear": {
                            "val": "8.631"
                        },
                        "BudgetYearOne": {
                            "val": "2.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.516"
                        },
                        "BudgetYearThree": {
                            "val": "0.567"
                        },
                        "BudgetYearFour": {
                            "val": "0.549"
                        },
                        "BudgetYearFive": {
                            "val": "0.549"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Fundamental Research for Combating WMD project (1) conducts early applied science research with an emphasis on maturing emerging science into Counter WMD technologies; (2) Supports a partnership of six universities with connections to over 20 additional universities, and (3) conducts strategic studies in support of DoD Combating WMD issues.  The advancement of technology and science into applied technology development effort focus upon increasing the stability and utility of mid-to-long term, moderate risk but high payoff science, and emerging technologies for transition to other Defense Threat Reduction Agency (DTRA) applied technology programs.  This effort serves as the bridge between the bench scientist and the applied technologist. The university partnership provides innovative research, scientific experts, post-doctoral fellowships, and scholarships to US students directly supporting cutting edge science, international cooperation programs and the next generation workforce. The strategic studies address challenges in reducing the threat from WMD based on an assessment of the future national security environment. They also develop and maintain an evolving analytical vision of necessary and sufficient capabilities to protect the U.S. and allied forces and citizens from nuclear, biological, and chemical attack and identify gaps in these capabilities and initiate programs to fill them.  \n\nThe decrease from FY 2012 to FY 2013 is predominately due to the elimination of University Strategic Partnerships activities, reduced efforts in Combating Weapons of Mass Destruction – Terrorism (CWMD-T), and the transfer of advanced systems concepts funding from project RU – Fundamental research for combating WMD to project RA – Systems Engineering and Innovation to perform strategic research and dialogues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RU: Fundamental Research for Combating WMD"
                                    },
                                    "Description": {
                                        "val": "Project RU provides (1) strategic studies to support DoD, (2) Decision support tools and analysis to support combating WMD research and development investments, and (3) early applied research for technology development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.961"
                                            },
                                            "Text": {
                                                "val": "-  Identified 38 of 112 basic science projects as candidate Science and Technology research and development projects to appropriate long-term sponsors for concept\/design validation, prototype fabrication, testing, and fielding.\n-  Conducted eleven active research projects—Two major accomplishments.\t\n\t-- Developed and transitioned initial nuclear materials detection capabilities, one for land use and one for underwater unmanned vehicles—potential pre-detonation nuclear weapon detection systems.  \n\t-- Developed new carbon-based transistor—potential as basis for next generation radiation-hardened electronics and for space sensors.\n-  Continued to exercise the test bed to assess promising technologies to quantify and mitigate large area nuclear effects on systems, networks and equipment.\n-  Continued “bridging” projects for early applied development of combating WMD technologies.\n-  Continued to provide technical expertise and advice to generate the new basic research topics in support of the semi-annual solicitation.\n-  Continued the mentoring, sponsorship, and education of the “Next Generation” of mission-critical scientific, technical and engineering expertise.\n-- Sponsored 17 U.S. student theses this past year—historically about 60% transition to US government or private sector positions supporting US government.  \n\t-- Provided 6 Post-doctoral fellows to DTRA—one transitioned to government and one transitioned to a DoD contractor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.631"
                                            },
                                            "Text": {
                                                "val": "-  Initiate expanded Fundamental Research Broad Agency Announcement (BAA) toward continuing Academic Partnerships as a core DTRA capability, as current University Strategic Partnership (USP) contract comes to its monetary close after 10 years.\n-  Identify and transition all suitable investigatory Science and Technology research and development projects to appropriate long-term sponsors for concept\/design validation, prototype fabrication, testing, and fielding.\n-  Identify and conduct strategic studies addressing challenges in reducing the threat from WMD.\n-  Continue “bridging” projects for early applied development of combating WMD technologies.\n-  Continue to provide technical expertise and advice to generate the new basic research topics in support of the semi-annual solicitation.\n-  Continue the mentoring, sponsorship, and education of the “Next Generation” of mission-critical scientific, technical and engineering expertise."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate close out of the current University Strategic Partnership (USP) contract after 10 years of activities.\n-  Close out the remainder of the eleven active research projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "1\/0601000BR"
                                    },
                                    "Title": {
                                        "val": "DTRA Basic Research Initiative"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "46.107"
                                        },
                                        "CurrentYear": {
                                            "val": "47.737"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.071"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.071"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "45.493"
                                        },
                                        "BudgetYearThree": {
                                            "val": "45.925"
                                        },
                                        "BudgetYearFour": {
                                            "val": "46.757"
                                        },
                                        "BudgetYearFive": {
                                            "val": "47.602"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured via a combination of statistics including the number of publications generated, number of students trained in sciences and engineering supporting DoD’s educational goals, number of research organizations participating, and percentage of participating universities on the US News & World Report “Best Colleges” list.\n\n\nPublication of an annual basic research technical and external programmatic review report.\n\nEach study\/project will commence within 3 months of customer request and results delivered within 3 months of completion."
                        }
                    }
                }
            ]
        }
    }
}