{
    "id": "fc5bfacf83567261ba7ea8da888fe1f7a6f5d718",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA3_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603008A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "36"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "48.698"
            },
            "CurrentYear": {
                "val": "69.852"
            },
            "BudgetYearOne": {
                "val": "50.661"
            },
            "BudgetYearOneBase": {
                "val": "50.661"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "52.353"
            },
            "BudgetYearThree": {
                "val": "54.335"
            },
            "BudgetYearFour": {
                "val": "53.590"
            },
            "BudgetYearFive": {
                "val": "54.747"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates technologies to address the seamless integrated tactical communications challenge with distributed, secure, mobile, wireless, and self-organizing communications networks that will operate reliably in diverse and complex terrains, in all environments. Efforts demonstrate seamlessly integrated communications and information security technologies across all network tiers, ranging from unattended networks and sensors through maneuver elements using airborne and space assets. Project TR1 investigates and leverages antennas; wireless networking devices, protocols, and software; information assurance techniques and software; and network operations tools and techniques; and combines these and other technology options in a series of Command, Control, Communications, and Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) On-The-Move (OTM) demonstrations to measure their potential battlefield effectiveness. Project TR2 researches information security devices, techniques and software to protect tactical wireless networks against modern network attacks; and improves collaborative software, techniques and devices for information sharing between battlefield functional communities.\n\nWork in this PE is complimentary of PE 0602782A (Command, Control, Communications Technology), and fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), PE 0602783 (Computer and Software Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "50.359"
                },
                "CurrentYear": {
                    "val": "57.963"
                },
                "BudgetYearOne": {
                    "val": "54.882"
                },
                "BudgetYearOneBase": {
                    "val": "54.882"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.698"
                },
                "CurrentYear": {
                    "val": "69.852"
                },
                "BudgetYearOne": {
                    "val": "50.661"
                },
                "BudgetYearOneBase": {
                    "val": "50.661"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.661"
                },
                "CurrentYear": {
                    "val": "11.889"
                },
                "BudgetYearOne": {
                    "val": "-4.221"
                },
                "BudgetYearOneBase": {
                    "val": "-4.221"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "12.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.256"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.221"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.221"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.405"
                                },
                                "CurrentYear": {
                                    "val": "-0.111"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "TR1"
                    },
                    "ProjectTitle": {
                        "val": "TAC C4 TECHNOLOGY INT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.578"
                        },
                        "CurrentYear": {
                            "val": "36.615"
                        },
                        "BudgetYearOne": {
                            "val": "30.939"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.939"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "32.266"
                        },
                        "BudgetYearThree": {
                            "val": "33.712"
                        },
                        "BudgetYearFour": {
                            "val": "32.766"
                        },
                        "BudgetYearFive": {
                            "val": "33.582"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates key communications and mobile networking technologies, such as antennas, radio components, networking software and novel techniques that provide secure, reliable, mobile network solutions that function in complex and diverse terrains. This project concentrates on three major goals: to provide a series of technology demonstrations of new and emerging Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) technology enabled capabilities to significantly reduce risk associated with the network-of-networks concept; to provide critical improvements in the ability to communicate and move large amounts of information across the force structure in a seamless, integrated manner supporting the Army's highly mobile manned and unmanned force structure; and to assess the Technology Readiness Level (TRL) of emerging network technologies in an operationally relevant environment. \n\nThis project supports Army science and technology efforts in the Command, Control and Communications, Ground, Air and Soldier portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antenna Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates low cost, power efficient, antenna technologies for terrestrial and tactical satellite ground terminals. The focus is to reduce the visual signature and cost of antennas and reduce the number of antennas required on platforms by proving the capability to transmit and receive on multiple frequency bands, such as X\/K\/KA\/Q for SATCOM and ultra-high frequency\/very-high frequency (UHF\/VHF) and L for terrestrial communications on the same antennas. Work accomplished under PE 0602782A\/project H92 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.962"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated K\/Ka\/Q band low profile electronically steered SATCOM antenna components and aperture with integrated drive and tracking system; demonstrated BFT SATCOM antenna, modem architecture and preliminary network design; matured conformal and embedded antenna design; conducted sub-system compatibility testing for a selected platform using electromagnetic modeling and simulation (M&S); and developed mockup brassboard for validation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.276"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and refine embedded armor antennas; fabricate internet protocol based antenna feed demonstrators; integrate antenna apertures and feed systems into vehicle armor; support the Tank and Automotive Research Development and Engineering Center during ballistic assessments of embedded armor antennas; demonstrate integrated K\/Ka\/Q band low profile electronically steered SATCOM antenna; integrate single package Ka\/Q band integrated power amplifier (PA) into the K\/Ka\/Q band SATCOM antenna; refine BFT SATCOM antenna network concepts and demonstrate medium scale performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.513"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.513"
                                            },
                                            "Text": {
                                                "val": "Will fabricate and demonstrate multifunctional armor-embedded and conformal antennas that support both communications and counter IED missions by allowing multiple radios and jammers to use a single integrated antenna system; demonstrate K\/Ka\/Q band antenna integrated with the Ka\/Q band PA in a relevant environment; design and fabricate artificial impedance surfaces to cover unmanned aerial system (UAS) components such as rudders, stabilizers and struts to mitigate radio frequency blockage of antennas mounted on the UAS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applied Commercial Communications and Information Networking technologies, formerly known as Applied Communications and Information Networking (ACIN)"
                                    },
                                    "Description": {
                                        "val": "This effort adapts, matures and assesses emerging commercially available wireless, networked communications and antenna technologies for military use. Work accomplished under PE 0602270A\/project 906 and PE 0603270A\/K15 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.367"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Adapted and assessed emerging cognitive and commercial networking technologies for wireless networks including cognitive radios and cross layer network protocols; investigated associated communications architectures and hardware components; developed digitized SATCOM technologies to reduce size, weight, power and cost (SWAP-C) for strategic ground terminals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.943"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess emerging commercial wireless communications technologies for suitability in military wireless communications networks; adapt, mature and demonstrate commercial wireless network operations control and visualization solutions in Army tactical environments; assess emerging 4G commercial cellular technologies (e.g., long term evolution) for future adaptation to military networks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR On-The-Move (OTM)"
                                    },
                                    "Description": {
                                        "val": "This effort provides a venue for the demonstration of new and emerging C4ISR technology-enabled capabilities. This venue performs risk mitigation and candidate assessment\/selection for Army Network Integration Exercise (NIE) events by assessing the TRL of Army science and technology (S&T) and best of Industry efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.857"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed the capability, functionality, and performance of network integrated architectures and emerging capabilities that support the Army Brigade Combat Team Modernization Plan; assessed the FY11 programmed increments of Joint Tactical Radio System (JTRS) for mounted and dismounted Soldiers and platforms, unmanned ground and aerial sensors, and intelligent munitions systems in support of the Army Brigade Combat Team Modernization Plan; assessed Warfighter Information Network Tactical (WIN-T) functionality, including enhanced quality of service architecture, information assurance solutions to enable network security across a wide area network using multiple encryption devices with minimal loss of data, and selected network operations management functions; assessed the TRL of Army S&T efforts maturing in the FY11 timeframe in an operationally relevant environment to facilitate technology transition; continued to support research and development (R&D) of capability sets and accelerate such capabilities to enhance the current force."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.552"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess the capability, functionality, and performance of network integrated architectures and emerging capabilities that support the Army Brigade Combat Team Modernization Plan and Network Modernization Strategy; assess the FY12 programmed increments of JTRS for mounted and dismounted Soldiers and platforms, unmanned ground and aerial sensors, and intelligent munitions systems in support of the Army Brigade Combat Team Modernization Plan; assess WIN-T increment 2 and 3 functionality including enhanced quality of service architecture, information assurance solutions to enable network security across a wide area network using multiple encryption devices with minimal loss of data, and selected network operations management functions; assess the TRL of Army S&T efforts maturing in the FY12 timeframe in a operationally relevant environment to facilitate technology transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.097"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.097"
                                            },
                                            "Text": {
                                                "val": "Will assess the capability, functionality, and performance of network integrated architectures and emerging capabilities that support the Army Brigade Combat Team Modernization Plan and Network Modernization Strategy; finalize the evaluation of Capability Sets 13\/14, hybrid\/bridging architectures and conduct initial assessments of Capability Sets 15\/16 and the associated programmed increments of JTRS (Mounted & Dismounted), WIN-T Inc 3, and NETT Warrior programs of record; provide a system of systems environment\/venue to evaluate technical progress, assess the next generation of technologies, facilitate technology transition, and perform risk mitigation and candidate assessment\/selection for future Army NIE events by assessing the TRL of Army S&T and best of Industry efforts maturing in the FY13 timeframe; continue to support R&D of enabling Future Force capabilities and accelerate such capabilities to enhance and modernize the current force."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR Network Mining"
                                    },
                                    "Description": {
                                        "val": "This effort matures data mining that provides the link between the transactions to be analyzed and analytical systems on large-scale information technology. Data mining consists of five major elements: 1. extract, transform, and load transaction data onto the data warehouse system; 2. store and manage the data in a multidimensional database system; 3. provide data access; 4. analyze the data using application software; and 5. present the data in a useful format."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.163"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Applied network mining software to analyze emerging protocols and standards for use over military networks; assess commercial technologies for potential transition into systems and develop architecture to decrease stovepipe and proprietary network implementations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.517"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Apply network mining software to determine how a military software applications (Apps) store can be efficiently deployed on the network; code and assess advanced spectrum management software tools to facilitate network operations where various types of networks converge using multiple transmission media."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wireless Mobile Networking, formerly known as Cognitive Networking"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates components, software, algorithms and services that enable wireless networks to operate more efficiently in both the use of RF spectrum and networking resources for terrestrial and SATCOM systems. Efforts include composing and coding algorithms and protocols that sense network and spectrum conditions, and automatically adapt network node behaviors to make more efficient use of available resources. Efforts also include adapting commercial wireless technology for use in the tactical environment. Work accomplished under PE 0602782A\/project H92 and 0603008A TR2 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.248"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured the cognitive network tools developed under PE 0602782A\/project H92 to assess and analyze networks with and without cognitive capabilities; adapted and matured commercial RF cellular based technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.976"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature all-digital strategic ground terminal architecture to enable improved tactical responsiveness to changing network needs and enable SATCOM to be responsive to cognitive ground networks; mature digital transmitter and receiver interfaces and subsystem integration; mature and demonstrate all-digital receiver; demonstrate configurable baseband processor for increased SATCOM throughput and integrate with digital receiver for proof of concept; define requirements and architecture for digital transmitter; demonstrate government off-the-shelf (GOTS) applique to enable operation of commercial wireless third generation (3G) communications in Army tactical environments with the addition of WiFi mesh, multicast routing and automated frequency, sensing and control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.954"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.954"
                                            },
                                            "Text": {
                                                "val": "Will mature, integrate and assess all-digital strategic ground terminal, consisting of digital transmitter and receiver interfaces, all-digital receiver and baseband signal processor; fabricate all-digital transmitter; integrate and mature GOTS applique with commercial-off-the-shelf (COTS) 3G network software applications and algorithms to apply enhanced, military grade security and network management functionality that enables tactical use of COTS hand held computing devices such as smart phones and tablets, and enables the Soldier to manage these devices as an edge extension for voice, data and video on existing and emerging tactical networks; demonstrate militarized smart devices in a field relevant environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Operations (NetOps)"
                                    },
                                    "Description": {
                                        "val": "This effort matures network operations tools (network management, information dissemination management and cyber security) to simplify the planning, management and troubleshooting of complex tactical communications networks. Focus is on network visualization, incident correlation and decision aids that assist soldiers with managing the complexity inherent with wireless, On-the-Move communications networks."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.351"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate interoperability among disparate NetOps tools and technologies, leveraging existing GOTS\/COTS tools being used in the field; take advantage of NetOps tools that make sense while reducing the overall number of tools to significantly improve the network planning, management, configuring and monitoring of tactical networks; research and improve tactical NetOps visualization capabilities and techniques based on how the Warfighter can best interpret the information; consolidate and demonstrate NetOps tools (network management, information assurance, information dissemination management and signals management) into an intuitive multi-touch (touch screen) user environment to produce a more collaborative and centralized NetOps management capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.375"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.375"
                                            },
                                            "Text": {
                                                "val": "Will mature and code software that integrates network visualization tools on touch-screen environments with network information correlation tools that enhance interoperability among disparate NetOps tools; assess the accuracy and usability of visualization and correlation tools in the laboratory and through user feedback, and modify the software to improve the effectiveness of the new tool set; mature a software engine that translates network information sources to any format for use by network correlation tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wireless Information Assurance (IA)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates software to protect wireless tactical networks against computer network attacks with an emphasis on defending against attack methods not previously seen. Work accomplished under PE 0602782A\/project H92 and PE 0603008A\/project TR2 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and matured the mission generation engine to allow for dynamic reconfiguration of a subset of network parameters (e.g., topology) based on mission specifications; demonstrated computer network protection using mission to policy translation engine and adaptive middleware, tactical public key infrastructure, and cross domain solutions in a relevant environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TR2"
                    },
                    "ProjectTitle": {
                        "val": "Secure Tactical Information Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.120"
                        },
                        "CurrentYear": {
                            "val": "21.256"
                        },
                        "BudgetYearOne": {
                            "val": "19.722"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.722"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "20.087"
                        },
                        "BudgetYearThree": {
                            "val": "20.623"
                        },
                        "BudgetYearFour": {
                            "val": "20.824"
                        },
                        "BudgetYearFive": {
                            "val": "21.165"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates software, algorithms and services with enhanced capabilities to analyze, plan, execute, and assess operations, at tactical and strategic levels, by integrating decision support and intelligence based software to provide a more comprehensive understanding of adversaries and environments. Efforts mature and demonstrate collaboration and decision support software to potentially improve mission execution success by more tightly coupling operations and intelligence functions, and better facilitate collaboration between individuals and teams. This project codes, optimizes and demonstrates software-based tactical cross domain solutions that enable operations and intelligence information sharing across security domains to replace current application-specific hardware solutions. This project also codes, optimizes and demonstrates cyber security software to proactively defend wireless networks against cyber attack using nontraditional methodologies.\n\nThis project supports Army science and technology efforts in the Command, Control and Communications, Ground, Air and Soldier portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command, Communications (RDECOM)-Electronics Research Development and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Collaborative Battle Management"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates mission command (MC) software to improve sharing and understanding of data between the intelligence and operations communities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.737"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported limited distribution of the universal collaboration bridge (UCB); matured and demonstrated software (SW) to associate Intel requirements, Geospacial (Geo) data needs and collection opportunities with mission tasks for Intel and Battle Command (BC) and allow Warfighter modification of system information to adapt to dynamic enemy tactics; matured Integrated Intelligence (Intel)\/Operations (Ops) services for collaboration\/visualization across SW environments; demonstrated integrated Intel\/Ops decision support tools for planning and execution, priority information requests management, and collection\/sensor management; matured and demonstrated multi-touch (MT) based mission collaboration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.973"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop collaboration services to include browser-based components for visualization of strategic battle command data feeds and communications status; develop SW environment permitting applications to execute on different operating systems (e.g., Windows, LINUX); complete MT-based mission collaboration SW including information link analysis tools and Tactical Ground Reporting System (TiGR)-compatible MT display; develop and mature general device-independent MT application framework; complete Geo terrain analytical tools and transition these efforts to PM Battle Command and PM Commercial Joint Mapping Toolkit."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.563"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.563"
                                            },
                                            "Text": {
                                                "val": "Will code, assess and demonstrate collaboration and interoperability services such as the ability to interface Joint Battle Command Platform (JBC-P) vehicle VMF chat with DISA-standard XMPP text chat in support of the Army Common Operating Environment; fabricate\/code and assess multi-touch MC applications such as an electronic sand table that streamline and improve the ability to plan, wargame and monitor Army missions; code, assess and integrate software information assurance techniques into MC software to reduce vulnerabilities; mature and validate software design techniques that present information to users more intuitively and easier to understand to help cognitively unburden the Soldier using MC applications at all echelons."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Cross Domain Solutions"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates service oriented architecture (SOA) cross domain solutions (CDS) to enable assured sharing of information across multiple security domains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.383"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated one-way position location information (PLI) transfer from unclassified to classified networks, and further matured guard to process two-way digital data flow; matured and demonstrated a general tool to be used by any program to identify malicious code in a developed application or on the network."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.824"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improve the one-way PLI data transfer and two-way digital data flow cross-domain software, integrate it with a military-hardened, tactical (small size, weight, and power) hardware platform complete with the necessary embedded security features to undergo NSA security certification and accreditation and demonstrate it on Ground Soldier equipment in a field environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Assurance"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates cyber security technologies that create new methods for proactively defending wireless networks against cyber attack using nontraditional methodologies. Work being performed under PE \/project 0602782\/H92 and PE\/project 0603008 TR1 complement this effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.459"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate improved detection and automated response capabilities into Intrusion Detection System (IDS) that resides on tactical host platforms, providing maximum protection to the host system with minimal resource usage; design an IDS response component that collaborates with an Information Operations (IO) response component to use intelligence threat information to ascertain exactly who or what is causing the cyber threat; integrate the IDS agents monitoring host platforms and the network into a common architecture; evaluate the IDS components in a lab environment to ascertain the maturity of the functionality of each component of the architecture; analyze and assess models of cyber attack behaviors to determine adversary objectives, attack vectors, and classes of attack to effect computer network defense (CND); code and integrate a cyber toolkit for CND including dynamic protocols, a dynamic decentralized network remapping framework, and obfuscation (confusion) software for masking network role, system identity, and cyber security protection from potential attackers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.159"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.159"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate improved detection and automated response software and algorithms that reside on tactical host platforms and provide maximum protection to the host system against cyber threats with minimal platform resource usage; code and demonstrate an IDS response component that collaborates with an IO response component to ascertain the source of a network attack; demonstrate IDS software agents operating on host platforms and across the network using a common network protection architecture; demonstrate a cyber toolkit for CND including dynamic protocols, a dynamic decentralized network remapping framework and software for concealing network role and system identity for cyber security protection from potential attackers; adapt and demonstrate military grade security for use on commercial smart devices like smartphones and tablets; optimize and implement security software standards on military networks to provide a trustworthy operating environment for commercial smart devices; code and mature automated analysis functionalities to assure software is clean of malicious content and vulnerabilities introduced by poor software coding techniques; validate the feasibility of employing network morphing software that dynamically modifies aspects of networks in order to prevent potential cyber attackers from accurately mapping networks in preparation for a cyber attack."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TR8"
                    },
                    "ProjectTitle": {
                        "val": "C3 DEMONSTRATIONS (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "11.981"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for C3 Demonstrations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security\/Information Assurance Research"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cyber Security\/Information Assurance Research"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}