{
    "id": "ff1ac04d726ba121a465be11f38aa6dd2a1a1c93",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V3A_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0101313F"
        },
        "ProgramElementTitle": {
            "val": "STRAT WAR PLANNING SYS - USSTRATCOM"
        },
        "R1LineItemNumber": {
            "val": "121"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "30.133"
            },
            "CurrentYear": {
                "val": "22.791"
            },
            "BudgetYearOne": {
                "val": "30.889"
            },
            "BudgetYearOneBase": {
                "val": "30.889"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "11.920"
            },
            "BudgetYearThree": {
                "val": "7.424"
            },
            "BudgetYearFour": {
                "val": "5.735"
            },
            "BudgetYearFive": {
                "val": "3.568"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of USSTRATCOM is to establish and provide full-spectrum global strike, coordinated space and information operations capabilities to meet both deterrent and decisive national security objectives, and to provide operational space support, integrated missile defense, Global Command Control Communications and Computers Intelligence Surveillance and Reconnaissance (C4ISR), and specialized planning expertise to the joint warfighter.  This mission has been defined by the 2002 Unified Command Plan (UCP) changes 1 and 2.  To enable completion of these missions, USSTRATCOM is modernizing the Integrated Strategic Planning and Analysis Network (ISPAN) (formerly known as SWPS), developing information systems and techniques to counter and conduct Navigation Warfare (NAVWAR) and establishing a unified national architecture integrating disparate Missile Warning\/Missile Defense (MW\/MD) systems into a single Internet Protocol (IP)-based system known as the Global Sensor Integrated Network (GSIN) to provide redundant and unambiguous MW\/MD data to national leadership.  When the ISPAN modernization is complete the system will support the warfighter in both deliberate and adaptive planning environments while allowing the National Command Authorities to employ the full spectrum of kinetic and non-kinetic weapons.  The ISPAN system will continue to evolve as weapon systems are matured, new systems are developed, and the threat changes, particularly in the area of worldwide proliferation of Weapons of Mass Destruction (WMD).   \n\nNavigation Warfare (NAVWAR) is a warfighting application of electronic warfare (EW), Information Operations (IO) and space control (SC) employing various techniques and technologies to negate or prevent hostile use of positioning, navigation, and timing (PNT) information and protect unimpeded use of PNT information by U.S., Allied, and Coalition Forces while not unduly disrupting peaceful use outside an area of operation.  The Joint Navigation Warfare Center (JNWC) was established to integrate and coordinate NAVWAR PNT capabilities across the mission areas of intelligence, surveillance, reconnaissance, information operations, electronic warfare, and space control.  The JNWC is also commissioned to integrate NAVWAR into space operations and assists the warfighter with subject matter expertise to “operationalize” NAVWAR, encouraging the NAVWAR view that the Global Positioning System is a taskable weapons system in addition to being a worldwide PNT service.  The JNWC establishes and maintains the Department’s premier basis of NAVWAR expertise, and provides subject matter expertise and knowledge support to warfighters, Department decision makers, the Federal Interagency (the Department of Homeland Security and other civil agencies concerned with the Critical National Infrastructure), and the coalition through testing and evaluation; modeling, simulation and analysis; and exercise and training support.  \n\nThe Nation's strategic C2, sensors and mission planning programs can not rapidly exchange information across multiple missions, creating ambiguity that delays time critical national C2 decision making processes.  GSIN establishes a unified national architecture integrating disparate MW\/MD systems into a single IP-based system providing redundant and unambiguous MW\/MD data to national leadership.  GSIN nets together all sensors, from tactical to strategic, including the Nation's most modern and capable assets - taking advantage of their larger numbers, improved algorithms, mobility and forward deployment to provide earlier cross-cueing and expanded decision space when every second counts.  GSIN will permit an IP-based User Defined Operational Picture (UDOP)to augment voice conferencing and rapidly build a single, unambiguous missile event picture allowing real-time senior collaboration for nuclear C2 and improved senior leader situational awareness (SA) and decision-making. \n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "28.441"
                },
                "CurrentYear": {
                    "val": "23.072"
                },
                "BudgetYearOne": {
                    "val": "22.650"
                },
                "BudgetYearOneBase": {
                    "val": "22.650"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "30.133"
                },
                "CurrentYear": {
                    "val": "22.791"
                },
                "BudgetYearOne": {
                    "val": "30.889"
                },
                "BudgetYearOneBase": {
                    "val": "30.889"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.692"
                },
                "CurrentYear": {
                    "val": "-0.281"
                },
                "BudgetYearOne": {
                    "val": "8.239"
                },
                "BudgetYearOneBase": {
                    "val": "8.239"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.281"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.967"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.814"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.461"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.239"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.239"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11 increased $2.967M for Global Sensor Integrated Network (GSIN).\n\nFY11 Congressional General Reduction of 0.461M in Other Adjustment row.\n\nFY12 Congressional General Reduction (FFRDC, Sec. 8023) of 0.281M.\n\n\nFY13 increased a total of $8.239M based on a reduction of $9.666M for Joint Navigation Warfare Center, an increase of $10.7M for Integrated Strategic Planning and Analysis Network Increment 4, and an increase of $7.205M for GSIN.\n\nIn FY 2013, 675282, Joint Navigation Warfare Center, efforts were transferred to PE 0105921F, Service Support to STRATCOM Space Activities (O&M)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675059"
                    },
                    "ProjectTitle": {
                        "val": "Strategic War Planning System (SWPS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.056"
                        },
                        "CurrentYear": {
                            "val": "10.118"
                        },
                        "BudgetYearOne": {
                            "val": "21.155"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.155"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission of USSTRATCOM is to establish and provide full-spectrum global strike, coordinated space and information operations capabilities to meet both deterrent and decisive national security objectives, and to provide operational space support, integrated missile defense, Global Command Control Communications and Computers Intelligence Surveillance and Reconnaissance (C4ISR), and specialized planning expertise to the joint warfighter. This mission has been defined by the 2002 Unified Command Plan (UCP) changes 1 and 2. To enable these missions, the Integrated Strategic Planning and Analysis Network (ISPAN) (formerly known as SWPS) must be capable of both deliberate and adaptive planning employing the full spectrum of kinetic and non-kinetic weapons. The planning system will continue to evolve as weapon systems are matured, new systems are developed, and the threat changes, particularly in the area of worldwide proliferation of Weapons of Mass Destruction (WMD).\n\nThe ISPAN modernization program includes initiation of Course of Action (COA) Development as a service to the DoD enterprise, workflow and decision support development, Combatant Commander (COCOM) Collaboration, User Defined Operational Picture (UDOP)), conventional mission planning integration, and Mission Planning Analysis System (MPAS) maintenance and modernization. This includes software coding, integration of multiple internal and external planning applications, as well as developmental and early operational test activities. ISPAN also includes automated data processing equipment (ADPE), software, facilities support, manpower, and training to support the mission objectives of ISPAN, associated deployable and distributed data processing nodes, and subsidiary systems. Activities also include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ISPAN Increment 2 Modernization"
                                    },
                                    "Description": {
                                        "val": "Funds the next increment of planning tools for the ISPAN Collaborative Information Environment (CIE).  Increment 2 continues by building on capabilities delivered in Block 1.  Increment 2 will develop advanced decision support capabilities for senior leader situational awareness through enhanced data analysis and visualization, and expand development of services and operational nodes to support Global Information Grid (GIG) Enterprise services and distributed operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.056"
                                            },
                                            "Text": {
                                                "val": "Completed development activities for CIE and Net-centricity and enhanced planning capabilities.  Developed advanced decision support capabilities for senior leader situational awareness through enhanced data analysis and visualization, and expanded development\nof services and operational nodes to support GIG Enterprise services and distributed operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.118"
                                            },
                                            "Text": {
                                                "val": "Continue Increment 2 Modernization development effort and enhancing planned \ncapabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Text": {
                                                "val": "Continues Increment 2 Modernization development effort and working delinquency reports."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Increment 3 Modernization"
                                    },
                                    "Description": {
                                        "val": "Funds pre-Milestone B risk reduction activities for the next increment of planning tools for the ISPAN Collaborative Information Environment (CIE).  Builds on the capabilities and technology developed in Block 1 and Increment 2, to achieve a more complete implementation of the joint operation planning process that includes collaborative campaign\/contingency planning and integrated COA development to meet the desired crisis action and time sensitive planning timelines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.655"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.655"
                                            },
                                            "Text": {
                                                "val": "Funds pre-Milestone B risk reduction activities for the next increment of planning tools for the ISPAN CIE. Builds on the capabilities and technology developed in Block 1 and Increment 2, to achieve a more complete implementation of the joint operation planning process that includes collaborative campaign\/contingency planning and integrated COA development to meet the desired crisis action and time sensitive planning timelines."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ISPAN Increment 4 Modernization"
                                    },
                                    "Description": {
                                        "val": "ISPAN Increment 4 MPAS Modernization provides a more robust strategic war planning capability with a reduced footprint, faster planning timelines, enhanced analysis and plan optimization, and the ability to incorporate new air vehicle capabilities in the future. ISPAN Inc 4 is an evolution of the Block 1 baseline system using proven technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.700"
                                            },
                                            "Text": {
                                                "val": "Funds pre-Milestone B risk reduction activities including studies and analyses to identify the best approach to increase system robustness, enhance plan optimization and improve planning timelines."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF, PE 0101313F, Strategic War..."
                                    },
                                    "Title": {
                                        "val": "-"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.790"
                                        },
                                        "CurrentYear": {
                                            "val": "13.240"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.197"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.197"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.863"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.037"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.192"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.289"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "ISPAN will develop and modernize strategic planning tools for the combatant commanders using an evolutionary acquisition strategy with development contracts that are negotiated and awarded in a competitive environment."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101313F_BPAC_675059_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "ISPAN Increment 2 Spiral 1 Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ISPAN Increment 2 Spiral 2 Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ISPAN Increment 2 IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ISPAN Increment 2 FOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ISPAN Increment 4 PDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ISPAN Increment 4 Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675282"
                    },
                    "ProjectTitle": {
                        "val": "Joint Navigation Warfare Center (JNWC)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.102"
                        },
                        "CurrentYear": {
                            "val": "9.551"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2013, 675282, Joint Navigation Warfare Center, efforts transferred to PE 0105921F, Service Support to STRATCOM Space Activities (O&M)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Navigation Warfare (NAVWAR) is a warfighting application of electronic warfare (EW), Information Operations (IO), and space control (SC) employing various techniques and technologies to negate or prevent hostile use of positioning, navigation, and timing (PNT) information and protect unimpeded use of PNT information by U.S., Allied, and Coalition Forces while not unduly disrupting peaceful use outside an area of operation. The Joint Navigation Warfare Center (JNWC) integrates and coordinates NAVWAR PNT capabilities across the mission areas of intelligence, surveillance, reconnaissance, information operations, electronic warfare, cyber and space control. The JNWC establishes and maintains the Department’s premier basis of NAVWAR expertise, and provides subject matter expertise and knowledge support to warfighters, Department decision makers, the Federal Interagency (the Department of Homeland Security and other civil agencies concerned with the Critical National Infrastructure), and the coalition through testing and evaluation; modeling, simulation and analysis; and exercise and training support. In recent years, the Global Positioning System (GPS) has become one of the most critical enablers of modern, advanced technology warfare. In an era where everything from advanced weapons systems to basic goods and services are tracked or guided by navigation systems such as GPS, Navigation Warfare is an interest and concern, especially if those systems are interrupted or lost. Likewise, as Global Navigation Satellite Systems (GNSS) proliferate, it becomes necessary to consider not only denying adversary use of GPS but also negating adversary use of alternate GNSS systems for PNT. The primary mission of the JNWC is to provide joint warfighter NAVWAR support through three broad mission areas:\n\na. Warfighter Operational Support – The JNWC applies knowledge of PNT vulnerabilities, prevention capabilities, and system operations to integrate NAVWAR as an element of warfighting operations. The JNWC provides reach-back capabilities to assist in resolving NAVWAR issues, address situations involving degradation or denial of PNT capabilities, and recommend actions to mitigate effects of both hostile and non-hostile events. The JNWC develops and maintains current information for the warfighter and theater commanders to include assessments of adversary capabilities, assessments of coalition capabilities and limitations, and other topics of special interest. The JNWC also provides subject matter expertise and knowledge support to Department acquisition and policy decision makers, the Federal Interagency (the Department of Homeland Security and other civil agencies concerned with the Critical National Infrastructure), and the coalition.\n\nb. Test, Training, Exercises, and Experiments – This JNWC mission area is the centerpiece for maintaining NAVWAR currency of information for the warfighter. The JNWC conducts annual NAVWAR field test events, and provides NAVWAR technical assistance for training, exercises and experiments. The JNWC, as part of this effort, maintains Integrated Joint NAVWAR Test Roadmaps and current intelligence products on adversary NAVWAR capabilities and Coalition NAVWAR capabilities and vulnerabilities. JNWC GYPSY field test events focus on fielded operational systems and capabilities to integrate NAVWAR and PNT operations, to baseline current NAVWAR electronic protection, support, and attack capabilities, and to assist warfighters optimize and deconflict theater\/tactical assets. JNWC FORTUNE field test events are more engineering focused and are used to evaluate specific NAVWAR capabilities or vulnerabilities, and to reduce engineering risk for GYPSY events. Test, training, exercise and experiment activities: 1) prepare the joint warfighter for operations in current and rapidly evolving NAVWAR threat environments; 2) establish priorities, standardized operational procedures for tactics, techniques, and procedures; 3) test electronic attack CONOPs to endure deconfliction and optimization with other operations to mitigate blue force fratricide; and 4) evolve standardized test methods.\n\nc. Navigation Warfare Information Analysis Center (IAC) – The JNWC develops and maintains methods, standards, models and simulations used in NAVWAR analysis and operates the NAVWAR Information Analysis Center (IAC). JNWC evaluates new models for accuracy and applicability to specific situations and rapidly evolving threat environments. It also develops and maintains standard test methodologies created solely by the U.S. as well as test methods developed in collaboration with coalition partners. These standard methodologies ensure data sharing is efficient and effective, and ensures accurate feedback to the operational communities. The JNWC, as part of this effort, manages the GPS EA Frequency Clearance process and conducts independent analysis and verification of EA frequency clearance requests. It also maintains and upgrades the Global Positioning System Reliability Prediction Model (GPS-RPM) frequency clearance model as required and conducts modeling and simulation exercises on GPS interference to include test and exercise threat laydowns for DoD organizations unable to perform their own modeling. The NAVWAR IAC serves as a source of NAVWAR information and technical expertise for DoD researchers, engineers, program managers, warfighters, testers, and others. It collects, analyzes, synthesizes, and disseminates scientific and technical information in clearly defined specialized subject areas. It promotes standardization by: 1) providing in-depth analyses; 2) creating products that respond to technical inquiries; 3) preparing state-of-the-art reports, handbooks, and databases; 4) conducting technology assessments; and 5) supporting the exchange of information within the NAVWAR community. Activities also include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NAVWAR Ops Support"
                                    },
                                    "Description": {
                                        "val": "NAVWAR Operational Warfighter Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.057"
                                            },
                                            "Text": {
                                                "val": "Provided COCOM reachback analysis to develop adversary, threat and intel assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.244"
                                            },
                                            "Text": {
                                                "val": "Continues COCOM reachback analysis support to develop adversary, threat and intel assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVWAR Test, Training, Exercises and Experiments"
                                    },
                                    "Description": {
                                        "val": "Funds will support Field Tests, NATO trials, U.S. PNT Tests, Exercises and Experiments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.560"
                                            },
                                            "Text": {
                                                "val": "Supported FORTUNE and GYPSY Field Tests, NATO trials, U.S. PNT Tests, Exercises and Experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.662"
                                            },
                                            "Text": {
                                                "val": "Continues support for FORTUNE and GYPSY Field Tests, NATO trials, U.S. PNT Tests, Exercises and Experiments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVWAR Modeling, Simulation, Tools and Methods"
                                    },
                                    "Description": {
                                        "val": "Funds support the Information Analysis Center (IAC) to develop Global Positioning System Reliability Prediction Model (GPS-RPM) Upgrades, GPS frequency clearance evaluations, modeling and simulation methodologies, standards and analyses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.485"
                                            },
                                            "Text": {
                                                "val": "Supported the Information Analysis Center (IAC), developed Global Positioning System Reliability Prediction Model (GPS-RPM) Upgrades, GPS frequency clearance evaluations, modeling and simulation methodologies, standards and analyses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.645"
                                            },
                                            "Text": {
                                                "val": "Continues support for the IAC, will develop additional GPS-RPM Upgrades, GPS frequency clearance evaluations, modeling and simulation methodologies, standards and analyses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NAVWAR will investigate, test, and simulate potential threats and mitigation strategies for preventing the hostile use of Positioning, Navigation and Timing (PNT) information through the use of competitive contracts and selective employment of government agencies."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101313F_BPAC_675282_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Warfighter Operational Support Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Warfighter Operational Support Combatant Command Exercise"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FORTUNE Field Test 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FORTUNE Field Test 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GYPSY HOTEL 2 Field Trial"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GYPSY INDIA Field Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NATO Trials Hammer 11 Exercise"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GPS Frequency Clearance Modeling Tool Update Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GPS Frequency Clearance Modeling Tool Update Release 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675368"
                    },
                    "ProjectTitle": {
                        "val": "GSIN (Global Integrated Sensor Network)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.975"
                        },
                        "CurrentYear": {
                            "val": "3.122"
                        },
                        "BudgetYearOne": {
                            "val": "9.734"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.734"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.920"
                        },
                        "BudgetYearThree": {
                            "val": "7.424"
                        },
                        "BudgetYearFour": {
                            "val": "5.735"
                        },
                        "BudgetYearFive": {
                            "val": "3.568"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission of USSTRATCOM is to establish and provide full-spectrum global strike, coordinated space and information operations capabilities to meet both deterrent and decisive national security objectives, and to provide operational space support, integrated missile defense, Global Command control Communications and Computers Intelligence Surveillance and Reconnaissance (C4ISR), and specialized planning expertise to the joint warfighter. This mission has been defined by the 2002 Unified Command Plan (UCP) changes 1 and 2. GSIN nets together all sensors, from tactical to strategic, including the Nation's most modern and capable assets, taking advantage of their larger numbers, improved algorithms, mobility and forward deployment to provide earlier cross-cueing and expanded decision space when every second counts. GSIN will permit an IP-based User Defined Operating Picture (UDOP) to augment voice conferencing and rapidly build a single, unambiguous missile event picture allowing real-time senior collaboration for nuclear C2 and improved senior leader situational awareness (SA) and decision-making.\n\nThe Nation's strategic C2, sensors and mission planning programs can not rapidly exchange information across multiple missions, creating ambiguity that delays time critical national C2 decision making processes. The problem is most evident in the Department's missile warning (MW) and missile defense (MD) programs. GSIN establishes a unified national architecture integrating disparate MW\/MD systems into a single IP-based system providing redundant and unambiguous MW\/MD data to national leadership. Activities also include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GSIN Increments 2 and 3 Common XML Data Schema"
                                    },
                                    "Description": {
                                        "val": "Continue to develop a common, XML net-enabled data schema to integrate Missile Warning, Missile Defense Sensor data for DISA Secret and below interoperability.  Integrate Space Situational Awareness sensor data into the XML Schema Register data schema and services with appropriate registries\/catalogs.  Develop configuration control processes and procedures to manage the XML schema and associated XML messaging and services.  Begin Development of Sensor Registry Prototype and development of Joint Concept for Data Identification and Migration to Common Standards"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.967"
                                            },
                                            "Text": {
                                                "val": "Developed options and implementation plans for incremental development to mature data exposure capabilities and migrate data to a common, XML net-enabled command capability solution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.848"
                                            },
                                            "Text": {
                                                "val": "Continue to develop a common, XML net-enabled data schema to integrate Missile Warning, Missile Defense Sensor data for DISA Secret and below interoperability.  Integrate Space Situational Awareness sensor data into the XML Schema Register data schema and services with appropriate registries\/catalogs.  Develop configuration control processes and procedures to manage the XML schema and associated XML messaging and services.  Begin Development of Sensor Registry Prototype and development of Joint Concept for Data Identification and Migration to Common Standards"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.416"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.416"
                                            },
                                            "Text": {
                                                "val": "Will continue incremental development of common schema to integrate Space Situational Awareness sensor data; register data schema and services with appropriate registries\/catalogs; continue development of Sensor Registry Prototype and Joint concepts for Data Identification and Migration to Common Standards; test and field Increment 2."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GSIN Visualization and Data Services, Demonstrations and Studies"
                                    },
                                    "Description": {
                                        "val": "Continue to fund development of integrated Missile Warning and Missile Defense visualization and data software services to display data in a common operational picture.  Conduct studies and demonstrations of data correlation, launch event characterization and assessment services for risk reduction  evaluations.  Modifications and enhancements to visualization and data services; Continue studies to include demonstration and evaluation of Resource Broker and Space Situational Awareness capabilities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.274"
                                            },
                                            "Text": {
                                                "val": "Continue development of integrated Missile Warning and Missile Defense visualization and data software services to display data in a common operational picture.  Conduct studies and demonstrations of data correlation, launch event characterization and assessment services for risk reduction  evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.113"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.113"
                                            },
                                            "Text": {
                                                "val": "Will continue modifications and enhancements to visualization and data services; Continue studies to include demonstration and evaluation of Resource Broker and Space Situational Awareness capabilities"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GSIN Increment 1 Missile Defense (MD) Data Exposure Services Mods"
                                    },
                                    "Description": {
                                        "val": "Minor enhancements and modifications to MD data exposure services based on changes to common XML schema"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.008"
                                            },
                                            "Text": {
                                                "val": "Completed minor enhancements and modifications to MD data exposure services based on changes to common XML schema"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GSIN Increments 3 and 4, Expose and Integrate Space Situational Awareness (SSA) Data"
                                    },
                                    "Description": {
                                        "val": "Expose senor data and integrate SSA data from non-traditional sensors (MD\/MW\/non-DoD) into the Global Information Grid; \nDevelop implementation plans to mature data exposure capabilities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.205"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.205"
                                            },
                                            "Text": {
                                                "val": "Begin exposure of SSA data (Increment 3) and integration of SSA data from non-traditional sensors (MW\/MD\/non-DoD) into the Global Information Grid (Increment 4); develop implementation plans to mature data exposure capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "GSIN will use existing contract vehicles to manage, develop and modernize the combined Space Situational Awareness\/Missile Warning\/Missile Defense data exposure architecture and solution.  These contract vehicles are already in place and available."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101313F_BPAC_675368_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Increment 1 Spiral Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 1 Capability Fielded"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 2 Spiral Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 2 Capability Fielded"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 3 contract award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 3 Spiral Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 3 Capability Fielded"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 4 contract award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 4 Spiral Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 4 Spiral 2 Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 4 Capability Fielded"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 5 contract award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 5 Spiral Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 5 Spiral 2 Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 5 Capability Fielded"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}