{
    "id": "003c84e30081e0ccd606459dec0ab22eab397208",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_NAVY_MARINECORPS_PROCUREMENT_JustificationBook_Navy_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6522"
        },
        "LineItemTitle": {
            "val": "Field Medical Equipment"
        },
        "P1LineNumber": {
            "val": "57"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "General Property"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "78.777"
                },
                "PriorYear": {
                    "val": "46.508"
                },
                "CurrentYear": {
                    "val": "23.129"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearTwo": {
                    "val": "0.000"
                },
                "BudgetYearThree": {
                    "val": "0.000"
                },
                "BudgetYearFour": {
                    "val": "0.000"
                },
                "BudgetYearFive": {
                    "val": "0.000"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "148.414"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "78.777"
                },
                "PriorYear": {
                    "val": "46.508"
                },
                "CurrentYear": {
                    "val": "23.129"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearTwo": {
                    "val": "0.000"
                },
                "BudgetYearThree": {
                    "val": "0.000"
                },
                "BudgetYearFour": {
                    "val": "0.000"
                },
                "BudgetYearFive": {
                    "val": "0.000"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "148.414"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "78.777"
                },
                "PriorYear": {
                    "val": "46.508"
                },
                "CurrentYear": {
                    "val": "23.129"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearTwo": {
                    "val": "0.000"
                },
                "BudgetYearThree": {
                    "val": "0.000"
                },
                "BudgetYearFour": {
                    "val": "0.000"
                },
                "BudgetYearFive": {
                    "val": "0.000"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "148.414"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206623M"
                }
            ]
        },
        "Description": {
            "val": "Family of Field Medical Equipment is comprised of items such as:\n\nAuthorized Medical Allowance List (AMAL) modernization is comprised of numerous assemblages. These modernizations are required to support current standards of care and treatment protocols while providing advanced capabilities for battlefield casualties. Included are Infrascanner, sterilizers, Fielding Anesthesia System previously referred to as Mobile Anesthesia Delivery Module, Fluid Warmers and the Patient Active Warming System (PAWS).\n\nThe Enroute Care System (ERCS) provides equipment and supplies for the care of two critically injured\/ill, but stabilized, casualties in theater operations for up to a two hour medical evacuation (MEDEVAC) flight. The ERCS is a modular system that includes medical equipment, medical treatment protocols, and consumable supplies. The Portable Patient Transport Life Support System (PPTLSS), previously referred to as Mobile Oxygen Ventilation and External Suction Device (MOVES), is a significant upgrade to the ERCS. It effectively eliminates oxygen bottles from the battlefield and improves pre-hospital life support throughout the entire patient stabilization and transportation process. This single, integrated device will effectively replace the existing ventilator with monitor, suction device, oxygen bottles, and the cumbersome Special Medical Emergency Evacuation Device (SMEED) bracket, which will significantly reduce cost, cube, and weight, while enhancing the quality of care and improving survivability for trauma patients.\n\nDigital Radiography Equipment program provides radiological capability to surgical trauma platoons to diagnose injuries and medical abnormalities. AMAL-627 contains equipment and consumables to support one x-ray machine and develop x-rays. The x-ray unit is a compact, mobile and lightweight system that enables all imaging functions to be performed at the point of patient care. The unit is comprised of a low capacity x-ray and a digital computed radiographic (CR) reader, which scans the x-ray plates and displays the images on a laptop computer. The unit can be broken down into components for transportation and storage. It is operable and maintainable under all conditions of altitude, climate and terrain.\n\nThe Authorized Dental Allowance List (ADAL) provides dental services to the Marine Expeditionary Force (MEF). In an operational environment, the Dental Battalion's primary mission is to provide dental health maintenance with a focus on emergency care. ADALs contain the equipment and supplies required by dentists and their technicians to perform dental procedures on Marines in an expeditionary environment. It can be broken down into component sets or scaled down to fit the size and mission of the deploying unit. Primarily designed for standalone dental treatment, but it can be used in conjunction with other Authorized Medical Allowance Lists (AMALs).\n\nThe Forward Resuscitative Surgery System (FRSS) provides Level I and II Health Service Support (HSS). The FRSS is a highly mobile, rapidly deployable, trauma surgical unit that provides emergency surgical interventions to stabilize casualties that might otherwise die or lose limbs before reaching treatment. The FRSS is the lightest and most mobile of the Marine Corps HSS elements capable of providing trauma surgical care. The FRSS is modular, rapidly transportable and deployable by air or surface means. Included in the FRSS are medical materials, a shelter, ancillary equipment, and mobile electric power.\n\nFamily of Shelter and Shelter Equipment is comprised of items such as:\n\nThe Communication Electronics Equipment Maintenance Complex (CEEMC) will replace current electronic repair shelters that have reached the end of their life span. The CEEMC Shelter modernizes the current legacy, non-expandable, 20 foot Electronics Maintenance Complex (EMC) rigid wall shelters. The CEEMC Shelter is a two-sided, expandable, rigid wall shelter integrated with Internal Appointment Modules, workbenches, shelves, drawers, and storage shelving. It provides an expanded mission capability, optimization of workspace, enhanced energy efficiency, and reduction of the logistical footprint.\n\nThe Electro Magnetic Interference\/Electronics Maintenance Complex (EMI\/EMC) Rigid Wall Shelter provides protection against electromagnetic interference, and a climate controlled space. These shelters are easily relocated, compatible with current Marine Corps transportation modes, require minimum maintenance, and protect equipment and personnel in support of deployed operations. The EMI\/EMC Rigid Wall Shelter provides a highly mobile, environmentally controlled work space used for applications such as maintenance and repair of communication electronics equipment and systems.  This shelter also provides protection against electromagnetic interference. The IAM's are being upgraded for compatability with CEEMC IAM's.\n\nThe Family of Field Medical Equipment and Family of Shelter and Shelter Equipment programs do not have procurement funding beyond FY2014."
        },
        "Justification": {
            "val": "FY 2013 Base Appropriation: $30.757M\nFFME ($7.832M) FFME procured the Forward Resuscitative Surgery System (FRSS) \nFamily of Shelters and Shelter Equipment (FSSE) The Communication Electronics Equipment Maintenance Complex (CEEMC) will replace current electronic repair shelters that have reached the end of their life span. \nCEEMC ($22.925M) The CEEMC Shelter modernized the current legacy, non-expandable, 20 foot Electronics Maintenance Complex (EMC) rigid wall shelters. The CEEMC Shelter is a two-sided, expandable, rigid wall shelter integrated with Internal Appointment Modules, workbenches, shelves, drawers, and storage shelving. It provides an expanded mission capability, optimization of workspace, enhanced energy efficiency, and reduction of the logistical footprint. \n\nFY 2014 Base Appropriation:  $23.129M\nFFME ($19.823M) FFME is comprised of numerous assemblages. Funding will support the procurement of Infrascanners, Sterilizers,  Fielding Anesthesia System, Fluid Warmers and the Patient Active Warming System (PAWS) \nFSSE ($3.306M) The CEEMC will replace current electronic repair shelters that have reached the end of their life span. The CEEMC Shelter modernizes the current legacy, non-expandable, 20 foot EMC rigid wall shelters. The CEEMC Shelter is a two-sided, expandable, rigid wall shelter integrated with Internal Appointment Modules, workbenches, shelves, drawers, and storage shelving. It provides an expanded mission capability, optimization of workspace, enhanced energy efficiency, and reduction of the logistical footprint \n\nFY 2015 Base Appropriation Request: N\/A\n\nOCO: \nFY 2013 Overseas Contingency Operations (OCO):  $15.751M\nFSSE procured the CEEMC in support of deployed operations."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Family of Field Medical Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Field Medical Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1) New Cost Element"
                                            },
                                            "ItemNumber": [],
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "1) Family of Field Medical Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Authorization Medical Allowance List Modernization"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "19.823"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) Enroute Care System (ERCS)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "22.724"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.3) Digital Radiography Equipment"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "4.619"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.4) Authorized Dental Allowance List (ADAL)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.686"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.5) Forward Resuscitative Surgery System (FRSS)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "34.441"
                                                    },
                                                    "PriorYear": {
                                                        "val": "7.832"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "70.47"
                                        },
                                        "PriorYear": {
                                            "val": "7.832"
                                        },
                                        "CurrentYear": {
                                            "val": "19.823"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) Family of Shelters and Shelter Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) CEEMC"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "46"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "7"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "22.925"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.306"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "498369.57"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "472285.71"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "22.925"
                                        },
                                        "CurrentYear": {
                                            "val": "3.306"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) Family of Field Medical Equipment (OCO)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) Authorized Medical Allowance List (AMAL)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.307"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "8.307"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) Family of Shelters and Shelter Equipment (OCO)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1)   CEEMC"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "25"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "15.751"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "630040"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "15.751"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "78.777"
                            },
                            "PriorYear": {
                                "val": "46.508"
                            },
                            "CurrentYear": {
                                "val": "23.129"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}