{
    "id": "0de18e02e5afd1937d34fb9d72405e1259e964dd",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_NAVY_OTHER_BA1_PROCUREMENT_JustificationBook_Navy_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "0120"
        },
        "LineItemTitle": {
            "val": "Allison 501K Gas Turbine"
        },
        "P1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ships Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Ship Propulsion Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "139.479"
                },
                "PriorYear": {
                    "val": "3.724"
                },
                "CurrentYear": {
                    "val": "5.536"
                },
                "BudgetYearOneBase": {
                    "val": "2.155"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.155"
                },
                "BudgetYearTwo": {
                    "val": "6.191"
                },
                "BudgetYearThree": {
                    "val": "6.311"
                },
                "BudgetYearFour": {
                    "val": "29.257"
                },
                "BudgetYearFive": {
                    "val": "29.822"
                },
                "ToComplete": {
                    "val": "45.392"
                },
                "Total": {
                    "val": "267.867"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "139.479"
                },
                "PriorYear": {
                    "val": "3.724"
                },
                "CurrentYear": {
                    "val": "5.536"
                },
                "BudgetYearOneBase": {
                    "val": "2.155"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.155"
                },
                "BudgetYearTwo": {
                    "val": "6.191"
                },
                "BudgetYearThree": {
                    "val": "6.311"
                },
                "BudgetYearFour": {
                    "val": "29.257"
                },
                "BudgetYearFive": {
                    "val": "29.822"
                },
                "ToComplete": {
                    "val": "45.392"
                },
                "Total": {
                    "val": "267.867"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "139.479"
                },
                "PriorYear": {
                    "val": "3.724"
                },
                "CurrentYear": {
                    "val": "5.536"
                },
                "BudgetYearOneBase": {
                    "val": "2.155"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.155"
                },
                "BudgetYearTwo": {
                    "val": "6.191"
                },
                "BudgetYearThree": {
                    "val": "6.311"
                },
                "BudgetYearFour": {
                    "val": "29.257"
                },
                "BudgetYearFive": {
                    "val": "29.822"
                },
                "ToComplete": {
                    "val": "45.392"
                },
                "Total": {
                    "val": "267.867"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This program provides the life-cycle support for the following Marine Gas Turbine systems: The Rolls Royce (Allison) 501-K Series Gas Turbines are used to drive electrical generators in Ship Service Gas Turbine Generators (SSGTG). The 501-K17 is used on the CG-47 Class ships.  The 501-K34 is an upgraded version used on the DDG-51 Class ships and is not interchangeable with the 501-K17.  The Rolls Royce MT-30 are used on LCS-1 variant for main propulsion and DDG 1000 for electrical generation.  Rolls Royce 250-KS4 is used as a starter gas turbine for the 501-K34 on DDG 79 and follow.\n\n[P40A \/ GF001 STOCK ROTATING SPARES]: GF001 - STOCK ROTATING SPARES\nThis cost code procures the MT-30 & MT-5 gas turbines for the Littoral Combat Ship (LCS) and Zumwalt DDG 1000 program, the 250-KS4 SSGTG starter engines for the DDG 79 and follow, and the 501-K34 gas turbines DDG 51 class ships. The procurement of these engines includes all required shipping\/storage containers.\n\nMT-30 Gas Turbines\nBased on experience with similar turbines and IAW 10 USC Sec. 2308, DFAR subpart 207.70 and DoDI 3110.06, a total of 5 spares are required to support the fleet.  Current MT-30 spares on-hand is two (2), one (1) budgeted procurement in FY18 leaves a requirement of 2 additional gas turbines to be procured.  The projected FY-20 and beyond in-service population of MT-30 gas turbine engines is fifty (50) due to new construction.\n\nMT-5 Gas Turbines\nBased on experience with similar turbines and IAW 10 USC Sec. 2308, DFAR subpart 207.70 and DoDI 3110.06, a total of 2 spares are required to support the fleet.  Current MT-5 spares on-hand is zero (0) with one (1) budgeted procurement in FY18 leaves a requirement of 1 additional gas turbines to be procured.  The projected FY-20 and beyond in-service population of MT-5 gas turbine engines is six (6) due to new construction.\n\n250-KS4 SSGTG Starter Engines\nBased on experience with similar turbines and IAW 10 USC Sec. 2308, DFAR subpart 207.70 and DoDI 3110.06, a total of 12 spares are required to support the fleet requirements.  Current spares on-hand is twelve (12) which achieves the baseline sparing requirement.  The projected FY-18 in-service population of starter engines is 112 due to new construction. Operation Tomodachi has resulted in the radiological contamination of twelve (12) 250-KS4 Marine Gas Turbines, which created an unplanned requirement to replace the twelve (12) affected engines beginning in FY13.  Currently, the program has budgeted for six (6) replacements through FY20 leaving a requirement of six (6) additional replacement assets to be procured.\n\n501-K34 Gas Turbines\nBased on experience with similar turbines and IAW 10 USC Sec. 2308, DFAR subpart 207.70 and DoDI 3110.06, a total of 24 spares are required to support the fleet requirements. Current 501-K34 spares on-hand is 20 and 2 procured in FY-12, which leaves a requirement of 2 additional gas generator units to be procured.  The projected FY-19 in-service population of gas turbine engines is 192, an increase from 186 in FY-12 due to new construction.\n\n[P40A \/ GF007 MODIFICATION PROGRAM]: GF007 - MODIFICATION PROGRAM\nThis cost code procures modification kits listed below for the Rolls Royce Marine Gas Turbines (MGT).  Analysis of Rolls Royce MGT engineering performance data, metrics, the SEA 21 Top Tech Issues and the component improvement program has identified necessary improvements to correct Rolls Royce MGT deficiencies.  The modifications addresses the Fleet's top maintenance and reliability issues by reducing failure rates of system components, and improve Rolls Royce MGT readiness.\nThe modification kits are packaged and shipped to the ship for installation during schedule CNO availability by a team of NSWCCD Philadelphia and Alteration Installation Team (AIT) personnel. No procurement quantities are a result of procuring various kits of various costs. The kits included in the cost code are as follows:\n--Engine Vibration Monitor\n--GTG Intake Filter System Replacement\n--SSGTG Bleed Air Control Valve Installation and Improvement\n--SSS Clutch upgrade to Air Turbine Starter (ATS)\n--SSGTG FADC 2-1 HMI Computer Conversion\n--SSGTG RIMSS Exhaust Backflow Detection System\n--Output Quill Shaft Bolt Replacement\n--RIMSS Tachometer Connector Improvement\n--Model 139 SSV and Off Mounted fuel Mod\n-- FADC upgrade conversion\n\n[P40A \/ GF018 501 K-34 HOT SECTION REPLACEMENT]: GF018 - HOT SECTION REPLACEMENT\t\t\t\t\t\t\t\t\t\n\nThis cost code procures High Pressure Turbine (HPT) components to supplement fall-out due to radiological contamination resultant from support of Operational Tomodachi. No procurement quantities are a result of procuring various kits of various costs. The kits included in the cost code are as follows: Blade Stage Kits T1, T2, T3 and T4\nVane Stage Kits T1, T2, T3 and T4\n\n[P40A \/ GF020 MANAGEMENT ENERGY INITIATIVES]: FY15 funds for energy initiatives realigned to Surface Combatant HM&E, Ships Support Equipment and Maritime Energy Initiatives (BLI 0200, L7027) to more effectively meet the Departments energy initiatives goals.\n\nFY14 funding budgeted to support the following two efforts in support of energy initiatives.  \n \nOnline waterwash \nShipboard evaluation showed no measurable gains in operating efficiency or operating cost reduction; the project has been cancelled and test installations shall be removed.  FY14 has been budgeted to restore the three evaluation hulls to their original configuration.\n \nDDG-51 Thermal Management Control System (TMCS)\nDDG-51 TMCS is considered a key energy conservation measure in the overall TFE Maritime Energy Portfolio.  It improves energy efficiency by reducing cooling need from A\/C plants and limiting excess heat with electric preheaters.  It also allows the redirection from non-vital to vital loads during casualty situations. \nThe DDG-51 TMCS was developed under the Fleet Readiness R&D Program and was successfully tested on the USS Kidd (DDG-100) in FY11-FY13.  TMCS includes replacement of 129 thermostats with default temperature set points for each space based on manned\/unmanned, day\/night, in port\/at sea, and summer and winter.  Space temperatures are controlled remotely from CCS and the Engineering Log Room.  \nInstallations will occur during scheduled CNO approved availabilities.\n\n[P40A \/ GF830 PRODUCTION ENGINEERING]: GF830 - PRODUCTION ENGINEERING\nThe review and approval of any production contract technical documentation, or the separate development of this documentation to include Technical Manuals, Signal Flow Diagrams, PMS, Level III Production Drawings, Provisioning Technical Documentation (PTD), Program Support Data, Allowance Parts Lists (APL's) and engineering in support of final design reviews. This includes efforts associated with tracking and updating NDE, MGTIS and Weblog to reflect completed installations and ensure consistent documentation for engine configuration management.\n\n[P40A \/ PRODUCTION ENGINEERING]: The review and approval of any production contract technical documentation, or the separate development of this documentation to include Technical Manuals, Signal Flow Diagrams, PMS, Level III Production Drawings, Provisioning Technical Documentation (PTD), Program Support Data, Allowance Parts Lists (APL's) and engineering in support of final design reviews. This includes efforts associated with tracking and updating NDE, MGTIS and Weblog to reflect completed installations and ensure consistent documentation for engine configuration management."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Allison 501K Gas Turbine"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "@footnote": "As a result of Operation Tomodachi the program currently has four (4) K34 engines that have been quarantined in either a Forward Repairable Inspection Activity (FRIA)-JAPAN or Aviation Radiological Inspection Facility (AVRIF) - San Diego and thus are no longer available to support the RFI sparing pool.",
                                    "val": "1) GF001 STOCK ROTATING SPARES"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) 501-K34"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "11"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "21.362"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1942000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) 250-KS4"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "3"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.197"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.406"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.414"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.421"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.421"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "399000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "406000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "414000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "421000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "421000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.3) MT-30"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "12.5"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "12500000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.4) MT-5"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "35.059"
                                        },
                                        "PriorYear": {
                                            "val": "0.406"
                                        },
                                        "CurrentYear": {
                                            "val": "0.414"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.421"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.421"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) GF007 MODIFICATION PROGRAM"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) PROCURE MODIFICATION KITS"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "87.461"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.665"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.58"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.039"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.039"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) INSTALLATION FOR MODIFICATION KITS"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.699"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.442"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.44"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.559"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.559"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "88.16"
                                        },
                                        "PriorYear": {
                                            "val": "2.107"
                                        },
                                        "CurrentYear": {
                                            "val": "1.02"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.598"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.598"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) GF018 501 K-34 HOT SECTION REPLACEMENT"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) 501K-34 HOT SECTION REPLACEMENT"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "49"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "12.648"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.991"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.036"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "258122.45"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "12.648"
                                        },
                                        "PriorYear": {
                                            "val": "0.991"
                                        },
                                        "CurrentYear": {
                                            "val": "1.036"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "FY15 funds for energy initiatives realigned to Surface Combatant HM&E, Ships Support Equipment and Maritime Energy Initiatives (BLI 0200, L7027) to more effectively meet the Departments energy initiatives goals.",
                                    "val": "4) GF020 MANAGEMENT ENERGY INITIATIVES"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) 501K-17\/34 3.5 COMPRESSOR UPGRADE"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.587"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.4"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.2) ONLINE WATERWASH GTG"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.466"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "50000"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.687"
                                        },
                                        "CurrentYear": {
                                            "val": "2.866"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) GF830 PRODUCTION ENGINEERING"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.1) PRODUCTION ENGINEERING"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.925"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.22"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.2"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.136"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.136"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.925"
                                        },
                                        "PriorYear": {
                                            "val": "0.22"
                                        },
                                        "CurrentYear": {
                                            "val": "0.2"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.136"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.136"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "139.479"
                            },
                            "PriorYear": {
                                "val": "3.724"
                            },
                            "CurrentYear": {
                                "val": "5.536"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.155"
                            },
                            "BudgetYearOne": {
                                "val": "2.155"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}