{
    "id": "16249f1cfbc41c89c6bb5087da0f9b28fed4a73f",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_NAVY_MARINECORPS_PROCUREMENT_JustificationBook_Navy_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6438"
        },
        "LineItemTitle": {
            "val": "Physical Security Equipment"
        },
        "P1LineNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Materials Handling Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "247.485"
                },
                "PriorYear": {
                    "val": "59.005"
                },
                "CurrentYear": {
                    "val": "16.809"
                },
                "BudgetYearOneBase": {
                    "val": "26.51"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "26.51"
                },
                "BudgetYearTwo": {
                    "val": "18.863"
                },
                "BudgetYearThree": {
                    "val": "31.305"
                },
                "BudgetYearFour": {
                    "val": "17.699"
                },
                "BudgetYearFive": {
                    "val": "7.159"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "247.485"
                },
                "PriorYear": {
                    "val": "59.005"
                },
                "CurrentYear": {
                    "val": "16.809"
                },
                "BudgetYearOneBase": {
                    "val": "26.51"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "26.51"
                },
                "BudgetYearTwo": {
                    "val": "18.863"
                },
                "BudgetYearThree": {
                    "val": "31.305"
                },
                "BudgetYearFour": {
                    "val": "17.699"
                },
                "BudgetYearFive": {
                    "val": "7.159"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "247.485"
                },
                "PriorYear": {
                    "val": "59.005"
                },
                "CurrentYear": {
                    "val": "16.809"
                },
                "BudgetYearOneBase": {
                    "val": "26.51"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "26.51"
                },
                "BudgetYearTwo": {
                    "val": "18.863"
                },
                "BudgetYearThree": {
                    "val": "31.305"
                },
                "BudgetYearFour": {
                    "val": "17.699"
                },
                "BudgetYearFive": {
                    "val": "7.159"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206313M"
                }
            ]
        },
        "Description": {
            "val": "Physical Security Systems provide systematic, uniform technological solutions to manpower intensive security requirements.  Systems are used at bases and stations protecting our most important assets vital to operations - people, flight lines, classified information, arms, ammunition, and explosives (AA&E), shore lines, open dessert areas, critical assets and infrastructure and providing constant, vigilant capabilities that control and restrict access and provides notification of actual and attempted unauthorized intrusion. Mass Notification System (MNS) provides immediate notice and warning to personnel living and working aboard our bases and stations in the event of security breaches via interior and exterior speaker systems, telephones and computers in the event of natural disasters, terrorist activities, weather emergencies or other events requiring immediate guidance to ensure the safety and security of personnel.  Physical Security supports collateral equipment specifically designed for physical security\/electronic security systems (ESS) in military construction (MILCON) projects.  Funding procures investment, devices and systems necessary for the United States Marine Corps installation and facility structure to comply with Congressional, White House Military Office, Department of Defense, Department of Navy, and Marine Corps Physical Security and antiterrorism directives pertaining to security equipment and ESS as technological solutions to manpower intensive security requirements.  This resource further provides a systematic, uniform capability throughout Marine Corps installations to deter, delay, and defeat espionage, sabotage, damage, theft, and terrorist attacks against Marine Corps assets such as personnel, facilities, information, and equipment.   \n\nThese systems upgrade and replace antiquated individually purchased systems that are costly to maintain and may not meet prescribed requirements for securing U.S. assets.  The Marine Corps Electronic Security System (MCESS) Program provides a comprehensive electronic security system suite that supports collateral equipment including intrusion detection, surveillance, installation, and facility automated access control and tracking capabilities.  These systems increase efficiency\/effectiveness of available security manpower and improve security and safety at installation perimeter, flight line, restricted area, facility entry points and is now expanding to meet installation access control requirements.   Ground based radars support wide areas aboard Marine Corps installations such as expansive waterways, open airfields and dessert areas (improved assessment at long distances) allowing for greater defensive posture and response capabilities.  \n\nGround-Based Operational Surveillance System (G-BOSS) The Ground-Based Operational Surveillance System (G-BOSS) is an incremental development program currently providing persistent, multispectral surveillance sensor packages in Afghanistan. Three variants of G-BOSS exist; 80' tower mounted system (heavy), 20' trailer mounted system (medium\/GBL), and man-portable, tripod mounted system (lite\/CBL).   Each tower employs multiple, self-contained detection and assessment technologies on a single trailer-mounted elevation platform with a multi-spectral sensor suite consisting of: daylight color & infrared imagery (StarSafire III and T-3000), Unattended Ground Sensors (UGS), Manportable Surveillance and Target Acquisition Radar (MSTAR), Communication suite for wireless point to point link, and unmanned aerial vehicle interface (VideoScout). The medium and lite systems provide a subset of the G-BOSS heavy capabilities.  G-BOSS is a material solution in response to an Urgent Universal Needs Statement in support of OIF and OEF. In FY13\/14 G-BOSS 3.1 will update the existing G-BOSS systems with a common operating system and equipment interface to increase operational availability while reducing sustainment cost. \n\nIdentity Dominance System-MC (IDS-MC) is a multi-modal (fingerprint, iris and face) biometric collection system that provides the USMC a reliable and effective capability to collect, share, match, access, verify and store identity information. IDS-MC will enable the Marine to collect appropriate biometric, biographical and reference information on an individual and match this locally developed information with pre-existing information available to the expeditionary force. The system will display match results with linkage to the respective individual's biographical and reference information as well as help analyze the response, update records as appropriate, create reports and disseminate updated information in accordance with current MAGTF policy. The primary mission of IDS-MC is to provide the MAGTF with the means to identify persons encountered in the battlespace. While IDS-MC is not an intelligence analysis system, it does provide identification information in support of military intelligence and law enforcement operations by providing positive identification of persons of interest. IDS-MC is an enabler in the areas of detainee management and questioning, base access, counterintelligence screening, border control, law enforcement, displaced persons' management and aiding in humanitarian assistance missions. IDS-MC supports the tactical application of identity dominance and fully supports a forward presence, crisis response and contingency response capability. IDS will subsume the Biometrics Automated Toolset (BAT).  The total AAO of 821 fielded systems to training facilities and eleven battalion-sized elements. IDS will incrementally phase out the Biometric Automated Toolset (BAT)."
        },
        "Justification": {
            "val": "FY13 Base Appropriation:\nPhysical Security\/Installations Security Equipment $3.505M:  Funding procured  Electronic Security Systems (ESS), Intrusion Detection Systems, Installations Security Systems (access controls), and a comprehensive electronic security system suite that supports collateral equipment throughout the Marine Corps providing surveillance, perimeter, facility, and installation automated access control and tracking capabilities.\n\nFY14 Base Appropriation:\nPhysical Security System\/Installations Security Equipment $15.001M:  Physical Security Systems supports systematic, uniform technological solutions to manpower intensive security requirements throughout the Marine Corps. The FY14 increase of 11.496M in funds is procuring flight line security systems, ground based radar detection tracking systems, Mass Notification Systems and perimeter and facility automated access control and tracking capabilities control systems. Funds are needed to upgrade operating systems no longer supported by industry due to end of life support for the current operating system software. \n\nIDS-MC $1.808M:  Provides for procurement of Test Article; Integration (to include facilities, test equipment and tooling), Production support; ILS and Acquisition Program Support for the 800 BESD's and the integration of IDS systems in preparation for developmental test.\n\nFY15 Base Appropriation Request:\nPhysical Security System\/Installations Security Equipment $24.856M: Physical Security Systems supports systematic, uniform technological solutions to manpower intensive security requirements throughout the Marine Corps. The FY15 funds will procure flight line security systems, ground based radar detection tracking systems, and perimeter and facility automated access control and tracking capabilities control systems.  The funding increase from FY14 to FY15 supports the Department of the Navy's decision to focus on requirements and resource realignment of all commodity areas and budget adjustments.  Funds are needed to upgrade operating systems no longer supported by industry due to end of life support for the current operating system software.  \n\nIDS-MC $1.654M: Supports the procurement of 78 IDS systems to provide identification information in support of military intelligence and law enforcement operations by providing positive identification of persons of interest. IDS-MC is an enabler in the areas of detainee management and questioning, base access, counterintelligence screening, border control, law enforcement, displaced persons' management and aiding in humanitarian assistance missions. IDS-MC supports the tactical application of identity dominance and fully supports a forward presence, crisis response and contingency response capability.\n\nOCO: \nFY13 Overseas Contingency Operations (OCO):\nG-BOSS $55.500M:  FY13 funding completed procurement of capability upgrades to support a common hardware\/software baseline.  This request also consists of the procurement of GBOSS material and support elements such as documentation\/operators, maintenance, training\/curriculum manuals, installation procedures, post installation procedures, and the integration of material into kits."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Physical Security Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Collateral Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Collateral Equipment"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "106.218"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2.324"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "7.98"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "10.657"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "10.657"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "106.218"
                                        },
                                        "PriorYear": {
                                            "val": "2.324"
                                        },
                                        "CurrentYear": {
                                            "val": "7.98"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.657"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.657"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) Installations Security Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Installation Security Equipment"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "86.232"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.181"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "7.021"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "14.199"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "14.199"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "86.232"
                                        },
                                        "PriorYear": {
                                            "val": "1.181"
                                        },
                                        "CurrentYear": {
                                            "val": "7.021"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.199"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.199"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) Ground-Based Operational Surveillance System (G-BOSS)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) G-BOSS 3.1 Upgrade Kits"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "32.192"
                                                    },
                                                    "PriorYear": {
                                                        "val": "23.07"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.2) G-BOSS 3.1 Production Representative Articles"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.169"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.3) G-BOSS Integration Support"
                                            },
                                            "ItemNumber": [],
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "9.811"
                                                    },
                                                    "PriorYear": {
                                                        "val": "32.43"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "43.172"
                                        },
                                        "PriorYear": {
                                            "val": "55.5"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) IDENTITY DOMINANCE SYSTEM (IDS-MC)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) IDS  Biometrics Systems"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "78"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "78"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.365"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.365"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "17500"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "17500"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.2) Integration\/Production\/Logistics Support"
                                            },
                                            "ItemNumber": [],
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "1.608"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.289"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.289"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.3) IDS-MC Production Representative Articles"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.2"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.4) IDS Hardware Tech Refresh"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.5) IDS Biometric Enrollment Screening Device (BESD)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "11.863"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "11.863"
                                        },
                                        "CurrentYear": {
                                            "val": "1.808"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.654"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.654"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "247.485"
                            },
                            "PriorYear": {
                                "val": "59.005"
                            },
                            "CurrentYear": {
                                "val": "16.809"
                            },
                            "BudgetYearOneBase": {
                                "val": "26.51"
                            },
                            "BudgetYearOne": {
                                "val": "26.51"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}