{
    "id": "4b4c2e5d61f92d2d4f236aef13611b341366ac58",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_NAVY_OTHER_BA5-7_PROCUREMENT_JustificationBook_Navy_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "8109"
        },
        "LineItemTitle": {
            "val": "Medical Support Equipment"
        },
        "P1LineNumber": {
            "val": "154"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Personnel & Command Support Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Command Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "2.798"
                },
                "CurrentYear": {
                    "val": "4.925"
                },
                "BudgetYearOneBase": {
                    "val": "2.634"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.634"
                },
                "BudgetYearTwo": {
                    "val": "4.839"
                },
                "BudgetYearThree": {
                    "val": "4.373"
                },
                "BudgetYearFour": {
                    "val": "5.033"
                },
                "BudgetYearFive": {
                    "val": "5.157"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "29.759"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "2.798"
                },
                "CurrentYear": {
                    "val": "4.925"
                },
                "BudgetYearOneBase": {
                    "val": "2.634"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.634"
                },
                "BudgetYearTwo": {
                    "val": "4.839"
                },
                "BudgetYearThree": {
                    "val": "4.373"
                },
                "BudgetYearFour": {
                    "val": "5.033"
                },
                "BudgetYearFive": {
                    "val": "5.157"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "29.759"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "2.798"
                },
                "CurrentYear": {
                    "val": "4.925"
                },
                "BudgetYearOneBase": {
                    "val": "2.634"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.634"
                },
                "BudgetYearTwo": {
                    "val": "4.839"
                },
                "BudgetYearThree": {
                    "val": "4.373"
                },
                "BudgetYearFour": {
                    "val": "5.033"
                },
                "BudgetYearFive": {
                    "val": "5.157"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "29.759"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This line item provides funding for the Medical Support Equipment (MSE) and the Fleet Hospital\/Expeditionary Medical Facility (EMF) Programs. The Medical Support Equipment (MSE) program funds new medical capability and new technology on naval operating ships. Medical Support Equipment configuration management, spares, technical manuals and installations are also funded through this line item.  Requirements are determined through Commander, U.S. Fleet Forces Command and Commander, U.S. Pacific Fleet, and procurement is managed by Naval Medical Logistics Command (NAVMEDLOGCOM). Funding is used to procure modifications or additions to the ships' allowance items that are identified within the Authorized Medical Allowance List (AMAL) and Authorized Dental Allowance List (ADAL). AMALs and ADALs are unique to specific classes or types of ship or Commands to fulfill its intended health care mission. AMAL and ADAL allowances are approved by the respective Fleet Type Commander (TYCOM) Force Surgeon with concurrence by the Commander, Fleet Forces Command Surgeon. The initiation of a change to the current depth (allowance amount) of material or addition of a new allowance for an item(s) within an AMAL or ADAL results from either a change in the scope of care a specific ship must provide in accordance with its Required Operational Capability (ROC) and Projected Operational Environment (POE) and\/or a change in the standard of medical care the assigned personnel are expected to provide. Changes to AMAL and ADAL requirements are determined through Individual Allowance Change Requests, as a result of reviews chaired by TYCOM Fleet Surgeons.             \n                                                           \nThe Fleet Hospital\/Expeditionary Medical Facility (EMF) program funds critical medical equipment to support and provide theater hospitalization capabilities (commonly referred to as Role III Care) as defined in Joint Publication 4-02 Health Services Support and the EMF ROC and POE.  This funding is used to procure investment equipment that supports the standard of care for Casualty Management as determined by the DoD Combat Trauma Surgery Committee.   \n\nThis line item also includes funding for the Hospital Ships (USNS Comfort (Fleet Forces Command) and USNS MERCY (PACFLT)) major systems replacement. The program is part of the standardization and life cycle management of the MERCY Class Hospital ships sustainability plan.\n\nFunds in this line item will be used to procure various medical equipment from the AMAL\/ADAL and for major systems replacement, including but not limited to the following:\n\nYA001 - In FY13-15, the following requirements are planned to be procured from the Authorized Medical Allowance List (AMAL) and Authorized Dental Allowance List (ADAL): Direct Radiology System (1) per hull, and Cerec Prosthetic Systems (1 per  CVN and L-Deck Hull)\n\n[P40A \/ V7YA1 - Computerized Axial Tomography Scan Replacement (USFFC)]: Funding provided for the procurement and installation of a Computerized Axial Tomography (CAT) Scan for the USNS COMFORT.  The CAT scan is an x-ray procedure that combines many x-ray images with the aid of a computer to generate cross-sectional views and, if needed, three-dimensional images of the internal organs and structures of the body.  It is used to define normal and abnormal structures in the body and\/or assist in procedures by helping to accurately guide the placement of instruments or treatments.  This equipment is required in support of the hospital ship mission and to provide a similar standard of care on the hospital ships to what a patient would receive in other Navy Military Facilities (fixed or expeditionary).\n\n[P40A \/ V7YA1 - Rad Fluoro Replace w\/Wireless Digital Imaging Option (USFFC)]: Procure and install Radiographic Fluoroscopy Replacement System with wireless digital radiology imaging option for USNS COMFORT.  This system provides digital storage capability of images and alleviates the need for chemical processors.\n\n[P40A \/ 184A - Rad Fluoroscopy Replace w\/Wireless Digital Rad Imaging Option]: Funding provided for the procurement and installation of Radiographic Fluoroscopy Replacement System with wireless digital radiology imaging for the USNS MERCY.\n\n[P40A \/ 184A - Computerized Axial Tomography (CAT) Scan Replacement]: Funding provided for the procurement and installation of a Computerized Axial Tomography (CAT) scan for the USNS MERCY.\nThe CAT scan is an x-ray procedure that combines many x-ray images with the aid of a computer to generate cross-sectional views and, if needed, three-dimensional images of the internal organs and structures of the body.  It is used to define normal and abnormal structures in the body and\/or assist in procedures by helping to accurately guide the placement of instruments or treatments.  This equipment is required in support of the hospital ship mission and to provide a similar standard of care on the hospital ships to what a patient would receive in other Navy Military Facilities (fixed or expeditionary).\n\n[P40A \/ 184A - Scanning System, Ultrasonic, General-Purpose]: Funding provided for the procurement and installation of the Scanning System, Ultrasonic, General-Purpose Radiographic System, Digital for the USNS MERCY.  This system is used to diagnose or treat patients by providing the flexibility of getting real-time ultrasonic images at the patient's side or across the room.  This equipment is required to provide state-of-the-art ultrasonic diagnosis in support of the hospital ship's mission and to provide a similar standard of car on the hospital ship to what a patient would receive in other Naval Military Facilities (fixed or expeditionary).\n\n[P40A \/ 184A - Digital Radiology Imaging Option]: Funding provided for the procurement and installation of the Digital Radiology Imaging Option for the USNS MERCY.  This upgrade will provide full spectrum imaging and live video studies, and eliminate the need for digital cassettes.  The system provides excellent image quality, efficient image processing and manipulation, advanced clinical applications, networking\/connectivity abilities, automatic or manual operator control, dose reporting and system maintenance.  These features will provide a required technology upgrade and provide the highest quality radiographic images and improve efficiency while minimizing radiographic dose.  This equipment is required to provide state-of-the-art ultrasonic diagnosis in support of the hospital ship's mission and to provide a similar standard of car on the hospital ship to what a patient would receive in other Naval Military Facilities (fixed or expeditionary).\n\n[P40A \/ 184A - Portable X-Ray Unit w\/ Digital C.R. Capability]: Funding provided for the procurement and installation of Portable X-Ray Units w\/ Digital C.R. Capability. The Portable X-Ray units will provide basic and advanced radiological capabilities onboard and throughout the ship in order to meet emergency and routine diagnostics requirements wherein patient transport in not recommended.  The ability to provide a mobile radiographic imaging capability enhances the USNS MERCY's mission by providing high quality diagnostic imaging at the patient's location.  This equipment enables the USNS MERCY to continue to provide state-of-the-art Radiographic capability throughout the ship.  This equipment also allows the Medical Treatment Facility to continue providing a similar standard of care on the hospital ships to what a patient would receive in other Navy Military Facilities (fixed or expeditionary)."
        },
        "Justification": {
            "val": "Funding required to support the healthcare readiness needs of Navy's operating forces."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Medical Support Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "@footnote": "(Note:  Unit costs may not multiply exactly to total costs due to rounding). These funds are to be used to procure new technology requirements introduced to the FLEET during recent AMAL\/ADAL review. Implementation focuses on L-decks and Carriers meeting Required Operational Capability in response to changes in standard of medical care provided to the ship' s force by organic medical teams. Ships identified to be outfitted with these requirements as well as the required quantities are determined by FFC but may change prior to targeted implementation dates outlined in this submittal. Furthermore, the total equipment cost is expected to increase due to the likelihood of Ship Configuration Change factors and the proliferation of medical technology over 3 years prior to implementation.",
                                    "val": "1) BUMED (BSO 18)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "In FY13 the Medical\/Dental Equipment and AMAL and ADAL Outfitting for Operational Fleet Units line item is procuring Direct Radiology System, (1) per hull, for 7 ships, 3 each for PACFLT and 4 each for LANTFLT.  In FY14 the Medical\/Dental Equipment and AMAL and ADAL Outfitting for Operational Fleet Units line item will procure Direct Digital Radiology, (1) per hull, for 12 ships. 6 ships in LANTFLT and 6 ships in PACFLT.            In FY15 the Medical\/Dental Equipment and AMAL and ADAL Outfitting for Operational Fleet Units line item will procure Direct Digital Radiology, (1) per hull, for 6 ships. 4 ships in LANTFLT and 2 ships in PACFLT.                - The Direct Digital Radiology system is required to keep pace with the advanced nature of diagnostic imaging. It is a form of X-Ray imaging, in which digital X-ray sensors are used instead of traditional photographic film.   This provides shipboard medical personnel the capability to digitally process, and store images thereby reducing film development time, maintenance, and storage costs. This also provides seamless integration of digital imaging with other systems used in Telemedicine.  Creating a more efficient process that bypasses chemical processing and provides the ability to digitally transfer and enhance images.  - Using an existing DLA-TS IDIQ Contract , NMLC will  procure equipment from AGFA Health Care.",
                                                "val": "1.1) YA001 - Direct Digital Radiology"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "7"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "12"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "6"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "2.66"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.788"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.514"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.514"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "380000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "399000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "419000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "419000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) YA001 - Direct Digital Radiology System (Partial System)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.138"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.137"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "138000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "137000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.3) YA001 - CEREC Prosthetic System - Small Deck"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.4) YA001 - CEREC Prosthetic System - Small Deck (Partial System)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.12"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.12"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "120000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "120000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.5) YA001 - CEREC Prosthetic System - Large Deck"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "2.798"
                                        },
                                        "CurrentYear": {
                                            "val": "4.925"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.634"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.634"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) U.S. Fleet Forces Command (BSO 60)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) V7YA1 - Computerized Axial Tomography Scan Replacement (USFFC)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) V7YA1 - Rad Fluoro Replace w\/Wireless Digital Imaging Option (USFFC)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) PACFLT (BSO 70)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) 184A - Rad Fluoroscopy Replace w\/Wireless Digital Rad Imaging Option"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.2) 184A - Computerized Axial Tomography (CAT) Scan Replacement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.3) 184A - Scanning System, Ultrasonic, General-Purpose"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.4) 184A - Digital Radiology Imaging Option"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.5) 184A - Portable X-Ray Unit w\/ Digital C.R. Capability"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "2.798"
                            },
                            "CurrentYear": {
                                "val": "4.925"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.634"
                            },
                            "BudgetYearOne": {
                                "val": "2.634"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}