{
    "id": "4f9a8e6144bf7993290e1b22624bf983dfeabe86",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_AIRFORCE_OTHER_PROCUREMENT_JustificationBook_Air_Force_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "834430"
        },
        "LineItemTitle": {
            "val": "GCSS-AF Fos"
        },
        "P1LineNumber": {
            "val": "34"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "23.148"
                },
                "PriorYear": {
                    "val": "11.201"
                },
                "CurrentYear": {
                    "val": "12.675"
                },
                "BudgetYearOneBase": {
                    "val": "3.67"
                },
                "BudgetYearOne": {
                    "val": "3.67"
                },
                "BudgetYearTwo": {
                    "val": "68.165"
                },
                "BudgetYearThree": {
                    "val": "7.963"
                },
                "BudgetYearFour": {
                    "val": "8.1"
                },
                "BudgetYearFive": {
                    "val": "8.967"
                },
                "Total": {
                    "val": "143.889"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "23.148"
                },
                "PriorYear": {
                    "val": "11.201"
                },
                "CurrentYear": {
                    "val": "12.675"
                },
                "BudgetYearOneBase": {
                    "val": "3.67"
                },
                "BudgetYearOne": {
                    "val": "3.67"
                },
                "BudgetYearTwo": {
                    "val": "68.165"
                },
                "BudgetYearThree": {
                    "val": "7.963"
                },
                "BudgetYearFour": {
                    "val": "8.1"
                },
                "BudgetYearFive": {
                    "val": "8.967"
                },
                "Total": {
                    "val": "143.889"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "23.148"
                },
                "PriorYear": {
                    "val": "11.201"
                },
                "CurrentYear": {
                    "val": "12.675"
                },
                "BudgetYearOneBase": {
                    "val": "3.67"
                },
                "BudgetYearOne": {
                    "val": "3.67"
                },
                "BudgetYearTwo": {
                    "val": "68.165"
                },
                "BudgetYearThree": {
                    "val": "7.963"
                },
                "BudgetYearFour": {
                    "val": "8.1"
                },
                "BudgetYearFive": {
                    "val": "8.967"
                },
                "Total": {
                    "val": "143.889"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Global Combat Support System (GCSS) is a family of information technology systems that provide integration and interoperability between combat support functions and command and control to support the operational needs of the warfighter.  It directly supports Command, Control, Communication, Computers, and Information (C4I) for the warfighter and Chairman Joint Chiefs of Staff (CJCS) Joint Vision 2020.  The GCSS-Air Force Family of Systems (FOS) includes standard base-level combat support applications which provide warfighters with a \"one update-one time\" processing environment.  The following systems provide the key support foundation for the Air Force's global engagement strategy and capabilities through GCSS-AF.\n\nPE 0303141F GLOBAL COMBAT SUPPORT SYSTEM\n\nGLOBAL COMBAT SUPPORT SYSTEM-AIR FORCE (GCSS-AF):  This program element encompasses GCSS-AF's Integration Framework and its presentation layer for operational users.  As the customer interfaces on GCSS-AF, the presentation layer provides the worldwide standard security and single sign-on for accessing a variety of functional systems.  The framework uses additional security features of Public Key Infrastructure (PKI) and AF Directory Services, negating duplication of security features in each of the functional systems being modernized within the GCSS-AF Family of Systems (FoS).  This effort procures application, security, web, and proxy servers, software and associated licenses, and engineering support.\n\nFunding for this exhibit contained in PE 0303141F. \n\nPE 0708012F LOGISTICS SUPPORT ACTIVITY\n\nCARGO MOVEMENT OPERATIONS SYSTEM (CMOS): CMOS supports base-level and theater distribution management.   More than 235 Air Force, Marine Corps, Navy, Army, NSA, and DCMA activities employ CMOS through its web-based and deployable configurations. CMOS continues to provide effective traffic management support to the warfighter for both peacetime and contingency operations. CMOS prepares and manages all movement documentation, electronically interfaces with shippers, commercial carriers, and receiving activities, and provides bar code\/radio frequency identification (RFID) capability.  It provides in-transit visibility to DOD and commercial carriers, aids planning and managing force deployment, and supports the deployed Air and Space Expeditionary Force (AEF) warfighter through deployable and standard CMOS architectures.\n\nFunding for this exhibit contained in PE 0708012F.\n\nPE 0708610F LOGISTICS INFORMATION TECHNOLOGY (LOGIT)\n\nExpeditionary Combat Support System (ECSS): The ECSS program was canceled 11 December 2012.  The cancellation of ECSS has driven the Air Force to re-evaluate its strategy to enable logistics Information Technology (IT) capabilities.  The Air Force still requires an integrated logistics capability that provides timely, accurate and reliable information to decision makers at all levels of command and across the full range of military operations.  The Air Force is transitioning from ECSS to a hybrid approach of core legacy system remediation \/ modification and transformation. This approach moves away from a large scale Enterprise Resource Planning (ERP) capability and uses firm requirements, smaller scale development efforts and shorter delivery schedules to achieve FY 2017 statutory Financial Improvement and Audit Readiness (FIAR) and operational requirements.\n\nLogistics Transformation: \nLogistics transformation will be accomplished through capability initiatives, to include Maintenance, Repair and Overhaul (MROi), Supply Chain Management (SCM), Product Lifecycle Management (PLM), Advanced Planning and Scheduling (APS) and Field Maintenance.  \nMROi will create an integrated capability that plans, schedules, and executes organic depot maintenance support functions critical to agile planning, optimized workload assignment, resource allocation and throughput, thereby increasing depot maintenance support to the warfighter.  \n\nSCM includes Air Force Wholesale Supply, Item Master, Retail Supply, and related initiatives.  Wholesale Supply encompasses centralized planning and management of items and equipment such as: reparables, consumables, Nuclear Weapons-Related Materiel (NWRM) and cryptographic items.  Retail Supply comprises business operations and inventory for the Air Force Base Supply community.  Item Master provides the capability to manage comprehensive, accurate, and reliable item data.  \nThe PLM capability will enable Air Force engineering\/logistics communities to define, track, protect and manage product data for Air Force weapon systems and equipment. \n\nAPS will provide an integrated, accurate and timely supply chain planning capability to project inventory allocations that facilitate improved decision-making throughout the Demand Planning, Inventory Planning, Supply Planning, Exception Management, and Analytics processes.  \nField Maintenance will improve Air Force base-level maintainers' ability to plan, schedule, execute and maintain oversight capabilities that support timely and accurate asset\/resource management related to weapons systems inventory, status and usage reporting.\n\nRemediation\/Modification Efforts:\nThe remediation and modification of core logistics systems is necessary for the Air Force to meet statutory Financial Improvement Audit Readiness (FIAR) by 2017 and align with the Joint Chiefs of Staff J-4 Concept for Logistics and the Air Force Logistics Board?s approved Enterprise Logistics Strategy (ELS).  Systems contained in these business areas include, but are not limited to, the Air Force Equipment Management System (AFEMS), Integrated Maintenance Data System (IMDS), Reliability and Maintainability Information System (REMIS), Combat Ammunitions System (CAS), Training Business Area (TBA), Enhanced Maintenance Operations Center (EMOC), Aircraft Structural Integrity Management Information System (ASIMIS), Integrated Logistics System-Supply (ILS-S), Cargo Movement Operations System (CMOS), Stock Control System (SCS), Purchase Request Process System (PRPS), Automated Logistics Management Support System (ALMSS), Depot Maintenance Accounting and Production System (DMAPS), Cryptologic Depot Accountability System (CDAS), and Commercial Asset Visibility-Air Force (CAV-AF).\n\nRDT&E to support remediation, modernization and transformation efforts are being accomplished under PE 0708610, Project 675207, Logistics Information Technology System Modernization.\n\nFunding for this exhibit contained in PE 0708610F.\n\nPE 0901538 FINANCIAL MGMT INFO SYS DEVELOPMENT\n\nDEFENSE ENTERPRISE ACCOUNTING AND MANAGEMENT SYSTEM (DEAMS) Increment 1: To enhance transparency, DEAMS Other Procurement Air Force (OPAF) funding in Weapon System Code (WSC) 834430, Global Combat Support System - Air Force Family of Systems (GCSS-AF FOS) will\nend in FY 2014. Starting in FY 2015, DEAMS OPAF funding requests will be shown in WSC 834470, DEAMS.\n\nDEAMS Inc 1 is a commercial-off-the-shelf (COTS) Oracle based software implementation effort that will provide an auditable modern accounting and finance system. DEAMS is a Joint AF and United States\nTransportation Command (USTRANSCOM) Enterprise Resource Planning (ERP) Program that will replace existing accounting and finance legacy systems and will provide core funds execution management\nfunctions consistent with financial management laws, regulations and policy, general ledger, funds management, payments, receivables, cost and revenues, and fiduciary reporting. DEAMS is compliant with the\nClinger-Cohen Act, Business Enterprise Architecture (BEA), and integrates into Global Combat Support System-Air Force (GCSS-AF).\n\nDEAMS Inc 1 is currently deployed and in use at seven locations: Scott AFB, IL; Defense Finance and Accounting Service (DFAS)-Limestone, ME; McConnell AFB, IL; Dover AFB, DE; Grand Forks AFB, ND;\nLittle Rock AFB, AR; and Pope Field, NC. DEAMS Inc 1 is expected to be deployed to a number of additional locations throughout FY 2014-15.\n\nDEAMS Inc 1 capability will continue to be deployed to additional locations as approved by the Milestone Decision Authority. The overall DEAMS program is under review by the Milestone Decision Authority\n(MDA). The acquisition and deployment strategy are expected to be adjusted to deploy the current software baseline to all Air Force locations and re-evaluate software upgrade scenarios. Funding adjustments\nwill be reflected in the FY16 President's Budget.\n\nFunding for this exhibit contained in PE 0901538F."
        },
        "Justification": {
            "val": "PE 0303141F GLOBAL COMBAT SUPPORT SYSTEM\n\nGLOBAL COMBAT SUPPORT SYSTEM-AIR FORCE (GCSS-AF): No FY15 funding requested.\n\nPE 0708012F LOGISTICS SUPPORT ACTIVITY\n\nCARGO MOVEMENT OPERATIONS SYSTEM: FY15 procurement dollars in the amount of $0.696M procure different types\/amounts of hardware in support of installation and unit mission requirements for Joint personnel. These funds replace hardware and updates software and licensing to support the sustainment posture for contingency operations, and buy various mixes of hardware, software, and licensing for 60 new sites. Hardware replacement mitigates increased capability demands on older platforms and supports deployable CMOS hardware and associated Automatic Identification Technology (AIT).\n\nPE 0708610F LOGISTICS INFORMATION TECHNOLOGY (LOGIT)\n\nLogistics IT Systems Remediation\/Modification:  FY15 funding in the amount of $2.974M will purchase hardware that supports necessary updates to core logistics IT systems and transformation systems.  The core systems include, but are not limited to, the Air Force Equipment Management System (AFEMS), Integrated Maintenance Data System (IMDS), Reliability and Maintainability Information System (REMIS), Combat Ammunitions System (CAS), Training Business Area (TBA), Enhanced Maintenance Operations Center (EMOC), Aircraft Structural Integrity Management Information System (ASIMIS), Integrated Logistics System-Supply (ILS-S), Cargo Movement Operations System (CMOS), Stock Control System (SCS), Purchase Request Process System (PRPS), Automated Logistics Management Support System (ALMSS), Depot Maintenance Accounting and Production System (DMAPS), Cryptologic Depot Accountability System (CDAS), and Commercial Asset Visibility-Air Force (CAV-AF).  The tranformation systems include Maintenance, Repair and Overhaul (MRO); Supply Chain Management (SCM), Product Lifecycle Management (PLM), Advanced Planning and Scheduling (APS) and Field Maintenance. \n\nPE 0901538F FINANCIAL MANAGEMENT INFORMATION SYSTEMS DEVELOPMENT\n\nNo FY 15 funding requested."
        },
        "MDAPCode": {
            "val": "221"
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "GCSS-AF Fos"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "GLOBAL COMBAT SUPPORT SYSTEM"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "2.5"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.038"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "2.5"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.038"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "2.5"
                                        },
                                        "CurrentYear": {
                                            "val": "3.038"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "2.5"
                            },
                            "CurrentYear": {
                                "val": "3.038"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "GCSS-AF Fos"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "CARGO MOVEMENT OPERATIONS SYSTEM"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1.298"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.696"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.696"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.696"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "1.298"
                                        },
                                        "CurrentYear": {
                                            "val": "0.696"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.696"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.696"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "1.298"
                            },
                            "CurrentYear": {
                                "val": "0.696"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.696"
                            },
                            "BudgetYearOne": {
                                "val": "0.696"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "GCSS-AF Fos"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Logistics IT Systems Modernization"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "B"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "3"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.974"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.974"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "3"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.974"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.974"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "CurrentYear": {
                                            "val": "3"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.974"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.974"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "CurrentYear": {
                                "val": "3"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.974"
                            },
                            "BudgetYearOne": {
                                "val": "2.974"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "GCSS-AF Fos"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Starting in FY 2015, DEAMS OPAF requests will no longer be made in WSC 834430, GCSS-AF FOS, and will be made in  WSC 834470, DEAMS, in order to improve transparency of ACAT 1 Acquisition programs.",
                                                "val": "DEFENSE ENTERPRISE ACCOUNTING AND MANAGEMENT SYSTEM (DEAMS) Increment 1"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "B"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "1"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "23.148"
                                                    },
                                                    "PriorYear": {
                                                        "val": "7.403"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "5.941"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "23.148"
                                                    },
                                                    "PriorYear": {
                                                        "val": "7.403"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.97"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "23.148"
                                        },
                                        "PriorYear": {
                                            "val": "7.403"
                                        },
                                        "CurrentYear": {
                                            "val": "5.941"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "23.148"
                            },
                            "PriorYear": {
                                "val": "7.403"
                            },
                            "CurrentYear": {
                                "val": "5.941"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}