{
    "id": "5ef7dfc3e8e76c49e32724c2d157e70fdb46a160",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_NAVY_MARINECORPS_PROCUREMENT_JustificationBook_Navy_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6366"
        },
        "LineItemTitle": {
            "val": "Power Equipment Assorted"
        },
        "P1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "216.588"
                },
                "PriorYear": {
                    "val": "69.326"
                },
                "CurrentYear": {
                    "val": "63.357"
                },
                "BudgetYearOneBase": {
                    "val": "8.985"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "8.985"
                },
                "BudgetYearTwo": {
                    "val": "17.227"
                },
                "BudgetYearThree": {
                    "val": "21.677"
                },
                "BudgetYearFour": {
                    "val": "26.576"
                },
                "BudgetYearFive": {
                    "val": "28.752"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "452.488"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "216.588"
                },
                "PriorYear": {
                    "val": "69.326"
                },
                "CurrentYear": {
                    "val": "63.357"
                },
                "BudgetYearOneBase": {
                    "val": "8.985"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "8.985"
                },
                "BudgetYearTwo": {
                    "val": "17.227"
                },
                "BudgetYearThree": {
                    "val": "21.677"
                },
                "BudgetYearFour": {
                    "val": "26.576"
                },
                "BudgetYearFive": {
                    "val": "28.752"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "452.488"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "216.588"
                },
                "PriorYear": {
                    "val": "69.326"
                },
                "CurrentYear": {
                    "val": "63.357"
                },
                "BudgetYearOneBase": {
                    "val": "8.985"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "8.985"
                },
                "BudgetYearTwo": {
                    "val": "17.227"
                },
                "BudgetYearThree": {
                    "val": "21.677"
                },
                "BudgetYearFour": {
                    "val": "26.576"
                },
                "BudgetYearFive": {
                    "val": "28.752"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "452.488"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206624M"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Navy Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "69.326"
                                },
                                "CurrentYear": {
                                    "val": "58.964"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.075"
                                },
                                "BudgetYearOne": {
                                    "val": "7.075"
                                },
                                "BudgetYearTwo": {
                                    "val": "14.983"
                                },
                                "BudgetYearThree": {
                                    "val": "18.433"
                                },
                                "BudgetYearFour": {
                                    "val": "24.733"
                                },
                                "BudgetYearFive": {
                                    "val": "26.871"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Navy Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "CurrentYear": {
                                    "val": "4.393"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.91"
                                },
                                "BudgetYearOne": {
                                    "val": "1.91"
                                },
                                "BudgetYearTwo": {
                                    "val": "2.244"
                                },
                                "BudgetYearThree": {
                                    "val": "3.244"
                                },
                                "BudgetYearFour": {
                                    "val": "1.843"
                                },
                                "BudgetYearFive": {
                                    "val": "1.881"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "69.326"
                    },
                    "CurrentYear": {
                        "val": "63.357"
                    },
                    "BudgetYearOneBase": {
                        "val": "8.985"
                    },
                    "BudgetYearOne": {
                        "val": "8.985"
                    },
                    "BudgetYearTwo": {
                        "val": "17.227"
                    },
                    "BudgetYearThree": {
                        "val": "21.677"
                    },
                    "BudgetYearFour": {
                        "val": "26.576"
                    },
                    "BudgetYearFive": {
                        "val": "28.752"
                    }
                }
            }
        },
        "Description": {
            "val": "FAMILY OF POWER EQUIPMENT - This family is comprised of five major elements (sub-families) that provide power generation, power distribution, and tactical external lighting to all user communities across the active Marine Corps and Reserves.  These are centrally managed items.\n\nThe first element is the sub-family of Department of Defense Standard Tactical Generators USMC (and all services) procures from the DOD Project Manager for Mobile Electric Power (PM MEP).  USMC procures and manages 15 standard generator models in the power output range of 2 kilowatts (kW) to 100 kW in both 60HZ (ground equipment) and 400HZ (aviation equipment) configurations.  Included in this for medium size models (5 kW to 60 kW) is the new Advanced Medium Mobile Power Sources (AMMPS) that USMC first began procuring in 2013 and will continue procuring for at least ten years. The AMMPS will provide improved fuel economy, improved maintainability, and reduced weight.\n\nThe second element is the sub-family for non-Standard Tactical Generators.  These address USMC unique requirements that the DOD PM MEP does not support. This includes the USMC unique Integrated Trailer - Environmental Control Unit - Generator (ITEG) capability that is towable by all vehicle platforms. The ITEG integrates both power generation equipment and environmental control equipment onto a single trailer chassis for highly mobile units, units that have tailored power and cooling requirements, units that predominantly have HMMWVs for transportation resources, or units operating forward that may not have Material Handling Equipment to support larger generators and environmental control units.\n\nThe third element is the sub-family for Mobile Electric Power Distribution Systems - Replacement (MEPDIS-R) which provides a modernized, standard suite of electric power distribution panels and cabling assemblies to meet Marine Corps power requirements to support a variety of command and control systems and expeditionary forces. MEPDIS-R, as a highly tailorable system, consists of 20 separate components that are configured into capability sets by all using units.\n\nThe fourth element is the Floodlight Set (FLS), a self contained external lighting system with a power plant and light tower assembly.  The FLS is capable of providing up to five acres of area illumination and is used extensively for security purposes. For flexibility, the set is configured so it can be mounted on all trailer systems or ground mounted and plugged into grid power.\n\nThe fifth element is the sub-family of support equipment to support elements of the Power Equipment Family.  This includes unique trailer mounting kits for all systems onto USMC standard trailers, software planning tools for emplacement of power and power distribution, unique training aids, and general purpose electrician toolkits.\n\n\nFAMILY OF ALTERNATIVE POWER SOURCES FOR COMMUNICATIONS EQUIPMENT (APSCE) - This family consists of multiple suites of devices, grouped into sub-families, that are used to provide highly expeditionary power (worn on the Marine, hand-carried, or vehicle mounted) to operate communications equipment, computers and peripheral equipment in place of disposable batteries, and for scenarios where fuel powered generators are too large, too heavy, unsuitable for use, or provide undue logistics burden due to refueling needs.\n\nThe first suite of devices encompasses renewable energy based systems, and includes the man-portable Ground Renewable Expeditionary Energy Network System (GREENS) that supports a company level operations center and Forward Operating Base, and the man-portable Solar Portable Alternative Communications Energy Systems (SPACES) that supports Combat Outposts and Observation Points.  Both of these exploit the use of solar energy technology to recharge batteries and directly power electronic equipment without the need for re-fueling generators.\n\nThe second suite of devices is the Family of USMC Tactical Power Supplies.  This includes both shelter based (semi-rugged) and fully ruggedized power supplies (operate outdoors) that convert grid power (alternating current) to vehicle based power (direct current).  These power supplies support all elements across the USMC with standard models that provide variable electrical output to support a wide electrical range of operation.  The suite also includes vehicle mounted inverters that convert vehicle 24 Volt direct current to 120 Volt alternating current to allow on-the-move operation of equipment that previously was only able to be used while stationary.\n\nThe third suite of devices is On-Board Vehicle Power (OBVP) systems, that modify and implement power generation onboard multiple vehicles (High Mobility Multipurpose Wheeled Vehicle and Medium Tactical Vehicle).  The HMMWV based system provides engine drive, electric AC power comparable to what a HMMWV towable, trailer mounted generator could provide (25 kilowatts).  This saves embark space and weight for highly expeditionary applications.  The MTV based system provides engine drive, electric AC power comparable to what a generator mounted to the bed of the truck could provide (100 kilowatts).  This frees up cargo space, while saving space and weight also for highly expeditionary applications.\n\nThe fourth suite of devices is the Family of Radio Power Adaptors (RPA), which provide an alternative power source for each radio in the Marine Corps (seven different models).  Instead of consuming batteries when in garrison\/shelter operations, RPAs allow the radios to be operated from central power sources (such as GREENS and SPACES) or grid power (120 volt AC generator).  This provides cost avoidance, conservation of batteries, and flexibility of operations.\n\nThe fifth suite is the Battery Management and Sustainment Systems (BMASS) that support all lead-acid batteries used in vehicles and artillery systems, and lithium ion rechargeable batteries used in command, control and communications systems.  The suite consists of battery chargers, battery analyzers, and battery safety management systems for both chemistry of batteries, and for both garrison (semi-rugged) and deployed operations (ruggedized).  As the USMC (and all services) move towards fully adopting rechargeable batteries for energy efficiency and logistics demand reduction, BMASS is critical to support numerous weapons, engineer, vehicle, and communication systems that are highly dependent on batteries for their operation."
        },
        "Justification": {
            "val": "MOBILE POWER EQUIPMENT:  \nFY2013 Base Appropriation: $31.420M \nFunded the procurement of Mobile Electric Power Distribution Systems (MEPDIS-R), 5KW 60HZ AMMPS, 10KW 60 HZ AMMPS, 15KW 60HZ AMMPS, 30KW 60HQ AMMPS, 60KW 60HZ AMMPS, ITEG II support equipment, Floodlight Sets, AMMPS Initial Issue provisioning. Funding is required to meet the Approved Acquisition Objectives outlined in the Total Force Structure Management System.\n\nFY14 Baseline Appropriation: $35.135M \nFunds the procurement of MEPDIS-R, 5KW 60HZ AMMPS, 10KW 60 HZ AMMPS, 15KW 60HZ AMMPS, 30KW 60HZ AMMPS, 60KW 60HZ AMMPS, 2K 60 HZ Medium Tactical Generator (MTG), 3KW 60HZ TQG, 100KW 60 HZ TQG, Integrated Trailer-ECU Generator (ITEGII), ITEGII support equipment, Grounding Rods, ILS Support. Funding is required to meet the Approved Acquisition Objectives outlined in the Total Force Structure Management System.\n\nFY2015 Base Appropriation Request: $4.890M\nFunds the procurement of 2K 60 HZ Medium Tactical Generator (MTG), 3KW 60HZ TQG, Grounding Rods and ILS Support. Continues the replacement of about 7,000 medium TQGs with more reliable, fuel-efficient and Environmental Protection Agency (EPA)-approved AMMPS generators.  The funding decrease from FY14 to FY15 reflects the requirements and resource realignment of all commodity areas and budget adjustments.\n\nADVANCED POWER SOURCES:\nFY2013 Base Appropriation: $24.758M\nFunded the Solar Portable Alternative Communications Energy Systems (SPACES), Alternative Power Sources for Communications Equipment (APSCE) consists of 24V Radio Power Adaptor, Battery Solar Charger, Benchtop Power Supply, Handheld Radio Power Adaptor, BB2590 Batteries and 117G Radio Power Adaptor.  Procured OBVP HMMWV Support and OBVP MTVR Kits. Funding is required to meet the Approved Acquisition Objectives outlined in the Total Force Structure Management System.\n\nFY2014 Base Appropriation: $26.218M   \nFunds will procure SPACES, APSCE consists of 24V Radio Power Adaptor, Battery Solar Charger, Handheld Radio Power Adaptor, BB 2590 Batteries and 117G Radio Power Adaptor, OBVP HMMWV Support, OBVP MTVR Kits, Stay Alive Power Supply, Solar Panel Cases, BMASS, Lithium Battery Support and 117G Radio Power Adaptor, Power Supplies consists of Benchtop Power Supply and World Wide Power Supplies (WWPS) and CEOSS Support.  \n\nFY2015 Base Appropriation Request: $4.095M \nFunds the procurement of Ground Renewable Expeditionary Energy Network System (GREENS).  Funding is required to meet the Approved Acquisition Objectives outlined in the Total Force Structure Management System. Funding decreases from FY14 to FY15 supports the Department of the Navy's focus on requirements and resource realignment of all commodity areas.\n\nOCO: \nMOBILE POWER EQUIPMENT:\nFY13 Overseas Contingency Operations (OCO): $11.330M\nFunded the procurement of the 30\/60KW AMMPS in support of in theater operations.\n\nFY14 Overseas Contingency Operations (OCO): $2.004M\nFunds the procurement of the Mobile Electric Power Distribution Systems - Replacement (MEPDIS-R) and associated logistics support for replacement of combat losses in theater.\n\nADVANCED POWER SOURCES:\nFY13 Overseas Contingency Operations (OCO):  $1.817M\nFunded the procurement of Battery chargers, 24V Radio Power Adaptor, Suitcase Portable Charger, GREENS, APSCE consists of BB2590 Batteries, Stay Alive Power Supply, Solar Panel Cases, Battery Management and Sustainment Systems (BMASS), Lithium Battery Support and 117G Radio Power Adaptor to support in theater losses."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Power Equipment Assorted"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "216.588"
                            },
                            "PriorYear": {
                                "val": "69.326"
                            },
                            "CurrentYear": {
                                "val": "63.357"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.985"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "8.985"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "216.588"
                            },
                            "PriorYear": {
                                "val": "69.326"
                            },
                            "CurrentYear": {
                                "val": "63.357"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.985"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "8.985"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "216.588"
                            },
                            "PriorYear": {
                                "val": "69.326"
                            },
                            "CurrentYear": {
                                "val": "63.357"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.985"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "8.985"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "Mobile Power Equipment"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "1.1.1) Advanced Medum Mobile Power Systems (AMMPS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "87.573"
                                                        },
                                                        "PriorYear": {
                                                            "val": "29.62"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.2) Power Equipment Assorted"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "55.381"
                                                        },
                                                        "PriorYear": {
                                                            "val": "6.229"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "21.613"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "4.345"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "4.345"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.3) Mobile Electric Power Distribution System Replacement (MEPDIS-R)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "19.512"
                                                        },
                                                        "PriorYear": {
                                                            "val": "5.536"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "6.717"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.4) Advanced MEPDIS"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.5) Floodlights"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "1.305"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.6) Integrated ECU-Trailer Generator"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "CurrentYear": {
                                                            "val": "75"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "4.961"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "6.75"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "CurrentYear": {
                                                            "val": "90000"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.7) Power Equipment Logistics Support Items"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "1.904"
                                                        },
                                                        "PriorYear": {
                                                            "val": "1.365"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2.059"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.545"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.545"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "170.636"
                                            },
                                            "PriorYear": {
                                                "val": "42.75"
                                            },
                                            "CurrentYear": {
                                                "val": "37.139"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "4.89"
                                            },
                                            "BudgetYearOne": {
                                                "val": "4.89"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "170.636"
                                        },
                                        "PriorYear": {
                                            "val": "42.75"
                                        },
                                        "CurrentYear": {
                                            "val": "37.139"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.89"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.89"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Advanced Power Sources"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "2.1.1) Alternate Power Sources for Comm\/Electric Equip (APSCE)-Reserves"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "4.393"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.91"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.91"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "2.1.2) Alternate Power Sources for Communications\/Electronic Equipment (APSCE)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "42.392"
                                                        },
                                                        "PriorYear": {
                                                            "val": "26.575"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "18.611"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.185"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.185"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "2.1.3) Power Supplies"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "3.56"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "3.214"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "45.952"
                                            },
                                            "PriorYear": {
                                                "val": "26.575"
                                            },
                                            "CurrentYear": {
                                                "val": "26.218"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "4.095"
                                            },
                                            "BudgetYearOne": {
                                                "val": "4.095"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "45.952"
                                        },
                                        "PriorYear": {
                                            "val": "26.575"
                                        },
                                        "CurrentYear": {
                                            "val": "26.218"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.095"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.095"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}