{
    "id": "6549a1e8e79a2c78b99f54615d3f6267c52bfe61",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_DEFENSE_SOCOM_PROCUREMENT_JustificationBook_United_States_Special_Operations_Command_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_United_States_Special_Operations_Command_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "0607TR"
        },
        "LineItemTitle": {
            "val": "TACTICAL RADIO SYSTEMS"
        },
        "P1LineNumber": {
            "val": "85"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Special Operations Command"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Procurement Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "269.388"
                },
                "PriorYear": {
                    "val": "69.197"
                },
                "Total": {
                    "val": "338.585"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "269.388"
                },
                "PriorYear": {
                    "val": "69.197"
                },
                "Total": {
                    "val": "338.585"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "269.388"
                },
                "PriorYear": {
                    "val": "69.197"
                },
                "Total": {
                    "val": "338.585"
                }
            }
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "1160476BB"
                }
            ]
        },
        "Description": {
            "val": "Beginning in FY2014, this Line Item has been consolidated into SOCOM Warrior Systems <$5M line item.\n\nThe Tactical Radio Systems line item procures Special Operations Forces (SOF) radio systems to meet emergent requirements in support of SOF. SOF units require tactical radio systems that improve their warfighting capability without degrading their mobility. This line item will procure lightweight, efficient and interoperable SOF radios. \n\nTactical radios rapidly and seamlessly establish and maintain mobile and fixed Command and Control (C2) communications between operational elements and higher echelon headquarters, allowing SOF to operate with any force combination in multiple environments. They also provide interoperability with all Services, various agencies of the U.S. Government, Air Traffic Control, commercial agencies, and allied coalition forces."
        },
        "Justification": {
            "val": "1. SOF Tactical Communications (STC) will procure the next generation SOF communication system and replace most of the currently fielded SOF suite of radios. The capability will consist of five basic form factors: 1) Manpack device will be a multi-band device capable of being carried by an individual or being mounted on various SOF platforms; 2) Fixed configuration will be a multi-band and\/or High-Frequency (HF) device designed for implementation into air\/ground\/sea platforms or base stations; 3) HF device in a manpack configuration will be capable of being mounted on various SOF platforms; 4) Handheld device will include both an urban and maritime variant; 5) Individual device will be a small handheld device to provide intra-team communications capability of voice, data and video. This system will introduce additional capabilities to SOF to improve current situational awareness capabilities and performance on SOF platforms. Capabilities will include: real time, hostile and friendly force information; Line of Sight (LOS) and Beyond LOS communications; and access to situational awareness in the form of intelligence inputs, broadcasts, and networks. This system will be a key component of an integrated network providing information connectivity among SOF, the Services, other government agencies, and potentially indigenous and surrogate forces.  \n\nThis program was reduced in FY 2013 by $5.043 million due to sequestration.  This cancelled the procurement of 158 handheld, 75 manpack and 16 HF radios. \n \n2.  Radio Integration System (RIS), formerly Joint Base Station (JBS), is an evolutionary acquisition program to procure the most current tactical C2 communications system for deployed and forward-based SOF and Theater Special Operations Commanders supporting OCO and other SOF activities. The procured solution consists of a full-scaled deployable transit case variant, a deployable downsized transit case variant, and a fixed base station variant. All variants are capable of integrating existing and future radios and are compliant with the Joint Tactical Radio System. RIS interfaces, enhance, and combine multiple single-channel radios into one integrated C2 suite. The variants will enable the SOF operational commander to exercise reliable, effective, and efficient C2 functions regardless of area of operation. Moreover, the system provides the SOF Commander and staff with the capability to send and receive voice, data, and messages between the inserted SOF war-fighter and higher headquarters, liaison officers, other government agencies, and coalition partners.  \n\nThis program was reduced in FY 2013 by $0.385 million due to sequestration.  This cancelled the procurement of one RIS-Light as a result. \n\n3.  Blue Force Tracking (BFT) is a family of devices used to remotely track and monitor friendly forces. The capability enhances C2, threat warning, force protection, situational awareness, combat search and rescue, counter-fratricide, battlefield visualization and combat identification. This capability is unique to SOF because it requires the devices to be lightweight, portable, secure and a Low Probability of Intercept\/Low Probability of Detection. SOF systems include the miniature transmitter and the handheld device that provides automated transmission of position location information and brevity codes supporting both ground and air assets. This information is collected by national assets, relayed to select command units, and displayed on the receiving unit’s common operational picture.  \n\nThis program was reduced in FY 2013 by $0.408 million due to sequestration.  This cancelled the procurement of 51 BFT systems as a result."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Tactical Radios"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "SOF Tactical Communications"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Hardware - Handheld"
                                            },
                                            "ItemNumber": {
                                                "val": "1"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "1947"
                                                    },
                                                    "PriorYear": {
                                                        "val": "273"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "19.47"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.004"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.01"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.011"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Hardware - Handheld - Capital Equipment Replacement Program (CERP)"
                                            },
                                            "ItemNumber": {
                                                "val": "2"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "2973"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "43.944"
                                                    },
                                                    "PriorYear": {
                                                        "val": "32.711"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.011"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Hardware - Manpack - CERP"
                                            },
                                            "ItemNumber": {
                                                "val": "3"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "498"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "10.518"
                                                    },
                                                    "PriorYear": {
                                                        "val": "16.925"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.034"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Hardware - High Frequency"
                                            },
                                            "ItemNumber": {
                                                "val": "4"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "73"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.775"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2.411"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.033"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Hardware - High Frequency - CERP"
                                            },
                                            "ItemNumber": {
                                                "val": "5"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "282"
                                                    },
                                                    "PriorYear": {
                                                        "val": "111"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "4.242"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.655"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.015"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.033"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Prior Year Funding"
                                            },
                                            "ItemNumber": {
                                                "val": "6"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "120.102"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "200.051"
                                        },
                                        "PriorYear": {
                                            "val": "58.706"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "Joint Base Station (JBS)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Transit Case Variant Hardware (RIS)"
                                            },
                                            "ItemNumber": {
                                                "val": "1"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.465"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.846"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.846"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Lightweight Transit Case Variant Hardware (RIS Lite)"
                                            },
                                            "ItemNumber": {
                                                "val": "2"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "5"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "10.357"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.8"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.36"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "JBS Cong Add Prior Funding"
                                            },
                                            "ItemNumber": {
                                                "val": "3"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.308"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.154"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Engineering Change Proposal For RIS Family Of Systems"
                                            },
                                            "ItemNumber": {
                                                "val": "4"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "166"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1.333"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.008"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "OCO Prior Year Funding"
                                            },
                                            "ItemNumber": {
                                                "val": "5"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "20.514"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Prior Year Funding"
                                            },
                                            "ItemNumber": {
                                                "val": "6"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "11.236"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "52.88"
                                        },
                                        "PriorYear": {
                                            "val": "3.979"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "Blue Force Tracking Devices (BFT)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "BFT Devices"
                                            },
                                            "ItemNumber": {
                                                "val": "1"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "814"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "14.046"
                                                    },
                                                    "PriorYear": {
                                                        "val": "6.512"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.008"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "14.046"
                                        },
                                        "PriorYear": {
                                            "val": "6.512"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            },
                            {
                                "Name": {
                                    "val": "Special Mission Radio Systems"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Prior Year Funding"
                                            },
                                            "ItemNumber": {
                                                "val": "1"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "65"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.411"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.037"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.411"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "269.388"
                            },
                            "PriorYear": {
                                "val": "69.197"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}