{
    "id": "7cea011273f84975c4b992945b20dece193ccab4",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_DEFENSE_CBDP_PROCUREMENT_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "PHM001"
        },
        "LineItemTitle": {
            "val": "CB PROTECTION AND HAZARD MITIGATION"
        },
        "P1LineNumber": {
            "val": "96"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Chemical\/Biological Defense"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "CBDP"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "150.392"
                },
                "BudgetYearOne": {
                    "val": "150.392"
                },
                "BudgetYearTwo": {
                    "val": "149.038"
                },
                "BudgetYearThree": {
                    "val": "188.217"
                },
                "BudgetYearFour": {
                    "val": "207.199"
                },
                "BudgetYearFive": {
                    "val": "183.801"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "878.647"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "150.392"
                },
                "BudgetYearOne": {
                    "val": "150.392"
                },
                "BudgetYearTwo": {
                    "val": "149.038"
                },
                "BudgetYearThree": {
                    "val": "188.217"
                },
                "BudgetYearFour": {
                    "val": "207.199"
                },
                "BudgetYearFive": {
                    "val": "183.801"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "878.647"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "150.392"
                },
                "BudgetYearOne": {
                    "val": "150.392"
                },
                "BudgetYearTwo": {
                    "val": "149.038"
                },
                "BudgetYearThree": {
                    "val": "188.217"
                },
                "BudgetYearFour": {
                    "val": "207.199"
                },
                "BudgetYearFive": {
                    "val": "183.801"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "878.647"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Beginning in FY15, the Chemical Biological Protection & Hazard Mitigation (CB P&HM) Budget Line Item (BLIN) facilitates a family-of-systems approach across the domains providing protective & hazard mitigation capabilities to the Joint Force through a consolidated CB P&HM portfolio that comprises efforts across individual and collective protection, decontamination, and medical countermeasures (pretreatments, prophylaxis and therapeutics).  Efforts previously captured under the Individual Protection (GP1000), Collective Protection (PA1600), and medical countermeasures under the Joint Bio Defense Program (Medical) (MA0800) BLINs are now consolidated in this BLIN. \n\nSpecific protection efforts provided include protective masks, respiratory systems, protective clothing, collective protection on numerous platforms, and medical countermeasure pre-treatments and prophylaxes. \n\nIndividual protection efforts are focused equipment that both improves current protection levels and reduces the physiological and logistical burden on the individual soldier, sailor, airman or marine.  The goal is to procure equipment that will allow for the individual to operate in a contaminated CB environment with minimal degradation in his\/her performance.  Individual protection programs funded include; (1) The Joint Service Aircrew Mask (JSAM) system is a lightweight Chemical, Biological, Radiological and Nuclear (CBRN) protective mask consisting of mask, filter, blower, and accessories optimized to minimize impact on the wearer's performance, maximize its ability to interface with aircrew protective clothing, and provide improved field of view when compared to current protective masks.  (2) The Joint Service General Purpose Mask (JSGPM) is a lightweight, protective Nuclear, Biological and Chemical (NBC) mask system.  The JSGPM will provide above-the-neck, head\/eye\/respiratory protection against Chemical and Biological (CB) agents, radioactive particles, and Toxic Industrial Materials (TIMs).  (3) The Uniform Integrated Protection Ensemble (UIPE) is a supplemental CBRN protective system with the capability that enables selection of a tailored material solution based on the expected threat level for any given mission or platform.  \n\nCollective Protection provides life-sustaining and continued operational capabilities to the Warfighter and their equipment in support of military missions and operations as a seamless, integrated sub-system to all manner of platform, which utilizes state-of-the-art chemical, biological, radiological and nuclear (CBRN) protective technologies.  The CB Collective Protection systems will be smaller, lighter, less costly, and more easily supported logistically at the crew, unit, ship, and aircraft level.  Collective protection platforms include shelters, vehicles, ships, aircraft, buildings, and hospitals.  Collective protection programs funded include;\n\n(1) The Collective Protection System (CPS) Backfit Program installs CPS in mission critical medical and command and control spaces on the Navy's Landing Helicopter Dock (LHD) amphibious ship class.  (2) The Collective Protected Field Hospitals (CPFH) provides Joint Service medical personnel CBRN collective protection to their medical treatment facilities.  The Army's Collectively Protected Deployable Medical System (CP DEPMEDS); the Air Force's Collectively Protected Expeditionary Medical Support (CP EMEDS); and the Navy's Chemically Hardened Expeditionary Medical Facility (CH EMF) converts the service's field hospitals into a fully operational, environmentally controlled, and collectively protected medical treatment facility.  The requirement is to sustain medical operations in a CB contaminated environment for 72 hours.  (3) The Joint Expeditionary Collective Protection (JECP) provides the joint expeditionary forces a collective protection (CP) capability which is lightweight, compact, modular, and affordable.  The JECP family of systems allows the application of CP to transportable soft-sided shelters, enclosed spaces of opportunity, and in remote austere locations as a standalone resource.  JECP will be capable of protecting personnel groups of varying size, unencumbered by individual protective equipment (IPE), from effects of chemical and biological (CB) agents, toxic industrial materials (TIMs), radiological (R) particles, heat, dust, and sand.  (4) Mounted on a platform, the Chemical Biological Protective Shelter (CBPS) provides a mobile, contamination free, environmentally controlled working area for medical, combat service, and combat service support personnel to obtain relief from the continuous need to wear CB protective clothing for greater than 72 hours of operation.\n\nDecontamination efforts facilitate the removal and detoxification of contaminants from materials without inflicting injury to personnel or damage to equipment or the environment.  Procured items are environmentally friendly, reduce logistics burdens, and are effective against traditional and nontraditional agents on sensitive and non-sensitive equipment.  Contamination control techniques have been developed which minimize the extent of contamination pickup and transfer and maximize the ability of units to remove contaminates both on-the-move and during dedicated decontamination operations.  Decontamination programs funded include;\n\n(1) Decontamination Family of Systems (DFoS) General Purpose Decontaminants (GPD) which will procure Traditional \/ Non-Traditional Agent (NTA) decontaminant(s) that will provide the Warfighter an increased capability to decontaminate\/mitigate traditional agents \/ NTAs on personnel, equipment, vehicle interiors\/exteriors, terrain, and fixed facilities.  (2) Contaminated Human Remains Pouch (CHRP) which will procure systems with the capability to protect personnel handling and processing human remains contaminated with Chemical Biological Radiological (CBR) contamination for safe intra-theater transport.  The CHRP provides the warfighter the capability to safely handle, transport, and temporarily store or inter contaminated human remains in a theater of operations.  (3) DFoS Joint Sensitive Equipment Wipes (JSEW) will provide immediate\/operational decontamination capabilities for sensitive and non-sensitive equipment in hostile and non-hostile environments that have been exposed to chemical contamination. \n\nMedical Countermeasures (MCMs) include capabilities to protect the warfighter against CBR threats and mitigate illness, suffering, and death.  MCMs will provide end-to-end countermeasures against emerging infectious diseases, genetically engineered threats, naturally occurring biological phenomena, novel chemical agents, and radiological threats.  Program efforts include core medical efforts aimed at delivering pretreatments\/prophylaxes and therapeutics to the warfighter.  MCMs in development by the CBDP traditionally fall into one of two categories: 1) pretreatments\/prophylaxes such as a plague vaccine and 2) post-exposure, pre\/post-symptomatic therapeutics such as the Advance Anticonvulsant System.  A family-of-systems approach for medical defense against threats is required to provide protection, to sustain performance in multiple environments, and to provide for self-aid\/buddy-aid and medical treatment of CBR casualties.  Fielding of prophylactic, pre-treatment, and therapeutic drugs and medical devices requires Food and Drug Administration (FDA) approval.  Medical Countermeasure programs funded include; (1) the Advanced Anticonvulsant System (AAS) consists of the drug midazolam in an auto-injector to be used as treatment for nerve agent induced seizures and will be a replacement for the currently fielded Convulsant Antidote for Nerve Agent (CANA) auto-injector, which uses diazepam.  (2) Smallpox Vaccinia Immune Globulin Intravenous (VIGIV).  (3) Recombinant Botulinum A\/B vaccine program."
        },
        "Justification": {
            "val": "Operational forces across the continuum of global, contingency, special operations\/low intensity conflict, counternarcotics, and other high-risk missions have an immediate need to survive and sustain operations in a CB threat environment.  Efforts in this BLIN combined provide protective equipment and medical countermeasures that supports protection prior to potential operations and mitigates the hazard if exposed."
        },
        "ModsOutYearDelta": {
            "Quantity": {
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "375000"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "375000"
                }
            },
            "Cost": {
                "BudgetYearTwo": {
                    "val": "0.000"
                },
                "BudgetYearThree": {
                    "val": "0.000"
                },
                "BudgetYearFour": {
                    "val": "12.079"
                },
                "BudgetYearFive": {
                    "val": "46.638"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "58.717"
                }
            }
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "ADVANCED ANTICONVULSANT SYSTEM (AAS)"
                    },
                    "ItemNumber": {
                        "val": "JM6677"
                    },
                    "Remarks": {
                        "val": "Prior to FY 2015, the [ADVANCED ANTICONVULSANT SYSTEM (AAS)] program was reported under CBDP line item (BLIN) [MA0800 - JOINT BIO DEFENSE PROGRAM (MEDICAL)]\n\nThe Advanced Anticonvulsant System (AAS) will consist of the drug midazolam in an autoinjector for use in treating nerve agent induced seizures and will replace the currently fielded Convulsant Antidote for Nerve Agent (CANA) autoinjector, which uses diazepam.  Procurement funds will support Initial Operational Capability (IOC) supporting the AAS phase-in\/CANA phase-out plan along with transitioning the program to the Defense Logistics Agency (DLA) for sustainment.\n\nIn October 2013 the manufacturer notified the government that modifications to the manufacturing line are required, and would result in delays to production.  The Government is working with the contractor to ensure that manufacturing upgrades are compliant with FDA requirements, and delays are mitigated to the fullest extent possible.  The contract will be modified to address these additional requirements, and the program is working to determine the path forward and revised timeline for FDA approval and delivery of IOC\/FOC.\n\n\nJustification: FY15 funding supports procurement of IOC."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.5"
                            },
                            "BudgetYearOne": {
                                "val": "2.5"
                            },
                            "BudgetYearTwo": {
                                "val": "0.000"
                            },
                            "BudgetYearThree": {
                                "val": "0.000"
                            },
                            "BudgetYearFour": {
                                "val": "0.000"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "2.5"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.5"
                            },
                            "BudgetYearOne": {
                                "val": "2.5"
                            },
                            "BudgetYearTwo": {
                                "val": "0.000"
                            },
                            "BudgetYearThree": {
                                "val": "0.000"
                            },
                            "BudgetYearFour": {
                                "val": "0.000"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "2.5"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.5"
                            },
                            "BudgetYearOne": {
                                "val": "2.5"
                            },
                            "BudgetYearTwo": {
                                "val": "0.000"
                            },
                            "BudgetYearThree": {
                                "val": "0.000"
                            },
                            "BudgetYearFour": {
                                "val": "0.000"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "2.5"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "AAS"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "150000"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "150000"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.5"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.5"
                                                        },
                                                        "Total": {
                                                            "val": "2.5"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.017"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.000"
                                            },
                                            "PriorYear": {
                                                "val": "0.000"
                                            },
                                            "CurrentYear": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.5"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.5"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearThree": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearFour": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearFive": {
                                                "val": "0.000"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "2.5"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.5"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.5"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "2.5"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "CB PROTECTIVE SHELTER (CBPS)"
                    },
                    "ItemNumber": {
                        "val": "R12301"
                    },
                    "Remarks": {
                        "val": "The Services need a highly mobile, self-contained collective protection system which can provide a contamination free working area for Echelon I and II medical treatment facilities and other selected units.  The Chemical and Biological Protective Shelter (CBPS) satisfies this need and replaces the M51 Chemical Protective Shelter.  The system consists of a Collectively Protected (CP) shelter modularized and integrated into a service selected prime-mover.  The system is completely self contained, self powered, mobile, and adaptable to a variety of missions.  CBPS relieves medical, combat service, and combat service support personnel from wearing chemical and biological protective clothing.  The system is capable of operating continuously for 72 hours providing a contamination free environmentally controlled working area.\n\n\nJustification: FY15 procures 38 CBPS CB modules. The CBPS has been identified as a critical shortfall item for the past five (5) years and is essential to the National Guard in support of both its national security and homeland missions. Recent events and natural disasters highlighted the need for a protected, mobile medical capability."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "30.4"
                            },
                            "BudgetYearOne": {
                                "val": "30.4"
                            },
                            "BudgetYearTwo": {
                                "val": "21.001"
                            },
                            "BudgetYearThree": {
                                "val": "21.3"
                            },
                            "BudgetYearFour": {
                                "val": "31.9"
                            },
                            "BudgetYearFive": {
                                "val": "36.993"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "141.594"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "30.4"
                            },
                            "BudgetYearOne": {
                                "val": "30.4"
                            },
                            "BudgetYearTwo": {
                                "val": "21.001"
                            },
                            "BudgetYearThree": {
                                "val": "21.3"
                            },
                            "BudgetYearFour": {
                                "val": "31.9"
                            },
                            "BudgetYearFive": {
                                "val": "36.993"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "141.594"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "30.4"
                            },
                            "BudgetYearOne": {
                                "val": "30.4"
                            },
                            "BudgetYearTwo": {
                                "val": "21.001"
                            },
                            "BudgetYearThree": {
                                "val": "21.3"
                            },
                            "BudgetYearFour": {
                                "val": "31.9"
                            },
                            "BudgetYearFive": {
                                "val": "36.993"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "141.594"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Prior\/Future combined efforts"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "21.001"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "21.3"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "31.9"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "36.993"
                                                        },
                                                        "ToComplete": {
                                                            "val": "0"
                                                        },
                                                        "Total": {
                                                            "val": "111.194"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CBPS UP-ARMORED"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "38"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "38"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "27.678"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "27.678"
                                                        },
                                                        "Total": {
                                                            "val": "27.678"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "728.368"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "728.368"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.000"
                                            },
                                            "PriorYear": {
                                                "val": "0.000"
                                            },
                                            "CurrentYear": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "27.678"
                                            },
                                            "BudgetYearOne": {
                                                "val": "27.678"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "21.001"
                                            },
                                            "BudgetYearThree": {
                                                "val": "21.3"
                                            },
                                            "BudgetYearFour": {
                                                "val": "31.9"
                                            },
                                            "BudgetYearFive": {
                                                "val": "36.993"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "138.872"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.678"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.678"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.001"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.3"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.9"
                                        },
                                        "BudgetYearFive": {
                                            "val": "36.993"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "138.872"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "First Article Testing"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.715"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.715"
                                                    },
                                                    "Total": {
                                                        "val": "0.715"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Engineering Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.25"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.25"
                                                    },
                                                    "Total": {
                                                        "val": "0.25"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Integrated Logistics Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.4"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.4"
                                                    },
                                                    "Total": {
                                                        "val": "0.4"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Management Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.5"
                                                    },
                                                    "Total": {
                                                        "val": "0.5"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "New Equipment Training"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.2"
                                                    },
                                                    "Total": {
                                                        "val": "0.2"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Total Package Fielding (spares)"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.657"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.657"
                                                    },
                                                    "Total": {
                                                        "val": "0.657"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.722"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.722"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "2.722"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "CBRN UNIFORM INTEGRATED PROTECTION ENSEMBLE (UIPE)"
                    },
                    "ItemNumber": {
                        "val": "MA0401"
                    },
                    "Remarks": {
                        "val": "Prior to FY 2015, the [CBRN UNIFORM INTEGRATED PROTECTION ENSEMBLE (UIPE)] program was reported under CBDP line item (BLIN) [GP1000 - INDIVIDUAL PROTECTION]\n\nThe Uniform Integrated Protection Ensemble (UIPE) is a Chemical, Biological, Radiological and Nuclear (CBRN) protective system offering the capability to select a tailored material solution based on the expected threat level commensurate with operational mission requirements.  This ability to tailor the type and level of the protective system will result in optimized protection, thereby minimizing physiological and psychological burdens on the Warfighter and affording the lowest impact on the operational mission.  The UIPE program will develop, integrate, test, procure and field incremental capability solutions that are modular in function and offer capability improvement over current systems.\n\t\t\nThe UIPE will be a single system that provides individual CBRN protection to the Warfighter while reducing physiological and psychological burdens associated with the weight, bulk, thermal strain, and encumbrance of wearing CBRN protective equipment.  The UIPE will be designed to permit efficient communications, be compatible with current and developmental CBRN protective component systems, and retain CBRN protection capability after exposure to petroleum, oils, lubricants, and other environmental contaminants.  The garment will be suitable for wear while performing combat operations, whether on land or at sea, in any climate, with minimal impact on combat effectiveness.  The UIPE may include hooded and non-hooded variants.  It will also be compatible with current clothing and equipment, including load-bearing equipment, helmets, handwear, footwear, body cooling systems, and protective masks of the respective Service and Special Operations Forces (SOF).\n\n\nJustification: FY15 procures 9,829 UIPE garments to meet Joint Service CBRN equipment requirements.\n\n\nRDT&E Code B Item: 0603884BP\/Proj IP4; 0604384BP\/Proj IP5\n\nIP4\/UIPE: RDT&E ; FY15 - 2.905M; FY16 - 4.380M\nIP5\/UIPE: RDT&E FY12 and Prior - 3.923M; FY13 - 2.829M; FY17 - 4.380M; FY18 - 4.380M; FY19 - 4.459M\n\nDEVELOPMENT\/TEST STATUS AND MAJOR MILESTONES\n\nUIPE - Milestone A: May 2015\nUIPE - Manufacturing Readiness Review (MRA): Jun 2016\nUIPE - Capability Development Document (CDD): Apr 2016\nUIPE - Joint Integrated Logistics Assessment (JILA): Jul 2016\nUIPE - Milestone B: Sep 2016\nUIPE - Critical Design Review (CDR): Dec 2016\nUIPE - DT\/OT (Jul 2017 to Mar 2018)\nUIPE - Competitive Prototyping (Jun 2015 to Jun 2016)\nUIPE - PDR: Sep 2016"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.948"
                            },
                            "BudgetYearOne": {
                                "val": "6.948"
                            },
                            "BudgetYearTwo": {
                                "val": "11.101"
                            },
                            "BudgetYearThree": {
                                "val": "11.101"
                            },
                            "BudgetYearFour": {
                                "val": "11.101"
                            },
                            "BudgetYearFive": {
                                "val": "11"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "51.251"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.948"
                            },
                            "BudgetYearOne": {
                                "val": "6.948"
                            },
                            "BudgetYearTwo": {
                                "val": "11.101"
                            },
                            "BudgetYearThree": {
                                "val": "11.101"
                            },
                            "BudgetYearFour": {
                                "val": "11.101"
                            },
                            "BudgetYearFive": {
                                "val": "11"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "51.251"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.948"
                            },
                            "BudgetYearOne": {
                                "val": "6.948"
                            },
                            "BudgetYearTwo": {
                                "val": "11.101"
                            },
                            "BudgetYearThree": {
                                "val": "11.101"
                            },
                            "BudgetYearFour": {
                                "val": "11.101"
                            },
                            "BudgetYearFive": {
                                "val": "11"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "51.251"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Prior\/Future combined efforts"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "11.101"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "11.101"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "11.101"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "11"
                                                        },
                                                        "ToComplete": {
                                                            "val": "0"
                                                        },
                                                        "Total": {
                                                            "val": "44.303"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "UIPE 1 Protective Garment"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "9829"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "9829"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "5.062"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "5.062"
                                                        },
                                                        "Total": {
                                                            "val": "5.062"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.515"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.515"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.000"
                                            },
                                            "PriorYear": {
                                                "val": "0.000"
                                            },
                                            "CurrentYear": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "5.062"
                                            },
                                            "BudgetYearOne": {
                                                "val": "5.062"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "11.101"
                                            },
                                            "BudgetYearThree": {
                                                "val": "11.101"
                                            },
                                            "BudgetYearFour": {
                                                "val": "11.101"
                                            },
                                            "BudgetYearFive": {
                                                "val": "11"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "49.365"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.062"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.062"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.101"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.101"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.101"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "49.365"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Production Lot Testing"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.295"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.295"
                                                    },
                                                    "Total": {
                                                        "val": "0.295"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Program Management"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.06"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.06"
                                                    },
                                                    "Total": {
                                                        "val": "1.06"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Engineering Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.531"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.531"
                                                    },
                                                    "Total": {
                                                        "val": "0.531"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.886"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.886"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "1.886"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "CONTAMINATED HUMAN REMAINS POUCH (CHRP)"
                    },
                    "ItemNumber": {
                        "val": "JD0063"
                    },
                    "Remarks": {
                        "val": "The Contaminated Human Remains Pouch (CHRP) will procure systems with the capability to protect personnel handling and processing human remains contaminated with Chemical Biological Radiological (CBR) contamination for safe intra-theater transport.  The CHRP provides the warfighter the capability to safely handle, transport, and temporarily store or inter contaminated human remains in a theater of operations.\n\n\nJustification: FY15 funds will procure 1,000 CHRP systems."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.865"
                            },
                            "BudgetYearOne": {
                                "val": "2.865"
                            },
                            "BudgetYearTwo": {
                                "val": "1.542"
                            },
                            "BudgetYearThree": {
                                "val": "0.000"
                            },
                            "BudgetYearFour": {
                                "val": "0.000"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "4.407"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.865"
                            },
                            "BudgetYearOne": {
                                "val": "2.865"
                            },
                            "BudgetYearTwo": {
                                "val": "1.542"
                            },
                            "BudgetYearThree": {
                                "val": "0.000"
                            },
                            "BudgetYearFour": {
                                "val": "0.000"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "4.407"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.865"
                            },
                            "BudgetYearOne": {
                                "val": "2.865"
                            },
                            "BudgetYearTwo": {
                                "val": "1.542"
                            },
                            "BudgetYearThree": {
                                "val": "0.000"
                            },
                            "BudgetYearFour": {
                                "val": "0.000"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "4.407"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Prior\/Future combined efforts"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "1.542"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "0.000"
                                                        },
                                                        "ToComplete": {
                                                            "val": "0"
                                                        },
                                                        "Total": {
                                                            "val": "1.542"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CHRP System"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1000"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1000"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.865"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.865"
                                                        },
                                                        "Total": {
                                                            "val": "2.865"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "2.865"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.865"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.000"
                                            },
                                            "PriorYear": {
                                                "val": "0.000"
                                            },
                                            "CurrentYear": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.865"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.865"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "1.542"
                                            },
                                            "BudgetYearThree": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearFour": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearFive": {
                                                "val": "0.000"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "4.407"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.865"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.865"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.542"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "4.407"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "DECONTAMINATION FAMILY OF SYSTEMS (DFoS)"
                    },
                    "ItemNumber": {
                        "val": "JD0050"
                    },
                    "Remarks": {
                        "val": "The Decontamination Family of Systems (DFoS) - General Purpose Decontaminant (GPD) Program will provide the Warfighter an increased capability to decontaminate hardened military equipment, procuring quantities of chemical and biological thorough decontaminants for tactical vehicles, shipboard surfaces, crew-served weapons and individual or personnel weapons.\n\nThe The Decontamination Family of Systems (DFoS) - Joint Sensitive Equipment Wipe (JSEW) Program will provide chemical agent equipment decontamination wipes for sensitive (optics, night vision goggles, Toughbook's, etc.) and non-sensitive equipment in support of immediate and operational decontamination.\n\n\nJustification: FY15 funds will procure 20,000 gallons of GPD chemical and biological (CB) agent thorough decontaminants for hardened military equipment and 62,829 JSEW chemical agent equipment decontamination wipes for sensitive and non-sensitive equipment."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "3.45"
                            },
                            "BudgetYearOne": {
                                "val": "3.45"
                            },
                            "BudgetYearTwo": {
                                "val": "9.754"
                            },
                            "BudgetYearThree": {
                                "val": "13.937"
                            },
                            "BudgetYearFour": {
                                "val": "16.726"
                            },
                            "BudgetYearFive": {
                                "val": "18.006"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "61.873"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "3.45"
                            },
                            "BudgetYearOne": {
                                "val": "3.45"
                            },
                            "BudgetYearTwo": {
                                "val": "9.754"
                            },
                            "BudgetYearThree": {
                                "val": "13.937"
                            },
                            "BudgetYearFour": {
                                "val": "16.726"
                            },
                            "BudgetYearFive": {
                                "val": "18.006"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "61.873"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "3.45"
                            },
                            "BudgetYearOne": {
                                "val": "3.45"
                            },
                            "BudgetYearTwo": {
                                "val": "9.754"
                            },
                            "BudgetYearThree": {
                                "val": "13.937"
                            },
                            "BudgetYearFour": {
                                "val": "16.726"
                            },
                            "BudgetYearFive": {
                                "val": "18.006"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "61.873"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Prior\/Future combined efforts"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "9.754"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "13.937"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "16.726"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "18.006"
                                                        },
                                                        "ToComplete": {
                                                            "val": "0"
                                                        },
                                                        "Total": {
                                                            "val": "58.423"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DFOS GPD - Chemical and Biological Equipment Decontaminants"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "20000"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "20000"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1"
                                                        },
                                                        "Total": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.05"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.05"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DFOS JSEW - Chemical Equipment Decontamination Wipes"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "62829"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "62829"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.45"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.45"
                                                        },
                                                        "Total": {
                                                            "val": "2.45"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.039"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.039"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.000"
                                            },
                                            "PriorYear": {
                                                "val": "0.000"
                                            },
                                            "CurrentYear": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "3.45"
                                            },
                                            "BudgetYearOne": {
                                                "val": "3.45"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "9.754"
                                            },
                                            "BudgetYearThree": {
                                                "val": "13.937"
                                            },
                                            "BudgetYearFour": {
                                                "val": "16.726"
                                            },
                                            "BudgetYearFive": {
                                                "val": "18.006"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "61.873"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.45"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.45"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.754"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.937"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.726"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.006"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "61.873"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "DOD BIOLOGICAL VACCINE PROCUREMENT"
                    },
                    "ItemNumber": {
                        "val": "JX0005"
                    },
                    "Remarks": {
                        "val": "Prior to FY 2015, the [DOD BIOLOGICAL VACCINE PROCUREMENT] program was reported under CBDP line item (BLIN) [MA0800 - JOINT BIO DEFENSE PROGRAM (MEDICAL)]\n\nThe biological vaccine procurement program is critical for national defense.  These products directly support the Secretary of Defense program to maintain a DoD capability to acquire and stockpile adequate quantities of all Biological Warfare (BW) vaccines to protect the programmed force against validated BW agents.  Items currently in the stockpile are the FDA licensed Anthrax Vaccine Adsorbed (AVA), Smallpox vaccine, and Vaccinia Immune Globulin Intravenous (VIGIV).  Funding supports vaccine and licensed biologic production, quality assurance and control, equipment validation, process change management, documentation control, and all FDA license maintenance and post-approval commitments (Phase 4 clinical trials).  The annual vaccination program for the Services is funded by the Defense Health Program.\n\nThe DoD funds the development of vaccines that are directed against validated biological warfare (BW) weapons to include bacteria, viruses, and toxins of biological origin.  Effective medical countermeasures to negate the threat of these BW agents are urgently needed.  Vaccines have been identified as the most efficient countermeasure against the validated threat of BW weapons.  These funds are for the manufacture of consistency lots at the new Contract Manufacturing Organization which will be fielded to support the Recombinant Botulinum A\/B Vaccine program's Initial Operational Capability (IOC).\n\n\nJustification: FY15 funds procure the biologic VIGIV support for shipping costs associated with emergency use product.  Funds are also required for the Recombinant Botulinum A\/B Vaccine Program to manufacture consistency lots at the new Contract Manufacturing Organization.  These consistency lots will be fielded to support IOC.\n\n\nRDT&E Code B Item: 0603884BP\/Proj MB4; 0604384BP\/Proj MB5\n\nMB4\/VAC BOT: RDT&E FY12 and Prior - 106.426M; FY19 - 11.450M\nMB4\/VACCINES: RDT&E FY12 and Prior - 59.662M\nMB5\/VAC BOT: RDT&E FY12 and Prior - 156.727M; FY13 - 35.730M; FY14 - 47.910M; FY15 - 53.362M; FY16 - 29.263M; FY17 - 10.799M; FY18 - 8.912M; FY19 - 3.115M\nMB5\/VAC PLG: RDT&E FY12 and Prior - 254.284M; FY13 - 29.425M; FY14 - 53.488M; FY15 - 36.811M; FY16 - 47.258M; FY17 - 22.174M; FY18 - 5.506M; FY19 - 0.984M\nMB5\/VACCINES: RDT&E FY12 and Prior - 74.717M\n\nDEVELOPMENT\/TEST STATUS AND MAJOR MILESTONES\n\nVAC BOT - Phase 2 Clinical Trial (A\/B) (Sep 2008 to Mar 2012)\nVAC BOT - Non-Clinical Testing (Pivotal Efficacy) (Jun 2012 to Sep 2018)\nVAC BOT - Technology Transfer to New CMO\/Manufacturing & Production of Consistency Lots (Jun 2013 to Jun 2017)\nVAC BOT - Initiation Efforts Required by FDA for Phase 3 Clinical Trial (Sep 2013 to Jun 2014)\nVAC BOT - Phase 3 Clinical Trial (A\/B) (Jun 2017 to Sep 2019)\nVAC BOT - Milestone C\/LRIP: Jun 2017\nVAC BOT - Biological Licensure Application (BLA) Submission: Jun 2019\nVAC BOT - Ongoing Manufacturing, Testing Efforts\/Regulatory (Sep 2019 to Jun 2022)\nVAC BOT - Initial Operational Capability (IOC): Dec 2020\nVAC BOT - FDA Licensure: Sep 2020\nVAC BOT - Full Operational Capability (FOC): Sep 2021\nVAC PLG - FDA Required Passive Transfer Studies (Aug 2012 to Sep 2014)\nVAC PLG - Non-Clinical Studies Pivotal Animal Efficacy (Jun 2014 to Mar 2016)\nVAC PLG - IND Preparation\/Submission of Consistency Lot Prodcution\/Testing Results to FDA (Mar 2014 to Dec 2014)\nVAC PLG - Milestone B: Jun 2006\nVAC PLG - Milestone C\/LRIP: Sep 2014\nVAC PLG - Phase 3 Clinical Trial\/IND Submission for Consistency Lot Production (Sep 2014 to Sep 2016)\nVAC PLG - Biological Licensure Application (BLA) Submission: Jun 2017\nVAC PLG - FDA Licensure: Mar 2018"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.412"
                            },
                            "BudgetYearOne": {
                                "val": "6.412"
                            },
                            "BudgetYearTwo": {
                                "val": "6.606"
                            },
                            "BudgetYearThree": {
                                "val": "12.108"
                            },
                            "BudgetYearFour": {
                                "val": "3.406"
                            },
                            "BudgetYearFive": {
                                "val": "6.801"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "35.333"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.412"
                            },
                            "BudgetYearOne": {
                                "val": "6.412"
                            },
                            "BudgetYearTwo": {
                                "val": "6.606"
                            },
                            "BudgetYearThree": {
                                "val": "12.108"
                            },
                            "BudgetYearFour": {
                                "val": "3.406"
                            },
                            "BudgetYearFive": {
                                "val": "6.801"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "35.333"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.412"
                            },
                            "BudgetYearOne": {
                                "val": "6.412"
                            },
                            "BudgetYearTwo": {
                                "val": "6.606"
                            },
                            "BudgetYearThree": {
                                "val": "12.108"
                            },
                            "BudgetYearFour": {
                                "val": "3.406"
                            },
                            "BudgetYearFive": {
                                "val": "6.801"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "35.333"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Prior\/Future combined efforts"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "6.606"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "12.108"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "3.406"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "6.801"
                                                        },
                                                        "ToComplete": {
                                                            "val": "0"
                                                        },
                                                        "Total": {
                                                            "val": "28.921"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "VACCINE RECOMBINANT BOTULINUM - JX0005"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "150000"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "150000"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "6.227"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "6.227"
                                                        },
                                                        "Total": {
                                                            "val": "6.227"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.042"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.042"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.000"
                                            },
                                            "PriorYear": {
                                                "val": "0.000"
                                            },
                                            "CurrentYear": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "6.227"
                                            },
                                            "BudgetYearOne": {
                                                "val": "6.227"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "6.606"
                                            },
                                            "BudgetYearThree": {
                                                "val": "12.108"
                                            },
                                            "BudgetYearFour": {
                                                "val": "3.406"
                                            },
                                            "BudgetYearFive": {
                                                "val": "6.801"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "35.148"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.227"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.227"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.606"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.108"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.406"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.801"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "35.148"
                                        }
                                    }
                                }
                            }
                        ],
                        "PackageFielding": {
                            "Recurring": {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Vaccinia Immune Globulin-Support Costs"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.185"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.185"
                                                    },
                                                    "Total": {
                                                        "val": "0.185"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.185"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.185"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "0.185"
                                        }
                                    }
                                }
                            },
                            "CategorySubtotal": {
                                "TotalCost": {
                                    "AllPriorYears": {
                                        "val": "0.000"
                                    },
                                    "PriorYear": {
                                        "val": "0.000"
                                    },
                                    "CurrentYear": {
                                        "val": "0.000"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "0.185"
                                    },
                                    "BudgetYearOne": {
                                        "val": "0.185"
                                    },
                                    "BudgetYearTwo": {
                                        "val": "0.000"
                                    },
                                    "BudgetYearThree": {
                                        "val": "0.000"
                                    },
                                    "BudgetYearFour": {
                                        "val": "0.000"
                                    },
                                    "BudgetYearFive": {
                                        "val": "0.000"
                                    },
                                    "ToComplete": {
                                        "val": "0"
                                    },
                                    "Total": {
                                        "val": "0.185"
                                    }
                                }
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "JOINT EXPEDITIONARY COLLECTIVE PROTECTION (JECP)"
                    },
                    "ItemNumber": {
                        "val": "JP1111"
                    },
                    "Remarks": {
                        "val": "Prior to FY 2015, the [JOINT EXPEDITIONARY COLLECTIVE PROTECTION (JECP)] program was reported under CBDP line item (BLIN) [PA1600 - COLLECTIVE PROTECTION]\n\nJoint Expeditionary Collective Protection (JECP) provides the Joint expeditionary forces a collective protection (CP) capability which is lightweight, compact, modular, and affordable.  The JECP family of systems (FoS) include tent kits, structure kits, and standalone shelters that allow the application of CP to transportable soft-side shelters, enclosed spaces of opportunity, and remote austere locations as a standalone resource.  JECP is capable of protecting personnel groups of varying size, unencumbered by individual protective equipment (IPE), from effects of chemical and biological (CB) agents, radiological (R) particles, toxic industrial materials (TIMs), heat, dust, and sand. \n\nTent kits consist of a CB protective liner, airlock system, and a CB filtration blower system.  Tent Kit-1 interfaces with the US Navy's Base-X 303 and 305 general purpose tents and all organic Base-X equipment including the environmental control unit and power systems.  Tent Kit-2 interfaces with the Air Force Small Shelter System (ASSS) general purpose tents and all organic ASSS equipment including the environmental control unit and power systems. \n\nStructure kits may include a floorless CB protective liner or a CB protective liner with a floor, an airlock system, and a CB filtration blower system.  Structure Kit-Improved (SK-I) is retrofitted to structures such as office buildings, warehouses, or hangars that provide coherent walls and roofing, ventilation systems, doors and windows, and power.  Structure Kit-Unimproved (SK-UI)\/Standalone Shelter System-Medium (SA-M) are retrofitted to structures such as huts, sheds or other rudimentary structures (SK-UI) that do not have any available electrical power, but provide environmental and other basic elemental protection.  This configuration uses a passive CP system relying on natural airflow through protective panels. \n\nStandalone large shelter (SA-L) is an all encompassing active CP shelter for multi-service use for up to 20 people.  SA-L provides a general purpose tent system, chemical and biological (CB) protective liner, an airlock system, a CB filtration blower system, an environmental control unit and all necessary power and ancillary equipment.\n\n\nJustification: FY15 procures 51 JECP systems in the following configurations: 15 tent kit 2s, 11 shelter kit-improved, eight (8) structure kit-unimproved, and 17 standalone large shelters.  The employment of JECP is a strategic deterrence against enemy use of CBR agents or TIMs, and will reduce the need for personnel and equipment decontamination.\n\n\nRDT&E Code B Item: 0604384BP\/Proj CO5\n\nRDT&E FY12 and Prior - 68.093M; FY13 - 10.487M; FY14 - 13.300M; FY15 - 4.670M\n\nDEVELOPMENT\/TEST STATUS AND MAJOR MILESTONES\n\nJECP - Capability Production Document (CPD): Jan 2013\nJECP - Milestone C LRIP  Decision: Feb 2013\nJECP - Low-Rate Initial Production Contract Option: Sep 2013\nJECP - Production Verification Testing (PVT) (Apr 2014 to Apr 2015)\nJECP - Multi-service Operational Test and Evaluation (Apr 2015 to May 2016)\nJECP - Full Rate Production Decision Review: Dec 2016\nJECP - Initial Operational Capability: Mar 2022\nJECP - Full Operational Capability: Sep 2030"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.16"
                            },
                            "BudgetYearOne": {
                                "val": "10.16"
                            },
                            "BudgetYearTwo": {
                                "val": "13.388"
                            },
                            "BudgetYearThree": {
                                "val": "16.381"
                            },
                            "BudgetYearFour": {
                                "val": "14.037"
                            },
                            "BudgetYearFive": {
                                "val": "26.02"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "79.986"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.16"
                            },
                            "BudgetYearOne": {
                                "val": "10.16"
                            },
                            "BudgetYearTwo": {
                                "val": "13.388"
                            },
                            "BudgetYearThree": {
                                "val": "16.381"
                            },
                            "BudgetYearFour": {
                                "val": "14.037"
                            },
                            "BudgetYearFive": {
                                "val": "26.02"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "79.986"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.16"
                            },
                            "BudgetYearOne": {
                                "val": "10.16"
                            },
                            "BudgetYearTwo": {
                                "val": "13.388"
                            },
                            "BudgetYearThree": {
                                "val": "16.381"
                            },
                            "BudgetYearFour": {
                                "val": "14.037"
                            },
                            "BudgetYearFive": {
                                "val": "26.02"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "79.986"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Prior\/Future combined efforts"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "13.388"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "16.381"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "14.037"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "26.02"
                                                        },
                                                        "ToComplete": {
                                                            "val": "0"
                                                        },
                                                        "Total": {
                                                            "val": "69.826"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tent Kit 2"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "15"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "15"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.633"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.633"
                                                        },
                                                        "Total": {
                                                            "val": "1.633"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "108.867"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "108.867"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Structure Kit - Improved"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "11"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "11"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.148"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.148"
                                                        },
                                                        "Total": {
                                                            "val": "1.148"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "104.364"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "104.364"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Structure Kit - Unimproved"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "8"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "8"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.393"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.393"
                                                        },
                                                        "Total": {
                                                            "val": "0.393"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "49.125"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "49.125"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "STANDALONE SHELTER - Stand Alone - Large"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "17"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "17"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "3.892"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "3.892"
                                                        },
                                                        "Total": {
                                                            "val": "3.892"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "228.941"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "228.941"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.000"
                                            },
                                            "PriorYear": {
                                                "val": "0.000"
                                            },
                                            "CurrentYear": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "7.066"
                                            },
                                            "BudgetYearOne": {
                                                "val": "7.066"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "13.388"
                                            },
                                            "BudgetYearThree": {
                                                "val": "16.381"
                                            },
                                            "BudgetYearFour": {
                                                "val": "14.037"
                                            },
                                            "BudgetYearFive": {
                                                "val": "26.02"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "76.892"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.066"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.066"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.388"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.381"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.037"
                                        },
                                        "BudgetYearFive": {
                                            "val": "26.02"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "76.892"
                                        }
                                    }
                                }
                            }
                        ],
                        "Logistics": {
                            "Recurring": {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Training and Fielding"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.071"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.071"
                                                    },
                                                    "Total": {
                                                        "val": "0.071"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Technical Data"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.001"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.001"
                                                    },
                                                    "Total": {
                                                        "val": "0.001"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.072"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.072"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "0.072"
                                        }
                                    }
                                }
                            },
                            "CategorySubtotal": {
                                "TotalCost": {
                                    "AllPriorYears": {
                                        "val": "0.000"
                                    },
                                    "PriorYear": {
                                        "val": "0.000"
                                    },
                                    "CurrentYear": {
                                        "val": "0.000"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "0.072"
                                    },
                                    "BudgetYearOne": {
                                        "val": "0.072"
                                    },
                                    "BudgetYearTwo": {
                                        "val": "0.000"
                                    },
                                    "BudgetYearThree": {
                                        "val": "0.000"
                                    },
                                    "BudgetYearFour": {
                                        "val": "0.000"
                                    },
                                    "BudgetYearFive": {
                                        "val": "0.000"
                                    },
                                    "ToComplete": {
                                        "val": "0"
                                    },
                                    "Total": {
                                        "val": "0.072"
                                    }
                                }
                            }
                        },
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Program Management and Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.867"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.867"
                                                    },
                                                    "Total": {
                                                        "val": "2.867"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Engineer Changes\/Modifications"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.155"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.155"
                                                    },
                                                    "Total": {
                                                        "val": "0.155"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.022"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.022"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "3.022"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "JOINT SERVICE GENERAL PURPOSE MASK (JSGPM)"
                    },
                    "ItemNumber": {
                        "val": "JI0003"
                    },
                    "Remarks": {
                        "val": "Prior to FY 2015, the [JOINT SERVICE GENERAL PURPOSE MASK (JSGPM)] program was reported under CBDP line item (BLIN) [GP1000 - INDIVIDUAL PROTECTION]\n\nThe Joint Service General Purpose Mask (JSGPM) is a lightweight, protective Nuclear Biological Chemical (NBC) mask system.  It incorporates state-of-the-art technology to protect the U.S. Joint Forces from anticipated threats.  The JSGPM provides above-the-neck, head\/eye\/respiratory protection against Chemical and Biological (CB) agents, radioactive particles, and Toxic Industrial Materials (TIMs).  The mask design is optimized to minimize impact on the wearer's performance, and to maximize its ability to interface with fielded and future Joint Service equipment and protective clothing.  The JSGPM mask system replaces the M40\/M42 series of masks for Army and Marine ground and combat vehicle operations and the MCU-2\/P series for Air Force and Navy ground and shipboard applications.  In addition, the JSGPM replaces the M45 mask in the Land Warrior program.  This can significantly reduce the number of masks that will have to be logistically supported by the Department of Defense.  The M50 is the ground\/ship version of the JSGPM.  The M51 is the combat vehicle crewman version of the JSGPM.  The M53 is the special operation version of the JSGPM.\n\n\nJustification: FY15 funds support procurement of 144,000 JSGPM Ground\/Ship (M-50) masks to support Army requirements.\n\n\nRDT&E Code B Item: 0603884BP\/Proj IP4; 0604384BP\/Proj IP5; 0607384BP\/Proj IP7\n\nIP4\/JSGPM: RDT&E FY12 and Prior - 26.490M; FY13 - 0.550M; FY14 - 1.208M; FY15 - 3.906M; FY16 - 0.300M; FY17 - 0.300M\nIP5\/JSGPM: RDT&E FY12 and Prior - 43.262M; FY13 - 1.571M; FY14 - 2.005M; FY15 - 1.003M; FY16 - 1.990M; FY17 - 1.990M\nIP7\/JSGPM: RDT&E ; FY14 - 0.500M; FY15 - 2.501M; FY16 - 1.490M; FY17 - 1.490M; FY18 - 1.490M; FY19 - 1.800M"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "61.131"
                            },
                            "BudgetYearOne": {
                                "val": "61.131"
                            },
                            "BudgetYearTwo": {
                                "val": "54.146"
                            },
                            "BudgetYearThree": {
                                "val": "59.34"
                            },
                            "BudgetYearFour": {
                                "val": "49.026"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "223.643"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "61.131"
                            },
                            "BudgetYearOne": {
                                "val": "61.131"
                            },
                            "BudgetYearTwo": {
                                "val": "54.146"
                            },
                            "BudgetYearThree": {
                                "val": "59.34"
                            },
                            "BudgetYearFour": {
                                "val": "49.026"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "223.643"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "61.131"
                            },
                            "BudgetYearOne": {
                                "val": "61.131"
                            },
                            "BudgetYearTwo": {
                                "val": "54.146"
                            },
                            "BudgetYearThree": {
                                "val": "59.34"
                            },
                            "BudgetYearFour": {
                                "val": "49.026"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "223.643"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Prior\/Future combined efforts"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "54.146"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "59.34"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "49.026"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "0.000"
                                                        },
                                                        "ToComplete": {
                                                            "val": "0"
                                                        },
                                                        "Total": {
                                                            "val": "162.512"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JSGPM - Ground\/Ship (M50)"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "144000"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "144000"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "35.856"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "35.856"
                                                        },
                                                        "Total": {
                                                            "val": "35.856"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.249"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.249"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.000"
                                            },
                                            "PriorYear": {
                                                "val": "0.000"
                                            },
                                            "CurrentYear": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "35.856"
                                            },
                                            "BudgetYearOne": {
                                                "val": "35.856"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "54.146"
                                            },
                                            "BudgetYearThree": {
                                                "val": "59.34"
                                            },
                                            "BudgetYearFour": {
                                                "val": "49.026"
                                            },
                                            "BudgetYearFive": {
                                                "val": "0.000"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "198.368"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "35.856"
                                        },
                                        "BudgetYearOne": {
                                            "val": "35.856"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "54.146"
                                        },
                                        "BudgetYearThree": {
                                            "val": "59.34"
                                        },
                                        "BudgetYearFour": {
                                            "val": "49.026"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "198.368"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Engineering Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.83"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.83"
                                                    },
                                                    "Total": {
                                                        "val": "2.83"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "System Fielding Support (Total Package Fielding (TPF), First Destination Transportation (FDT) & N..."
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.756"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.756"
                                                    },
                                                    "Total": {
                                                        "val": "4.756"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Initial Spares"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "10.926"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "10.926"
                                                    },
                                                    "Total": {
                                                        "val": "10.926"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Gov't Program Management"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "6.113"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6.113"
                                                    },
                                                    "Total": {
                                                        "val": "6.113"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Production Acceptance Test"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.65"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.65"
                                                    },
                                                    "Total": {
                                                        "val": "0.65"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.275"
                                        },
                                        "BudgetYearOne": {
                                            "val": "25.275"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "25.275"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "JS AIRCREW MASK (JSAM)"
                    },
                    "ItemNumber": {
                        "val": "JI0002"
                    },
                    "Remarks": {
                        "val": "Prior to FY 2015, the [JS AIRCREW MASK (JSAM)] program was reported under CBDP line item (BLIN) [GP1000 - INDIVIDUAL PROTECTION]\n\nThe Joint Service Aircrew Mask (JSAM) system is a lightweight Chemical, Biological, Radiological and Nuclear (CBRN) protective mask consisting of mask, filter, blower, and accessories incorporating state-of-the-art technology to protect U.S. Forces from anticipated threats.  The JSAM systems will be developed to support multiple aircraft platforms which will integrate with aircraft subsystems: Aircrew Life Support Equipment (ALSE), seating, portable aircrew systems, restraint systems, night vision goggles (NVGs), and communications systems.  The mask is optimized to minimize impact on the wearer's performance, maximize its ability to interface with aircrew protective clothing, and provide improved field of view when compared to current protective masks. \n\nThe JSAM Rotary Wing (RW) Mask Protective Unit 5 (MPU-5(V)\/P) will provide head, eye, respiratory, and CB protection and \"don in flight\" capability for general purpose, rotary wing aircrew in all four Services and the US Coast Guard.\n\nThe JSAM Apache (MPU-6(V)\/P) aircrew mask provides head, eye, respiratory and Chemical-Biological (CB) protection for U.S. Army AH-64A\/D Apache aircrew as part of the JSAM Family of Systems.  JSAM MPU-6(V)\/P replaces the legacy M-43 and M-48.  It is compatible with the Joint Protective Aircrew Ensemble (JPACE) and the Apache Integrated Helmet and Display Sighting System (IHADSS).  It provides flame and thermal protection, and reduces heat stress imposed by existing CB protective masks.  The system is capable of being donned and doffed while in flight.\n\nThe JSAM for Tactical Aircraft (JSAM TA) will be the first and only CB protective mask in the DoD inventory that can provide anti-G protection.  The JSAM for Strategic Aircraft (JSAM SA) will provide CB protection for positions that only need pressure breathing for altitude.  Both the JSAM TA and JSAM SA will provide flame and thermal protection, demist\/emergency demist, and anti-drowning features.\n\n\nJustification: FY15 will procure 60 JSAM TA masks (A\/P22P-14(A)) and 1216 JSAM MPU-5 Rotary Wing (RW) masks to meet Joint Service CBRN equipment requirements.\n\n\nRDT&E Code B Item: 0604384BP\/Proj IP5\n\nDEVELOPMENT\/TEST STATUS AND MAJOR MILESTONES\n\nJSAM FW - JSAM TA - AP22P(A) ECP Integration (Apr 2013 to Sep 2015)\nJSAM FW - JSAM TA - AP22P(A) USN Variant Purchase: Jul 2013\nJSAM FW - JSAM TA - AP22P(A) Safe to Fly Certification (Dec 2013 to Dec 2014)\nJSAM FW - JSAM TA - AP22P(A) USAF Variant MS C LRIP (Sep 2015 to Feb 2019)\nJSAM FW - JSAM TA - AP22P(A) USAF Variant MS C FRP: Mar 2019\nJSAM FW - JSAM SA - MM53 MS C LRIP (Mar 2016 to Jun 2019)\nJSAM FW - JSAM SA - MM53 MS C IOC: Mar 2017\nJSAM FW - JSAM SA - MM53 MS C FRP: Jun 2019\nJSAM RW - MS C\/ Low Rate Initial Production (LRIP): Jun 2014\nJSAM RW - Full Rate Production (FRP) (Dec 2015 to Dec 2020)\nJSAM RW - Initial Operational Capability (IOC): Nov 2016"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "11.526"
                            },
                            "BudgetYearOne": {
                                "val": "11.526"
                            },
                            "BudgetYearTwo": {
                                "val": "31.5"
                            },
                            "BudgetYearThree": {
                                "val": "54.05"
                            },
                            "BudgetYearFour": {
                                "val": "68.924"
                            },
                            "BudgetYearFive": {
                                "val": "38.343"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "204.343"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "11.526"
                            },
                            "BudgetYearOne": {
                                "val": "11.526"
                            },
                            "BudgetYearTwo": {
                                "val": "31.5"
                            },
                            "BudgetYearThree": {
                                "val": "54.05"
                            },
                            "BudgetYearFour": {
                                "val": "68.924"
                            },
                            "BudgetYearFive": {
                                "val": "38.343"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "204.343"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "11.526"
                            },
                            "BudgetYearOne": {
                                "val": "11.526"
                            },
                            "BudgetYearTwo": {
                                "val": "31.5"
                            },
                            "BudgetYearThree": {
                                "val": "54.05"
                            },
                            "BudgetYearFour": {
                                "val": "68.924"
                            },
                            "BudgetYearFive": {
                                "val": "38.343"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "204.343"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Prior\/Future combined efforts"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "31.5"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "54.05"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "68.924"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "38.343"
                                                        },
                                                        "ToComplete": {
                                                            "val": "0"
                                                        },
                                                        "Total": {
                                                            "val": "192.817"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JSAM ROTARY WING MPU-5 - JSAM RW MPU-5 Hardware - LRIP"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1216"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1216"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "5.472"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "5.472"
                                                        },
                                                        "Total": {
                                                            "val": "5.472"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "4.5"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "4.5"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JSAM FW - JSAM TA - A\/P22P-14(A) ECP - LRIP"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "60"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "60"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.606"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.606"
                                                        },
                                                        "Total": {
                                                            "val": "0.606"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "10.1"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "10.1"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.000"
                                            },
                                            "PriorYear": {
                                                "val": "0.000"
                                            },
                                            "CurrentYear": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "6.078"
                                            },
                                            "BudgetYearOne": {
                                                "val": "6.078"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "31.5"
                                            },
                                            "BudgetYearThree": {
                                                "val": "54.05"
                                            },
                                            "BudgetYearFour": {
                                                "val": "68.924"
                                            },
                                            "BudgetYearFive": {
                                                "val": "38.343"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "198.895"
                                            }
                                        }
                                    }
                                },
                                "NonRecurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "JSAM RW MPU-5 Tooling"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.799"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.799"
                                                        },
                                                        "Total": {
                                                            "val": "0.799"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JSAM RW MPU-5 Initial Spares\/Components"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "0.000"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.000"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.000"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.393"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.393"
                                                        },
                                                        "Total": {
                                                            "val": "0.393"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.000"
                                            },
                                            "PriorYear": {
                                                "val": "0.000"
                                            },
                                            "CurrentYear": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.192"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.192"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearThree": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearFour": {
                                                "val": "0.000"
                                            },
                                            "BudgetYearFive": {
                                                "val": "0.000"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "1.192"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.27"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.27"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "31.5"
                                        },
                                        "BudgetYearThree": {
                                            "val": "54.05"
                                        },
                                        "BudgetYearFour": {
                                            "val": "68.924"
                                        },
                                        "BudgetYearFive": {
                                            "val": "38.343"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "200.087"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "JSAM TA - A\/P22P-14(A) ECP -  NET Training Support Package"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.35"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.35"
                                                    },
                                                    "Total": {
                                                        "val": "0.35"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "JSAM TA - A\/P22P-14(A) ECP-Program Management Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.295"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.295"
                                                    },
                                                    "Total": {
                                                        "val": "0.295"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "JSAM RW MPU-5 Integrated Logistics Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.532"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.532"
                                                    },
                                                    "Total": {
                                                        "val": "0.532"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "JSAM TA - AP22P-14(A) ECP - Initial Spares\/Components"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.342"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.342"
                                                    },
                                                    "Total": {
                                                        "val": "0.342"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "JSAM TA - AP22P-14(A) ECP - Engineering Support (Gov't)"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.34"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.34"
                                                    },
                                                    "Total": {
                                                        "val": "0.34"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "JSAM RW MPU-5 Program Management Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.438"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.438"
                                                    },
                                                    "Total": {
                                                        "val": "1.438"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "JSAM RW MPU-5 Engineering Support (Gov't)"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.959"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.959"
                                                    },
                                                    "Total": {
                                                        "val": "0.959"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.256"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.256"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "4.256"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ],
            "P3AModificationItemGroup": [
                {
                    "ModificationTitle": {
                        "val": "Collective Protection System Amphibious Backfit"
                    },
                    "ModificationNumber": {
                        "val": "JN0014"
                    },
                    "ModificationType": {
                        "val": "Force Protection"
                    },
                    "Model": {
                        "val": "LHD class ships"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "15"
                            },
                            "BudgetYearOne": {
                                "val": "15"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "15"
                            }
                        },
                        "NetProcurementP1": {
                            "BudgetYearOneBase": {
                                "val": "15"
                            },
                            "BudgetYearOne": {
                                "val": "15"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "15"
                            }
                        },
                        "TotalObligationAuthority": {
                            "BudgetYearOneBase": {
                                "val": "15"
                            },
                            "BudgetYearOne": {
                                "val": "15"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "15"
                            }
                        }
                    },
                    "DevelopmentMilestoneList": {
                        "DevelopmentMilestone": [
                            {
                                "Date": {
                                    "val": "2015-09"
                                },
                                "Title": {
                                    "val": "LHD-8 (USS MAKIN ISLAND)"
                                }
                            }
                        ]
                    },
                    "SupportCost": {
                        "CostElementList": {
                            "CostElement": [
                                {
                                    "Name": {
                                        "val": "Other"
                                    },
                                    "Cost": {
                                        "Quantity": {
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "0"
                                            }
                                        },
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "0.617"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.617"
                                            },
                                            "ToComplete": {
                                                "val": "0.000"
                                            },
                                            "Total": {
                                                "val": "0.617"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "CategorySubtotal": {
                            "TotalCost": {
                                "BudgetYearOneBase": {
                                    "val": "0.617"
                                },
                                "BudgetYearOne": {
                                    "val": "0.617"
                                },
                                "ToComplete": {
                                    "val": "0.000"
                                },
                                "Total": {
                                    "val": "0.617"
                                }
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "Collective Protection System Amphibious Backfit"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "val": "Equipment"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "3"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "3"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "3"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "9.183"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "9.183"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0.000"
                                                                },
                                                                "Total": {
                                                                    "val": "9.183"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "3"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3"
                                                    },
                                                    "ToComplete": {
                                                        "val": "0"
                                                    },
                                                    "Total": {
                                                        "val": "3"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "9.183"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9.183"
                                                    },
                                                    "ToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "Total": {
                                                        "val": "9.183"
                                                    }
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "Location": {
                                                    "val": "TBD"
                                                },
                                                "ContractDates": {
                                                    "BudgetYearOne": {
                                                        "val": "2014-12"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "BudgetYearOne": {
                                                        "val": "2015-12"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "2"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "10"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "BudgetYearOneBase": {
                                                "val": "3"
                                            },
                                            "BudgetYearOne": {
                                                "val": "3"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "3"
                                            }
                                        },
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "9.183"
                                            },
                                            "BudgetYearOne": {
                                                "val": "9.183"
                                            },
                                            "ToComplete": {
                                                "val": "0.000"
                                            },
                                            "Total": {
                                                "val": "9.183"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "Alteration Installation Teams (AITs)."
                                                    },
                                                    "InstallationCost": {
                                                        "BudgetYearOne": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "4"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "4"
                                                                    },
                                                                    "Total": {
                                                                        "val": "4"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "5.2"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "5.2"
                                                                    },
                                                                    "Total": {
                                                                        "val": "5.2"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "ToComplete": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "4"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "4"
                                                                    },
                                                                    "ToComplete": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "4"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "5.2"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "5.2"
                                                                    },
                                                                    "ToComplete": {
                                                                        "val": "0.000"
                                                                    },
                                                                    "Total": {
                                                                        "val": "5.2"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "AllPriorYears": {
                                                                "val": "28"
                                                            },
                                                            "CurrentYear": {
                                                                "SecondQuarter": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "SecondQuarter": {
                                                                    "val": "3"
                                                                }
                                                            },
                                                            "ToComplete": {
                                                                "val": "0"
                                                            },
                                                            "Total": {
                                                                "val": "32"
                                                            }
                                                        },
                                                        "Out": {
                                                            "AllPriorYears": {
                                                                "val": "28"
                                                            },
                                                            "BudgetYearTwo": {
                                                                "FirstQuarter": {
                                                                    "val": "4"
                                                                }
                                                            },
                                                            "ToComplete": {
                                                                "val": "0"
                                                            },
                                                            "Total": {
                                                                "val": "32"
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "BudgetYearOneBase": {
                                                "val": "4"
                                            },
                                            "BudgetYearOne": {
                                                "val": "4"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "4"
                                            }
                                        },
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "5.2"
                                            },
                                            "BudgetYearOne": {
                                                "val": "5.2"
                                            },
                                            "ToComplete": {
                                                "val": "0.000"
                                            },
                                            "Total": {
                                                "val": "5.2"
                                            }
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "Quantity": {
                            "BudgetYearOneBase": {
                                "val": "3"
                            },
                            "BudgetYearOne": {
                                "val": "3"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "3"
                            }
                        },
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "9.183"
                            },
                            "BudgetYearOne": {
                                "val": "9.183"
                            },
                            "ToComplete": {
                                "val": "0.000"
                            },
                            "Total": {
                                "val": "9.183"
                            }
                        }
                    },
                    "InstallationSubtotal": {
                        "Quantity": {
                            "BudgetYearOneBase": {
                                "val": "4"
                            },
                            "BudgetYearOne": {
                                "val": "4"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "4"
                            }
                        },
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "5.2"
                            },
                            "BudgetYearOne": {
                                "val": "5.2"
                            },
                            "ToComplete": {
                                "val": "0.000"
                            },
                            "Total": {
                                "val": "5.2"
                            }
                        }
                    },
                    "Description": {
                        "val": "The CPS will be installed on LHD class ships (1-8) in the Combat Information Center (CIC), two medical spaces, and a casualty decontamination area.  CPS Backfit efforts will include ship surveys, engineering design analysis, detail design SIDs, development of modular installation packages, procurement of hardware, logistic warehousing and staging, and installation via Alteration Installation Teams (AITs).  Procurement of government furnished equipment (GFE) is required.  The CPS Backfit installation process is designed to maximize flexibility in procuring, receiving, warehousing, and assembling the necessary material and equipment to meet the challenges associated with changing ship availabilities.  Each quantity denotes a protected zone.\n\nNote: Prior Years funding includes costs associated with the previous installation of protected spaces on two additional Navy amphibious ship classes.  The Landing Ship Dock  (LSD) had 12 zones installed on three ships and 14 zones were installed on five Landing Helicopter Assault (LHA) ships."
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}