{
    "id": "bf95262459869b1772ee0fbac1b5d48634b136b2",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_AIRFORCE_OTHER_PROCUREMENT_JustificationBook_Air_Force_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "834070"
        },
        "LineItemTitle": {
            "val": "Mobility Command and Control"
        },
        "P1LineNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "10.237"
                },
                "CurrentYear": {
                    "val": "9.384"
                },
                "BudgetYearOneBase": {
                    "val": "11.462"
                },
                "BudgetYearOne": {
                    "val": "11.462"
                },
                "BudgetYearTwo": {
                    "val": "11.472"
                },
                "BudgetYearThree": {
                    "val": "10.317"
                },
                "BudgetYearFour": {
                    "val": "10.497"
                },
                "BudgetYearFive": {
                    "val": "10.686"
                },
                "Total": {
                    "val": "74.055"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "10.237"
                },
                "CurrentYear": {
                    "val": "9.384"
                },
                "BudgetYearOneBase": {
                    "val": "11.462"
                },
                "BudgetYearOne": {
                    "val": "11.462"
                },
                "BudgetYearTwo": {
                    "val": "11.472"
                },
                "BudgetYearThree": {
                    "val": "10.317"
                },
                "BudgetYearFour": {
                    "val": "10.497"
                },
                "BudgetYearFive": {
                    "val": "10.686"
                },
                "Total": {
                    "val": "74.055"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "10.237"
                },
                "CurrentYear": {
                    "val": "9.384"
                },
                "BudgetYearOneBase": {
                    "val": "11.462"
                },
                "BudgetYearOne": {
                    "val": "11.462"
                },
                "BudgetYearTwo": {
                    "val": "11.472"
                },
                "BudgetYearThree": {
                    "val": "10.317"
                },
                "BudgetYearFour": {
                    "val": "10.497"
                },
                "BudgetYearFive": {
                    "val": "10.686"
                },
                "Total": {
                    "val": "74.055"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "PE 0401840F MOBILITY COMMAND AND CONTROL\n\nGLOBAL MOBILITY COMMAND AND CONTROL (C2) ARCHITECTURE AIR MOBILITY COMMAND (AMC): The AMC C2 architecture is an integrated, command-wide program that supports US Air Force airlift\/air refueling missions around the globe with centralized control\/decentralized execution.  To execute America's Global Reach mission, Air Mobility Command's 618th Air Operations Center (AOC) plans, schedules, and directs a fleet of more than 1,300 mobility aircraft.  The 618th AOC operates combat delivery, strategic airlift, air refueling, and aeromedical evacuation operations around the world. Funding for this exhibit contained in program element (PE) 0401840F. \n\na. WING LOCAL AREA NETWORK (LAN):  Wing LAN provides equipment in support of AMC's 618th AOC and its 12 bases for an enhanced, robust, and reliable command-wide intra-building wired and intra-base wireless networking infrastructure to support AMC's command and control (C2) systems to ensure they remain operational at AMC bases and operating locations.  The Wing LAN infrastructure ensures connectivity with critical Air Force systems such as the Information Transport System (ITS), Global Combat Support System (GCSS) and the Global Decision Support System (GDSS); AMC's C2 systems such as the Consolidated Air Mobility Planning System (CAMPS) and Advanced Computer Flight Planning (ACFP) system and the infrastructure for Land Mobile Radio (LMR) systems across AMC providing intra-base command and control for base security, emergency management, flightline operations\/maintenance, and crash response.  \n\nb. DEPLOYED SATELLITE COMMUNICATIONS (DSATCOM):  Provides C2 communications capabilities for deployed Mobility C2 forces and mission support team C2 operations.  These operations rapidly install mission support communications at austere base locations where communications to support air mobility operations are nonexistent or insufficient.  The DSATCOM program is the primary funding vehicle for procuring communications equipment supporting these components.  The resources directly support C2 and In-Transit Visibility (ITV) of deployed and enroute personnel, aircraft, and cargo providing critical communications to Contingency Response Groups (CRGs).  CRGs are self-sufficient groups of multi-skilled, highly-trained airmen, representing different Air Force specialty codes, who can rapidly deploy anywhere in the world with little notice to open air bases for any follow-on mission.  The AN\/TSC-159A Hard-side Expandable Lightweight Air Mobile Shelter (HELAMS) is the primary weapon system providing this support.  It is a rapidly deployable, self-contained C2\/ITV command center.  This shelter functions as the base command post during the initial phases of airbase build-up.  It contains integrated communications equipment such as radios, computers, printers and fax machines.  \n\n\nPE 0401897F TRAINING\n\nMOBILITY AIR FORCE DISTRIBUTED MISSION OPERATIONS (MAF DMO).  Supports the modification and enhancement of high-fidelity MAF aircrew training and support systems to ensure full employment of DMO capabilities to meet combat readiness training needs.  Use of enhanced DMO-capable (simulator) trainers provides a cost-effective means of conducting daily training, mission rehearsal, joint force exercise, and tactics development activity.  Funding for this exhibit contained in PE 0401897F.\n\n\nPE 0408011F SPECIAL TACTICS\/COMBAT CONTROL\n\nAIR FORCE SPECIAL OPERATIONS COMMAND (AFSOC) TACTICAL COMMAND AND CONTROL (TAC C2) PROGRAM:  AFSOC TAC C2 program purchases enhanced communication systems and equipment essential for special tactics (ST) combat controllers, pararescue personnel, combat weather operators, and tactical air control parties to perform their mission.  The ST operators use this equipment to gather and transmit assault zone suitability and weather data and to perform tactical airfield\/assault landing\/drop zone operations.\nFunding for this exhibit contained in PE 0408011F."
        },
        "Justification": {
            "val": "PE 0401840F MOBILITY COMMAND AND CONTROL\n\nWing Local Area Network (LAN):  FY15 funding continues procurement of wired and wireless base network infrastructure equipment to include cabling, routers, bridges, hubs, repeaters, switches and LMR trunking systems to ensure information technology remains current and interoperability with AMC C2 systems is maintained to meet the needs of the warfighter and the AMC mission.\n\nDSATCOM:  FY15 funding will be used to continue refurb\/capital equipment replacement of communications equipment for the HELAM shelters.\n\nPE 0401897F TRAINING\n\nMOBILITY AIR FORCE DISTRIBUTED MISSION OPERATIONS: No FY15 funding requested.\n\nPE 0408011F SPECIAL TACTICS \/ COMBAT CONTROL\n\nAIR FORCE SPECIAL OPERATIONS COMMAND (AFSOC) TACTICAL COMMAND AND CONTROL (TAC C2) PROGRAM: FY15 funds purchase new tactical radios, airfields surveying equipment, advanced weather equipment, tactical airfield\/drop zone marking beacons, and ancillary support equipment."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Mobility Command and Control"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "WING LOCAL AREA NETWORK (LAN) - Network Infrastructure"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "3.862"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.379"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "7.875"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7.875"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "3.862"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.379"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "7.875"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7.875"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "WING LOCAL AREA NETWORK (LAN) - Land Mobile Radio (LMR) Systems"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "3.288"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.4"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.87"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.87"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "3.288"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.4"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.87"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.87"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "DEPLOYED SATELLITE COMMUNICATIONS (DSATCOM)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "4"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.934"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.3"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.35"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.35"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.234"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.3"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.35"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.35"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "8.084"
                                        },
                                        "CurrentYear": {
                                            "val": "9.079"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.095"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.095"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "8.084"
                            },
                            "CurrentYear": {
                                "val": "9.079"
                            },
                            "BudgetYearOneBase": {
                                "val": "11.095"
                            },
                            "BudgetYearOne": {
                                "val": "11.095"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Mobility Command and Control"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "MOBILITY AIR FORCE DISTRIBUTED MISSION OPERATIONS"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1.82"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "1.82"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "1.82"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "1.82"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Mobility Command and Control"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "AIR FORCE SPECIAL OPERATIONS COMMAND (AFSOC) TACTICAL COMMAND AND CONTROL (TAC C2) PROGRAM"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.333"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.305"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.367"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.367"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0.333"
                                        },
                                        "CurrentYear": {
                                            "val": "0.305"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.367"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.367"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0.333"
                            },
                            "CurrentYear": {
                                "val": "0.305"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.367"
                            },
                            "BudgetYearOne": {
                                "val": "0.367"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}