{
    "id": "c16d7969fcf5e84fa38033797a05038ef678f9ca",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_ARMY_AMMO_PROCUREMENT_JustificationBook_Army_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "E51200"
        },
        "LineItemTitle": {
            "val": "Simulators, All Types"
        },
        "P1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition"
        },
        "BudgetSubActivityNumber": {
            "val": "47"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Ammunition"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "274.937"
                },
                "PriorYear": {
                    "val": "10.375"
                },
                "CurrentYear": {
                    "val": "5.228"
                },
                "BudgetYearOneBase": {
                    "val": "11.638"
                },
                "BudgetYearOne": {
                    "val": "11.638"
                },
                "BudgetYearTwo": {
                    "val": "10.313"
                },
                "BudgetYearThree": {
                    "val": "10.932"
                },
                "BudgetYearFour": {
                    "val": "11.025"
                },
                "BudgetYearFive": {
                    "val": "10.604"
                },
                "Total": {
                    "val": "345.052"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "274.937"
                },
                "PriorYear": {
                    "val": "10.375"
                },
                "CurrentYear": {
                    "val": "5.228"
                },
                "BudgetYearOneBase": {
                    "val": "11.638"
                },
                "BudgetYearOne": {
                    "val": "11.638"
                },
                "BudgetYearTwo": {
                    "val": "10.313"
                },
                "BudgetYearThree": {
                    "val": "10.932"
                },
                "BudgetYearFour": {
                    "val": "11.025"
                },
                "BudgetYearFive": {
                    "val": "10.604"
                },
                "Total": {
                    "val": "345.052"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "274.937"
                },
                "PriorYear": {
                    "val": "10.375"
                },
                "CurrentYear": {
                    "val": "5.228"
                },
                "BudgetYearOneBase": {
                    "val": "11.638"
                },
                "BudgetYearOne": {
                    "val": "11.638"
                },
                "BudgetYearTwo": {
                    "val": "10.313"
                },
                "BudgetYearThree": {
                    "val": "10.932"
                },
                "BudgetYearFour": {
                    "val": "11.025"
                },
                "BudgetYearFive": {
                    "val": "10.604"
                },
                "Total": {
                    "val": "345.052"
                }
            }
        },
        "Description": {
            "val": "This budget line includes Simulators, All Types.\n\n(E42801) M9 Simulator Projectile Airburst Liquid is used in training to provide a realistic chemical-biological defense system.  An electronic actuating charge propels the simulant-filled bottle into the air, then a one-second burn-through delay fuze sets off the burster charge at approximately a 30 foot or 50 foot height by a 150 foot width to disperse a vapor cloud spray, which triggers the chemical sensors by causing color changes to chemical agent detector paper; five projectors can be burst at the same time to increase the area.  This item is Code A, approved for service use.\n\n(E49700) M115A2 Artillery Ground Burst Simulator is a hand thrown device that is used in training to simulate battle noise and effects (shell in flight and ground explosion) during troop maneuvers.  The simulator has a 6-10 second delay followed by a 2-4 second whistle ending with a flash and loud report; the surface danger zone is 35 meters.  This item is Code A, approved for service use.\n\n(E49900) M117 Booby Trap Simulator is used in training to teach the installation, detection and use of booby traps, and to instill caution in troops exposed to traps set by the enemy.  The simulator is trip wire initiated and produces a flash and bang.  The surface danger zone is 6 feet.  This item is Code A, approved for service use.\n\n(E50000) M118 Booby Trap Simulator is used in training to teach the installation, detection and use of booby traps, and to instill caution in troops exposed to traps set by the enemy.  The simulator is trip wire initiated and produces a flame for 28 seconds.  The surface danger zone is 6 feet.  This item is Code A, approved for service use.\n\n(E50100) M119 Booby Trap Simulator is used in training to teach the installation, detection and use of booby traps, and to instill caution in troops exposed to traps set by the enemy.  The simulator is trip wire initiated and produces a whistle for 2.5 to 5 seconds.  The surface danger zone is 6 feet.  This item is Code A, approved for service use.\n\n(E50200) M116A1 Hand Grenade Simulator is a hand-thrown device and is used in training to simulate battle noise and effects during troop maneuvers.  It has a 5 to 10 second delay and a 15 meter surface danger zone.  This item is Code A, approved for service use.\n\n(E70600) M22 Anti-Tank Weapon Effect Signature Simulator (ATWESS) Guided Missile (GM) Rocket Simulator is used to simulate the TOW, DRAGON or VIPER, including report, flash and smoke through use of an adapter.  It is compatible with the Multiple Integrated Laser Engagement System (MILES).  This item is Code A, approved for service use.\n\n(E88119) M34 Hostile Fire Simulator has replaced the M21 and is used for Force on Target training to simulate large caliber gunfire.  The simulator emits an orange flash and white smoke visible at 1800 meters.  The simulator is fired from the Omega 60B2 and the Omega 36.  This item is Code A, approved for service use.\n\n(E88200) Simulator Antitank M27  The L715-M27 is the SAGGER missile simulator.  The Antitank Guided Missile Signature Simulator (ATGMSS) is used during live fire training exercises to simulate enemy antitank missile.  The ATGMSS consists of a paper tube body with polyurethane foam nose and tail cone.  The rocket motor is in cylindrical form within the paper tube.  A hole is provided in the tail section for a guide rod on the simulator.  The ATGMSS is inserted onto a launcher with the guide rod of the launcher going through the tail cone guide hole.  An Electric Match (M79) is inserted into the missile.  The electric match ignites the rocket motor and the simulator travels approximately 1500 meters down range.  This item is Code A, approved for service use.\n\n(E88404) Simulators, Non-standard, Special Effects for CTCS Black smoke cartridge to simulate target kill.  Launched with Omega 60 Force on target.  This item in development which is part of the Special Use Ammo Family.  After development, this item will Code A, approved for service use."
        },
        "Justification": {
            "val": "FY 2015 Base Budget supports critical Army Title 10 war reserve\/operational, training, and test requirements IAW DoD Instruction 3000.04 (Munitions Requirements Process) and AR 5-13 (Total Army Munitions Requirements Process and Prioritization System).  War reserve requirements support OSD-approved Combatant Commander Operational Plans, Homeland Defense, and other OSD-directed missions.  Training requirements support individual and collective training of Active and Reserve Component forces at Army schools, home station and the combined training centers.  Test requirements support the development, fielding, safety and quality assurance of Army munitions and equipment throughout their life-cycle.  \n\nFY 2015 Base procurement dollars in the amount of $11.638 million supports production of five variants of simulators."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "SIMULATOR PROJ AIRBURST LIQUID (SPAL) M9"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "SIMULATOR PROJ AIRBURST LIQUID (SPAL) M9"
                                            },
                                            "ItemNumber": {
                                                "val": "E42801"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "30"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.473"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.006"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "115766.67"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "SIMULATOR PROJ GND BURST M115A2"
                                            },
                                            "ItemNumber": {
                                                "val": "E49700"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "13333"
                                                    },
                                                    "PriorYear": {
                                                        "val": "101584"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "87914"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "138491"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "138491"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "107.64"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.202"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.159"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.242"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.242"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "8073.2"
                                                    },
                                                    "PriorYear": {
                                                        "val": "41.36"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "24.56"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "23.41"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "23.41"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "SIMULATOR BOOBY TRAP FLASH M117"
                                            },
                                            "ItemNumber": {
                                                "val": "E49900"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "1669"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "19.386"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.101"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "11615.34"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "SIMULATOR BOOBY TRAP ILLUM M118"
                                            },
                                            "ItemNumber": {
                                                "val": "E50000"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "568"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.898"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.102"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "12144.37"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "SIMULATOR BOOBY TRAP WHISTLING M119"
                                            },
                                            "ItemNumber": {
                                                "val": "E50100"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "2109"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "17.965"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.103"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "8518.26"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "SIMULATOR HAND GRENADE M116A1"
                                            },
                                            "ItemNumber": {
                                                "val": "E50200"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "12329"
                                                    },
                                                    "PriorYear": {
                                                        "val": "246644"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "127029"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "192288"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "192288"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "77.802"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.099"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.615"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.961"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.961"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "6310.49"
                                                    },
                                                    "PriorYear": {
                                                        "val": "16.62"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "20.59"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "20.6"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "20.6"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "SIMULATOR ANTITANK GM RKT M22 (ATWESS)"
                                            },
                                            "ItemNumber": {
                                                "val": "E70600"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "7298"
                                                    },
                                                    "PriorYear": {
                                                        "val": "60203"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "12250"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "12250"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "38.005"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.762"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.454"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.084"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.084"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "5207.59"
                                                    },
                                                    "PriorYear": {
                                                        "val": "29.27"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "88.49"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "88.49"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "SIMULATOR ANTITANK M27"
                                            },
                                            "ItemNumber": {
                                                "val": "E88200"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "45"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "10495"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "10495"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.768"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.971"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.971"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "83733.33"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "187.8"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "187.8"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "SIMULATORS, NON-STANDARD, SPECIAL EFFECTS FOR CTCS"
                                            },
                                            "ItemNumber": {
                                                "val": "E88404"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "67704"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "67704"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.38"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.38"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "20.38"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "20.38"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "274.937"
                                        },
                                        "PriorYear": {
                                            "val": "10.375"
                                        },
                                        "CurrentYear": {
                                            "val": "5.228"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.638"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.638"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "274.937"
                            },
                            "PriorYear": {
                                "val": "10.375"
                            },
                            "CurrentYear": {
                                "val": "5.228"
                            },
                            "BudgetYearOneBase": {
                                "val": "11.638"
                            },
                            "BudgetYearOne": {
                                "val": "11.638"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}