{
    "id": "c779f7668637fd9d9a8e5ff30d469d676ffef7e2",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_NAVY_AIRCRAFT_BA1-4_PROCUREMENT_JustificationBook_Navy_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1506N",
        "appropriation_name": "Aircraft Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "0443"
        },
        "LineItemTitle": {
            "val": "MQ-8 UAV"
        },
        "P1LineNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1506N"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Other Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Aircraft"
        },
        "ResourceSummary": {
            "Quantity": {
                "AllPriorYears": {
                    "val": "33"
                },
                "PriorYear": {
                    "val": "5"
                },
                "CurrentYear": {
                    "val": "2"
                },
                "ToComplete": {
                    "val": "79"
                },
                "Total": {
                    "val": "119"
                }
            },
            "TotalCost": {
                "AllPriorYears": {
                    "val": "510.146"
                },
                "PriorYear": {
                    "val": "110.402"
                },
                "CurrentYear": {
                    "val": "74.08"
                },
                "BudgetYearOneBase": {
                    "val": "40.663"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "40.663"
                },
                "BudgetYearTwo": {
                    "val": "37.535"
                },
                "BudgetYearThree": {
                    "val": "28.403"
                },
                "BudgetYearFour": {
                    "val": "24.372"
                },
                "BudgetYearFive": {
                    "val": "25.755"
                },
                "ToComplete": {
                    "val": "1678.91"
                },
                "Total": {
                    "val": "2530.266"
                }
            },
            "UnitCost": {
                "AllPriorYears": {
                    "val": "15458.97"
                },
                "PriorYear": {
                    "val": "22080.4"
                },
                "CurrentYear": {
                    "val": "37040"
                },
                "ToComplete": {
                    "val": "21252.025"
                },
                "Total": {
                    "val": "21262.739"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "510.146"
                },
                "PriorYear": {
                    "val": "110.402"
                },
                "CurrentYear": {
                    "val": "74.08"
                },
                "BudgetYearOneBase": {
                    "val": "40.663"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "40.663"
                },
                "BudgetYearTwo": {
                    "val": "37.535"
                },
                "BudgetYearThree": {
                    "val": "28.403"
                },
                "BudgetYearFour": {
                    "val": "24.372"
                },
                "BudgetYearFive": {
                    "val": "25.755"
                },
                "ToComplete": {
                    "val": "1678.91"
                },
                "Total": {
                    "val": "2530.266"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "510.146"
                },
                "PriorYear": {
                    "val": "110.402"
                },
                "CurrentYear": {
                    "val": "74.08"
                },
                "BudgetYearOneBase": {
                    "val": "40.663"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "40.663"
                },
                "BudgetYearTwo": {
                    "val": "37.535"
                },
                "BudgetYearThree": {
                    "val": "28.403"
                },
                "BudgetYearFour": {
                    "val": "24.372"
                },
                "BudgetYearFive": {
                    "val": "25.755"
                },
                "ToComplete": {
                    "val": "1678.91"
                },
                "Total": {
                    "val": "2530.266"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "7.135"
                },
                "CurrentYear": {
                    "val": "15.6"
                },
                "BudgetYearOneBase": {
                    "val": "6.573"
                },
                "BudgetYearOne": {
                    "val": "6.573"
                },
                "BudgetYearTwo": {
                    "val": "6.651"
                },
                "BudgetYearThree": {
                    "val": "0.25"
                },
                "BudgetYearFour": {
                    "val": "0.25"
                },
                "BudgetYearFive": {
                    "val": "0.25"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "FlyawayUnitCost": {
                "AllPriorYears": {
                    "val": "12830.939"
                },
                "PriorYear": {
                    "val": "19551.4"
                },
                "CurrentYear": {
                    "val": "28078"
                },
                "ToComplete": {
                    "val": "16781.873"
                },
                "Total": {
                    "val": "16290.092"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The MQ-8 Vertical Take-Off and Landing Tactical Unmanned Aerial Vehicle (VTUAV, popular name \"Fire Scout\") provides real-time and non-real-time Intelligence, Surveillance and Reconnaissance (ISR) data to tactical users without the use of manned aircraft or reliance on limited joint theater or national assets. The baseline MQ-8 can accomplish missions including over-the-horizon tactical reconnaissance, classification, targeting and laser designation and battle management (including voice relay). The MQ-8 launches and recovers vertically, and can operate from air capable ships, as well as area land bases.  Interoperability is achieved through the use of the Tactical Control System (TCS) software in the Ground Control Station (GCS) and through the use of the Tactical Common Data Link (TCDL).  The data from the MQ-8 will be provided through standard DoD Command, Control, Communications, Computers and ISR system architectures and protocols.\n\nDeployed MQ-8 system is comprised of  one (1) or two (2) air vehicles, payloads (i.e. electro-optical\/infra-red\/laser designator-range finder, Automated Identification System, comms relay and other specialty payloads), GCS (with TCS and TCDL integrated for interoperability), a UAV Common Automatic Recovery System (UCARS) for automatic take-off and landings, and associated spares and support equipment. A total of 56 systems are planned to support training, maintenance, test and Littoral Combat Ship (LCS) requirements.  Eight (8) Fire Scout systems will utilize the MQ-8B air vehicle (23 air vehicles) and Forty-Eight (48) systems are planned to utilize the MQ-8C air vehicle (96 air vehicles), for a total of 119 air vehicles which includes Primary Inventory, backup inventory and attrition aircraft.  Each air vehicle meets the Capability Production Document (CPD) threshold requirement.  A limited number of land-based ground control stations supplement the system to support shore based operations, such as pre-deployment or acceptance functional check flights. These land based ground control stations will also support depot level maintenance\/post-maintenance activities. \n\nThe MQ-8 system will support Surface Warfare, Mine Countermeasures Warfare, and Anti-Submarine Warfare mission modules while operating onboard Littoral Combat Ship (LCS).  The MQ-8B is currently deployed on Guided Missile Frigates (FFG)  and may be deployed on alternate class of ships to support the U.S. Special Operations Command (USSOCOM) missions. In support of the SOCOM mission, air vehicles were moved forward in the budget starting in FY 2012 and additional ship control stations were planned for outfitting of the FFG\/DDG and alternate class of ships. The MQ-8B concluded land-based operations in support of the ISR Task Force and Army units. Mission training devices will be procured for pre-deployment and proficiency training. In addition, support equipment and material will be procured to support the planned 56 systems. Non-Recurring efforts include Diminishing Manufacturing Sources and Material Shortages (DMSMS), evaluation and studies on system obsolescence and replacement, and Engineering Change Proposals (ECPs) focused on performance enhancements identified in the Quick Reaction Assessment (QRA) and deployments.  In addition, specialty payloads and communications equipment will be procured in support of deployment requirements.  \n\nThe Navy will use the MQ-8 system from FFGs to provide up to 1\/2 orbit of support to SOF until Endurance Upgrade aircraft are available and LCS become available through the Global Force Management Process. \n\nPB-15 deferred air vehicle procurement to better align with LCS deliveries, while allowing integration of MQ-8C capabilities (Endurance, Radar and Weapons) to support LCS Mission Packages. Resourced in this budget are MQ-8 control stations, ancillary equipment, training equipment, support equipment, technical support and logistics which are still critically needed to outfit the ships and train the Aviation Detachments. \n\nThe program plans to Buy to Budget in FY13 and FY14. To Complete requirements will be adjusted to maintain a total procurement of 119 aircraft.\n\nThe MQ-8 system is post Milestone C (MS C), which was approved in May 2007.  MS C authorized entry into Low Rate Initial Production. The system is currently deployed on Navy Guided Missile Frigates (FFGs).   The Navy has truncated MQ-8B procurement with the last LRIP buy in FY11.  21 of the 23 LRIP aircraft (90%) have been delivered. Once delivery is complete, the 23 aircraft will support 8 Fire Scout systems.  MQ-8B airframes will continue to support maritime based ISR from FFGs, support LCS DT\/OT events and LCS deployments. MQ-8B airframes will sunset through attrition."
        },
        "Justification": {
            "val": "FY 2015 through FY 2019 funds MQ-8 control stations, ancillary equipment, training equipment, support equipment, technical support and logistics."
        },
        "MDAPCode": {
            "val": "253"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "MQ-8 UAV"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "Remarks": {
                        "val": "FY13-FY14 aircraft production is MQ-8C airframes.  FY13-14 included additional ship control stations and installations to outfit FFG and DDGs to support assigned deployments.  \n\nFY15-FY19 provides ancillary equipment which includes GCS, UCARs, special payloads, and shipboard TCDL systems; quantity and cost vary by shipboard deployment need date and requirement. Support costs include peculiar training equipment peculiar support equipment for airframe and avionics requirements, publications, and production support.  Other ILS includes production reachback, depot standup, and government logistics support requirements necessary to field the MQ-8 system.\n\nThe FY15 Support Cost increase aligns to the Navy plan to transition the MQ-8C Endurance Upgrade, Radar, and Weapons capabilities into the program of record and fully support production fielding and depot maintenance standup requirements.  The peculiar training equipment increase results from the procurement of a Mission Systems Trainer and a Combined Maintenance Trainer that are needed to train air vehicle operators, mission payload operators, and fleet maintenance personnel.  The Other ILS increase results from properly funding logistics functions to manage the system fielding process and transition the Endurance Upgrade, Radar, and Weapons capabilities to the program of record.  The Pubs and Tech Equipment increase results from previously underfunded requirements and transition of the above capabilities to the program of record."
                    },
                    "ResourceSummary": {
                        "Quantity": {
                            "AllPriorYears": {
                                "val": "33"
                            },
                            "PriorYear": {
                                "val": "5"
                            },
                            "CurrentYear": {
                                "val": "2"
                            }
                        },
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "510.146"
                            },
                            "PriorYear": {
                                "val": "110.402"
                            },
                            "CurrentYear": {
                                "val": "74.08"
                            },
                            "BudgetYearOneBase": {
                                "val": "40.663"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "40.663"
                            }
                        },
                        "UnitCost": {
                            "AllPriorYears": {
                                "val": "15458.97"
                            },
                            "PriorYear": {
                                "val": "22080.4"
                            },
                            "CurrentYear": {
                                "val": "37040"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "510.146"
                            },
                            "PriorYear": {
                                "val": "110.402"
                            },
                            "CurrentYear": {
                                "val": "74.08"
                            },
                            "BudgetYearOneBase": {
                                "val": "40.663"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "40.663"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "510.146"
                            },
                            "PriorYear": {
                                "val": "110.402"
                            },
                            "CurrentYear": {
                                "val": "74.08"
                            },
                            "BudgetYearOneBase": {
                                "val": "40.663"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "40.663"
                            }
                        },
                        "InitialSpares": {
                            "PriorYear": {
                                "val": "7.135"
                            },
                            "CurrentYear": {
                                "val": "15.6"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.573"
                            },
                            "BudgetYearOne": {
                                "val": "6.573"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "1.1.1) Airframe\/CFE"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "AllPriorYears": {
                                                            "val": "33"
                                                        },
                                                        "PriorYear": {
                                                            "val": "5"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "303.443"
                                                        },
                                                        "PriorYear": {
                                                            "val": "49.919"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "25.16"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "AllPriorYears": {
                                                            "val": "9195.242"
                                                        },
                                                        "PriorYear": {
                                                            "val": "9983.8"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "12580"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.2) GFE Electronics"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "32.41"
                                                        },
                                                        "PriorYear": {
                                                            "val": "15.376"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "8.692"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.3) Rec Flyaway ECO"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "3.691"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.572"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.429"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "339.544"
                                            },
                                            "PriorYear": {
                                                "val": "65.867"
                                            },
                                            "CurrentYear": {
                                                "val": "34.281"
                                            }
                                        }
                                    }
                                },
                                "NonRecurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "1.2.1) Non-Recur Cost"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "15.239"
                                                        },
                                                        "PriorYear": {
                                                            "val": "1.833"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2.577"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.2.2) Ancillary Equipment"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "68.638"
                                                        },
                                                        "PriorYear": {
                                                            "val": "30.057"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "19.298"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "8.583"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "8.583"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "83.877"
                                            },
                                            "PriorYear": {
                                                "val": "31.89"
                                            },
                                            "CurrentYear": {
                                                "val": "21.875"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "8.583"
                                            },
                                            "BudgetYearOne": {
                                                "val": "8.583"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "423.421"
                                        },
                                        "PriorYear": {
                                            "val": "97.757"
                                        },
                                        "CurrentYear": {
                                            "val": "56.156"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.583"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.583"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "2.1) Airframe PGSE"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.779"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.157"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.35"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.631"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.631"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) Avionics PGSE"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "1.514"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.32"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.32"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.3) Peculiar Training Equipment"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "14.258"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.219"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.843"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "11.861"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "11.861"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.4) Pubs\/Tech Equipment"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.781"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.496"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.127"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.149"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.149"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.5) Production Engineering Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "50.716"
                                                    },
                                                    "PriorYear": {
                                                        "val": "7.454"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "10.105"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "6.02"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6.02"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.6) Other ILS Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "17.191"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.319"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.985"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.099"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.099"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "86.725"
                                        },
                                        "PriorYear": {
                                            "val": "12.645"
                                        },
                                        "CurrentYear": {
                                            "val": "17.924"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "32.08"
                                        },
                                        "BudgetYearOne": {
                                            "val": "32.08"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}