{
    "id": "f02d8cd89d97dd616f5920766c83127441290632",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_ARMY_OTHER_3-4_PROCUREMENT_JustificationBook_Army_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "F00001"
        },
        "LineItemTitle": {
            "val": "Unmanned Ground Vehicle"
        },
        "P1LineNumber": {
            "val": "178"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "90"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support Equipment"
        },
        "ResourceSummary": {
            "Quantity": {
                "PriorYear": {
                    "val": "311"
                },
                "BudgetYearTwo": {
                    "val": "1"
                },
                "BudgetYearThree": {
                    "val": "1"
                },
                "BudgetYearFour": {
                    "val": "1"
                },
                "BudgetYearFive": {
                    "val": "1"
                }
            },
            "TotalCost": {
                "AllPriorYears": {
                    "val": "79.671"
                },
                "PriorYear": {
                    "val": "83.937"
                },
                "BudgetYearTwo": {
                    "val": "2.48"
                },
                "BudgetYearThree": {
                    "val": "5.953"
                },
                "BudgetYearFour": {
                    "val": "5.957"
                },
                "BudgetYearFive": {
                    "val": "5.961"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "UnitCost": {
                "PriorYear": {
                    "val": "269.894"
                },
                "BudgetYearTwo": {
                    "val": "2480"
                },
                "BudgetYearThree": {
                    "val": "5953"
                },
                "BudgetYearFour": {
                    "val": "5957"
                },
                "BudgetYearFive": {
                    "val": "5961"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "79.671"
                },
                "PriorYear": {
                    "val": "83.937"
                },
                "BudgetYearTwo": {
                    "val": "2.48"
                },
                "BudgetYearThree": {
                    "val": "5.953"
                },
                "BudgetYearFour": {
                    "val": "5.957"
                },
                "BudgetYearFive": {
                    "val": "5.961"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "79.671"
                },
                "PriorYear": {
                    "val": "83.937"
                },
                "BudgetYearTwo": {
                    "val": "2.48"
                },
                "BudgetYearThree": {
                    "val": "5.953"
                },
                "BudgetYearFour": {
                    "val": "5.957"
                },
                "BudgetYearFive": {
                    "val": "5.961"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Prior year funding was for the Small Unmanned Ground Vehicle (SUGV) program which was terminated.\n\n\nIn support of Joint Ground Robotic Integration Team (JGRIT) and emerging requirements, the Robot Enhancement Program (REP), modeled after the Soldier Enhancement Program (SEP), uses a \"buy, try and decide\" methodology to evaluate Commercial Off The Shelf (COTS), Government Off The Shelf (GOTS) and Non-Developmental Items (NDI) products that have the potential to enhance Soldier combat effectiveness. Hardware quantities will be limited to one Brigade Combat Team at the envisioned Basis of Issue as well as available SEP\/REP funds. Evaluation results obtained will be used to inform emerging requirements documents and Cost-Benefit Analyses to support future Army decision making with actual operational user feedback.\n\nThe CRS(I) program is the result of the MOA between Director, Army Capabilities Integration Center (DIR ARCIC), United States Army Training and Doctrine Command (TRADOC) and Deputy Commandant for Combat Development and Integration (DC CD&I), Headquarters Marine Corps (HQMC) dated 19 Sep 2012.  Thus the CRS(I) program has been jointly developed by the Army and USMC incorporating Army capability requirements, USMC Engineering Squad Robot (ESR) and USMC Tactical Robotic Controller (TRC) capabilities into one program.\n\nAs the lead service and in accordance with the Joint MOA Sec. 8.a., the Army will \"have responsibility and authority for overall programming, budgeting, obligation, and expenditure of Research, Development, Test, and Evaluation (RDT&E) funding appropriated for program development.\"\n\nThe CRS(I) capability contributes to the essential Joint Operational Concepts (JOC) of: Major Combat Operations (MCO); Military Support to Stabilization, Security, Transition, and Reconstruction (SSTR); Homeland Support and Civil Defense and Joint Functional Concepts (JFC) of: Force Application and Protection. The CRS(I) contributes directly to Situational Awareness, Detect, Protect and Neutralize  by providing a standoff hazards interrogation, detection, confirmation and neutralization capability employed to support a wide spectrum of mobility missions for current and future forces by providing required standoff capability across the Warfighting Functions. This capability allows commanders to make more informed decisions and plans, to use their forces more effectively and efficiently to produce desired outcomes, and to conduct focused operations for high-risk missions or selected missions that best satisfy the requirement without the limitations and vulnerabilities of manned systems. The CRS(I) capability provides commanders the ability to persistently monitor the operational environment (OE) while protecting and sustaining the force at standoff distances from the threat. The CRS (I) complements the Joint Integrated Warfighting Force by providing standoff to the Warfighter during Major Combat Operations, stability operations, and homeland security. The CRS(I) provides Warfighters the capability to find and identify targets of interest in the operational environment."
        },
        "Justification": {
            "val": "No FY15 procurement funding. Procurement funding in FY16-20 supports procurement of Commercial Off The Shelf (COTS)\/ Government Off The Shelf (GOTS)\/Non-developmental technologies sponsored by the Joint Ground Robotics Integration Team (JGRIT) under the Robotics Enhancement Program (REP)."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}