{
    "id": "f7ece10fb7a1353f9468074a83abc450975dde2f",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_AIRFORCE_OTHER_PROCUREMENT_JustificationBook_Air_Force_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "833560"
        },
        "LineItemTitle": {
            "val": "Integrated Strat Plan & Analy Network (ISPAN)"
        },
        "P1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Electronics Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "9.06"
                },
                "BudgetYearOne": {
                    "val": "9.06"
                },
                "BudgetYearTwo": {
                    "val": "9.66"
                },
                "BudgetYearThree": {
                    "val": "9.484"
                },
                "BudgetYearFour": {
                    "val": "9.247"
                },
                "BudgetYearFive": {
                    "val": "9.127"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "9.06"
                },
                "BudgetYearOne": {
                    "val": "9.06"
                },
                "BudgetYearTwo": {
                    "val": "9.66"
                },
                "BudgetYearThree": {
                    "val": "9.484"
                },
                "BudgetYearFour": {
                    "val": "9.247"
                },
                "BudgetYearFive": {
                    "val": "9.127"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "9.06"
                },
                "BudgetYearOne": {
                    "val": "9.06"
                },
                "BudgetYearTwo": {
                    "val": "9.66"
                },
                "BudgetYearThree": {
                    "val": "9.484"
                },
                "BudgetYearFour": {
                    "val": "9.247"
                },
                "BudgetYearFive": {
                    "val": "9.127"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "INTEGRATED STRATEGIC PLANNING AND ANALYSIS NETWORK (ISPAN):  The mission of USSTRATCOM is to conduct global operations in coordination with other Combatant Commands, Services, and appropriate U.S. Government agencies to deter and detect strategic attacks against the U.S. and its allies.  It provides full-spectrum global strike, and coordinated space, missile defense, and information operations capabilities to meet both deterrent and decisive national security objectives.  USSTRATCOM will also provide operational space support, integrated missile defense, global command, control, communications, computers, intelligence, surveillance, and reconnaissance (C4ISR), and specialized planning expertise to the joint warfighter.  ISPAN enables USSTRATCOM to carry out these missions.  It is one of DoD's most complex classified computer systems and the only national force level planning system.\n\nThe ISPAN program is comprised of two independent but complementary planning systems; the Mission Planning and Analysis System (MPAS) and the Global Adaptive Planning Collaborative Information Environment (GAP-CIE).  MPAS is an automated information system to support Global Strike nuclear and conventional target development and weaponeering.  MPAS includes Mission Planning, Analysis, and Decision Support tools and an Enterprise Database to sustain and support nuclear and conventional strategic war planning.  GAP-CIE provides web-enabled adaptive planning, rapid distributed Course of Action (COA) development and global situational awareness supporting both contingency and crisis planners.  ISPAN enables an effects-based approach to planning and operations; cross domain information sharing; and serves multiple planning environments.  It develops, verifies, and produces Operational Plan (OPLAN) 8010.  It also supports the USSTRATCOM family of plans construct and current Concept of Operations.  The system performs tasks ranging from creating and running Courses of Action (COAs) on threat scenarios to providing data for developing bomber aircraft crew strike mission data in digital and hard copy formats.  It includes automated data processing equipment (ADPE), multiple networks, unique processes and procedures, software, training, associated deployable and distributed data processing nodes, a test\/development environment, and subsidiary systems.  The system will migrate to the new USSTRATCOM Command and Control Facility. \n\nISPAN uses a four-year life-cycle replacement plan to procure required Commercial Off-The-Shelf (COTS) hardware (e.g. servers, storage devices, workstations, peripherals and other network components).  In some instances the hardware must be combined with commercially available software to form unique planning environments.  The programs  life cycle replacement plan for hardware follows industry standards and is used to eliminate the peaks and valleys associated with maintaining compatibility with the fast moving COTS hardware technology improvement cycle.  It also allows the program to better utilize existing manpower to install and configure the hardware systems to provide an incremental and efficient replacement of critical infrastructure components as they become obsolete.  Hardware and software procured within the program is used to support all ISPAN program increments.\n\nFunding for this exhibit is contained in Program Element 0101313F.\n\nFY14 and Prior-Year funding for ISPAN was requested in Line Item #22, 833140, Strategic Command and Control.\n\nThis is not a new start and is a budget realignment only."
        },
        "Justification": {
            "val": "FY15 funding continues the life-cycle procurement of commercial-based hardware and software components for the ISPAN mission system which consists of the Mission Planning and Analysis System (MPAS) and the Global Adaptive Planning Collaborative Information Environment (GAP CIE) efforts.  Funding procures mission system infrastructure, architecture, and related support components.  This includes replenishment hardware and software for an operational capability lab environment to certify ISPAN applications for operational use.  Funding also provides a secure cross-domain security solution capability to enable automated data transfers between multi-level networks supporting planners worldwide on multiple enclaves. It allows for the procurement of items such as (but are not limited to) application servers, switches, storage area network (SAN), backup and recovery systems, guard solution software and other articles that will provide a secure Cross Domain Security Solution (CDSS) capability, and the life-cycle replacement of Government Furnished Equipment (GFE) at development contractor sites.  Funding also provides for ISPAN strategic modernization efforts, to include increased virtualization technology environments and distributed operations capability to support joint warfighters across geographically separated locations.  Finally, funding provides for the initial migration of the ISPAN mission system to the new USSTRATCOM Command and Control Facility."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Integrated Strat Plan & Analy Network (ISPAN)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "End-point Computing Devices"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.782"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.782"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.782"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.782"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "MPAS Virtual Server Technology"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "ISPAN B-Network"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.3"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.3"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.3"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.3"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "ISPAN Security Enclaves (SIPR, TS\/C, & JWICS)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.25"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.25"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.25"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.25"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "ISPAN Virtual Data Storage System"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.4"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.4"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.4"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.4"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "ISPAN Systems at Geographically Separated Location(s)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.1"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.55"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.55"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Cross Domain Guard Solution"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.5"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.5"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "ISPAN Network Systems"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.25"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.25"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.25"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.25"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "ISPAN Systems for Off-Site Developers (GFE)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.8"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.8"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.4"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.4"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Program Management Administration (Government Cost)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.06"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.06"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Program Management Administration (Contractor Services)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.195"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.195"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "USSTRATCOM C2 Building Hardware & Networks"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "3.423"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.423"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "3.423"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.423"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "9.06"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.06"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "9.06"
                            },
                            "BudgetYearOne": {
                                "val": "9.06"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}