{
    "id": "18510aa72bac80e5eb4e0e74ee573b5d96712fc6",
    "meta": {
        "filename": "dod-2013_RDTE_2013_CBDP_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2013.zzz_unzipped_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
        },
        "R1LineItemNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "171.000"
            },
            "CurrentYear": {
                "val": "219.873"
            },
            "BudgetYearOne": {
                "val": "223.269"
            },
            "BudgetYearOneBase": {
                "val": "223.269"
            },
            "BudgetYearTwo": {
                "val": "208.611"
            },
            "BudgetYearThree": {
                "val": "191.966"
            },
            "BudgetYearFour": {
                "val": "246.035"
            },
            "BudgetYearFive": {
                "val": "246.035"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Funding under this program element (PE) sustains a robust defense program, which both reduces the danger of a chemical, biological, or radiological (CBR) attack and enables U.S. forces to survive, and continue operations in a CBR environment.  The medical program focuses on the development of antidotes, drug treatments, disease surveillance and point-of-need diagnostic devices, patient decontamination and medical technologies management.  The Medical Countermeasures Initiative (MCMI) was established to provide the capability for the advancement of regulatory science and flexible manufacturing of biological MCM to address CBR threats, including novel and previously unrecognized, naturally-occurring emerging infectious diseases.  In the physical sciences area, the emphasis is on continuing improvements in CB defense materiel, including contamination avoidance, decontamination, and protection technologies.  Research efforts are planned to be initiated for CB defense technologies that will result from a strategic approach of converging nanotechnology, biotechnology, information technology and cognitive science.  This PE also provides for applied research in the areas of real-time sensing and immediate biological countermeasures.\nEfforts under this PE transition to or provide risk reduction for Advanced Technology Development (PE: 0603384BP), Advanced Component Development and Prototypes (PE: 0603884BP) and System Development and Demonstration (PE: 0604384BP).\nIn FY13, all NTA efforts (both Medical and Non-Medical) within the PE are re-aligned to Project NT2 - Techbase Non-Traditional Agents Defense.  Also in FY13, all Medical efforts currently included in Project TB2 (Medical Biological Defense), Project TC2 (Medical Chemical Defense) and Project TR2 (Medical Radiological Defense), will be re-aligned to Project TM2 (Techbase Med Defense)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "169.287"
                },
                "CurrentYear": {
                    "val": "219.873"
                },
                "BudgetYearOne": {
                    "val": "217.812"
                },
                "BudgetYearOneBase": {
                    "val": "217.812"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "171.000"
                },
                "CurrentYear": {
                    "val": "219.873"
                },
                "BudgetYearOne": {
                    "val": "223.269"
                },
                "BudgetYearOneBase": {
                    "val": "223.269"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.713"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.457"
                },
                "BudgetYearOneBase": {
                    "val": "5.457"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.314"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.087"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "4.114"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "5.457"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.457"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: Adjustments less than 10% of total program.\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB2"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "85.789"
                        },
                        "CurrentYear": {
                            "val": "97.774"
                        },
                        "BudgetYearOne": {
                            "val": "44.331"
                        },
                        "BudgetYearOneBase": {
                            "val": "44.331"
                        },
                        "BudgetYearTwo": {
                            "val": "41.819"
                        },
                        "BudgetYearThree": {
                            "val": "40.951"
                        },
                        "BudgetYearFour": {
                            "val": "52.243"
                        },
                        "BudgetYearFive": {
                            "val": "52.243"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (CB2) provides physical applied research to develop future, multi-disciplinary, multi-functional capabilities in life sciences, physical sciences, environmental sciences, mathematics, cognitive sciences, and engineering.  Efforts in this project support the seamless integration of state-of-the-art-technologies into a collection of systems across the spectrum of capabilities required to support chemical and biological defense missions.  Capability areas in this project include: detection; information systems technology; protection\/hazard mitigation; and threat agent science.  Detection focuses on developing technologies for standoff and point detection and identification of chemical and biological agents.  Information systems technology focuses on advanced warning and reporting, hazard prediction and assessment, simulation analysis and planning, and systems performance modeling.  Protection and hazard mitigation focuses on providing technologies that protect and reduce the chemical\/biological threat or hazard to the Warfighter, weapons platforms, and structures.  Threat agent science is devoted to characterizing threat agents and the hazards they present in terms of agent fate in the environment, toxicology, and pathogenicity.  This project focuses on horizontal integration of CB defensive technologies in support of the Joint Services. \n\nStarting in FY11, all NTA-dedicated research was re-aligned into specific capability areas within this project in order to ensure a focused effort on this high priority area.  In FY13, all NTA-dedicated research is re-aligned to Project NT2 - Techbase NTA Defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Detection"
                                    },
                                    "Description": {
                                        "val": "Chemical and Biological Point Detection Technology: Emphasis on the detection and identification of chemical and biological threats.  Objectives include the development of nanoscale detector for sensing of chemical and biological agents, design for prototype whole pathogen genome sequencing system, and development of a portable point detector for chemical warfare (CW) detection in potable water."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.271"
                                            },
                                            "Text": {
                                                "val": "Continued concept development of nano-scale biological agent identification and sensing technologies.  Continued feasibility studies of nanoscale detection systems.  Demonstrated Microelectromechanical System (MEMS) Fourier Transform Infrared Spectroscopy (FTIR) sensor system.  Demonstrated technology to completely sequence entire pathogen genomes with automated sample preparation.  Completed studies to increase understanding of critical biological antigen variability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.795"
                                            },
                                            "Text": {
                                                "val": "Continue concept development of nano-scale biological agent identification and sensing technologies.  Continue feasibility studies of nanoscale detection systems.  Continue integration studies for the Next Generation Chemical Point Detector (NGCPD) based on MEMS components for gas chromatography (GC), Infrared (IR), and mass spectrometry (MS).  Continue development of breadboard prototype for complete sequencing of entire pathogen genomes with automated sample preparation which also applies to biosurveillance.  In FY13, all research in this area is re-aligned into Techbase Non-Med Defense - Physical Science Applied Research (PSAR) (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Detection"
                                    },
                                    "Description": {
                                        "val": "Chemical and Biological Stand-off Detection Technology: Emphasis on the detection and identification of chemical and biological threats in near real time at a distance from the detector.  Future programs focus on the improvement of algorithms, excitation sources, and detector elements to increase range, reduce false positives, increase sensitivity, and reduce cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.043"
                                            },
                                            "Text": {
                                                "val": "Completed algorithm development to increase range capabilities and reduce false positives.  Completed work on first generation active infrared (IR) standoff biological classification capabilities.  Completed evaluation and assessment of technology for scattering optical techniques, non-scattering optical standoff techniques, and off-gassing for down-selection of breadboard design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Detection NTA"
                                    },
                                    "Description": {
                                        "val": "Primary focus is to assess the potential of optical technologies to meet the needs to detect the presence of NTAs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.625"
                                            },
                                            "Text": {
                                                "val": "Completed a scientific analysis on the technical impacts of the detection of agents on surfaces due to the presence of NTAs.  Completed assessment of chemical fate of chemicals in potable water.  Continued feasibility development of plant sentinel concept, enabling a plant to serve as a detector for substances of interest, to provide an inexpensive, widespread detection technology that can be used in both interior and exterior settings.  Initiated development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination application.  Initiated concept designs for chemical aerosols point detection system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.879"
                                            },
                                            "Text": {
                                                "val": "Continue feasibility development of plant sentinel concept.  Continue development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination application.  Complete designs for chemical aerosols point detection system.  Initiate integration studies for chemical aerosol detection into the NGCPD.  In FY13, all research in this area is re-aligned into Techbase Non-Traditional Agents Defense Non-Medical (Applied Research) (NT2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Warning and Reporting Information & Analysis: Emphasis on developing science and technologies for collaborative information management, fusion of disparate information from multiple sources, environmental databases and modeling, fusion of syndromic\/diseases surveillance data, and synthetic environments for model performance evaluation and acquisition decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.743"
                                            },
                                            "Text": {
                                                "val": "Refined advanced Source Term Estimation (STE) and Hazard Refinement (HR) algorithms for use in complex environments (e.g., variable terrain, urban, water), based on results of field trial-based Validation and Verification (V&V) effort.  Completed testing and V&V of first-generation networked CB detector false alarm reduction capability for an advanced development program (JWARN).  Expanded and improved data assimilation techniques for linking chemical, environmental, medical surveillance, and other disparate sensor data with computer based applications.  Completed development of Source Term Estimation (STE), Hazard Refinement (HR), and Sensor Placement Tool (SPT) for use in complex environments.  Continued to enhance coupling between environmental parameters and advanced development programs.  Finalized development of a tool that continuously refines and updates the contamination footprint through rapid assimilation of limited and disparate information into meteorological, transport and dispersion, and virtual environment models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.951"
                                            },
                                            "Text": {
                                                "val": "Initiate study on integration of biosurveillance data with disease spread models to enable early warning and reporting capabilities.  Investigation will include approaches and tools to automatically access, process and store biosurveillance data, architecture to search stored raw and processed biosurveillance data including adapting existing taxonomies or ontologies to facilitate interoperability, and approaches to facilitate using the architecture in near real time to update disease spread models with new biosurveillance data.  Complete advanced STE and HR algorithms for use in complex environments (e.g., variable terrain, urban, water), based on results of field trial-based V&V effort.  Continue to expand and improve data assimilation techniques for linking chemical, environmental, medical surveillance, and other disparate sensor data with computer based applications.  Complete enhanced coupling between environmental parameters and advanced development programs.  In FY13, all research in this area is re-aligned into Techbase Non-Med Defense - Physical Science Applied Research (PSAR) (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Hazard Prediction and Information Analysis: Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop predictive capability for the source term of releases of CB agents or industrial materials from CB attack or accidents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.039"
                                            },
                                            "Text": {
                                                "val": "Continued to develop a high altitude post-missile intercept hazard prediction model for chemical, biological, and nuclear dispersion and integrated with advanced development programs.  Continued to develop models for waterborne transport and dispersion of chemical agents.  Continued to improve and optimize transport and dispersion models in open and urban environments.  Implemented source backtracking in advanced urban models.  Implemented methods for foreign regions as well as dynamic climatology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.143"
                                            },
                                            "Text": {
                                                "val": "Continue development of a waterborne transport tool by beginning investigation of transport methods for biological agents and other materials as well as beginning a feasibility study of waterborne inverse species transport module.  Continue to develop a high altitude post-missile intercept hazard prediction model for eventual integration into the JEM supplemented by small scale testing for model validation.  Assume management of and complete human and health effects modeling - shifted from the Simulation, Analysis and Planning research area - informed by other hazard prediction projects.  Initiate enhancement of urban dispersion models to include source characterization\/backtracking for eventual integration into the Joint Effects Model.  Initiate implementation and testing of new numerical schemes for future establishment of 64-bit\/multi-core capable models.  Transfer high-altitude post-missile intercept, urban transport and dispersion, and 64-bit\/multi-core capable model development to CB3 M&S funding in FY13.  In FY13, all research in this area is re-aligned into Techbase Non-Med Defense - Physical Science Applied Research (PSAR) (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Operations Planning & Information Analysis: Develop decision support tools and information management capabilities for planning and real-time analysis to determine and assess operational effects, risks, and impacts of CBRN incidents on decision making.  Focus areas include consequence management, population modeling, and human knowledge management."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.597"
                                            },
                                            "Text": {
                                                "val": "Continue development of efforts previously funded under Simulation Analysis and Planning in FY11 (continue integration of CB operational effects in tactical and operational level models, continue development of IM\/CM tools, capabilities that leverage and integrate existing early detection and disease surveillance data for inclusion into advanced development efforts).  Initiate studies on social\/cultural norms for application in agent based models.  Initiate study of social reaction to disease and disease mitigation strategies to support biosurveillance.  Initiate development of human cognitive models that incorporate the effects of chemical biological agent interaction with other battle stressors to facilitate operational decision making.  Continue operational effects research and analysis efforts.  In FY13, all research in this area is re-aligned into Techbase Non-Med Defense - Physical Science Applied Research (PSAR) (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Systems Performance Information & Analysis: Develop Chemical, Biological, Radiological and Nuclear (CBRN) data sharing capabilities and simulation tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.112"
                                            },
                                            "Text": {
                                                "val": "Constructed a plan for development of the Chemical and Biological Warfare Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB warfare agents on equipment, personnel, and operations.  Demonstrated initial versions of Systems Performance Models.  Continued to develop collective protection, individual protection, contamination avoidance and decontamination models for test and evaluation.  Continued to build requirements for system performance model integration and program-wide exploitation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.569"
                                            },
                                            "Text": {
                                                "val": "Initiate development of an authoritative manual capturing analytical methods for evaluating the effects of chemical and biological warfare on equipment, personnel, and operations.  In FY13, all research in this area is re-aligned into Techbase Non-Med Defense - Physical Science Applied Research (PSAR) (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Medical & Surveillance Information & Analysis: Integrate existing disparate military and civilian datasets into advanced warning systems, and leverage and enhance epidemiological models and algorithms for disease prediction, impact and biological threat assessment.  Contribute to the development of global, near real time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into agent-based epidemiological modeling, medical resource estimation and decision support tools.  Focus areas include health\/human effects modeling including casualty estimation, agent-based epidemiological modeling and fusion of disease surveillance data."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.525"
                                            },
                                            "Text": {
                                                "val": "Continue effort on biosurveillance data stream evaluation and analysis.  Initiate effort to devise structured expansion roadmap for agent-based epidemiological models for Outside Contiguous United States (OCONUS).  Initiate research on agent-based modeling platforms and policy assessment.  In FY13, all research in this area is re-aligned into Techbase Med Bio - Diagnostics (TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Simulation Analysis and Planning: Develop decision support tools and information management capabilities for planning and real-time analysis to determine and assess operational effects, risks, and impacts of CBRN incidents on decision making.  Focus areas include consequence management, human knowledge management, health\/human effects modeling including casualty estimation, and fusion of diseases surveillance data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.594"
                                            },
                                            "Text": {
                                                "val": "Completed development of refined versions of secondary infection models and human effects models to reflect revision of NATO's AMedP-8.  Initiated research in human and health effects for additional casualty estimation modules for agents not in NATO's AMedP-8, including Non-Traditional Agents and shifted this work into the Hazard Prediction Information & Analysis area beginning in FY12.  Completed development of contagious\/infectious disease models.  Continued developing efforts aimed at integrating CB operational effects in tactical and operational level models for mobile forces, shipboard modeling, fixed sites and tactical aircraft.  Further developed IM\/CM tools and capabilities.  Initiated development of capabilities that leverage and integrate existing early detection and disease surveillance data for inclusion into advanced development efforts.  Developed route planning and evacuation\/shelter-in-place decision aids.  Shift all research, other than human and health effects research, in this area into the Operations Planning & Information Analysis research area beginning in FY12."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Information Systems Technology NTA"
                                    },
                                    "Description": {
                                        "val": "Modeling & Simulation for Non-Traditional Agents (NTA): Provide modeling of NTA materials for hazard prediction.  Develop NTA source term algorithms for intentionally functioning weapons, counter-proliferation scenarios (bomb on target), and missile intercept.  \"Intentionally Functioning Weapons\" refers to the case where a missile has released its chemical or biological payload as it was designed, rather than where the release was caused by missile interdiction.  Investigate NTA agent fate for secondary effects, environmental\/atmospheric chemistry, atmospheric and waterborne transport and dispersion, human effects, model V&V, scaled testing, casualty estimation, and supporting data management"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.422"
                                            },
                                            "Text": {
                                                "val": "Establish initial methodologies of defining NTA source terms for relevant scenarios.  Begin establishment of a classified database for linking NTA types to weapon system types for NTA source term modeling.  Expand material file collection to include those NTAs on which there is sufficient initial data.  Create initial priority list of remaining agents with data gaps.  Initiate the establishment of capabilities for data collection on NTA data gaps.  Initiate planning and implementation of small scale testing for NTA simulants for use in creating and verifying NTA modeling source terms.  In FY13, all research in this area is re-aligned into Techbase Non-Traditional Agents Defense Non-Medical(Applied Research) (NT2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Innovative Systems Concepts and Analysis: Development and systems analysis of novel system concepts for chemical and biological protection of occupants of buildings and platforms that integrates emerging technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.345"
                                            },
                                            "Text": {
                                                "val": "Continuation of Innovative Systems Concepts and Analysis projects from FY10."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Lightweight Integrated Fabric: Development of lightweight chemical and biological protective textiles that can be used as an integrated combat duty uniform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.546"
                                            },
                                            "Text": {
                                                "val": "Incorporated lessons learned from the Individual Protection Advanced Technology Demonstration (see TT3 E&TD), which supported the Lightweight CB Ensemble (LCBE), and incorporated lessons into further development of integrated fabric.  Completed work on network-enabled fabric agent indicators.  Continued development work on ultra light and tactile barrier materials for gloves and boots and continued fabrication and testing of prototype integrated fabrics to determine protection, mechanical properties, and heat transfer characteristics.  Continued development and scaling of nanofiber\/textile production technologies for transition to Uniform Integrated Protection Ensemble (UIPE) and\/or Joint Service Lightweight Integrated Suit Technology (JSLIST) program.  Continued use of computational methods for assessment and refinement of prototypes.  Continued development of ensemble design conceptual work based on lessons gathered in the human performance project for transition to UIPE\/JSLIST."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.829"
                                            },
                                            "Text": {
                                                "val": "Continue development work, fabrication, and testing of prototype integrated fabrics to determine protection, mechanical properties, and comfort characteristics (such as heat and water vapor transfer properties).  Continue use of computational methods to assess and refine prototypes.  Develop improved thermal modeling simulations.  Develop and scale an advanced adsorbent nanofiber\/textile production technology and\/or a \"smart material\" technology for possible transition to a UIPE program.  Continue development of ensemble design conceptual work based on the lessons gathered in the human performance projects for transition to UIPE\/JSLIST.  In FY13, all research in this area is re-aligned into Techbase Non-Med Defense - Physical Science Applied Research (PSAR) (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Low-Resistance, Low-Profile Filtration: Development and integration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals (TIC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.526"
                                            },
                                            "Text": {
                                                "val": "Incorporated lessons learned from the Individual Protection Advanced Technology Demonstration, which supported the Uniform Integrated Protective Ensemble (UIPE), and incorporated lessons into further development of low resistance\/profile filtration.  Continued project to develop the next generation filter for individual protection from CB agents and TICs.  Integrated metal-organic frameworks, other novel adsorbent and nanofiber HEPA filters into \"breadboard\" prototypes.  Continued reactive hybrid approaches for individual protection filtration and evaluated the performance.  As a result of the IP Demo, refined prototype concept filters for advanced development programs such as the Joint Service General Purpose Mask (JSGPM), Joint Service Aircrew Mask (JSAM), UIPE programs, improved media for collective protection filters in Joint Expeditionary Collective Protection (JECP), and in support of collective protection in vehicular\/platform systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.905"
                                            },
                                            "Text": {
                                                "val": "Continue development of low resistance\/profile filtration.  Continue effort to develop the next generation novel filtration media for individual protection from CB agents and TICs (NTAs are addressed in Protection & Hazard Mitigation NTA).  Transition these technologies to the Joint Service General Purpose Mask (JSGPM) and Joint Service Aircrew Mask (JSAM) programs.  Integrate metal-organic frameworks and other novel adsorbent into \"system\" prototypes.  Integrate nanofiber HEPA filters into system prototypes.  Continue reactive hybrid approaches for individual protection filtration and evaluate performance.  In FY13, all research in this area is re-aligned into Techbase Non-Med Defense - Physical Science Applied Research (PSAR) (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "14) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Human Performance Prediction and Assessment: Analysis and modeling of human performance in chemical and biological protective ensembles in order to determine design priorities and trade-offs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.711"
                                            },
                                            "Text": {
                                                "val": "Incorporated lessons learned from the Individual Protection Advanced Technology Demonstration, which supported the Uniform Integrated Protective Ensemble (UIPE), and incorporated lessons learned into further development of human performance prediction and assessment.  Completed human performance model for CB protective equipment.  As a result of the IP Demo, transitioned model data and analysis to individual protection advanced development programs.  Continued anthropometric sizing study to support size tariff development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.484"
                                            },
                                            "Text": {
                                                "val": "Continue development of human performance prediction and assessment by investigating the interactive effects of competing burdens on human cognitive performance.  Studies will be conducted to quantify the cumulative effects of the two primary factors researched to date: thermal burden (via moisture vapor transport rate) and breathing resistance.  Transition data on Human Performance Assessment that will allow the prediction and design of individual protective gear."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "15) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Low-Burden Air Purifying Respirator: Development and analysis of design alternatives for chemical and biological air-purifying respirators to provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.619"
                                            },
                                            "Text": {
                                                "val": "Incorporated lessons learned from the Individual Protection Advanced Technology Demonstration, which supported the Uniform Integrated Protective Ensemble (UIPE), and incorporated lessons into further development of a low-burden air purifying respirator.  Completed the assessment of the key development parameters associated with respiratory protective systems and incorporated data and lessons from the human performance project.  Incorporated lessons learned from the IP Demonstration into protective mask prototypes.  Completed integration analysis with ground Warfighter helmet systems.  Continued to integrate work on the dual-cavity respirator concepts into the final design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.551"
                                            },
                                            "Text": {
                                                "val": "Continue development of a low-burden air purifying respirator.  Advanced concept CBRN technologies will be integrated within the confines of the Chem\/Bio protection component of the Helmet Electronics and Display System - Upgradable Protection (HEADS-UP) Army Technology Objective (ATO) program, which has multi-service participation for ground applications.  Various levels of comfort versus protection will be integrated into prototype helmets.  Work will focus on revolutionary, innovative design concepts (such as a dual-cavity respirator) in the final design in order to support decisions to initiate future helmet\/mask developmental programs.  In FY13, all research in this area is re-aligned into Techbase Non-Med Defense - Physical Science Applied Research (PSAR) (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "16) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Logistically Sustainable Air Purification for Collective Protection: Development of chemical and biological air-purification alternative technologies that minimize or eliminate the need for expendable media within acceptable size, weight and power constraints."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.937"
                                            },
                                            "Text": {
                                                "val": "Continued development of reactive membrane and regenerative post treatment media technologies for applications in building protection and vehicular\/platform systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.966"
                                            },
                                            "Text": {
                                                "val": "Continue development of reactive membrane and regenerative post treatment media technologies for applications in building protection and vehicular\/platform systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "17) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "General Purpose Formulations for Decontamination: Development and improvement of chemical and biological decontamination formulations that are compatible with the current family of decontamination systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.858"
                                            },
                                            "Text": {
                                                "val": "Completed development, testing and transition of solid oxidant and green surfactant to support advanced development programs such as the Hazard Mitigation for Material and Equipment Restoration (HaMMER) Advanced Technology Demonstration (see Budget Activity 3, Project TT3, Experiment & Technology Demonstrations), also known as the Decontamination Family of Systems Demonstration.  Continued focused enzymatic decontamination development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.561"
                                            },
                                            "Text": {
                                                "val": "Continue focused enzymatic decontamination development.  Complete study and transition data on agent fate of contaminated human remains and transition to the Human Remains Decontamination System program.  In FY13, all research in this area re-aligned to \"Decontamination Family-of-Systems\"."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "18) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Decontamination Family-of-Systems (DFoS): Development and analysis of non-traditional decontamination technologies and approaches which gain significantly improved effectiveness by complementary application."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.348"
                                            },
                                            "Text": {
                                                "val": "Developed data to define performance envelop of system components and transitioned to HaMMER.  Initiated a study on impact of application methods of decontaminants to complex surfaces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.929"
                                            },
                                            "Text": {
                                                "val": "Transition mature DFoS technologies including reactive coatings; continue developing other promising technologies.  Continue the optimization of decontamination applicators.  Continue investigation of microwave interaction with coating embedded particles and functionalities for directed energy decontamination.  Coatings efforts will also examine durable and temporary coatings that pursue reactive and barrier options.  Continue studies on effect of delivery and application methods on decontamination efficacy on complex surfaces.  In FY13, all research in this area is re-aligned into Techbase Non-Med Defense - Physical Science Applied Research (PSAR) (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "19) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Smart Hazard Mitigation: Development of decontamination technologies that sense, respond (decontaminate) and signal in the presence of chemical and biological contamination."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.388"
                                            },
                                            "Text": {
                                                "val": "Continued development of molecular switches that respond and react to the presence of CB agents and signal results.  Continued development of rotaxane chemistry as artificial tunable G and V receptors that sense and react to chemical and biological agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.477"
                                            },
                                            "Text": {
                                                "val": "Continue development of molecular switches that respond and react to the presence of CB agents and signal results.  Continue development of rotaxane chemistry as artificial tunable G and V receptors that sense and react to chemical and biological agents.  Conduct comparative analysis\/technology readiness assessment of smart system candidate technologies to select candidates for further development.  In FY13, all research in this area re-aligned to \"Decontamination Family-of-Systems\"."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "20) Protection and Hazard Mitigation NTA"
                                    },
                                    "Description": {
                                        "val": "NTA Air Purification: Study and assessment of filter technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.397"
                                            },
                                            "Text": {
                                                "val": "Completed assessment of military carbon against NTAs, including performance when exposed to battlefield contaminants such as petroleum, oil, lubricants, and sweat.  Developed and tested novel materials to improve performance against NTAs.  Provided results for upgrades into developmental programs.  Continued project to develop the next generation filter for individual protection from NTAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.024"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of novel materials to improve performance against NTAs.  Materials explored will include crystalline nano-porous framework materials, catalytic, nano-fibrous, and composite materials.  In FY13, all research in this area is re-aligned into Techbase Non-Traditional Agents Defense Non-Medical(Applied Research) (NT2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "21) Protection & Hazard Mitigation NTA"
                                    },
                                    "Description": {
                                        "val": "NTA Percutaneous Protection\n\nStudy and assessment of protective technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.113"
                                            },
                                            "Text": {
                                                "val": "Developed technologies to improve overall protective clothing performance against NTAs.  Developed and assessed improved ensemble closures and evaluated current individual protective (IP) barrier materials.  Developed component aerosol test methods for performance standards of IP ensembles.  Modified and verified material swatch test methods for liquid and aerosol for performance standards of IP materials.  Developed breathable aerosol barrier materials and self-detoxifying fabrics.  Developed and evaluated improved barrier materials for protective gloves and boots.  Completed assessment of expedient approaches and skin barrier treatments.  Developed and tested performance enhancements that improve material agent resistance and garment closure performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.551"
                                            },
                                            "Text": {
                                                "val": "Continue development of technologies to improve overall protective clothing performance against NTAs.  Perform component and system modeling in order to (1) evaluate and utilize aerosol-based closure testing; and (2) model aerosol transport within individual protective equipment ensembles.  Design and test novel closures in accordance with modeling results\/predictions.  Fabricate prototype systems and then test\/measure their aerosol performance.  In FY13, all research in this area is re-aligned into Techbase Non-Traditional Agents Defense Non-Medical(Applied Research) (NT2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "22) Protection & Hazard Mitigation NTA"
                                    },
                                    "Description": {
                                        "val": "NTA Decontamination: Study and assessment of decontamination technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.241"
                                            },
                                            "Text": {
                                                "val": "Assessed performance of current and developmental decontamination technologies against NTAs.  Developed decontamination technologies and formulations that are optimized against NTAs.  Modified and verified test procedures for NTAs.  Developed and tested decontamination formulations and system-of-systems approaches that improve performance against NTAs and manage process residuals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.324"
                                            },
                                            "Text": {
                                                "val": "Continue development of decontamination technologies against NTAs.  Continue to develop decontamination technologies and formulations that are optimized against NTAs.  Continue development and test decontamination formulations and system-of-systems approaches that improve performance against NTAs and manage process residuals, including effluent control.  Continue development of durable and temporary, reactive and barrier coatings to mitigate NTA contamination.  In FY13, all research in this area is re-aligned into Techbase Non-Traditional Agents Defense Non-Medical(Applied Research) (NT2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "23) Applied Research"
                                    },
                                    "Description": {
                                        "val": "Chemical and Biological Point Detection Technology: Emphasis on the detection and identification of chemical and biological threats.  Objectives include the development of nanoscale detector for sensing of chemical and biological agents, design for prototype whole pathogen genome sequencing system, and development of a portable point detector for chemical warfare (CW) detection in potable water."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.579"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.579"
                                            },
                                            "Text": {
                                                "val": "Complete concept development of nano-scale biological agent identification and sensing technologies.  Complete feasibility studies of nanoscale detection systems.  Continue integration studies for Next Generation Chemical Point Detection (NGCPD) based on MEMS components for GC and MS.  Complete development of breadboard prototype for complete sequencing entire pathogen genomes with automated sample preparation which also applies to biosurveillance.  Continue algorithm development to increase range capabilities, reduce false positives, and provide decision capabilities for large data sets.  Funding for this research area is realigned from Tech Base Non-Med - Detection (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "24) Applied Research"
                                    },
                                    "Description": {
                                        "val": "Threat Agent Science: Supports defensive countermeasure development against current and new threats by delivering the scientific understanding and relevant estimates of the hazards posed to humans by exposure to chemical or biological agents.  Toxicological and\/or infectious-dose information and environmental response supports development and\/or enhancing both operational risk and exposure guidelines; limits for detection and protection; goals for decontamination; and medical countermeasures.  Funding for this research is realigned from Tech Base Non-Med - Threat Agent Science (CB2)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.603"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.603"
                                            },
                                            "Text": {
                                                "val": "Develop a systems approach to toxicological understanding of physiological injury by threat agents.  Determine infectious dose of biological agents of interest and potential emergent threats from reservoir hosts or other technological breakthroughs such as Do-it-Yourself (DIY) biology.  DIY biology is a growing movement in which individuals, or sometimes small informal organizations, change the genetics of life forms, with small resources, and often little or no formal training, oversight by professionals, or regulation by governments.  Continue investigations that describe fundamental mechanisms that contribute to BWA persistence and transport.  Define particle properties and predict aerosolization behavior to inform hazard assessment.  Study emerging technological breakthroughs such as DIY biology that may impact novel threat emergence.  Study agent modulation in natural or laboratory environments to inform forensic examination of threats.  Funding for this research area is realigned from Tech Base Non-Med - Threat Agent Science (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "25) Applied Research"
                                    },
                                    "Description": {
                                        "val": "Hazard Prediction Information & Analysis: Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop predictive capability for the source term of releases of CB agents or industrial materials from CB or accidents."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.485"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.485"
                                            },
                                            "Text": {
                                                "val": "Complete development of a waterborne transport tool investigation of transport methods for biological agents and other materials.  Initiate development of waterborne inverse species transport module based on feasibility study results.  Funding for this research area is realigned from Tech Base Non-Med - Modeling & Simulation (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "26) Applied Research"
                                    },
                                    "Description": {
                                        "val": "Operations Planning Information & Analysis: Develop decision support tools and information management capabilities for planning and real-time analysis to determine and assess operational effects, risks, and impacts of CBRN incidents on decision making.  Focus areas include consequence management, population modeling, and human knowledge management."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.529"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.529"
                                            },
                                            "Text": {
                                                "val": "Continue studies on social\/cultural norms for application in agent based models.  Continue study of social reaction to disease and disease mitigation strategies to support biosurveillance.  Continue development of human cognitive models that incorporate the effects of chemical biological agent interaction with other battle stressors to facilitate operational decision making.  Initiate special population analysis to model emerging disease and the effects of targeted countermeasures.  Continue operational effects research and analysis efforts.  Funding for this research area is realigned from Tech Base Non-Med - Modeling & Simulation (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "27) Applied Research"
                                    },
                                    "Description": {
                                        "val": "Systems Performance Information & Analysis: Develop CBRN data sharing capabilities and simulation tools."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.312"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.312"
                                            },
                                            "Text": {
                                                "val": "Continue to develop the Chemical and Biological Warfare Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB warfare agents on equipment, personnel, and operations.  Conclude development of initial versions of systems performance models in collective protection, individual protection, contamination avoidance and decontamination.  Initiate system performance model integration and advanced development for program-wide exploitation.  Funding for this research area is realigned from Tech Base Non-Med - Modeling & Simulation (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "28) Applied Research"
                                    },
                                    "Description": {
                                        "val": "Warning and Reporting Information & Analysis: Emphasis on developing science and technologies for collaborative information management, fusion of disparate information from multiple sources, environmental databases and modeling, fusion of syndromic\/diseases surveillance data, and synthetic environments for model performance evaluation and acquisition decisions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.354"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.354"
                                            },
                                            "Text": {
                                                "val": "Initiate study on animal and human effects from time-varying toxic industrial chemical concentration exposures.  Initiate development of a generalized Virtual Testing and Evaluation testbed for evaluating\/stressing source characterization and hazard refinement techniques, under a wide range of operational conditions.  Initiate interior building transport and dispersion modeling effort to improve modeling of indoor-to-outdoor dispersion and to enhance the indoor modeling capabilities of advanced development programs.  Continue study on integration of biosurveillance data with disease spread models to enable early warning and reporting capabilities, performing R&D to improve performance of novel data assimilation algorithm used to integrate global biosurveillance data.  Funding for this research area is realigned from Tech Base Non-Med - Modeling & Simulation (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "29) Applied Research"
                                    },
                                    "Description": {
                                        "val": "Protection & Hazard Mitigation\n\nLightweight Integrated Fabric: Development of lightweight chemical and biological protective textiles that can be used as an integrated combat duty uniform."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.303"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.303"
                                            },
                                            "Text": {
                                                "val": "Continue to develop new low burden fabrics and ensemble designs to support the UIPE\/JSLIST programs.  Continue with development areas that include: evaluation of superoleophobic materials, refinement of \"man in simulant test\" sensors, continuation of aerosol system testing, advanced adsorbent nanofiber\/textile production technology, and smart materials.  Funding for this research area is realigned from Tech Base Non-Med - Protection and Hazard Mitigation(CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "30) Applied Research"
                                    },
                                    "Description": {
                                        "val": "Protection & Hazard Mitigation\n\nLow-Resistance, Low-Profile Filtration: Development and integration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.294"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.294"
                                            },
                                            "Text": {
                                                "val": "Continue development of next generation filtration technology.  Continue focus on low resistance\/low profile novel filter media with augmented performance against TICs and chemical agents.  Continue to replace legacy filter media with novel media that offers broad spectrum protection.  Continue with technology areas to include: metal organic frameworks, novel adsorbents and reactive hybrids.  Transition these technologies to the Joint Service General Purpose Mask (JSGPM) and Joint Service Aircrew Mask (JSAM) programs.  Funding for this research area is realigned from Tech Base Non-Med - Protection and Hazard Mitigation(CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "31) Applied Research"
                                    },
                                    "Description": {
                                        "val": "Protection & Hazard Mitigation\n\nLow-Burden Air Purifying Respirator: Development and analysis of design alternatives for chemical and biological air-purifying respirators to provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.046"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.046"
                                            },
                                            "Text": {
                                                "val": "Continue development of next generation low burden respirator technology.  Develop and integrate novel seal, anti-fogging, and dual cavity technologies.  Develop and verify methods for a Respiratory Battlefield Evaluation System (RBEs).  Funding for this research area is realigned from Tech Base Non-Med - Protection and Hazard Mitigation(CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "32) Applied Research"
                                    },
                                    "Description": {
                                        "val": "Protection & Hazard Mitigation\n\nDecontamination Family-of-Systems (DFoS): Development and analysis of non-traditional decontamination technologies and approaches which gain significantly improved effectiveness by complementary application."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.826"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.826"
                                            },
                                            "Text": {
                                                "val": "Continue the development of new formulations adjusted for agent, material substrate, and environment; combine with optimized application systems and initiate additional efforts based on the results of the dial-a-decon analysis of alternatives.  Continue coatings efforts to examine durable and temporary coatings that pursue reactive and barrier options and initiate efforts based on the results of the coatings analysis of alternatives.  Continue development of delivery and application methods on decontamination efficacy on complex surfaces.  Continue to develop decontamination assurance sprays for biological agents and other agents of interest.  Continue development of enzymes for sensitive equipment\/platform decon (previously under General Purpose Formulations in FY12).  Initiate radiological\/nuclear decontamination\/hazard mitigation effort.  Funding for this research area is realigned from Tech Base Non-Med - Protection and Hazard Mitigation(CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "33) Threat Agent Science"
                                    },
                                    "Description": {
                                        "val": "Physiological Response: Delivers the scientific understanding and relevant estimates of the hazards posed to humans by exposure to chemical or biological agents.  Toxicological and\/or infectious-dose information supports developing and\/or enhancing both operational risk and exposure guidelines; limits for detection and protection; goals for decontamination; and medical countermeasures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.108"
                                            },
                                            "Text": {
                                                "val": "Continued research efforts on BWA toxicokinetic and toxicodynamic modeling."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.497"
                                            },
                                            "Text": {
                                                "val": "Expand research efforts on BWA toxicokinetic and toxicodynamic modeling for specific priority viral agents.  Investigate potential reservoir hosts for biological agents.  Other work will improve understanding of bioavailability following dermal exposures for chemical agents, as well as study in vitro and in vivo binding of agents and analogues.  Identification of toxicity of decontamination breakdown products may inform development of decontamination technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "34) Threat Agent Science"
                                    },
                                    "Description": {
                                        "val": "Agent Fate: Characterizes fate of chemical and biological material on operationally relevant surfaces; information obtained from the study of particular agents will be used in core programs to support development of detection capabilities, information systems, including hazard prediction tools, and protection and hazard mitigation activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.101"
                                            },
                                            "Text": {
                                                "val": "Utilized empirical data to inform prediction of persistence and degradation of select CWAs and BWAs; transition data to JEM.  Characterized interaction between biological agents and environmental surfaces, including the impact of ambient conditions (e.g., temperature, relative humidity) and mechanical disturbances.  In FY12, all Agent Fate projects realigned to Agent Characterization within this Project(CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "35) Threat Agent Science"
                                    },
                                    "Description": {
                                        "val": "Agent Characterization: Examines critical characteristics of chemical and biological warfare agents (CWAs and BWAs, beginning with physiochemical properties and subsequently determining the challenge levels to military personnel in operationally relevant environments that provides key information to development or improvement of both physical and medical countermeasures and decision support tools.  Research focuses on: characterizing the realistic threat posed by CWA and BWA aerosol and particulate agent dissemination; examining the fundamental mechanisms that contribute to BWAs persistence and transport; understanding the fundamental interactions between CWA ad BWA agents and substrates; investigating aqueous transport of CWA and BWA agents and the underlying mechanisms of binding CB agents onto hydrated surfaces; and identifying agent decomposition products harmful to military personnel.  \nIn FY12, this area will include research formerly performed under Agent Fate."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.095"
                                            },
                                            "Text": {
                                                "val": "Continued BWA research to improve understanding of the relationship of genotype variations on organism virulence, infectivity, and persistence.  Sustained efforts to support T&E applications by continued development of CWA and BWA simulants and refined simulant application by expanding agent-simulant correlation studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.980"
                                            },
                                            "Text": {
                                                "val": "Expand investigations of fundamental mechanisms that contribute to BWA persistence and transport; transfer information from previous studies to operational models.  Identify markers of cultured versus naturally occurring agents, as well as markers of persistence of biological agents.  Continue to support test and evaluation needs for both CWA and BWA simulants.  Characterize environmental factors affecting persistence and binding to environmental elements such as soil.  Advance the understanding of fundamental interactions between agents and substrates in order to improve predictive modeling that supports other capability areas, such as detection and hazard mitigation.  In FY13, all research in this area is re-aligned to CB2 Physical Sciences Applied Research (PSAR)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "36) Threat Agent Science NTA"
                                    },
                                    "Description": {
                                        "val": "Threat Agent Science NTA: Provides enabling science and technology which informs development and testing of NTA defense technology such as detection, decontamination, protection, hazard assessment, and more.  This preliminary assessment provides the basis for all countermeasure development and assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.374"
                                            },
                                            "Text": {
                                                "val": "Established human NTA operational toxicity estimates and interim human health risk assessments.  Characterized the effects of alternate toxicological pathways.  Expanded agent fate studies to additional agent-substrate interactions.  Correlated agent adsorption\/absorption coefficients to chemical properties.  Expanded research on NTA liquid and solid phase transport to include re-suspension of particulates.  Applied computational tools to identify data requirements and accelerate QSAR application to NTA interactions with operational substrates and toxicology issues.  Correlated human effects to contact with operationally-relevant surfaces.  Furthered research on NTA chemistry.  Continued development of NTA simulants and simulant correlation studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.128"
                                            },
                                            "Text": {
                                                "val": "Continue efforts from FY11, working through the list of priority agents.  Provide necessary operational and residual contact hazards as well as aerosol and percutaneous toxicity standards for NTAs.  Deliver prioritized fundamental analysis, including physicochemical properties such as volatility, solubility, mass transport, reactivity, stability and other factors.  Examine physical parameters that govern NTA stability on operational materials.  In FY13, all NTA-dedicated Research is re-aligned to Non-Medical Techbase Non-Traditional Agents Defense Non-Medical(Applied Research) (NT2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "37) SBIR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.342"
                                            },
                                            "Text": {
                                                "val": "Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.219"
                                        },
                                        "CurrentYear": {
                                            "val": "23.818"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.034"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.034"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.343"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.893"
                                        },
                                        "BudgetYearFour": {
                                            "val": "17.357"
                                        },
                                        "BudgetYearFive": {
                                            "val": "17.357"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NT2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "60.730"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.730"
                        },
                        "BudgetYearTwo": {
                            "val": "56.498"
                        },
                        "BudgetYearThree": {
                            "val": "53.707"
                        },
                        "BudgetYearFour": {
                            "val": "63.138"
                        },
                        "BudgetYearFive": {
                            "val": "63.138"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (NT2) provides early applied research to enhance and develop defensive capabilities against Non-Traditional Agents (NTAs).  This project focuses on expanding scientific knowledge required to develop defensive capabilities and to demonstrate fast and agile scientific responses to enhance or develop capabilities that address emerging threats.  Efforts in this project support an integrated approach to counter emerging threats through innovative S&T solutions for detection, protection, decontamination, and medical countermeasures.  This project is a comprehensive and focused effort for developing NTA defense capabilities, coordinated with specific interagency partners for doctrine, equipment, and training for the Warfighter and civilian population for defense against NTAs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Techbase Medical Defense - NTA"
                                    },
                                    "Description": {
                                        "val": "Chemical Medical Pretreatments NTA: Develops pretreatments that provide protection against non-traditional agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high catalytic efficiency for the destruction of agents."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.371"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.371"
                                            },
                                            "Text": {
                                                "val": "Continue developing effective pretreatments against NTAs originating in FY12 in Chemical Pretreatments NTA (TC2 NTA).  Continue studies to determine efficacy of bioscavenger for all NTA exposure.  Continue to determine efficacy of enzyme candidates for all NTA exposure.  Funding for this research area is realigned from Tech Base Med Defense - Med Chem Pretreatments NTA (TC2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Techbase Medical Defense - NTA"
                                    },
                                    "Description": {
                                        "val": "Chemical Medical Therapeutics NTA: Investigates common mechanisms of agent injury.  Determines the toxic effects of agents by probable routes of field exposure, as well as standard experimental routes.  Physiological parameters and pathological assessment will be used to establish the general mode and mechanism(s) of toxicity.  Develops, assesses, evaluates, and validates therapeutics for treatment resulting from exposure to Non-Traditional Agents (NTA)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.050"
                                            },
                                            "Text": {
                                                "val": "Continue efforts originating in FY12 in Chemical Therapeutics NTA (TC2 NTA).  Initiate investigation of other compounds of interest including mechanism of action and toxicity, and initiate search for effective countermeasures.  Funding for this research area is realigned from Tech Base Med Defense - Med Chem Therapeutics NTA (TC2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Techbase Medical Defense - NTA"
                                    },
                                    "Description": {
                                        "val": "Chemical Medical Diagnostics NTA: Focuses on developing state-of-the-art laboratory\/fieldable methods to detect exposure to non-traditional agents in clinical samples.  Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker.  Non-NTA Chem Diagnostics support the analytics for traditional agent diagnostics and hand-held diagnostic technologies that might be applied to NTA diagnostics."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.386"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.386"
                                            },
                                            "Text": {
                                                "val": "Continue to identify biomarkers to create an enhanced capability to pre-symptomatically diagnose NTA exposure.  Continue method development for identification and validation of NTAs in clinical samples for additional compounds of interest.  Funding for this research area is realigned from Tech Base Med Defense - Med Chem Diagnostics NTA (TC2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Techbase Non-Med NTA"
                                    },
                                    "Description": {
                                        "val": "Detection NTA: Primary focus is to assess the potential of optical technologies to meet the needs to detect the presence of NTAs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.580"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.580"
                                            },
                                            "Text": {
                                                "val": "Complete and demonstrate feasibility development of plant sentinel concept.  Continue development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination application.  Continue integration studies for chemical aerosol detection into the NGCPD.  Funding for this research area is realigned from Tech Base Non-Med Defense - Detection NTA (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Techbase Non-Med NTA"
                                    },
                                    "Description": {
                                        "val": "Threat Agent Science NTA: Provide enabling science and technology on threat agents to prepare for surprise and inform development and testing of NTA defense technology such as detection, decontamination, protection, hazard assessment, and more.  This preliminary assessment of new threats provides the basis for all countermeasure development and assessment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.261"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.261"
                                            },
                                            "Text": {
                                                "val": "Expand assessment of novel threats into new classes of agents providing operationally relevant exposure limits using an integrated systems toxicology approach.  Define critical physical\/chemical properties and characterize\/predict agent reactivity and interaction with environmental substrates.  Provide supportable data to enable countermeasure development and testing as well as inform concept of operations policy, doctrine and procedure.  Funding for this research area is realigned from Tech Base Non-Med Defense - Threat Agent Science NTA (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Techbase Non-Med NTA"
                                    },
                                    "Description": {
                                        "val": "Modeling & Simulation NTA: Provide modeling of NTA materials for hazard prediction.  Develop NTA source term algorithms for intentionally functioning weapons, counter-proliferation scenarios (bomb on target), and missile intercept.  \"Intentionally Functioning Weapons\" refers to the case where a missile has released its chemical or biological payload as it was designed, rather than where the release was caused by our missile interdiction.  Investigate NTA agent fate for secondary effects, environmental\/atmospheric chemistry, atmospheric and waterborne transport and dispersion, human effects, model Validation and Verification (V&V), scaled testing, casualty estimation, and supporting data management."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.464"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.464"
                                            },
                                            "Text": {
                                                "val": "Continue with actual experimentation involving small scale testing for NTA simulants for use in creating and verifying NTA modeling source terms.  Continue to develop NTA source term models.  Funding for this research area is realigned from Tech Base Non-Med Defense - Modeling & Simulation NTA (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Techbase Non-Med NTA"
                                    },
                                    "Description": {
                                        "val": "Protection and Hazard Mitigation NTA: NTA Air Purification: Study and assessment of filter technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.262"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.262"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of novel materials to improve performance against NTAs.  Replace legacy filter media with novel media that offers broad spectrum NTA protection.  Continue with technology areas that include: crystalline nano-porous framework materials, novel adsorbents, catalytic, nano-fibrous, composite materials and reactive hybrids.  Transition these technologies to the Joint Service General Purpose Mask (JSGPM) and Joint Service Aircrew Mask (JSAM) programs.  Funding for this research area is realigned from Tech Base Non-Med Defense - Protection & Hazard Mitigation NTA (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Techbase Non-Med NTA"
                                    },
                                    "Description": {
                                        "val": "Protection & Hazard Mitigation NTA - NTA Percutaneous Protection: Study and assessment of protective technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.084"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.084"
                                            },
                                            "Text": {
                                                "val": "Continue development of low burden technologies to improve overall protective clothing performance against NTAs leading toward verification, demonstration and transition.  Funding for this research area is realigned from Tech Base Non-Med Defense - Protection & Hazard Mitigation NTA (CB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Techbase Non-Med NTA"
                                    },
                                    "Description": {
                                        "val": "Protection & Hazard Mitigation NTA - NTA Decontamination: Study and assessment of decontamination technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.272"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.272"
                                            },
                                            "Text": {
                                                "val": "Continue development of decontamination technologies against NTAs.  Continue to develop decontamination technologies and formulations that are optimized against NTAs.  Continue to develop, demonstrate, and transition enzyme technology for low-impact decon of NTAs.  Continue to integrate with the Decontamination Family-of-Systems effort.  Funding for this research area is realigned from Tech Base Non-Med Defense - Protection & Hazard Mitigation NTA (CB2)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "31.916"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "31.916"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "30.864"
                                        },
                                        "BudgetYearThree": {
                                            "val": "30.927"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.603"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.603"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TB2"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "51.158"
                        },
                        "CurrentYear": {
                            "val": "86.679"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "137.837"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (TB2) funds applied research on vaccines, therapeutic drugs, and diagnostic capabilities to provide effective medical defense against validated biological threat agents or emerging infectious disease threats including bacteria, toxins, and viruses.  Innovative biotechnology approaches will be incorporated to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to biological threat agents.  Categories for this project include core science efforts in biological defense capability areas, such as Pretreatments, Diagnostics, and Therapeutics.  Medical Science and Technology (S&T) efforts in this Budget Activity refine promising medical initiatives identified in Budget Activity 1, resulting in the development of countermeasures to protect against and treat the effects of exposure to biological agents.  \n\nThis project includes the Transformational Medical Technologies Initiative (TMTI), (funded as the Transformational Medical Technologies (TMT) program in FY12).  The program was launched to respond to the threat of emerging or intentionally engineered biological threats.  TMT's mission is to protect the Warfighter from genetically engineered biological threats by providing a rapid response capability from identification of pathogens to the delivery of medical countermeasures.  This mission is accomplished through two main efforts: 1) developing broad spectrum (multi-agent) therapeutics against biological agents (e.g. one drug that treats multiple agents); and 2) developing platform technologies to assist in the rapid development of medical countermeasures (MCMs) in response to biological agents (e.g. developing new and innovative ways to mass produce drugs in the event of a biological incident). \n\nThe Medical Countermeasures Initiative (MCMI) was established to coordinate inter-related advanced development and flexible manufacturing capabilities, based on partnerships between the government and industry, providing a dedicated, cost-effective, reliable, and sustainable MCM process that meets the warfighter and national security needs.  Specifically, the MCMI will provide the capability for the advanced development and flexible manufacturing of biological MCM (to include TMT developed MCMs) to address CBRN threats, including novel and previously unrecognized, naturally-occurring emerging infectious diseases.  MCMI efforts within S&T are concentrated in two areas: 1) advancement of regulatory science, and 2) advancements in flexible manufacturing technologies for MCMs.\n\nIn FY13, all Project TB2 research is re-aligned into Project TM2 - Techbase Medical Defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Medical Countermeasures Initiative (MCMI)"
                                    },
                                    "Description": {
                                        "val": "Medical Countermeasures Initiative (MCMI): Coordinate inter-related advanced development and flexible manufacturing capabilities, based on partnerships between the government and industry, providing a dedicated, cost-effective, reliable, and sustainable MCM process that meets the warfighter and national security needs.  Specifically, the MCMI will provide the capability for the advanced development and flexible manufacturing of biological MCM (to include TMT developed MCMs) to address CBRN threats, including novel and previously unrecognized, naturally-occurring emerging infectious diseases.  MCMI efforts within S&T are concentrated in two areas: 1) advancement of regulatory science, and 2) advancements in flexible manufacturing technologies for MCMs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.568"
                                            },
                                            "Text": {
                                                "val": "Conduct studies to explore increasing the efficiency, responsiveness and speed of biopharmaceutical manufacturing through use of more flexible, non-traditional host-vector systems.  Initiate and refine development of multi-product\/multi-use platform technologies for flexible manufacturing processes for MCMs.  Evaluate and exploit the regulatory advantages of such systems, with the intent that approval of the platform for one product will simplify subsequent approvals of other products based on the same system.  In FY13, all research in this area is re-aligned into Techbase Med Defense - Medical Countermeasures Initiative (TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Diagnostics (Biosurveillance)"
                                    },
                                    "Description": {
                                        "val": "Diagnostic Technologies: Development and verification of rapid, sensitive, and specific tests for the identification of Biological Warfare Agents (BWAs) and their expressed pathogens or toxins in clinical specimens from Warfighters for the diagnosis of exposure\/infection.  Discovery of biomarkers of response to exposure.  Evaluation of next generation diagnostic technologies including portable instrument platforms, highly parallel and informative testing formats, and nanotechnology applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.377"
                                            },
                                            "Text": {
                                                "val": "Developed high-throughput technologies for identification, evaluation, and validation of agent-specific genetic and immunological assay targets using sequencers and microarrays.  Completed development and assessed performance of affinity-based protein expression amplification methods.  Continued to discover and develop pre-symptomatic diagnostic signatures for additional agents and investigate diagnostic utility as early indicators of exposure\/infection in animal models.  Evaluated nano diagnostic technologies for ease-of-use, sensitivity, specificity and cost.  Continued development and application of rapid sequencing technology and target enrichment for deployable field environment.  Investigated advancement of technologies and procedures for broad multiplex detection of agent gene expression, proteomic and antibiotic resistance profiles.  Developed a geographically representative strain collection and assay(s) capable of detecting an emerging threat agent of high genetic variability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.754"
                                            },
                                            "Text": {
                                                "val": "Verify performance of informative genetic and affinity probes and optimize number of probes required to capture predictive signature coverage.  Verify performance of pre-symptomatic diagnostic biomarker panels in blinded BWA and emerging threat pathogen-exposed animal samples.  Develop pan-emerging threat agent genotyping assay for fieldable sequence-based genetic analyzer to supplement\/replace strain-specific assays.  In FY13, all research in this area is re-aligned into Techbase Med Defense - Diagnostics (TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Bacterial\/Toxins Vaccines: Generate novel or improved vaccines against bacterial and toxin biothreat agents, and demonstrate preliminary efficacy in small animal models.  Identify correlates of protective immunity in animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.235"
                                            },
                                            "Text": {
                                                "val": "Continued aerosol efficacy studies in mice for Brucella and Burkholderia vaccine candidates.  Worked to improve the efficacy of the most promising vaccine candidates against Burkholderia and Brucella by initiating studies that vary the route of immunization, dose and vaccination schedule.  Began investigating whether the efficacy of the Brucella and Burkholderia vaccine candidates can be approved by co-administering the vaccines with nonspecific stimulators of the immune response (i.e., adjuvants).  Tested the ability of antibiotics to remove residual Burkholderia from vaccinated animals to prevent reactivation of disease.  Identified measures of immunity elicited by vaccine candidates against Brucella and Burkholderia.  Tested the efficacy of novel next-generation, multi-valent anthrax vaccines in small animal models against aerosol challenge.  Determined the immune stimulation capability of novel subunit vaccines comprised of proteins involved in a common virulence pathway shared by most gram negative bacteria, including Yersinia pestis.  Investigated the potential of outer membrane proteins isolated from Type A Francisella tularensis to serve as vaccine candidates against aerosol challenge with the pathogen in small animal models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.011"
                                            },
                                            "Text": {
                                                "val": "Identify correlates of immunity, elicited by Burkholderia species vaccine candidates, which predict vaccine efficacy.  In a concurrent effort, open investigative avenues in search of vaccine candidates directed against Burkholderia species.  Continue efforts designed to examine the efficacy of adjuvants co-administered with existing vaccine candidates against Burkholderia species.  Continue efforts to boost immune response to the currently licensed anthrax vaccine using novel adjuvants which might have applicability to other vaccine candidates in the future.  Additionally, research will continue to produce vaccine candidates designed to protect against emerging or genetically engineered anthrax strains.  Examine the efficacy of rationally designed, next-generation Type A Francisella tularensis vaccine against aerosol challenge in rat and non-human primate models.  Continue research designed to evaluate outer membrane proteins isolated from Type A Francisella tularensis as vaccine candidates against aerosol challenge with the pathogen in small and large animal models.  In FY13, all research in this area is re-aligned to Techbase Med Defense - Bio CM (TM2)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Viral Vaccines: Design vaccines against the Filoviruses (Ebola and Marburg strains) and Alphaviruses (VEE, EEE, WEE) using distinct vaccine platforms, and demonstrate preliminary efficacy in animal models.  Identify correlates of protective immunity in animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.682"
                                            },
                                            "Text": {
                                                "val": "Further defined immune correlates of protection for alphavirus (i.e., EEE and WEE) vaccine candidates.  Continued to characterize the immune response to Ebola and Marburg viruses in order to identify correlates of protection in animal models, and establish assays to measure these immune correlates.  Assessed the immune stimulation and effectiveness of vaccine candidates against a new strain of the Ebola virus, Ebola Bundibugyo, in animal challenge models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.484"
                                            },
                                            "Text": {
                                                "val": "Continue to characterize the innate, humoral and cellular immune response of the Ebola\/Marburg vaccine candidates in the relevant animal models.  Produce, characterize, optimize and test reagents for Filovirus immunological assays.  Develop assays to measure innate, cellular, and humoral immune responses to Alphaviruses (i.e., EEE, WEE and VEE) which predict protective immunity.  Produce, characterize, optimize and test reagents for Alphavirus immunological assays.  In FY13, all research in this area is re-aligned to Techbase Med Defense - Bio CM (TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Vaccine Platforms and Research Tools: Design novel multi-agent vaccine platforms capable of expressing multiple antigens, investigate the ability of non-specific stimulators of immunity to enhance the effectiveness of newly generated vaccines, characterize alternative vaccine delivery (needle-free) methods and novel vaccine stabilization methodologies, and conduct studies to further advance a laboratory based, human artificial immune system to render it capable of predicting the human immune response to biodefense vaccines under development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.552"
                                            },
                                            "Text": {
                                                "val": "Continued to construct new multi-agent vaccine formulations utilizing platform technologies that support the expression of multiple antigens, and test these multi-agent vaccines for immune stimulation in small animal models.  Compared an intra-dermal versus intra-muscular electric field device for delivery of DNA vaccines against bio-threat agents in small animals.  Continued studies to advance the laboratory based, surrogate human immune system termed the Modular Immune In Vitro Construct (MIMIC), which provides a three-dimensional peripheral tissue model intended to reliably reproduce the human immune response.  Completed optimization of the production of high affinity antibodies by the MIMIC in response to biodefense vaccines, and developed a sensitive fluorescent-based assay to assess the functionality of the antibodies generated.  Adapted the MIMIC to function as an infectious disease model for alphaviruses and filoviruses.  Used these MIMIC in infectious disease models to define human correlates of protective immunity against alphaviruses and filoviruses.  Initiated studies to develop methodologies that render different types of vaccine platforms (i.e., viral vector, inactivated virus, virus like particles, and attenuated bacteria, etc.) stable in variable and extreme temperatures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.487"
                                            },
                                            "Text": {
                                                "val": "Continue to develop new platform technologies that support the presentation of multiple antigens to the immune system.  Develop relevant animal models for the evaluation of the immune response to multi-antigen platforms.  Continue studies to develop alternative methodologies for vaccine delivery (i.e., electroporation) via intra-muscular or intra-dermal administration.  Continue studies to advance the surrogate human immune system, MIMIC, which provides an in vitro assessment of the human immune response.  Complete studies to assess the cross-reactivity of antigens present in different Filoviruses and Alphaviruses.  Use MIMIC to define human correlates of immunity in responses to various bio-threat agents.  Continue studies to develop methodologies which remove the need for cold storage and transport for vaccines and renders them stable in variable and extreme temperatures.  In FY13, all research in this area is re-aligned to Techbase Med Defense - Bio CM (TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Viral Therapeutics: Identify, optimize and evaluate lead candidate therapeutics for efficacy against viral pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Identified FDA approved drug combinations with efficacy against alphavirus infection.  Identified and developed small molecule inhibitors to specific host factors required for alphavirus pathogenesis.  Conducted structure-based screening of chemical libraries to identify inhibitors of alphavirus proteins.  Utilized medicinal chemistry to optimize antiviral activity of lead compounds.  Identified therapeutic inhibitors of orthopoxvirus infection by targeting required host and viral tyrosine phosphatases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.722"
                                            },
                                            "Text": {
                                                "val": "Validate FDA approved drug combinations against alphavirus infection.  Continue optimization of pathogen and host directed small molecule inhibitors for alphaviruses.  Identify and evaluate novel broad-spectrum host and pathogen directed small molecule therapeutics for emerging infectious diseases (i.e. alphavirus, filovirus, flavivirus, arenavirus, bunyavirus).  Optimize therapeutic inhibitors of host and viral tyrosine phosphatases for orthpoxvirus infection.  In FY13 all research in this area is re-aligned to Techbase Med Defense-Bio CM (TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Bacterial Therapeutics: Identify, optimize and evaluate lead therapeutic candidates effective against designated bacterial threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Continued the identification of commercially available antimicrobials in advanced clinical development with laboratory assayed activity against bacterial threat agents.  Assessed compounds identified in high content imaging assays for their antimicrobial activity in relevant animal challenge models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.862"
                                            },
                                            "Text": {
                                                "val": "Expand FDA approved drug screening program for Burkholderia, Francisella tularensis and determine in vitro susceptibilities.  Continue evaluation of novel compounds against bacterial biological warfare agents.  Optimize lead series of MurB compounds targeting cell wall biosynthesis.  Determine synergy between MurB antibacterial agents and conventional antibiotics against B. anthracis and Y. pestis.  Identify and validate compounds that inhibit bacterial SOS induction thereby potentiating the effects of FDA approved drugs.  Select a second FDA approved drug to focus on for Burkholderia and F. Tularensis.  In FY13, all research in this area is re-aligned to Techbase Med Defense-Bio CM (TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Toxin Therapeutics: Identify, optimize and evaluate therapeutic candidates that are effective against biological toxin agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.171"
                                            },
                                            "Text": {
                                                "val": "Developed transgenic mice expressing genetically-encoded reporters of BoNT activity in neurons for use in high-throughput screening of BoNT therapeutics.  Validated neurite outgrowth analysis for the identification of BoNT inhibitors.  Identified host proteins responsible for BoNT light chain stabilization.  Conducted co-crystallization studies of BoNT-inhibitor complexes.  Performed experiments to determine toxicity and pharmacokinetics of selected ricin inhibitors.  Identified host proteins involved in ricin dislocation as potential host-directed drug targets.  Determined efficacy of identified ricin inhibitors in mice."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.717"
                                            },
                                            "Text": {
                                                "val": "Validate host proteins responsible for BoNT light-chain stabilization.  Continue co-crystallization studies of BoNT-inhibitor complexes.  Characterize host proteins that interact with BoNT and identify small molecule inhibitors preventing host-toxin interactions.  Validate differential expression of host genes involved in neuron response to BoNT intoxication.  Identify and develop therapies that target host proteins involved in BoNT persistence in the neuron.  Validate host proteins involved in ricin dislocation as potential drug targets.  Continue development of small molecule inhibitors to toxin threat agents (BoNT, ricin, and staphylococcal enterotoxin B).  In FY13, all research in this area is re-aligned to Techbase Med Defense-Bio CM(TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Transformational Medical Technologies"
                                    },
                                    "Description": {
                                        "val": "Multiagent (Broad Spectrum) Medical Countermeasures (MCM): Continues efforts previously funded under the Transformational Medical Technologies Initiative.  It supports existing and new efforts in the drug discovery phase of drug development.  Applied research efforts also include the investigation of existing drugs to explore their efficacy against BW agents.  This involves the initiation of experiments to identify markers, correlates of protection, assays, and endpoints for further non-clinical and clinical studies and development of a scalable and reproducible manufacturing process amenable to Food and Drug Administration (FDA) Good Manufacturing Practices (GMP)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.468"
                                            },
                                            "Text": {
                                                "val": "Continue to support new MCM discovery efforts to refresh the Hemorrhagic Fever Virus (HFV) and Intracellular Bacterial Pathogen (IBP) product pipelines.  Continue to identify and initiate the development of intervention strategies targeting host response to biological pathogens, inclusive of enhancing the immune system and treating symptoms to reduce the severity of disease.  In FY13 all research in this area is re-aligned to Project TM2 - Techbase Med Defense-Bio CM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Transformational Medical Technologies"
                                    },
                                    "Description": {
                                        "val": "Development of Platform Technologies: Continues efforts previously funded under the Transformational Medical Technologies Initiative.  Platform Technologies are standalone enabling technologies that support MCM development and when strategically aligned, provide a system of systems response capability to an adverse biological event - from the identification of an unknown pathogen to the development of an approved countermeasure ready for delivery to the Warfighter and the nation.  The enabling technologies are divided into five platform areas: Pathogen Characterization, Target Identification, Countermeasure Discovery, Countermeasure Evaluation, and Bioinfomatics.  Applied research efforts include the maturation of the components necessary to develop an integrated capability from pathogen identification and characterization to countermeasure delivery.  Off-the-shelf technologies will be identified, evaluated, and where applicable, refined to demonstrate the ability to provide drug development capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.449"
                                            },
                                            "Text": {
                                                "val": "Investment to further develop host and pathogen based platforms to higher levels of maturity and fund Biosurveillance indications and warnings of a fused nature in accordance with the Platform Technologies objectives of pathogen characterization, target identification, and bioinformatics.  Continue to mature pathogen identification and characterization capabilities, including genetic sequencing, integrate existing capabilities.  Continue to develop genetic sequencing and analysis technologies to characterize advanced threats.  Continue integration of leading edge technologies with existing technologies to enhance pathogen characterization, target identification, countermeasure discovery and countermeasure evaluation platform areas.  In FY13 all research in this area is re-aligned to Techbase Med Defense - Diagnostics (TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Transformational Medical Technologies Initiative"
                                    },
                                    "Description": {
                                        "val": "Multiagent (Broad Spectrum) Medical Countermeasures (MCM): Builds upon basic research performed by existing performers and supports the efforts of new performers who are in the mid-drug discovery phase of drug development.  Applied research efforts also include the investigation of existing drugs to explore their efficacy against BW agents.  This involves the initiation of experiments to identify markers, correlates of protection, assays, and endpoints for further non-clinical and clinical studies and development of a scalable and reproducible manufacturing process amenable to Food and Drug Administration (FDA) good manufacturing processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.585"
                                            },
                                            "Text": {
                                                "val": "Continued to support new MCM discovery efforts entering the product pipeline.  Continued to evaluate and mature novel drugs as post-exposure prophylaxis and treatment for HFVs and IBP infections.  Identified and initiated the development of intervention strategies targeting host pathogen response, inclusive of enhancing the immune system and addressing symptoms to reduce the severity of disease."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Transformational Medical Technologies Initiative"
                                    },
                                    "Description": {
                                        "val": "Development of Platform Technologies: Platform Technologies are standalone enabling technologies that support MCM development and when strategically aligned, provide a system of systems response capability to an adverse biological event - from the identification of an unknown pathogen to the development of an approved countermeasure ready for delivery to the Warfighter and the nation.  The enabling technologies are divided into five platform areas: Pathogen Characterization, Target Identification, Countermeasure Discovery, Countermeasure Evaluation, and Bioinfomatics.  Applied research efforts include the maturation of the components necessary to develop an integrated capability from pathogen identification and characterization to countermeasure delivery.  Off-the-shelf technologies will be identified, evaluated, and where applicable, refined to demonstrate the ability to provide drug development capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.856"
                                            },
                                            "Text": {
                                                "val": "Continued the development of host and pathogen based platforms to higher levels of maturity.  Continued to explore pathogen identification and characterization capabilities, including genetic sequencing, integrate existing capabilities.  Continued to assess future sequence and analysis needs to characterize advanced threats.  Continued to integrate leading edge technologies with existing technologies to enhance pathogen characterization, target identification, countermeasure discovery and countermeasure evaluation platform areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) SBIR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.157"
                                            },
                                            "Text": {
                                                "val": "Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "118.208"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "118.208"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "110.294"
                                        },
                                        "BudgetYearThree": {
                                            "val": "97.308"
                                        },
                                        "BudgetYearFour": {
                                            "val": "130.654"
                                        },
                                        "BudgetYearFive": {
                                            "val": "130.654"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "171.399"
                                        },
                                        "BudgetYearThree": {
                                            "val": "147.651"
                                        },
                                        "BudgetYearFour": {
                                            "val": "136.326"
                                        },
                                        "BudgetYearFive": {
                                            "val": "136.326"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "129.682"
                                        },
                                        "CurrentYear": {
                                            "val": "116.653"
                                        },
                                        "BudgetYearOne": {
                                            "val": "133.254"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "133.254"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "194.502"
                                        },
                                        "BudgetYearThree": {
                                            "val": "155.024"
                                        },
                                        "BudgetYearFour": {
                                            "val": "81.188"
                                        },
                                        "BudgetYearFive": {
                                            "val": "23.593"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (SDD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "75.657"
                                        },
                                        "CurrentYear": {
                                            "val": "216.715"
                                        },
                                        "BudgetYearOne": {
                                            "val": "214.056"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "214.056"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "246.295"
                                        },
                                        "BudgetYearThree": {
                                            "val": "187.101"
                                        },
                                        "BudgetYearFour": {
                                            "val": "213.001"
                                        },
                                        "BudgetYearFive": {
                                            "val": "238.653"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "5.448"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.498"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.498"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.499"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.266"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.496"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.355"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TC2"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL CHEMICAL DEFENSE (APPLIED RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.970"
                        },
                        "CurrentYear": {
                            "val": "34.614"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "66.584"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (TC2) funds applied research for the investigation of new medical countermeasures to include prophylaxes, pretreatments, antidotes, diagnostics, skin decontaminants and therapeutic drugs against identified and emerging chemical warfare threat agents to include a class of agents called Non Traditional Agents (NTAs).  Capability areas include: Pretreatments; pretreatments for NTAs; diagnostics; diagnostics for NTAs; therapeutics; and therapeutics for NTAs.  Pretreatments includes researching prophylaxes to protect against chemical agents and NTAs.  Diagnostics focuses on researching diagnostic tools that help identify exposure to chemical agents and NTAs.  Therapeutics focuses on researching post-exposure countermeasures to protect against chemical agents and NTAs.  Research and development efforts in this project focus on formulation and scale-up of candidate compounds.  In FY13, all research in this area is re-aligned into Techbase Medical Defense (TM2)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Diagnostic Technologies: Focuses on developing state-of-the-art laboratory\/fieldable methods that detect exposure to chemical warfare agents (CWA) (e.g., nerve agents and vesicants) in clinical samples.  Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.584"
                                            },
                                            "Text": {
                                                "val": "Continued to determine whether existing CWA biomarkers are appropriate for early detection and validation of CWA exposure in clinical samples.  Determined if biomarkers that appear after exposure to sulfur mustard can be used to identify an appropriate treatment option prior to the onset of symptoms.  Continued investigation of a novel surface plasmon resonance based sensor array and a phage library display to develop binding molecules as biomarkers of nerve agent exposure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.916"
                                            },
                                            "Text": {
                                                "val": "Complete studies of existing CWA biomarkers to determine effectiveness for early detection.  Complete sulfur mustard biomarker studies for identifying pre-symptomatic treatment options.  Continue investigation of a novel sensor using a phage library display.  In FY13, all research in this area is re-aligned into Techbase Med Defense - Diagnostics (TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Chem Diagnostics NTA"
                                    },
                                    "Description": {
                                        "val": "Focuses on developing state-of-the-art laboratory\/fieldable methods to detect exposure to non-traditional agents in clinical samples.  Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker.  Non-NTA Chem Diagnostics support the analytics for traditional agent diagnostics and hand-held diagnostic technologies that might be applied to NTA diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.392"
                                            },
                                            "Text": {
                                                "val": "Continued studies to identify biomarkers to create an enhanced capability to pre-symptomatically diagnose NTA exposure.  Continued method development for identification and validation of NTAs in clinical samples."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.571"
                                            },
                                            "Text": {
                                                "val": "Further identify biomarkers to create an enhanced capability to pre-symptomatically diagnose NTA exposure.  Continue method development for identification and validation of NTAs in clinical samples.  Initiate method development for identification and validation of NTAs in clinical samples for additional compounds of interest.  In FY13, all research in this area is re-aligned into Project NT2 - Techbase Med Defense - NTA Diagnostics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Nerve Agent, Pretreatments: Develops pretreatments that provide protection against all organophosphorous nerve agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high enzymatic efficiency for the destruction of agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.776"
                                            },
                                            "Text": {
                                                "val": "Further refined methods and expression systems for screening, production and purification of designed catalytic bioscavengers.  Initiated development of animal expression systems for delivery of newly designed improved catalytic bioscavengers.  Initiated efficacy studies of small molecule approaches towards acetylcholinesterase AChE protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.616"
                                            },
                                            "Text": {
                                                "val": "Utilize novel methods to develop candidate proteins capable of destroying CWAs.  Assess processes to produce, screen, and purify newly designed enzymes.  Evaluate efficacy of small molecule approaches toward AChE protection.  In FY13, all research within this area is re-aligned into Project TM2 - Techbase Medical Defense - Chemical CM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Chem Pretreatments NTA"
                                    },
                                    "Description": {
                                        "val": "Develops pretreatments that provide protection against non-traditional agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high catalytic efficiency for the destruction of agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.467"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to investigate ways to decrease the development time to deliver a bioscavenger (stoichiometric\/catalytic) to protect the Warfighter.  Continued studies to determine efficacy of bioscavenger for all NTA exposure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.307"
                                            },
                                            "Text": {
                                                "val": "Determine efficacy of enzyme candidates for all NTA exposure.  In FY13, all research in this area is re-aligned to Project NT2 - Techbase Medical Defense - NTA."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Cutaneous and Ocular: Focuses on therapeutic strategies to effectively minimize injuries to dermal (i.e., skin) and ocular tissues resulting from exposure to chemical warfare agents (CWAs).  Involves the development of effective practical field and clinic management strategies and physical and pharmacological interventions to treat the injury processes.  This work is designed to develop potential candidates that will ultimately be submitted for FDA licensure or new indications for previously licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.884"
                                            },
                                            "Text": {
                                                "val": "Continued development of novel drug delivery approaches for candidate countermeasures.  Continued to determine the effectiveness of multiple anti-inflammatory approaches in vitro against blister agent exposure.  Continued investigation of potential therapeutic approaches to mitigate the chronic effects of blister agent exposure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.256"
                                            },
                                            "Text": {
                                                "val": "Further evaluate the effectiveness of multiple anti-inflammatory approaches in vitro and in vivo against sulfur mustard exposure.  Continue to develop molecular biology approaches to assess candidate countermeasures against skin and eye injury caused by sulfur mustard.  Further evaluate most effective therapeutic approaches to mitigate the chronic effects of sulfur mustard exposure.  In FY13, all research within this project is re-aligned to Project TM2 - Techbase Medical Defense - Chemical CM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Neurologic: Focuses on therapeutic strategies to effectively minimize neurologic injuries resulting from exposure to CWAs.  This effort involves the development of neuroprotectants, anticonvulsants, and improved neurotransmitter restorers.  This work is designed to develop potential candidates that will ultimately be submitted for FDA licensure or new indications for previously licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.933"
                                            },
                                            "Text": {
                                                "val": "Continued to investigate the mechanism of reactivation of nerve-agent inhibited acetylcholinesterase (AChE) in order to identify or design compounds that allow for a longer time frame between exposure and the administration of the therapeutic without decreasing its effectiveness.  Continued to explore approaches for neuroprotection against nerve agent exposure.  Developed therapeutic strategies to effectively minimize neurologic injuries resulting from exposure to CWAs by testing in silico and in vitro."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.768"
                                            },
                                            "Text": {
                                                "val": "Utilizing mechanistic understanding of reactivation, identify compounds capable of reactivating nerve-agent inhibited AChE at delayed times after exposure.  Identify more effective approaches for neuroprotection, as defined by the minimization of chronic functional decrement due to nerve agent exposure.  Conduct in silico and in vitro evaluation of novel and\/or Food and Drug Administration licensed products for treatment of acute nerve agent exposure.  In FY13, all research within this area is re-aligned to Project TM2 - Techbase Medical Defense - Chemical CM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Respiratory and Systemic: Supports investigation of the systemic host response to chemical warfare agent (CWA) injury via all routes of exposure, with emphasis on the respiratory system and chronic effects of exposure.  This involves the development of effective practical field and clinic management strategies and physical and pharmacological interventions to treat the injury processes.  This work is designed to support eventual Food and Drug Administration (FDA) licensure of new compounds or new indications for licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.934"
                                            },
                                            "Text": {
                                                "val": "Continued to evaluate safety, efficacy, dosing and relevant effects on the body, and the body's effects on the drug, of candidate countermeasures against lung injury.  Continued to investigate down-selected potential candidate countermeasures based on molecular biology approaches to CWA lung injury.  Continued to study long-term health effects due to CWA exposure.  Research in this area has been completed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Chem Therapeutics NTA"
                                    },
                                    "Description": {
                                        "val": "Investigates common mechanisms of agent injury.  Determines the toxic effects of agents by probable routes of field exposure, as well as standard experimental routes.  Physiological parameters and pathological assessment will be used to establish the general mode and mechanism(s) of toxicity.  Develops, assesses, evaluates, and validates therapeutics for treatment resulting from exposure to Non-Traditional Agents (NTA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "Continued binding studies to support the design and synthesis of an improved reactivator.  Continued evaluation of improved products to treat NTA exposure.  Continued investigation of pathophysiological effects to identify debilitating syndromes caused by exposure to NTAs.  Continued development of animal models for various routes of exposure to NTA.  These models will be utilized to evaluate toxic effects of NTAs, behavioral changes, efficacy, and FDA animal rule approvals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.784"
                                            },
                                            "Text": {
                                                "val": "Continue binding studies to support the design and synthesis of an improved reactivator.  Continue evaluation of improved products to treat NTA exposure.  Continue investigation of pathophysiological effects to identify debilitating syndromes caused by exposure to NTAs.  Continue development of animal models for various routes of exposure to NTA.  Conduct in silico and in vitro evaluation of novel and\/or Food and Drug Administration licensed products for treatment of NTA exposure.  Study mechanisms of NTA injury for therapeutic intervention.  In FY13, all research in this area is re-aligned into Techbase Medical Defense - NTA (NT2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) SBIR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.396"
                                            },
                                            "Text": {
                                                "val": "Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "118.208"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "118.208"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "110.294"
                                        },
                                        "BudgetYearThree": {
                                            "val": "97.308"
                                        },
                                        "BudgetYearFour": {
                                            "val": "130.654"
                                        },
                                        "BudgetYearFive": {
                                            "val": "130.654"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "171.399"
                                        },
                                        "BudgetYearThree": {
                                            "val": "147.651"
                                        },
                                        "BudgetYearFour": {
                                            "val": "136.326"
                                        },
                                        "BudgetYearFive": {
                                            "val": "136.326"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.134"
                                        },
                                        "CurrentYear": {
                                            "val": "7.804"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "16.947"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.395"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.513"
                                        },
                                        "BudgetYearFive": {
                                            "val": "25.134"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (SDD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.801"
                                        },
                                        "CurrentYear": {
                                            "val": "2.407"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.642"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.642"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "41.257"
                                        },
                                        "BudgetYearThree": {
                                            "val": "45.477"
                                        },
                                        "BudgetYearFour": {
                                            "val": "50.862"
                                        },
                                        "BudgetYearFive": {
                                            "val": "58.935"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TM2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "118.208"
                        },
                        "BudgetYearOneBase": {
                            "val": "118.208"
                        },
                        "BudgetYearTwo": {
                            "val": "110.294"
                        },
                        "BudgetYearThree": {
                            "val": "97.308"
                        },
                        "BudgetYearFour": {
                            "val": "130.654"
                        },
                        "BudgetYearFive": {
                            "val": "130.654"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (TM2) funds applied research for innovative technology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to nuclear, chemical and biological threat agents.  Categories for this project include core science efforts in Medical Chemical, Medical Biological, Diagnostics, and the Medical Countermeasures Initiative (MCMI).  This project funds applied research for the investigation of new medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants, and therapeutic drugs against identified and emerging biological and chemical warfare agents.  This project provides investment for the development of pretreatments (prophylaxis) and post-irradiation therapeutics against radiological\/nuclear exposure.  Diagnostic research focuses on providing high quality data closer to the point-of-need comprising devise innovation, panels of biomarkers driven by bioinformatics, and epidemiological modeling tools.  Medical Science and Technology (S&T) efforts in this Budget Activity refine promising medical initiatives identified in Budget Activity 1, resulting in the development of countermeasures to protect against and treat the effects of exposure to chemical and biological (CB) agents.\n\nThe Medical Countermeasures Initiative (MCMI) was established to coordinate inter-related advancement development and flexible manufacturing capabilities, providing a dedicated, cost-effective, reliable, and sustainable MCM process that meets the warfighter and national security needs.  Specifically, the MCMI will provide the capability for the advancement of regulatory science and flexible manufacturing of biological MCM to address CBRN threats, including novel and previously unrecognized, naturally-occurring emerging infectious diseases."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Techbase Med Defense - Bio CM"
                                    },
                                    "Description": {
                                        "val": "Disease Surveillance\/Epidemiological and Predictive Modeling: Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, impact and biological threat assessment.  Contribute to the development of global, near real time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into agent-based epidemiological modeling, medical resource estimation and decision support tools.  Focus on agent-based epidemiological modeling and fusion of disease surveillance data."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.600"
                                            },
                                            "Text": {
                                                "val": "Continue efforts in FY12 from Information Systems Technology, Medical & Surveillance Information and Analysis (CB2 - M&S).  Continue effort on biosurveillance data stream evaluation and analysis to identify most useful biosurveillance data streams for prediction and early warning.  Continue effort to devise structured OCONUS expansion roadmap for agent-based epidemiological models and increase OCONUS analytic capability through targeted areas.  Continue research into data integration platforms and expand biosurveillance portfolio to support in-context, rapid detection, identification and response capabilities on the global scale.  Funding for this research area is realigned from Tech Base Med Bio - Diagnostics (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Techbase Med Defense - Chem Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Chemical Diagnostics: Focuses on developing state-of-the-art laboratory\/fieldable methods that detect exposure to chemical warfare agents (CWA) (e.g., nerve agents and vesicants) or radiological agents in clinical samples.  Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.175"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.175"
                                            },
                                            "Text": {
                                                "val": "Develop assays for enhancing the ability to identify exposure (sublethal) to emerging chemical agent threats using newly-identified biomolecular targets.  Funding for this research area is realigned from Tech Base Med Chem - Diagnostics (TC2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Techbase Med Defense - Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Biological Diagnostic Technologies: Development and verification of rapid, sensitive, and specific tests for the identification of Biological Warfare Agents (BWAs) and their expressed pathogens and toxins in clinical specimens from Warfighters for the diagnosis of exposure\/infection.  Discovery of host biomarkers generated in response to exposure to biological threat agents."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.652"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.652"
                                            },
                                            "Text": {
                                                "val": "Optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease processes.  Mature pipeline of genomics, proteomics, systems biology, and bioinformatics tools and methods to simultaneously support companion diagnostic tests, the development of MCMs and the analytic processes required to identify known, emerging, and re-emerging pathogens.  Funding for this research area is realigned from Tech Base Med Bio - Diagnostics (TB2) and Techbase Med Bio - TMT Platform Technologies (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Techbase Med Defense - Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Next Generation Technologies:  Development of next generation diagnostic technologies including portable diagnostic platforms, highly parallel and informative testing formats, and nanotechnology applications. Development of novel assay formats and hardware solutions to enable point of need diagnostic capabilities, allowing for rapid guidance of medical decisions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.561"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.561"
                                            },
                                            "Text": {
                                                "val": "Discover and verify panel of pre-symptomatic differential diagnostic biomarkers of exposure to virulent bacterial and viral bio- and emerging threat class and agents.  Development of portable diagnostic devices capable of use by minimally trained personnel, aiding in rapid diagnostics at the point of need.  Funding for this research area is realigned from Tech Base Med Bio - Diagnostics (TB2) and Techbase Med Bio - TMT Platform Technologies (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Techbase Med Defense - Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Biological Diagnostic Devices: Diagnostic device development to include systems able to harness next generation technologies to revolutionize clinical diagnostics in care facilities and in hospital laboratories.  This investment will incorporate capabilities such as next generation sequencing and advanced biomolecular methods to harness both host and pathogen biomarkers in a threat agnostic approach that will serve all echelons of military medical care."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.047"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.047"
                                            },
                                            "Text": {
                                                "val": "Develop and mature point of need diagnostic platform technologies with orthogonal capabilities.  Implement design control phased development and acceptance criteria to identify a minimum of two Next Generation Diagnostic Systems, Increment 2, candidate device platforms.  Funding for this research area is realigned from Tech Base Med Bio - Diagnostics (TB2) and Techbase Med Bio - TMT Platform Technologies (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Techbase Med Defense - Medical Countermeasures Initiative"
                                    },
                                    "Description": {
                                        "val": "Medical Countermeasures Initiative (MCMI): Integrate the regulatory science and manufacturing technologies and processes developed into the Advanced Development and Manufacturing Centers of Excellence (ADM COE) as enablers of the advanced development and flexible manufacturing capability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.972"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.972"
                                            },
                                            "Text": {
                                                "val": "Investigate organotypic platforms for MCM evaluation: ex-vivo liver, kidney, alveolar lung sacs with the goal of enhancing the product development process.  Construct next generation high yield protein expression platforms for biotechnology-based MCMs.  Develop high capacity downstream technologies and process analytic technologies to enhance rapid manufacturing process development and control with the goal of accelerating the manufacturing of biotechnology-based MCMs.  Funding for this research area is realigned from MCMI - Medical Countermeasures Initiative (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Techbase Med Defense - Bio CM"
                                    },
                                    "Description": {
                                        "val": "Pretreatments - Bacterial\/Toxins Vaccines: Generate novel or improved vaccines against bacterial and toxin biothreat agents, and demonstrate preliminary efficacy in small animal models.  Identify correlates of protective immunity in animal models."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.063"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.063"
                                            },
                                            "Text": {
                                                "val": "Refine appropriate animal models for aerosolized Burkholderia mallei and pseudomallei as well as Type A Francisella tularensis with regulatory guidance.  Evaluate multiple novel subunit Burkholderia vaccine candidates in small or large animal models with and without adjuvants.  Define predictive value of correlates of immunity, elicited by Burkholderia species vaccine candidates.  Evaluate the tolerability of novel adjuvants using the Anthrax vaccine for proof of concept, but which may potentially have applicability to other vaccine candidates.  Additionally, research will continue to produce vaccine candidates designed to protect against emerging or genetically engineered anthrax strains.  Test multiple novel subunit vaccine candidates for protection against aerosolized Type A Francisella tularenesis infection in appropriate small and large animal models.  Funding for this research area is realigned from Tech Base Med Bio - Pretreatments (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Techbase Med Defense - Bio CM"
                                    },
                                    "Description": {
                                        "val": "Pretreatments - Vaccine Platforms and Research Tools: Design novel multi-agent vaccine platforms capable of expressing multiple antigens, investigate the ability of non-specific stimulators of immunity to enhance the effectiveness of newly generated vaccines, characterize alternative vaccine delivery (needle-free) methods and novel vaccine stabilization methodologies, and conduct studies to further advance a laboratory based, human artificial immune system to render it capable of predicting the human immune response to biodefense vaccines under development."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.098"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.098"
                                            },
                                            "Text": {
                                                "val": "Utilize relevant animal models for the evaluation of the immune response to novel multi-antigen platforms.  Further refine the capabilities of the surrogate human immune system, MIMIC (i.e., Modular Immune In vitro Construct), which provides an in vitro assessment of the human immune response.  Initiate studies designed to lend regulatory credence to functional assays on the MIMIC to evaluate cross-reactivity of different Filovirus and Alphavirus strains.  Increase efforts to develop methodologies which remove the need for cold storage and transport for vaccines and render them stable in variable and extreme temperatures.  Funding for this research area is realigned from Tech Base Med Bio - Pretreatments (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Techbase Med Defense - Bio CM"
                                    },
                                    "Description": {
                                        "val": "Therapeutics - Viral Therapeutics: Identify, optimize and evaluate lead candidate therapeutics for efficacy against viral pathogens."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.150"
                                            },
                                            "Text": {
                                                "val": "Evaluate FDA approved drug combinations against arenavirus, bunyavirus, and flavivirus infection.  Conduct structure-based drug discovery for alphaviruses.  Identify and evaluate novel broad-spectrum host and pathogen directed small molecule therapeutics for emerging infectious diseases (i.e. alphavirus, filovirus, flavivirus, arenavirus, bunyavirus).  A portion of TB2\/TBMDB TMT Multiagent (Broad Spectrum) Medical Countermeasures will be continued in viral therapeutics (TB2\/TBMDB THER).  Funding for this research area is realigned from Tech Base Med Bio - Therapeutics (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Techbase Med Defense - Bio CM"
                                    },
                                    "Description": {
                                        "val": "Therapeutics - Bacterial Therapeutics: Identify, optimize and evaluate lead therapeutic candidates effective against designated bacterial threat agents."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.150"
                                            },
                                            "Text": {
                                                "val": "Expand FDA approved drug screening program for Burkholderia, Francisella tularensis and determine in vitro susceptibilities.  Continue evaluation of novel compounds against bacterial biological warfare agents.  Develop lead series of MurB compounds targeting cell wall biosynthesis.  Determine synergy between MurB antibacterial agents and conventional antibiotics against B. anthracis and Y. pestis.  Evaluate the electron transport chain, multidrug efflux systems, and purine pathways as a target for broad-spectrum antibacterial development.  A portion of TB3\/TBMDB TMT Multiagent (Broad Spectrum) Medical Countermeasures will be continued in bacterial therapeutics (TB2\/TBMDB THER).  Funding for this research area is realigned from Tech Base Med Bio - Therapeutics (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Techbase Med Defense - Bio CM"
                                    },
                                    "Description": {
                                        "val": "Therapeutics - Toxin Therapeutics: Identify, optimize and evaluate therapeutic candidates that are effective against biological toxin agents."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.395"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.395"
                                            },
                                            "Text": {
                                                "val": "Characterize host proteins that interact with BoNT and identify small molecule inhibitors preventing host-toxin interactions.  Validate differential expression of host genes involved in neuron response to BoNT intoxication.  Identify and develop therapies that target host proteins involved in BoNT persistence in the neuron.  Continue co-crystallization studies of BoNT-inhibitor complexes.  Funding for this research area is realigned from Tech Base Med Bio - Therapeutics (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Techbase Med Defense - Bio CM"
                                    },
                                    "Description": {
                                        "val": "Multiagent (Broad Spectrum) Medical Countermeasures (MCM): Continues efforts previously funded under the Transformational Medical Technologies Initiative.  It supports existing and new efforts in the discovery phase of drug development.  Applied research efforts also include the investigation of existing drugs to explore their efficacy against BW agents.  This involves the initiation of experiments to identify markers, correlates of protection, assays, and endpoints for further non-clinical and clinical studies and development of a scalable and reproducible manufacturing process amenable to Food and Drug Administration (FDA) Good Manufacturing Practices (GMP)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.235"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.235"
                                            },
                                            "Text": {
                                                "val": "Continue to support new MCM discovery efforts to refresh the Hemorrhagic Fever Virus (HFV) and Intracellular Bacterial Pathogen (IBP) product pipelines.  Continue to identify and initiate the development of intervention strategies targeting host response to biological pathogens, inclusive of enhancing the immune system and treating symptoms to reduce the severity of disease.  Funding for this research area is realigned from Tech Base Med Bio - TMT Broad Spectrum MCM (TB2) (TB2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Techbase Med Defense - Chem CM"
                                    },
                                    "Description": {
                                        "val": "Chemical Medical Pretreatments - Nerve Agent, Pretreatments: Develops pretreatments that provide protection against all organophosphorous nerve agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high enzymatic efficiency for the destruction of agents."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.452"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.452"
                                            },
                                            "Text": {
                                                "val": "Initiate search for Catalytic Bioscavenger of V agents.  Assess feasibility and begin initial studies to develop a broad spectrum cocktail of V and G agent catalytic bioscavengers.  Funding for this research area is realigned from Tech Base Med Chem - Pretreatments (TC2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "14) Techbase Med Defense - Chem CM"
                                    },
                                    "Description": {
                                        "val": "Chemical Medical Therapeutics - Cutaneous and Ocular: Focuses on therapeutic strategies to effectively minimize injuries to dermal (i.e., skin) and ocular tissues resulting from exposure to chemical warfare agents (CWAs).  Involves the development of effective practical field and clinic management strategies and physical and pharmacological interventions to treat the injury processes.  This work is designed to develop potential candidates that will ultimately be submitted for FDA licensure or new indications for previously licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.270"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.270"
                                            },
                                            "Text": {
                                                "val": "Continue to utilize molecular biology approaches to elucidate drug targets and gain further mechanistic understanding of delayed ocular injury due to sulfur mustard exposure.  Funding for this research area is realigned from Tech Base Med Chem - Therapeutics (TC2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "15) Techbase Med Defense - Chem CM"
                                    },
                                    "Description": {
                                        "val": "Chemical Medical Therapeutics - Neurologic: Focuses on therapeutic strategies to effectively minimize neurologic injuries resulting from exposure to CWAs.  This effort involves the development of neuroprotectants, anticonvulsants, and improved neurotransmitter restorers.  This work is designed to develop potential candidates that will ultimately be submitted for FDA licensure or new indications for previously licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.775"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.775"
                                            },
                                            "Text": {
                                                "val": "Continue investigating potential for broad spectrum\/centrally active reactivator.  Continue search for Neuroprotectant effective up to 4 hours after seizure initiation.  Funding for this research area is realigned from Tech Base Med Chem - Therapeutics (TC2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "16) Techbase Med Defense - Rad CM"
                                    },
                                    "Description": {
                                        "val": "Radiation Medical Countermeasures: Develop medical countermeasures to protect the Warfighter against acute radiological\/nuclear exposure, to include developing both pretreatments (prophylaxis) and post-irradiation therapeutics against radiological\/nuclear exposure.  DoD is the only governmental agency currently developing medical prophylaxis to protect Warfighters and\/or other responders in the event of a radiological incident."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.613"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.613"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of novel biomarkers useful for biodosimetry and identification of potential therapeutic approaches.  Funding for this research area is realigned from Tech Base Med Rad - Radiation Countermeasures (TR2)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TB2"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "51.158"
                                        },
                                        "CurrentYear": {
                                            "val": "86.679"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "137.837"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TC2"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "31.970"
                                        },
                                        "CurrentYear": {
                                            "val": "34.614"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "66.584"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TR2"
                                    },
                                    "Title": {
                                        "val": "MEDICAL RADIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.083"
                                        },
                                        "CurrentYear": {
                                            "val": "0.806"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "2.889"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TB3"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "153.437"
                                        },
                                        "CurrentYear": {
                                            "val": "172.394"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "325.831"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TC3"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "25.486"
                                        },
                                        "CurrentYear": {
                                            "val": "21.789"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "47.275"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "171.399"
                                        },
                                        "BudgetYearThree": {
                                            "val": "147.651"
                                        },
                                        "BudgetYearFour": {
                                            "val": "136.326"
                                        },
                                        "BudgetYearFive": {
                                            "val": "136.326"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TR3"
                                    },
                                    "Title": {
                                        "val": "MEDICAL RADIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.402"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "2.402"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "129.682"
                                        },
                                        "CurrentYear": {
                                            "val": "116.653"
                                        },
                                        "BudgetYearOne": {
                                            "val": "133.254"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "133.254"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "194.502"
                                        },
                                        "BudgetYearThree": {
                                            "val": "155.024"
                                        },
                                        "BudgetYearFour": {
                                            "val": "81.188"
                                        },
                                        "BudgetYearFive": {
                                            "val": "23.593"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.134"
                                        },
                                        "CurrentYear": {
                                            "val": "7.804"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "16.947"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.395"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.513"
                                        },
                                        "BudgetYearFive": {
                                            "val": "25.134"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (SDD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "75.657"
                                        },
                                        "CurrentYear": {
                                            "val": "216.715"
                                        },
                                        "BudgetYearOne": {
                                            "val": "214.056"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "214.056"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "246.295"
                                        },
                                        "BudgetYearThree": {
                                            "val": "187.101"
                                        },
                                        "BudgetYearFour": {
                                            "val": "213.001"
                                        },
                                        "BudgetYearFive": {
                                            "val": "238.653"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (SDD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.801"
                                        },
                                        "CurrentYear": {
                                            "val": "2.407"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.642"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.642"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "41.257"
                                        },
                                        "BudgetYearThree": {
                                            "val": "45.477"
                                        },
                                        "BudgetYearFour": {
                                            "val": "50.862"
                                        },
                                        "BudgetYearFive": {
                                            "val": "58.935"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "5.448"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.498"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.498"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.499"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.266"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.496"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.355"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TR2"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL RADIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.083"
                        },
                        "CurrentYear": {
                            "val": "0.806"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "2.889"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (TR2) funds applied research to develop medical countermeasures to protect the Warfighter against acute radiological exposure.  Specifically, innovative technical approaches will be used to develop products to mitigate health consequences resulting from Acute Radiation Exposure (ARS) and Delayed Effects of Acute Radiation Exposure (DEARE).  The research and development of medical countermeasures for radiation exposure will ultimately enhance the survivability of Warfighters and will serve to significantly minimize the development of acute radiation syndromes and subsequent health problems.  Results of efforts funded under this project are collaboratively shared with other government agencies, while the Department of Defense maintains an emphasis on the development of pretreatments to protect military personnel who could be involved in responding to a radiological incident.  In FY13, all research in this area is re-aligned into Techbase Medical Defense (TM2)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Radiological Medical Countermeasures"
                                    },
                                    "Description": {
                                        "val": "Radiation Medical Countermeasures: Develop medical countermeasures to protect the Warfighter against acute radiological\/nuclear exposure, to include developing both pretreatments (prophylaxis) and post-irradiation therapeutics against radiological\/nuclear exposure.  DoD is the only governmental agency currently developing medical prophylaxis to protect Warfighters and\/or other responders in the event of a radiological incident."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.083"
                                            },
                                            "Text": {
                                                "val": "Continued to evaluate novel and FDA-approved drugs for efficacy against radiation exposure maintaining a focus on potential mechanisms of action.  Identified biochemical\/physiological mechanisms that could be exploited for expanding the scope of potential therapeutic approaches.  Continued to focus approaches on the GI and lung injury related to radiation exposure.  Continued evaluation and identification of unique, novel and promising biomarkers useful for biodosimetry and potential pathways for therapeutic approaches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.795"
                                            },
                                            "Text": {
                                                "val": "Continue the evaluation of novel biomarkers for biodosimetry and identification of potential therapeutic approaches.  In FY13, all Project TR2 research is re-aligned into Techbase Medical Defense - RAD CM (TM2)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) SBIR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.011"
                                            },
                                            "Text": {
                                                "val": "Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "118.208"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "118.208"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "110.294"
                                        },
                                        "BudgetYearThree": {
                                            "val": "97.308"
                                        },
                                        "BudgetYearFour": {
                                            "val": "130.654"
                                        },
                                        "BudgetYearFive": {
                                            "val": "130.654"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "171.399"
                                        },
                                        "BudgetYearThree": {
                                            "val": "147.651"
                                        },
                                        "BudgetYearFour": {
                                            "val": "136.326"
                                        },
                                        "BudgetYearFive": {
                                            "val": "136.326"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}