{
    "id": "1893bc4292fef65cb2431d481e70981a2fdb9cba",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V3A_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0208006F"
        },
        "ProgramElementTitle": {
            "val": "Mission Planning Systems"
        },
        "R1LineItemNumber": {
            "val": "164"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "80.492"
            },
            "CurrentYear": {
                "val": "63.009"
            },
            "BudgetYearOne": {
                "val": "69.377"
            },
            "BudgetYearOneBase": {
                "val": "69.377"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "70.332"
            },
            "BudgetYearThree": {
                "val": "82.164"
            },
            "BudgetYearFour": {
                "val": "84.284"
            },
            "BudgetYearFive": {
                "val": "84.542"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY11 funding totals include $4.443M appropriated for Overseas Contingency Operations."
        },
        "ProgramElementMissionDescription": {
            "val": "Mission planning involves the creation of a flight plan based on threats, targets, terrain, weather, aircraft performance capability, and configuration.  It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie.  The planner must have the ability to plan weapons, cargo, passenger, and\/or fuel delivery, calculate fuel requirements, and assess the route based on known enemy threat location and type.  Mission planners must be able to optimize and de-conflict flight routes with other aircraft; review, print, and brief the mission plan; and download pertinent flight information to on-board aircraft avionics. \n\nThe Mission Planning Systems (MPS) program is a collaborative program with the Army and Navy to leverage technical solutions and business practices for all Department of Defense (DoD) platforms.  It provides automated mission planning tools and support for fixed and rotary wing aircraft and guided munitions.  It will replace two closed architecture legacy mission planning systems (Unix-based MPS (Unix-MPS) and the PC-based Portable Flight Planning Software (PFPS)), with a single multi-service open architecture system more commonly referred to as the Joint Mission Planning System (JMPS).  MPS will compress the mission planning cycle by providing an improved integrated planning environment, reducing the time required to respond to changing situations and urgent needs such as striking time sensitive\/critical targets and conducting combat search and rescue.  The MPS development program will migrate a variety of Air Force aircraft, weapons, and airdrop payload systems from legacy mission planners to MPS.  These systems include, but are not limited to the: A-10, B-1B, C-5, C-17, C-130, E-3, E-8, F-15, F-16, F-22A, RC-135, HH-60, and their associated weapons (e.g. Small Diameter Bomb (SDB), Joint Direct Attack Munitions (JDAM), Joint Air-to-Surface Standoff Munitions (JASSM), etc.) and airdrop payloads.  In addition, basic MPS products have the potential to support all DoD fixed-wing and rotary-wing aircraft and will be shared with other AF programs as well as the Army and Navy.  MPS will deliver significant benefits to command and control performance by enhancing information superiority for the warfighter and by providing unique capabilities in support of both precision engagement and dominant maneuver.  Additionally, elements of Mission Planning Systems will be utilized to continue the development of a Joint Precision Airdrop System (JPADS) in conjunction with the Army.\n\nThe JPADS System of Systems (SoS) capability provides a planning and execution capability for DoD airdrop requirements. It is the primary airdrop mission planning and execution system for all ballistic airdrop mission as well as precision guided airdrops that are required when the mission profile or surface-to-air threat assessment warrants a high-altitude and\/or standoff precision delivery.  JPADS enables high-altitude, precise airdrop delivery to forward ground forces, mitigating surface-to-air threats, reducing risk of Improvised Explosive Device (IED) & insurgent attack on ground convoys. JPADS allows the warfighter to consider weather, terrain, aircraft capabilities, threat, etc. to accurately deliver payloads to keep the warfighter supplied and in the fight.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "83.555"
                },
                "CurrentYear": {
                    "val": "69.918"
                },
                "BudgetYearOne": {
                    "val": "72.037"
                },
                "BudgetYearOneBase": {
                    "val": "72.037"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "80.492"
                },
                "CurrentYear": {
                    "val": "63.009"
                },
                "BudgetYearOne": {
                    "val": "69.377"
                },
                "BudgetYearOneBase": {
                    "val": "69.377"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.063"
                },
                "CurrentYear": {
                    "val": "-6.909"
                },
                "BudgetYearOne": {
                    "val": "-2.660"
                },
                "BudgetYearOneBase": {
                    "val": "-2.660"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.409"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-6.500"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.388"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.675"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.660"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.660"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2012 request reduced by 6.5M due to MPS Increment IV critical change delays.\n\nFY2013 reduced by 2.66M due to higher Air Force priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "673858"
                    },
                    "ProjectTitle": {
                        "val": "Mission Planning Systems (MPS) Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.663"
                        },
                        "CurrentYear": {
                            "val": "28.004"
                        },
                        "BudgetYearOne": {
                            "val": "6.405"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.405"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.833"
                        },
                        "BudgetYearThree": {
                            "val": "5.484"
                        },
                        "BudgetYearFour": {
                            "val": "2.665"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "FY11 funding totals include $4.443M appropriated for Overseas Contingency Operations.\n\nProject 675838 was renamed Mission Planning Systems Development from Mission Planning Systems in FY13."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission planning involves the creation of a flight plan based on threats, targets, terrain, weather, aircraft performance capability and configuration. It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie.  The planner must have the ability to plan weapon, cargo, passenger, and\/or fuel delivery, calculate fuel requirement and assess the route based on known enemy threat location and type.  Mission planners must be able to optimize and de-conflict flight routes with other aircraft; review, print and brief the plan; and download pertinent flight information to on-board aircraft avionics.\n\nThis project provides for the continuous improvement of mission planning software capabilities that cut across all platforms and systems.  It includes all FY10 and prior development activities for migrating selected Combat Air Forces (CAF) and Mobility Air Forces (MAF) platforms to MPS.  It also allows for the investigation of new technologies and products that have the potential for improving mission planning systems.  This includes the continuous upgrading of the MPS framework.  The framework is the underlying baseline for all mission planning systems.  It will require continuous upgrades to: 1) reduce timelines for route planning; 2) transmit near real-time intelligence data to the platforms; 3) increase the accuracy of the mapping products; 4) provide a Windows-based, commercial off the shelf-based, user friendly product; and 5) retain compatibility with platform changes to avionics and operational flight programs.  \n\nThis project also continues the development of a Joint Precision Airdrop System-Mission Planner (JPADS-MP) in conjunction with the Army. The JPADS System of Systems (SoS) capability provides a planning and execution capability for DoD airdrop requirements. It is the primary airdrop mission planning and execution system when the mission profile or surface-to-air threat assessment warrants a high-altitude and\/or standoff precision delivery. JPADS enables high-altitude, precise airdrop delivery to forward ground forces, mitigating surface-to-air threats, reducing risk of Improvised Explosive Device (IED), and insurgent attack on ground convoys. JPADS allows the warfighter to consider weather, terrain, aircraft capabilities, threat, etc. to accurately deliver payload. Activities also include studies and analysis to support both current program planning and execution and future program planning. Development and modernization activities within this project are as follows:\n\na. MPS Increment IV - continues all FY10 and prior year development activities to migrate selected CAF and MAF platforms to the MPS Increment IV planning systems capability.  This includes the initial migration of all designated Increment IV platforms.  FY2011 and outyear development activities for Increment IV will be completed as part of respective projects for CAF and MAF planning systems.\n\nb. MPS Modernization - continues the modernization of overarching technologies (including the framework) to support development of Mission Planning Environments (MPEs) for various CAF and MAF platforms.\n\nc. CAF MPE Modernization: Beginning in FY13, these efforts will modernize CAF MPEs that were developed and delivered under MPS Increments II – IV.  The modernization effort will provide new and improved mission planning capability for individual Operational Flight Program (OFP) requirements, such as new weapons, avionics upgrades, communications systems, etc.  The OFPs requiring MPE updates under the CAF Modernization effort in Fiscal Years 2011 through 2017 include but are not limited to those for A-10 (Suites 8, 9, 10, 11, 12), B-1B (Sustainment Blocks (SB) 15, 16, 16a, 17 and 18), and F-15 (Suites 7, 8, 9, and 10).  CAF modernization also includes updates to mission planning capabilities supporting associated weapons, including Small Diameter Bomb (SDB), Joint Direct Attack Munitions (JDAM) and the Joint Air-to-Surface Standoff Missile (JASSM).  Finally, CAF modernization will address required improvements to CAF related MPE Common Components (CCs), including Precision-Guided Munitions Planning System (PGMPS), Electronic Warfare CC (EWCC), etc.  \n\nd. MAF MPE Modernization: This effort modifies the common MAF MPE developed and deployed during previous mission planning increments. The modernization activities will provide new and improved mission planning capabilities for the MAF fleet as required to meet evolving OFP, fuel efficiency and Global Planning netcentric requirements such as avionics upgrades, communication systems, interfaces with command and control systems, new chutes, etc. for various MAF platforms. The MPE updates under the MAF Modernization effort in Fiscal Years 2011 through 2017 include but are not limited to those for C-5, C-17, C-27, C-130s (multiple variants), E-3, E-8, E-4, HH-60, KC-10, KC-46, KC-135, and RC-135. MAF modernization will address required improvements to MAF related MPE CCs, including the Communications, Navigation Surveillance\/Air Traffic Management (CNS\/ATM) CC, Consolidated Airdrop Tool (CAT), Aeronautical Advisory and Notices to Airmen Tool (AANT), and Air Refueling Tool (ART) CC.   \n\ne. Joint Precision Airdrop System –Mission Planner (JPADS-MP) - continues development of software and hardware required to provide a precision airdrop capability for AF and other services (e.g the Army, etc).  \n\nf. Test, Training and Certification - continues all MPS-related integration, test, and certification activities for all CAF and MAF platforms.\n\ng. Operational and Technical Support - continues all program office management operations and support activities to ensure the timely delivery of mission planning systems to the warfighter.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Increment IV Development"
                                    },
                                    "Description": {
                                        "val": "Continue contractor-executed software development and test activities required to migrate selected CAF and MAF platforms to the new MPS Increment IV mission planning capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.270"
                                            },
                                            "Text": {
                                                "val": "Continued the development, testing, and fielding of FW 1.4 software. Completed development and fielding activities for B-1B, F-22A, and A-10 Mission Planning Environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.390"
                                            },
                                            "Text": {
                                                "val": "Continue development of the unique planning component portion of the MPEs for F-22 and A-10."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.405"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.405"
                                            },
                                            "Text": {
                                                "val": "Complete development of the unique planning component portion of the MPE for F-22."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MPS Modernization"
                                    },
                                    "Description": {
                                        "val": "Continues modernization of MPEs for previously migrated platforms to enable use of new capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.135"
                                            },
                                            "Text": {
                                                "val": "Conducted system engineering and integration activities to support the continued modernization of previously migrated CAF and MAF platforms and requirements analysis for updates to the MPS Framework (FW 1.5)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.811"
                                            },
                                            "Text": {
                                                "val": "Conduct system engineering and integration activities to support the continued modernization of previously migrated CAF and MAF platforms and continue software development of Framework 1.5."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test, Training and Certification"
                                    },
                                    "Description": {
                                        "val": "Continues Test, Training, and Certification (TT&C) activities to evaluate and ensure the operational performance of all newly developed and modernized MPS software and hardware."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.412"
                                            },
                                            "Text": {
                                                "val": "Continued formal Government testing of software and other development efforts for MPS Increment IV and MPS modernization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.346"
                                            },
                                            "Text": {
                                                "val": "Continue formal Government testing for MPS Increment IV, and MPS modernization efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Beginning in FY13 all Test, Training, and Certification requirements will be allocated to their respective programs in 675302, Precision Aerial Delivery Systems (PADS), and 675380, MPS Modernization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operations\/Technical Support"
                                    },
                                    "Description": {
                                        "val": "Continues all program management office technical and administrative activities and operations necessary to support development and fielding of all MPS capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.403"
                                            },
                                            "Text": {
                                                "val": "Provided technical support for MPS Increment IV and MPS modernization efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.457"
                                            },
                                            "Text": {
                                                "val": "Provide technical support for MPS Increment IV and MPS modernization activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Beginning in FY13 all Operations\/Technical Support requirements will be allocated to their respective programs in 675302, PADS, and 675380, MPS Modernization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JPADS Development"
                                    },
                                    "Description": {
                                        "val": "Continue development of a JPADS capability for precise, high-altitude delivery of material to forward ground forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.443"
                                            },
                                            "Text": {
                                                "val": "Completed JPADS-MP\/Consolidated Airdrop Tool (CAT) v1 (Win XP) software. Continued development, integration and testing of CAT v2 (VISTA) software. Completed requirements analysis of CAT v3 (wx refactor) software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MPS development utilizes an evolutionary acquisition approach to develop and deliver an interoperable, network-centric, mission planning system tailored for numerous Air Force platforms using competition and multiple contract vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_673858_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "F-22 Inc 3.2A v12.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "A-10 Suite 7B Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Framework 1.4 Final Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Framework 1.5 Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675302"
                    },
                    "ProjectTitle": {
                        "val": "Precision Aerial Delivery Systems (PADS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.238"
                        },
                        "CurrentYear": {
                            "val": "4.142"
                        },
                        "BudgetYearOne": {
                            "val": "5.546"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.546"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.815"
                        },
                        "BudgetYearThree": {
                            "val": "4.322"
                        },
                        "BudgetYearFour": {
                            "val": "3.894"
                        },
                        "BudgetYearFive": {
                            "val": "0.945"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project 675302 was renamed Precision Aerial Delivery Systems (PADS) from Mobility Air Forces (MAF) Planning Systems in FY13."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission planning involves the creation of a flight plan based on multiple inputs including threats, targets, terrain, weather, aircraft performance capability and configuration. It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie. The planner must have the ability to plan weapon, cargo, passenger, and\/or fuel delivery, calculate fuel requirement and assess the route based on known enemy threat location and type. Mission planners must be able to optimize and de-conflict flight routes with other aircraft; review, print and brief the plan; download pertinent flight information to on-board aircraft avionics; and, conduct dynamic\/in-flight replanning as applicable .  This project continues the development of a Joint Precision Airdrop System-Mission Planner (JPADS-MP) in conjunction with the Army.  The JPADS System of Systems (SoS) capability provides a planning and execution capability for DoD airdrop requirements. It is the primary airdrop mission planning and execution system for all ballistic airdrop mission as well as precision guided airdrops that are required when the mission profile or surface-to-air threat assessment warrants a high-altitude and\/or standoff precision delivery.  JPADS enables high-altitude, precise airdrop delivery to forward ground forces, mitigating surface-to-air threats, reducing risk of Improvised Explosive Device (IED) & insurgent attack on ground convoys. JPADS allows the warfighter to consider weather, terrain, aircraft capabilities, threat, etc. to accurately deliver payloads to keep the warfighter supplied and in the fight.  \n\nSome key requirements on the horizon for the Consolidated Airdrop Tool (CAT) include refactoring WindPADS (Weather component of CAT), Combination Airdrop, Local Analysis and Prediction System (LAPS) replacement, Ensemble Weather prediction, and Obstruction Data.  CAT will also be integrating multiple S&T efforts developed and prototyped by Natick Soldier Center including Airdrop Damage Estimate and updates to Precision Aerial Guidance Units.  The JPADS-MP will also transition various AFRL Flagship Capability Concept (FCC) efforts to include improvements to Airdrop Performance Modeling, Light Detection and Ranging (LIDAR) and updates to Human Effectiveness of the software.\n\nActivities also include studies and analysis to support both current program planning and execution and future program planning. Development and modernization efforts are as follows: \n\na. MAF MPE Modernization - modifies the common MAF Mission Planning Environment (MPE) developed and deployed during previous mission planning increments. The modernization activities will provide new and improved mission planning capabilities for the MAF fleet  as required to meet evolving Operational Flight Program (OFP), fuel efficiency and Global Planning netcentric requirements such as avionics upgrades, communication systems, interfaces with command and control systems, new chutes, etc. for various MAF platforms. The MPE updates under the MAF Modernization effort in Fiscal Years 2011 through 2017 include but are not limited to those for C-5, C-17, C-27, C-130s (multiple varients), E-3, E-8, E-4, HH-60, KC-10, KC-46, KC-135 and RC-135. MAF modernization will address required improvements to MAF related MPE Common Components (CCs), including the Communications, Navigation Surveillance\/Air Traffic Management (CNS\/ATM) CC, Consolidated Airdrop Tool (CAT), Aeronautical Advisory, and Notices to Airmen (NOTAMS) Tool (AANT), and Air Refueling Tool (ART) CC.  This effort also provides the capability to use the new Digital Aeronautical Information File (DAFIF) web services-based data structure (GNS-A) being produced by NGA in this timeframe.\n\nb. Joint Precision Airdrop System – Mission Planner (JPADS-MP) - continues development of software and hardware required to provide a precision airdrop capability for AF and other services (e.g the Army, etc). \n\nc. Test, Training and Certification - continues all MPS-related integration, test, and certification activities for all CAF and MAF platforms.\n\nd. Operational and Technical Support - continues all program office management operations and support activities to ensure the timely delivery of mission planning systems to the warfighter.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JPADS Development"
                                    },
                                    "Description": {
                                        "val": "Continue development of a JPADS capability for precise, high altitude delivery of material to forward ground forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.426"
                                            },
                                            "Text": {
                                                "val": "Completed JPADS-MP\/Consolidated Airdrop Tool (CAT)v1 (Win XP) software. Continued development, integration and testing of CAT v 2 (VISTA) software. Completed requirements analysis of CAT v 3 (wx refactor) software. Additional funding in project 673858."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.710"
                                            },
                                            "Text": {
                                                "val": "Continued development of CAT v 3 software which predominantly re-architects the WindPads component of CAT software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.546"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.546"
                                            },
                                            "Text": {
                                                "val": "CAT v3.x effort will integrate new solution to replace antiquated and \"black box\" module Local Analysis and Prediction System (LAPS) for improved localized weather modeling.  Efforts also include inclusion of updated\/new chute systems and related airdrop performance data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MAF Modernization"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of MPEs for MAF platforms"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.812"
                                            },
                                            "Text": {
                                                "val": "Continued the modernization of previously fielded mission planning software environments for the E-3 and the E-8."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.432"
                                            },
                                            "Text": {
                                                "val": "Continue the modernization of previously fielded mission planning software environments for the E-3, E-8, and RC-135."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Beginning in FY13 all MAF Modernization requirements will be allocated to 675380, MPS Modernization."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF, PE 0208006F, Mission Plann..."
                                    },
                                    "Title": {
                                        "val": "-"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.918"
                                        },
                                        "CurrentYear": {
                                            "val": "9.709"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.487"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.487"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.525"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.334"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.585"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.683"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "PADS utilizes an evolutionary acquisition approach to develop and deliver an interoperable, network-centric, mission planning system tailored for numerous Air Force platforms using competition and multiple contract vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_675302_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v2.0.2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v2.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v3.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v3.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v3.2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v4.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v5.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v6.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675380"
                    },
                    "ProjectTitle": {
                        "val": "Mission Planning Systems (MPS) Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.591"
                        },
                        "CurrentYear": {
                            "val": "30.863"
                        },
                        "BudgetYearOne": {
                            "val": "57.426"
                        },
                        "BudgetYearOneBase": {
                            "val": "57.426"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "66.684"
                        },
                        "BudgetYearThree": {
                            "val": "72.358"
                        },
                        "BudgetYearFour": {
                            "val": "77.725"
                        },
                        "BudgetYearFive": {
                            "val": "83.597"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project 675380 was renamed Mission Planning Systems (MPS) Modernization from Combat Air Forces (CAF) Planning Systems in FY13. \n\nFY11 funding is in Project 675838, MPS Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission planning involves the creation of a flight plan based on threats, targets, terrain, weather, aircraft performance capability and configuration.  It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie.  The planner must have the ability to plan weapons, cargo, passenger, and\/or fuel delivery, calculate fuel requirement and assess the route based on known enemy threat location and type.  Mission planners must be able to optimize and de-conflict flight routes with other aircraft, review, print and brief the plan; and download pertinent flight information to on-board aircraft avionics.  This project focuses on modernizing MPS to support CAF and Mobility Air Forces (MAF), including the development, test and sustainment of Mission Planning Environments (MPEs) to support the A-10, B-1B, C-5, C-17, C- 27, C-130, E-3, E-8, F-15, F-16, F-22A, KC-10, KC-46, KC-135, RC-135, and other platforms.  Activities also include studies and analysis to support both current program planning and execution and future program planning. MPS Modernization efforts are as follows:\n\na. MPS Increment IV Development: This effort continues update\/development activities for platforms that previously transitioned to MPS (e.g. F-15, F-16, A-10, B-1B, and F-22A Increment 3.2A) to provide capabilities IAW the Increment IV Capability Development Document (CDD).  In addition, it also upgrades several Common Components (CCs) that are utilized on a variety of CAF platforms.  Starting in FY13, all MPS Increment IV Development efforts will reside in Project 673858, Mission Planning Systems (MPS) Development.\n\nb. CAF MPE Modernization: These efforts modernize CAF MPEs that were developed and delivered under MPS Increments II – IV.  The modernization effort will provide new and improved mission planning capability for individual Operational Flight Program (OFP) requirements, such as new weapons, avionics upgrades, communications systems, etc.  The OFPs requiring MPE updates under the CAF Modernization effort in Fiscal Years 2011 through 2017 include but are not limited to those for A-10 (Suites 8, 9, 10, 11, 12), B-1B (Sustainment Blocks 15, 16, 16a, 17 and 18), F-15 (Suites 7, 8, 9, and 10), F-16 Block 30 (System Capability Upgrade [SCU] 8, 9 and 10), F-16 Block 40\/50 (M6.1, M6.5, M7.1, and M8.0) and F-22 (Increments 3.2B, 3.2C, and 4.0).  CAF modernization also includes updates to mission planning capabilities supporting associated weapons, including Small Diameter Bomb (SDB-II), Joint Direct Attack Munitions (JDAM) and the Joint Air-to-Surface Standoff Missile (JASSM).  Finally, CAF modernization will address required improvements to CAF related MPE CCs, including Precision-Guided Munitions Planning System (PGMPS), Electronic Warfare CC (EWCC), etc.  \n\nc. MAF MPE Modernization: This effort modifies the common MAF MPE developed and deployed during previous mission planning increments. The modernization activities will provide new and improved mission planning capabilities for the MAF fleet as required to meet evolving OFP, fuel efficiency and Global Planning netcentric requirements such as avionics upgrades, communication systems, interfaces with command and control systems, new chutes, etc. for various MAF platforms. The MPE updates under the MAF Modernization effort in Fiscal Years 2011 through 2017 include but are not limited to those for C-5, C-17, C-27, C-130s (multiple varients), E-3, E-8, E-4, HH-60, KC-10, KC-46, KC-135, and RC-135. MAF modernization will address required improvements to MAF related MPE CCs, including the Communications, Navigation Surveillance\/Air Traffic Management (CNS\/ATM) CC, Consolidated Airdrop Tool (CAT), Aeronautical Advisory and Notices to Airmen Tool (AANT), and Air Refueling Tool (ART) CC.  This effort also provides the capability to use the new Digital Aeronautical Information File (DAFIF) web services-based data structure (GNS-A) being produced by NGA in this timeframe.  \n\nTo meet the unique needs of Air Mobility Command (AMC), the Mobility Air Force Automated Flight Planning Service (MAFPS) component of MPS will provide a centralized\/net-centric Global Mobility mission flight planning capability. This service will provide significant fuel savings through automated flight route optimization utilizing aircraft performance, air traffic management, weather, and other data.” \n\nd. Test, Training and Certification: Continues all MPS-related integration, test, and certification activities for all CAF and MAF platforms.\n\ne. Operational and Technical Support: Continues all program office management operations and support activities to ensure the timely delivery of mission planning systems to the warfighter.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Increment IV Development"
                                    },
                                    "Description": {
                                        "val": "Continues development of MPS Increment IV MPEs for CAF platforms (e.g. A-10, F-15, F-16, F-22, B-1B)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.460"
                                            },
                                            "Text": {
                                                "val": "Continued development of the unique planning component portion of MPE for the E-3 and E-8 platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.971"
                                            },
                                            "Text": {
                                                "val": "Complete development of the unique planning component portion of MPEs for the A-10 and F-22A platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY13 all MPS Increment IV requirements will be executed in Project 673858, MPS Development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CAF Modernization"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded Mission MPEs to enable efficient use of new and improved capabilities being developed in the OFPs of CAF platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.131"
                                            },
                                            "Text": {
                                                "val": "Continued modernization of previously fielded mission planning software environments for B-1B, F-15, F-16, and F-22A.  Included design, code integration, and documentation of software components.  Also supported training for units that received the additional functional capabilities developed and incorporated in platform OFPs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.892"
                                            },
                                            "Text": {
                                                "val": "Continues the modernization of previously fielded mission planning software environments for the A-10, B-1B, F-15, F-16 and F-22A. Future funding will incorporate changes to the requirements by the Operation Flight Programs as the warfighter transitions to the Joint Mission Planning System. Air Combat Command (ACC) and AMC supplies functional and performance requirements that must be implemented relative to each particular platform mission planning requirements. This will include the implementation of specific UPC improvements based upon fielded problems, developer evaluations, and Developmental and Operational testing as agreed to by HQ ACC and AMC. As part of the modernization effort MPE software shall interoperate with the baseline JMPS Framework, PGMPS, Weapons Data link, and key handling software for the newly identified SDB-II (Network Enabled Weapons) capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.647"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.647"
                                            },
                                            "Text": {
                                                "val": "Specific CAF efforts include but are not limited to:  ongoing development of the A-10 Suite 8 (at this time specific mission planning requirements in support of Suite 8 OFP have not been addressed\/evaluated); ongoing development of the F-15 v3.2 which includes incorporation of Network Enabled Weapons (NEW); continued development on F-15 v4.0 which includes SDB-II updates; design and development of the F-15 v4.1; design, development of the F-16 Block 30 System Capability Upgrade (SCU) 9 OFP;  design and development of the M6.5 and M7.1 MPEs in support of the associated F-16 Block 40\/50 OFPs, including mission planning support for the Air Launch Aerial-Intercept Guided Missile-9X (AIM-9X) Block II integration; further development of the F-22 v12.0 for 3.2A OFP and F-22 v13.0 MPE, providing mission planning support to the Increment 3.2B OFP for AIM 120D and AIM-9X integration, Electronic Proetection, Embedded Training, and SDB management.  Additional effort may be driven by ACC requirements, to include, but not limited to, specific MPE improvements based upon problems discovered in fielded versions, developer evaluations and formal Government testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MAF Modernization"
                                    },
                                    "Description": {
                                        "val": "Continue the modernization of previously fielded mission planning software environments for the E-3, E-8,  E-4, EC-130, and RC-135. Begin activities for modernization of the MAF MPE to include C-5, C-17, C-130s, C-27, KC-10, KC-135, and KC-46 platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.779"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.779"
                                            },
                                            "Text": {
                                                "val": "Will continue the modernization of previously fielded mission planning software environments for Special Mission Air Combat Command platforms (SM-ACC), the E-3, E-8, E-4, EC-130, and RC-135. Begin activities for modernization of the MAF MPE to include C-5, C-17, C-130s, C-27, KC-10, KC-135, and KC-46 platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF, PE 0208006F, Mission Plann..."
                                    },
                                    "Title": {
                                        "val": "-"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.426"
                                        },
                                        "CurrentYear": {
                                            "val": "8.819"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.808"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.808"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.678"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.011"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.761"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.127"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Mission Planning Systems (MPS) Modernization utilizes an evolutionary acquisition approach to develop and deliver an interoperable, network-centric, mission planning system tailored for numerous Air Force platforms using competition and multiple contract vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_675380_0.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_675380_1.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "F-15 v3.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15 v3.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15 v3.2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15 v4.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 30 SCU 8 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 30 SCU 9 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 40\/50 M6.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 40\/50 M6.5 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 40\/50 M7.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-22 v13.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "A-10 Suite 8 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 6 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 7 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 8 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 9 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 10 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMC Modernization C-5 AMP Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMC Modernization Tankers Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMC Modernization Airdrop Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC E-3 \/ E-8 Release 2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC EC-130H Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC E-3 \/ E-8 Release 3 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC RC-135 Release 3 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC EC-130H Release 2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC E-3 \/ E-8 Release 4 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC EC-130H Release 3 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}