{
    "id": "28430aa9b7879257cb970c1b4838718eb666d850",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602236N"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Sustainment Applied Res"
        },
        "R1LineItemNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "109.716"
            },
            "CurrentYear": {
                "val": "101.072"
            },
            "BudgetYearOne": {
                "val": "44.127"
            },
            "BudgetYearOneBase": {
                "val": "44.127"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "45.420"
            },
            "BudgetYearThree": {
                "val": "45.098"
            },
            "BudgetYearFour": {
                "val": "42.397"
            },
            "BudgetYearFive": {
                "val": "42.615"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Applied Research (PE 0602750N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.2 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE supports the Future Naval Capabilities (FNCs) of Littoral Combat\/Power Projection, Capable Manpower, Force Health Protection Future Capability, Seabasing and Enterprise and Platform Enablers (EPE) FNC; and innovation-based efforts that will provide technology options for future Navy and Marine Corps capabilities.  Efforts focus on manpower and personnel; naval systems training; littoral combat and power projection capabilities; advanced naval materials; medical technologies; environmental quality; biocentric technologies; high speed sealift; cost reduction technologies; and seabasing technologies.  Within the Naval Transformation Roadmap, this investment supports eight transformational capabilities within the \"Sea Strike\", \"Sea Shield\", and \"Sea Basing\" operational concepts; the critical human system, \"Sea Warrior\"; and Naval business efficiencies within \"Sea Enterprise.\"\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "113.724"
                },
                "CurrentYear": {
                    "val": "101.205"
                },
                "BudgetYearOne": {
                    "val": "94.994"
                },
                "BudgetYearOneBase": {
                    "val": "94.994"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "109.716"
                },
                "CurrentYear": {
                    "val": "101.072"
                },
                "BudgetYearOne": {
                    "val": "44.127"
                },
                "BudgetYearOneBase": {
                    "val": "44.127"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.008"
                },
                "CurrentYear": {
                    "val": "-0.133"
                },
                "BudgetYearOne": {
                    "val": "-50.867"
                },
                "BudgetYearOneBase": {
                    "val": "-50.867"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.133"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.488"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.897"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-51.596"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-51.596"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.729"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.729"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.623"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Sustainment Applied Res"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "109.716"
                        },
                        "CurrentYear": {
                            "val": "101.072"
                        },
                        "BudgetYearOne": {
                            "val": "44.127"
                        },
                        "BudgetYearOneBase": {
                            "val": "44.127"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "45.420"
                        },
                        "BudgetYearThree": {
                            "val": "45.098"
                        },
                        "BudgetYearFour": {
                            "val": "42.397"
                        },
                        "BudgetYearFive": {
                            "val": "42.615"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE supports the FNC's of Littoral Combat\/Power Projection, Capable Manpower, Force Health Protection Future Capability, Enterprise and Platform Enablers (EPE) FNC; and innovation-based efforts that will provide technology options for future Navy and Marine Corps capabilities. Efforts focus on manpower and personnel; Naval systems training and education; human systems integration; littoral combat and power projection capabilities; advanced naval materials; medical technologies; environmental quality; biocentric technologies; high speed sealift; cost reduction technologies; and Sea Basing technologies. Within the Naval Transformation Roadmap, this investment supports eight transformational capabilities within the \"Sea Strike\", \"Sea Shield\", and \"Sea Basing\" operational concepts; the critical human\nsystem, \"Sea Warrior\"; and Naval business efficiencies within \"Sea Enterprise.\"\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ADVANCED NAVAL MATERIALS"
                                    },
                                    "Description": {
                                        "val": "Advanced Naval Materials efforts include: developing advanced, high-performance materials; processes to reduce weight and cost; and enhanced sonar transducers.\n\nThe Office of Naval Research Global (ONRG) has a presence overseas to search the globe for promising, emerging scientific research and advanced technologies to enable the Office of Naval Research to effectively address current needs of the Fleet and Force. This includes discovering the best science such as innovative fundamental research which could help shape future naval investments and strategies, leveraging great minds globally with positive engagement to support the Sailors & Marines of today and tomorrow. \n\nFY 2011 and FY 2012 funding increase is to support FNC EPE-FY11-01 Flight Deck Thermal Management. \n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Enterprise and Platform Enablers.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.035"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued multi-laser-processing technique development for the fabrication of ultra hard materials for wear resistance\napplications.\n- Continued development of advanced, cost-efficient joining of titanium for >25% weight reduction of large seaborne structures.\n- Continued development of advanced composites and polymers with fire resistance for ship structures.\n- Continued development of nanotube reinforced composite materials for next generation air and naval platforms.\n- Continued development of acceptance testing methodologies for advanced transducer single-crystal high-strain materials and definition of standardized materials properties and composition ranges.\n- Continued development of compositional tuning of single-crystal, high-strain transducer materials, for specialized naval system applications.\n- Continued development of cavitation resistant ship rudder coatings based on the FY 2004 shipboard coating study.\n- Continued marine titanium alloy design and processing development, exploiting anticipated cost reductions for high performance, reduced maintenance naval applications.\n- Continued development of continuous single wall carbon nanotube composite materials for next generation air and naval platforms.\n- Continued stainless steel carburization study to enhance corrosion performance.\n- Continued development of surface preparation methods and characterization of corrosion performance for future naval ship materials.\n- Continued evaluation of low temperature carburized materials for marine application.\n- Continued development of coating performance and knowledge database for Naval use.\n- Continued development of mechanistic model for stress corrosion cracking in Nickel Aluminum Bronze (NAB).\n- Continued friction stir welding development for control of residual stresses and elimination of distortion in naval steels.\n- Continued development of innovative sonar transducers based on high-strain, high-coupling piezoelectric single crystals.\n- Continued development of integrated structural composites with blast resistance, manufacturing technologies, and low-cost organic resins with improved fire resistance.\n- Continued development of novel processing technologies for increasing the fatigue strength and corrosion resistance of weldments for ship structures with reduced weight and maintenance requirements.\n- Continued development of materials processing methods for single crystal piezoelectrics to make strong, robust sonar transducers.\n- Continued development of models and characterization methods for dynamic loading (water slamming and blast loading) in polymer composite materials.\n- Continued acoustic damping coatings for ship tank application.\n- Continued development of portable, real-time, Non-Destructive Examination (NDE)\/Non-Destructive Inspection (NDI) technology for heat damage detection in composite materials.\n- Continued development of fiber-optic Bragg grating sensor and demodulation technology system for structural health\nmonitoring of ships and submarines.\n- Continued development of continuous based monitoring techniques of new synthetic fuels and lubricants based on electromagnetic signature analysis.\n- Continued development and application of distributed fiber optic Bragg gratings for structural health monitoring of ships and aircrafts.\n- Continued development of novel growth methods to specialized single crystal transducer materials tuned to requirements of specialized naval systems.\n- Continued assessment of the degree of sensitization potential of marine grade Al alloys.\n- Continued investigation of criteria for stable pitting of stainless steel.\n- Continued development of surface assessment technologies to measure surface profile and chlorine.\n- Continued evaluation of advanced material coating for erosion control on helicopter main rotor blade leading edges.\n- Continued development of seamless joining technologies for large, complex shaped conventional ceramic windows from small, inexpensive components using electrophoretic deposition of ceramic nanoparticles.\n- Continued development of intelligent corrosion sensor systems for intergranular corrosion cracking.\n- Continued studies on fuel cell corrosion.\n- Continued development of superhydrophobic surface modification technology.\n- Continued studies on mitigation of pitting corrosion and stress corrosion cracking in marine aluminum alloys.\n- Completed development of compositional tuning of single-crystal, high-strain transducer materials, for specialized naval system applications.\n Completed development of new 3D mechanical characterization technique for polymer composites based on dissipative energy density principles.\n- Initiated development of quantitative coating quality assurance tools.\n- Initiated development of surface tolerant coating removal methods.\n- Initiated development of processing technologies to fabricate piezoelectric single crystals into complex\ntransducer assemblies.\n- Initiated development of thermal management system(s) to arrest excessive heat fluxes and loads on amphibious ship by advanced Naval\/USMC aircraft.\n- Initiated development of MEMS based sensor nodes, with energy harvesting and wireless communication capabilities, for system health management and prognosis.\n- Initiated development of high-strength, high-hardness tool materials for friction-stir welding applications.\n- Initiated development of the rational engineering design of Al-alloys for naval applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.159"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above.\n- Complete friction stir welding development for control of residual stresses and elimination of distortion in naval steels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.274"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.274"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as completed above.\n- Complete development of materials processing methods for single crystal piezoelectrics to make strong, robust sonar transducers\n- Complete development of advanced composites and polymers with fire resistance for ship structures\n- Complete development of nanotube reinforced composite materials for next generation air and naval platforms.\n- Increase emphasis on research efforts to discover innovative fundamental technologies to shape future Naval   investments and strategies, leveraging the globe to support the Sailors & Marines of today and tomorrow."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BIOCENTRIC TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Biocentric technologies provide novel solutions for naval needs based upon the applications of bio-inspiredsensors, materials, processes and systems. Topic areas include, but are not limited to development of biologically-based signal processing for medical, surveillance and security applications; bioinspired robotics; synthetic biology to produce high-value naval materials or to develop sentinel organisms, and marine mammal diagnostics to support the Navy's Fleet Marine Mammal Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of innovative naval biosensors, biomaterials, and bioprocess technology\n- Continued efforts on naval biosensor to detect brain structures and blood vessels through skull bones.\n- Continued engineering development and optimization of sea-floor sediment energy harvesting system for sustainable and\nautonomous powering of underwater sensor networks and AUV's\n- Continued efforts on advanced biomimetic sensing and neural control for human-robot interaction to enable effective\ncollaboration of warfighters and autonomous systems.\n-Continued integration of biomimetic sonar with bioinspired autonomous undersea vehicles (with high-lift propulsors) to achieve closed loop control.\n- Continued efforts in bioinspired quiet, and maneuverable self-propelled line array using high-lift propulsors based on animal wing and fin biomechanics.\n- Continued effort to develop living fluidic networks.\n- Continued\/Completed development of a second set of molecular diagnostic tests for recently discovered viral, bacterial, and fungal pathogens of marine mammals.\n- Continued\/Completed marine mammal diagnostics efforts, including the characterization of the dolphin fore-stomach microbial community, identification of probiotic immunostimulating species and immunobioassays for stress and infection detection.\n- Completed research for detection or mitigation of microbes or compounds of naval relevance in various settings.\n- Initiated long duration, realistic field tests, and  modeling studies of autonomous microbial fuel cell power systems for underwater sensor networks.\n- Initiated efforts for bio-inspired massively parallel vision systems.\n- Initiated effort to evaluate breath analysis for non-invasive diagnostics in marine mammal medicine."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.292"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above.\n- Initiate studies to evaluate candidate probiotics in Atlantic bottlenose dolphins."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.718"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.718"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012.\n- Initiate studies of microbial fuel cells for expeditionary applications.\n- Initiate studies to develop brain-based intelligent systems to support high level interaction between warfighters and autonomous systems.\n- Initiate studies of dolphin regenerative cells for treating a variety of pathologies and disease states in these animals.\n- Initiate synthetic biology studies of engineered sentinel organisms for environmental surveillance.\n- Initiate efforts to detect, treat, and prevent diseasese in dolphins."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "COST REDUCTION TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Cost Reduction Technology efforts include: developing ultrareliable materials and sensors to reduce cost by enabling condition-based and zero maintenance capabilities; and airframe and ship corrosion efforts for advanced cost effective prevention and life cycle management technologies. This activity includes the Navy's share of the Versatile, Affordable, Advanced Turbine Engine (VAATE) program for materials. Investments under this activity were previously reported under Advanced Naval Materials and were broken out to provide improved clarification of the overall investment scope. \n\nFY 2011 to FY 2012 funding increase is due the Corrosion Mitigation Technologies and Design Integration and Integrated Hybrid Structural Management System FNC new start efforts.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Enterprise and Platform Enablers.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.211"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of ceramic matrix composite turbine blades for gas turbine engines.\n- Continued development of cavitation resistant ship rudder coatings.\n- Continued development of durable alloys and materials for shipboard and aircraft gas turbine engines\nand spallation-resistant thermal barrier coatings for shipboard\/aircraft marine gas turbine hot sections.\n- Continued development of advanced materials and processes for high temperature marine turbine disks and combustors.\n- Continued development of oxidation and vanadium\/sulfate-resistant high temperature coatings for shipboard\/aircraft gas turbine engines.\n- Continued development of calcium magnesium aluminum-silicate (CMAS)-resistant coatings for ceramic matrix composites.\n- Continued development of high temperature organic matrix composites.\n- Continued development of low-platinum and platinum-free aluminide coatings that are phase compatible with turbine blade alloys and exhibit low oxidation rates.\n- Continued efforts to assess manufacturing issues and reliability of ceramic matrix composites for turbine engines.\n- Continued development of materials processing for future gas turbine molybdenum-based alloys.\n- Continued efforts to conduct warfighter sustainment applied research, including technology management of investments supporting the naval enterprise and naval capability pillars.\n- Continued efforts to perform technology analyses to support the development and validation of FNC technology performance metrics for enabling capabilities structured to close naval capability gaps.\n- Continued efforts to assess technology options for the development of applied FNC technologies packaged into deliverable science and technology products.\n- Continued applied research and development of improved coatings for (1) non-skid surfaces, (2) ship rudders, (3) high performance ship topsides, and (4) high performance airfield pavements.\n- Continued analytical model and reduced scale component development of shipboard compact power conversion technologies for multi-function motor drives, bi-directional power conversion modules, and power management controllers, focusing on closing technology gaps associated with Alternative Integrated Power System Architectures.\n- Continued applied research in determining lifting of hot section materials exposed to alternative synthetic fuels and petroleum-synthetic fuel blends.\n- Continued applied research development of Calcium Magnesium Aluminum-Silicate (CMAS)-resistant coatings for molybdenum-base alloys.\n- Continued life prediction research for modeling of hot section gas turbine materials, including blades, in mixed naval environments.\n- Continued development of an Adaptive Expert System to automatically and rapidly analyze aircrew performance (1M+ flight hours annually) to detect human factors related mishap leading indicators using a new technique with anomaly detection and corroboration.\n- Continued durable environmental barrier coatings for 2700F ceramic-matrix composites.\n- Continued research on Nb-Cr-Si alloys for improved corrosion resistance at high temperatures.\n- Continued, developed and applied emerging technologies that support delivery of Navy approved FNC enabling capabilities structured to close operational capability gaps in warfighter sustainment.\n- Continued package emerging warfighter sustainment technologies into deliverable FNC products and ECs that can be integrated into acquisition programs within a five year period.\n- Continued and developed mature warfighter sustainment technologies that support naval requirements identified within the Naval Power 21 capability pillars.\n- Continued development of novel seawater pretreatment strategies to optimize performance of prefiltration membranes (microfiltration or ultrafiltration membranes or filters).\n- Continued further development of novel high flux and chlorine resistant reverse osmosis membranes.\n- Completed development of high temperature foil bearing coatings for aircraft engine weight reduction.\n- Completed integrated development of durable thermal barrier coating system with various bond coats for naval aircraft gas turbine hot section.\n- Initiated research and development of ceramic matrix composite vanes for Naval aircraft.\n- Initiated applied research on radiation barrier coatings.\n- Initiated development of 1500F capable disk coatings.\n- Initiated development of advanced ASGS (Active Shaft Grounding System) with integrated shaft current sensing and extremely low frequency electromagnetic (ELFE) control.\n- Initiated development of novel ICCP (Impressed Current Cathodic Protection) anodes, reference cells and sensors with high Mean Time Between Failure(MTBF).\n- Initiated development of dual-use ICCP and novel sensor technology for CBM and closed-loop deamping to extend hull\/ballast coating longevity and reduce recalibration frequency.\n- Initiated applied research in modeling and simulation to identify key corrosion drivers and target problem areas for material modification and improved barrier dielectrics.\n- Initiated development of spatial corrosion recognition and diagnostic models for hull, ballast tanks and propulsor condition.\n- Initiated\/completed systems analysis efforts to identify and prioritize critical, relevant variable\/adaptive cycle propulsion system technologies and development plans\/approaches.  The outcome of these analyses will provide essential information supporting initiation of the Variable Cycle Advanced Technology (VCAT) Program in FY 2012 (see PE 0602123N).\n- Initiated development of durable lift fan alloy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.036"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011 less those noted as completed above.\n- Complete applied research development of Calcium Magnesium Aluminum-Silicate (CMAS)-resistant coatings for molybdenum-base alloys.\n- Complete research on Nb-Cr-Si alloys for improved corrosion resistance at high temperatures.\n- Complete applied research on radiation barrier coatings.\n- Complete development of ceramic matrix composite turbine blades for gas turbine engines.\n- Initiate applied research in wireless energy harvesting sensors, architecture, and diagnostics for rotorcraft structural health management.\n- Initiate development of sprayable acoustic damping systems for submarines to significantly reduce weight and costly maintenance procedures and increase operational readiness.  \n- Initiate development of low temperature carbon supersaturation (LTCSS) technology to incorporate improved corrosion resistance and surface hardness to materials in erosion-corrosion environments. \n- Initiate development of algorithms to incorporate into design module for corrosion prevention to predict the occurrence of corrosion and provide alternative solutions for use in component and system design.\n- Initiate development of Distributed Structural Microsensor technologies that allow more accurate health assessment of metal and composite structure on rotary wing vehicles.\n- Initiate development of Rotor\/Hot Spot Sensors & Integration technologies that allow more health assessment of rotating frame and selected structural hot spots."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENVIRONMENTAL QUALITY"
                                    },
                                    "Description": {
                                        "val": "Environmental Quality technologies enable sustained world-wide Navy operations in compliance with all local, state, regional, national and international laws, regulations and agreements, and support the Navy Transformational Roadmap in the areas of Sea Basing, Sea Strike and Sea Warrior. Compliant operations enable training evolutions and exercises that are critical for maintaining readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.028"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of advanced environmentally sound technologies for shipboard waste treatment and pollution abatement systems.\n- Continued development and modifications to shipboard oily waste treatment systems to accommodate processing of synthetic lubricants.\n- Continued field evaluation of prototype robotic Hull BUG to identify gaps needed to refine and advance the technology.\n- Continued efforts on ballast tank and system design optimization that minimize fuel discharges from compensated systems, minimize sedimentation in clean ballast and compensated ballast tanks, and maximize exchange of organisms during ballast tank exchanges.\n- Continued efforts on solids separation\/removal from shipboard liquid waste streams.\n- Completed field evaluation of prototype robotic Hull BUG and transition to FNC program.\n- Initiated efforts on improved handheld, waterborne, underwater hull cleaning technologies.\n- Initiated studies on oil emulsion issues and development of novel bilge water treatment systems on existing and new ships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.151"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012.\n- Complete efforts on solids separation\/removal from shipboard liquid waste streams.\n- Complete development and modifications to shipboard oily waste treatment systems to accommodate processing of synthetic lubricants."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN SYSTEMS DESIGN"
                                    },
                                    "Description": {
                                        "val": "This activity supports the warfighter by designing affordable user-centered systems that are efficient, easy to use, and provide required mission capabilities at lowest lifecycle costs. Such systems will be optimally designed for the right number and types of personnel, requiring minimum training while providing high skills retention.\n\nCongressional, DoD, and Navy policies and instructions require the Navy and Marine Corps to have a comprehensive plan for Human Systems Design (HSD) in the acquisition process to optimize total system performance, minimize total ownership costs, and ensure the system is built to accommodate the characteristics of the user population that will operate, maintain, and support the systems.\n\nThe increase in funding from FY 2011 to FY 2012 reflects the planned initiation of a new project and the planned funding profile of the other projects in this activity.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Capable Manpower.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.084"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research into operational constructs, processes, methods, and software specifications to merge the full spectrum of Human Systems Engineering into the Navy's standards based, open-architecture, Integrated Product Data Environment.\n- Continued research to develop and demonstrate automation and human interface technologies to support collaborative decision making in which multiple unmanned system operators manage groups of vehicles with optimal manning.\n- Continued research into mission performance optimization encompassing task centered design and advanced human performance modeling for achieving the requisite manning, both in numbers and capabilities, for the complex ships and systems of the future fleet.\n- Continued research into improving the capability to fuse imaging, electronic warfare, inorganic and acoustic sensor inputs into integrated, fused, and intuitive displays that enhance the presentation and command understanding of uncertain information.\n- Completed research into technologies and strategies for significantly improving on-board training and performance measurement for improving submarine command team decision making and overall submarine team performance and resilience.\n- Completed research to develop and demonstrate automation and human interface technologies to support collaborative decision-making in which multiple unmanned system operators manage groups of vehicles with optimal manning.\n- Initiated research into the impact of incorporating environmental stressors (fatigue, motion, vibration and extreme temperatures) into systems engineering tools for the development for complex Navy systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.016"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011 less noted as completed above.\n- Complete research into operational constructs, processes, methods, and software specifications to merge the full spectrum of Human Systems Engineering into the Navy's standards based, open-architecture, Integrated Product Data Environment.\n- Complete research into mission performance optimization encompassing task centered design and advanced human performance modeling for achieving the requisite manning, both in numbers and capabilities, for the complex ships and systems of the future fleet."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LITTORAL COMBAT \/ POWER PROJECTION"
                                    },
                                    "Description": {
                                        "val": "This activity provides for technologies that enhance the ability of the Navy-Marine Corps team to assure access and sustained operations in the Littorals. The FNC Program considers all the critical functions of warfighting: command, control, communications, computers, intelligence, surveillance, and reconnaissance (C4ISR); fires; strike; maneuver; sustainment; and fleet\/force protection. This activity includes technical assessments and trade studies for FNC Enabling Capabilities that transition high priority technologies to the Navy and Marine Corps in support of the Sea Strike, Sea Shield, Sea Basing, and ForceNet Naval Power 21 pillars as well as Enterprise and Platform Enabling Science and Technology requirements.\n\nThe increase from FY2011 to FY2012 is due to increase in the Modular Photonics Mast Housing and Compact Low Light Level SWIR Video Camera FNC efforts.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Enterprise and Platform Enablers and FNC Management.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.184"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued efforts to assess technology options for the development of applied FNC technologies packaged into deliverable S&T products.\n- Continued development of technologies to reduce the load of warfighters by 1) reducing the weight of and improving the capability of the day\/night weapon sight, 2) eliminating battery incompatibility, and 3) providing GUI-based software for tradeoff analyses bases on Military Operational Posture.\n- Continued research to develop technology to reduce fabrication and life cycle costs of SSN\/SSGN next generation photonics mast and to improve SSN surface situational awareness through faster image acquisition rates, improve range performance under adverse weather conditions and improve autonomous detection and classification.\n- Continued efforts to assess technology options for the development of applied research for FNC technologies, to include preparation of detailed technology specifications and  performance metrics, packaged into deliverable S&T products for enabling capabilities structured to close naval capability gaps."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.598"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANPOWER\/PERSONNEL"
                                    },
                                    "Description": {
                                        "val": "These technologies enhance the Navy's ability to select, assign, and manage its people by responding to a variety of requirements, including: managing the force efficiently and maintaining readiness with fewer people and smaller budgets; providing warfighting capabilities optimized for low-intensity conflict and littoral warfare; and operating and maintaining increasingly sophisticated weapons systems while managing individual workload and supporting optimal manning.\n\nThis activity further supports the warfighter by providing enhanced capabilities by designing affordable user-centered systems that are efficient, easy to use, and provide required mission capabilities at lowest lifecycle costs. Such systems will be optimally designed for the right number and types of personnel, requiring minimum training while providing high skills retention.\n\nThe reduction in funding from FY 2011 to FY 2012 reflects realignment of resources for other Navy priorities.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Capable Manpower.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.306"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research into decision support tools to better enable meeting the goals of the Navy's evolving strategies for personnel and manpower management and especially to evaluate manpower alternatives.\n- Continued research into intelligent agents to empower total force members to make training and assignment choices that\nenhance their careers and meet personal goals.\n- Continued research into agent-based simulations for enhancing the effectiveness of behaviorally-based predictive models.\n- Continued research into supporting technologies for a prototype decision support system to enable community management\nprogram analysts to better forecast and assess the effects of active duty enlisted and officer behavior resulting from both proposed and current policy decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.191"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MEDICAL TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This program supports the development of field medical equipment, diagnostic capabilities and treatments; technologies to improve warfighter safety and to enhance personnel performance under adverse conditions; and systems to prevent occupational injury and disease in hazardous, deployment environments. Navy investment in these areas is essential because Navy\/USMC mission needs are not adequately addressed by the civilian sector or other Federal agencies. For example, civilian emergency medicine does not address casualty stabilization during long transit times to definitive care. The National Institutes of Health (NIH) focuses on the basic science of disease processes and not applied research related to development. Programs are coordinated with other Services through the Armed Services Biomedical Research Evaluation and Management (ASBREM) Committee, and Joint Technical Coordinating Group (JTCG) process, to prevent duplication of effort. This project funds the Force Health Protection FNC that will provide technology options for future Navy and Marine Corps capabilities and supports the \"Sea Warrior\" component of the Naval Transformation Roadmap, medical logistics aspects of \"Sea Basing\" and expeditionary force medical support associated with \"Sea Strike\".\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Force Health Protection.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.455"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued program to develop enhanced First Responder capabilities.\n- Continued program to develop enhanced Forward Resuscitative Surgical capabilities.\n- Continued program to develop enhanced En Route Care capabilities.\n- Continued efforts to mitigate the effects of environmental and other threats to health.\n- Continued program, with Army, in regenerative medicine (Armed Forces Institute for Regenerative Medicine (AFIRM)).\n- Continued efforts to reduce operational injuries.\n- Continued efforts to reverse NIHL.\nContinued studies on decompression sickness (DCS) and arterial gas embolism (AGE), to include novel approaches to the prevention, detection and treatment of DCS\/AGE, particularly by nonrecompressive methods.\n- Continued efforts to develop prophylactic agents preventing hyperbaric oxygen toxicity. Prolonged exposure to hyperbaric oxygen can be toxic to lungs, nervous system and eyes.\n- Continued efforts to assess the impact of thermal (i.e., heat and cold) stress on operational performance. Underwater thermal extremes can affect diver performance and alter risk of incurring decompression sickness.\n- Continued studies related to optimization of diver performance. Operational performance in the undersea environment can be hampered by a variety of environmental stressors.\n- Continued studies related to optimization of submariner health and performance. Submarine crewmembers are exposed to a variety of unique stressors including prolonged deployments, effects of altered diurnal rhythms, non-standard breathing gases, lack of sunlight, etc that can impact health and performance.\n- Continued studies related to biomedical effects of underwater sound. Military divers must operate safely and effectively in potentially complex underwater sound fields.\n- Continued efforts for \"stress inoculation\" to mitigate the impact of exposure to stressful combat environments prior to deployment.\n- Continued efforts to develop advanced technologies to support Rapid Blood Treatment.\n- Continued efforts to develop advanced technologies to support Warfighter Restoration. \n- Continued efforts to model accelerated head and neck injuries; operational injuries.\n- Continued research to reduce noise at the source, i.e. jet engine quieting and flight deck noise reduction.\n- Continued research to study the incidence and susceptibility of Noise Induced Hearing Loss (NIHL) and tinnitus, and to evaluate mitigation strategies.\n- Continued research in medical prevention and treatment of NIHL and tinnitus (ringing in the ears).\n- Continued research to improve personal protective equipment technology.\n- Continued research to develop a Human Injury and Treatment (HIT) model for predicting outcomes of personnel exposure to shipboard damage.\n- Continued and develop mature force health protection technologies that support naval requirements identified within the Navy and Marine Corps.\n- Completed safety studies and analysis of compartmental shipboard heat exposure levels; environmental threats to health.\n- Initiated development of multifunctional blood substitute program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.457"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011.\n- Initiate Jet Noise Reduction Project, Noise Induced Hearing Loss Program, to utilize analytical modeling and simultion tools anchored by experiment to develop and assess solutions enabling mitigation of jet induced noise from high performance tactical aircraft.\n- Initiate development of the Automated Critical Care System (ACCS).\n- Initiate research on Perfluorocarbon-based treatments for explosive blast injuries and hypoxia and lung damage from extreme environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.109"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.109"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA BASING TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This activity includes development and advancement of technologies to support Seabasing. Areas include: advanced hull forms, propulsion, and materials to support high speed, shallow draft, and beachable connectors; innovative connector interface and transfer technologies; advanced wave and position sensors and autonomous controls to support vessel to vessel interfaces; and autonomous conveyance systems to support automated and integrated warehousing.\n\nThe decrease in funding from FY 2011 to FY 2012 is due to the completion of T-CRAFT scale technology demonstration articles.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Sea Basing.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.276"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Sense and Respond Logistics (S&RL) research in: battlefield fuel management; decision support systems for S&RL; emergent intelligence\/intelligent agents for S&RL; and advanced sensors\/processes for S&RL.\n- Continued efforts for the development of technologies supporting automated shipboard assembly of air-delivered weapons.\n- Continued multiple INP contracts for preliminary designs in the area of a T-CRAFT and a Rapidly Deployable Seabasing Stable Transfer Platform.\n- Continued the construction of a scaled model of a Rapidly Deployable Stable Transfer Platform demonstrator.\n- Continued a second evaluation of potential Seabasing INP efforts.\n- Continued the down-selection of Sense and Respond Logistics Information Architecture prototype development.\n- Continued contract design and develop shipyard building plans for T-CRAFT prototype and component construction.\n- Continued procurement of components and material to support T-CRAFT prototype construction.\n- Continued development of agent based decision support and logistics planning algorithms.\n- Completed T-CRAFT scale technology demonstration articles.\n- Initiated development of a detailed technology demonstration plan.\n- Initiated T-CRAFT technology demonstration component construction. \n- Initiated the modeling and simulation of first article prototypes of Sense and Respond demonstration systems; Logistics Common Operating Picture, Decision Support Tools, Prognostics Embedded Health Management, Macro Fuel Quantity Management, Portable Fuel Quality Analysis.\n- Initiated development of the Connectors and the Sea Base Enabling Capability including Environmental Ship Motion Forecasting and Advanced Mooring System Technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.233"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above.\n- Complete testing and integration of Sense & Response Logistics Common Operating Picture.\n- Initiate model testing of Advanced Mooring System and planning of at-sea demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Training technologies enhance the Navy's ability to train effectively and affordably in classroom settings, in simulated environments, while deployed, and to operate effectively in the complex, highstress, information-rich and ambiguous environments of modern warfare such as asymmetric warfare. Technology development responds to a variety of requirements, including providing more affordable approaches to training and skill maintenance. Improved training efficiency and cost-effectiveness is achieved by applying operations research, modeling and simulation, and instructional, cognitive, and computer sciences to the development, delivery, evaluation, and execution of training.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Capable Manpower.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 into the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.541"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research and assessment of advanced gaming technology for enhanced training.\n- Continued research into game based training to more effectively enable better warfighter understanding of languages and cultures to enhance their regional expertise.\n- Continued creation and conduct of experiments to validate automated performance assessment and after action reviews.\n- Continued a systematic program of applied research addressing unanswered questions regarding effective instructional\nstrategies in artificially intelligent tutoring.\n- Continued research on software tools to facilitate building natural language tutorial dialogs for artificially intelligent tutoring.\n- Continued task to develop multi-agent based architectures for modeling human behavior, improve techniques for human\ncognitive and behavioral modeling, and create highly realistic simulated teammates.\n- Continued field studies and user tests evaluating new features and job aiding tools.\n- Continued research to create computational models of human behavior in selected non-Western environments that reflect the dominant cultural, social, ethnic, and economic determinants of behaviors, attitudes, and beliefs of individuals, groups, and organizations operating in these environments, and exploit these models to forecast responses to our actions and those of others attempting to exert influence in these environments.\n- Continued research into computational neuron-models in the design of training systems\n- Continued the integration of cognitive and neuron-computational models of human learning.\n- Continued research into intelligent tutoring systems for adaptive competency in submarine bridge team and surface ship combat information center trainers.\n- Completed development of optimized strategies for performance aiding and training.\n- Completed development of virtual technologies for warfare training application.\n- Completed research and assessment of advanced gaming technology for enhanced training.\n- Completed creation and conduct of experiments to validate automated performance assessment and after action reviews.\n- Initiated research to identify the perceptual cues in the urban and dense infrastructure and environment that may improve warfighter performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.939"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011 except those noted as complete above.\n- Complete research into game based training to more effectively enable better warfighter understanding of languages and cultures to enhance their regional expertise.\n- Initiate development of simulation technologies to deliver safe, effective, and balanced live-virtual-constructive training to achieve meaningful training and readiness levels without the costs involved with only using live assets.\n- Initiate research to determine the improvement in recruit classification provided by the addition of measures of fluid intelligence and working memory. \n- Initiate research to understand the structural relations among the latent variables of short-term memory, working memory, executive attentional control, and fluid intelligence.\n- Initiate research on techniques to improve warfighter adaptability and resilience."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.111"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.111"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as completed above."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of varied efforts within this PE. For the most part these efforts support the FNC program. As such, each is monitored at two levels. At the lowest level each is measured against both technical and financial milestones on a monthly basis. Annually each FNC and its projects are reviewed in depth for technical and transition performance by the Chief of Naval Research against goals which have been approved by the Navy.\n\nThe FNC managers conduct routine site visits to performing organizations to assess programmatic and technical progress and most projects conduct an annual or biannual review by an independent board of visitors who assess the level and quality of the Science and Technology (S&T) basis for the project."
                        }
                    }
                }
            ]
        }
    }
}