{
    "id": "293b51158f7a5204bac6f495a50b16c5c1dd5f4a",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA7_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305204A"
        },
        "ProgramElementTitle": {
            "val": "Tactical Unmanned Aerial Vehicles"
        },
        "R1LineItemNumber": {
            "val": "181"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "38.049"
            },
            "CurrentYear": {
                "val": "26.508"
            },
            "BudgetYearOne": {
                "val": "31.303"
            },
            "BudgetYearOneBase": {
                "val": "31.303"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "16.860"
            },
            "BudgetYearThree": {
                "val": "12.163"
            },
            "BudgetYearFour": {
                "val": "19.647"
            },
            "BudgetYearFive": {
                "val": "10.876"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Project 114: Tactical Unmanned Aerial Vehicle (TUAV) Shadow 200 provides the Army Brigade Commander with dedicated Reconnaissance, Surveillance and Target Acquisition (RSTA), Intelligence, Battle Damage Assessment (BDA) and Force Protection. The Shadow provides the Brigade Commander with critical battlefield intelligence and targeting information in the rapid cycle time required for success at the tactical level. The TUAV Shadow system air vehicle meets the required operating range of 50 kilometers and remains on station for up to nine hours with the re-wing configuration. The TUAV Shadow system consists of four air vehicles (each configured with an Electro Optical\/Infrared (EO\/IR) sensor payload), launcher, ground control and support equipment including: power generation, communications equipment, automated recovery equipment, one system remote video terminals, vehicle mounted shelters, and High Mobility Multipurpose Wheeled Vehicles with trailer(s). Each system is equipped with one Maintenance Section Multifunctional (MSM) and is supported at the division level by a Mobile Maintenance Facility (MMF). \n\nProject 11A, The STARLite Synthetic Aperture Radar\/Ground Moving Target Indicator (SAR\/GMTI) payload is a lightweight, high performance, all weather, multi-functional radar system for the Gray Eagle Unmanned Aircraft System (UAS). The STARLite system provides wide area, near real time Reconnaissance, Surveillance and Target Acquisition (RSTA) capabilities. It operates throughout the UAS flight mission profile in adverse weather and through battlefield obscurants.  The Common Sensor Payload (CSP), an Electro Optical Infra Red w\/Laser Designator (EO\/IR\/LD) system, also for the Gray Eagle, provides a day\/night capability to collect and display continuous imagery with the ability to designate targets of interest for attack by laser guided precision weapons.  Additional initiatives will continue to focus on the transition of technologies directly supporting emerging requirements and the Army's Current and Future Force.  This effort has been expanded to include High Definition (HD) and Target Location Accuracy (TLA) capability.\n \nProject 11B, The Tactical Signals Intelligence (SIGINT) Payload (TSP) is a SIGINT sensor, currently under development for the Gray Eagle that detects radio frequency (RF) emitters. The TSP system will provide a SIGINT capability to the tactical commander.  The TSP system will be a modular, scalable payload using an architecture that is software reconfigurable to allow for growth and flexibility as technology, and as the adversaries use of technology, changes.  The TSP system improves situational awareness and shortens the targeting cycle by detecting and identifying emitters associated with high value targets (HVTs). The TSP system is capable of processing conventional signals, standard military signals, and modern signals of interest.\n\nProject 123:  The Unmanned Aircraft System (UAS) Joint Technology Center\/Systems Integration Laboratory (JTC\/SIL) is a Joint facility that develops, integrates, and supports the enhancement of its Multiple Unified Simulation Environment (MUSE) capability for Army systems and operational concepts.  The JTC\/SIL conducts prototype hardware and software development, builds the UAS Institutional Mission Simulator (IMS) trainers for the Shadow, Hunter, and ERMP programs, and provides modeling and simulation support. The MUSE is a real-time, operator in-the-loop simulation that may be integrated with larger simulations in support of Army and Joint training and exercises.  The MUSE is also employed as a Mission Rehearsal Tool for ongoing combat operations.  This project funds the management of the JTC\/SIL and MUSE enhancements. \n \nProject D10:  The Small Unmanned Aircraft System (SUAS) provides the battalion and below ground maneuver elements critical situational awareness and enhances force protection.  The system provides the small unit commander an organic and responsive tactical Reconnaissance, Surveillance, and Target Acquisition (RSTA) capability through the ability to view real-time Full Motion Video (FMV) and sensor data via the system ground control station.  Other compatible receivers, such as the One Station Remote Video Terminal (OSRVT) and appropriately equipped manned platforms may also receive the SUAS products.\n\nA SUAS includes three aircraft that must be launched by hand or by some other means that does not require an improved launch\/recovery location.  In addition to the aircraft, the system contains ground support equipment, which includes an interoperable hand controller.  This equipment is fully transportable in or on rucksack type packs that are organic to the unit.   \n\nThe SUAS RDT&E budget line includes funding for studies and incremental development\/upgrade of current SUAS capabilities that will capitalize on new technology insertions based on identified user requirements.  Past improvements include a Digital Data Link capability, introdu"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "54.300"
                },
                "CurrentYear": {
                    "val": "40.650"
                },
                "BudgetYearOne": {
                    "val": "15.681"
                },
                "BudgetYearOneBase": {
                    "val": "15.681"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "38.049"
                },
                "CurrentYear": {
                    "val": "26.508"
                },
                "BudgetYearOne": {
                    "val": "31.303"
                },
                "BudgetYearOneBase": {
                    "val": "31.303"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-16.251"
                },
                "CurrentYear": {
                    "val": "-14.142"
                },
                "BudgetYearOne": {
                    "val": "15.622"
                },
                "BudgetYearOneBase": {
                    "val": "15.622"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-16.251"
                                },
                                "CurrentYear": {
                                    "val": "-14.142"
                                },
                                "BudgetYearOne": {
                                    "val": "15.622"
                                },
                                "BudgetYearOneBase": {
                                    "val": "15.622"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "114"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Unmanned Aerial Vehicle (TUAV) (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.619"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funding shifts to PE 0305233A - RQ-7 UAV MODS, Project RQ7 in FY2011."
                        },
                        "ProjectMissionDescription": {
                            "val": "Tactical Unmanned Aerial Vehicle (TUAV) Shadow 200 provides the Army Brigade Commander with dedicated Reconnaissance, Surveillance and Target Acquisition (RSTA), Intelligence, Battle Damage Assessment (BDA) and Force Protection. The Shadow provides the Brigade Commander with critical battlefield intelligence and targeting information in the rapid cycle time required for success at the tactical level. The TUAV Shadow system air vehicle meets the required operating range of 50 kilometers and remains on station for up to nine hours with the re-wing configuration. The TUAV Shadow system consists of four air vehicles (each configured with an Electro Optical\/Infrared (EO\/IR) sensor payload), launcher, ground control and support equipment including: power generation, communications equipment, automated recovery equipment, one system remote video terminals, vehicle mounted shelters, and High Mobility Multipurpose Wheeled Vehicles with trailer(s). Each system is equipped with one Maintenance Section Multifunctional (MSM) and is supported at the division level by a Mobile Maintenance Facility (MMF). \n\nAll 102 Shadow UAS systems have been procured and 93 have been fielded. Shadow has amassed over 709,000 total flight hours, most of which were flown in support of Operation Iraqi Freedom (OIF) and Operation Enduring Freedom (OEF). The Shadow UAS began being deployed to OIF in 2003 and to OIF in 2006. Incremental upgrades are required for continued improvement and interoperability. Common Systems Integration is required to ensure interoperability with other manned and unmanned weapon systems, to include One System Remote Video Transceiver (OSRVT). Continued developmental improvements are required to provide greater interoperability, increase operational capability and flexibility to the Brigade Combat Team. Modifications to the airframe, avionics, payloads, ground control equipment, and support equipment are based on documented requirements and lessons learned units operating in OEF and OIF. \n\nJustification:  \n\nFY2013 RQ-7 UAV Base funding of $31.158 million will be used for Capability Improvements, specifically: Engine improvements (engine development), Air Vehicle modifications (small mission computer development, weatherization, improved fuel system (vented), GPS Denied Operations and redundant avionics development), and Ground Equipment (interoperability) improvements. Additionally, funds will be for System Engineering, Program Management, Software Architecture and Reliability Solutions and System Test and Evaluation support. Funds will also be used to conduct the Increment II OSRVT Limited User Test (LUT), and other applicable OSRVT test events."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Base: Block Upgrades \/ Capability Improvements"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.619"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Base: OIF Improvements \/ Block Upgrades \/ Capability Improvements"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RQ-7 UAV MODS (A00018)"
                                    },
                                    "Title": {
                                        "val": "RQ-7 UAV MODS (A00018)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "548.998"
                                        },
                                        "CurrentYear": {
                                            "val": "165.139"
                                        },
                                        "BudgetYearOne": {
                                            "val": "104.339"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "104.339"
                                        },
                                        "BudgetYearThree": {
                                            "val": "143.584"
                                        },
                                        "BudgetYearFour": {
                                            "val": "135.313"
                                        },
                                        "BudgetYearFive": {
                                            "val": "137.220"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "1379.383"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TUAV - Initial Spares"
                                    },
                                    "Title": {
                                        "val": "TUAV - Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.613"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RQ-7 UAV MODS - (Project RQ7)"
                                    },
                                    "Title": {
                                        "val": "RQ-7 UAV MODS - (Project RQ7)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.555"
                                        },
                                        "CurrentYear": {
                                            "val": "31.896"
                                        },
                                        "BudgetYearOne": {
                                            "val": "31.158"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "31.158"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.773"
                                        },
                                        "BudgetYearFour": {
                                            "val": "22.953"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.991"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "158.960"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A System Capability Demonstration (SCD) was conducted with four contractors.  The results from the SCD in conjunction with proposal evaluations resulted in the competitive down select of a Best Value TUAS.  A successful Milestone II ASARC was conducted 21 Dec 99 and a Milestone III Decision 25 Sep 02.  The full rate production contract was awarded 27 Dec 02, and all 102 systems were procured by FY2009.  Continued development of the selected TUAV system will be accomplished through a series of modifications and retrofits such as Tactical Common Data Link (TCDL), Communications Relay, Laser Designator, Larger engine, Larger fuselage, and reliability upgrades. Development\/integration of these improved capabilities will be through individual efforts on sole source cost-plus fixed fee engineering services contract with the Shadow prime contractor and competitive contracts.  Development of the larger engine will be accomplished through a competitive process."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM UAS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.677"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.677"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Base: OIF Improvements \/ Block Upgrades \/ Capability Improvements"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AAI Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hunt Valley, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "23.774"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Target Location Error (TLE) \/ TCDL \/ JTRS\/ Laser Designator"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AAI Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hunt Valley, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "52.200"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "52.200"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Re-Wing"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AAI Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hunt Valley, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.600"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Common System Integration (UCGS, Trainers, OSRVT)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AAI Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hunt Valley, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "23.206"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.206"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TUAS Heavy Fuel Engine"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AAI Corporation \/ Other"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hunt Valley, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.600"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "LALHAV"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AAI Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hunt Valley, MD \/ Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Shadow Encryption"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "29.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "29.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contractor Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Contractor"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "12.196"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.196"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Engineering and Logistics Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMRDEC \/ IMMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.758"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.758"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Engineering Support - Extended Range"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.760"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.760"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Rolling Take Off"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Activities"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.815"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.815"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development Testing \/ TCDL (Tactical Common Data Link)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Activities"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "12.235"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.235"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "11A"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Payload Develop & Spt (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.452"
                        },
                        "CurrentYear": {
                            "val": "15.910"
                        },
                        "BudgetYearOne": {
                            "val": "6.247"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.247"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.180"
                        },
                        "BudgetYearThree": {
                            "val": "7.386"
                        },
                        "BudgetYearFour": {
                            "val": "11.994"
                        },
                        "BudgetYearFive": {
                            "val": "3.094"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Tactical Unmanned Aerial Vehicles (TUAV) budget line is a shared funding line between multiple Payload programs.  These Payload programs support the Army's transformation by developing Reconnaissance, Surveillance and Target Acquisition (RSTA) and Intelligence, Surveillance and Reconnaissance (ISR) payload systems for brigade combat teams, divisions, and corps Unmanned Aircraft Systems (UAS).  This is in accordance with Headquarters Department of the Army (HQDA) and Training and Doctrine Command (TRADOC) UAS priorities.  \n\nSmall Tactical Radar - Lightweight (STARLite) Synthetic Aperture Radar\/Ground Moving Target Indicator (SAR\/GMTI) is a lightweight, high performance, all weather, multi-functional radar system for the Gray Eagle Unmanned Aircraft System (UAS). The STARLite system provides wide area, near real time Reconnaissance, Surveillance and Target Acquisition (RSTA) capabilities. It operates throughout the UAS flight mission profile in adverse weather and through battlefield obscurants. The SAR mode generates quality images for the battlefield commander for detection, classification and location of stationary commercial wheeled vehicle-size targets. The GMTI mode detects moving ground targets, provides location information and performs cross-cue with the Electro-Optic\/Infrared (EO\/IR) sensors. \n\nCommon Sensor Payload (CSP) - Electro Optical \/ Infra Red \/ Laser Designator (EO\/IR\/LD) provides day\/night capability to collect and display continuous imagery with the ability to designate targets of interest for attack by laser guided precision weapons.  It is the EO\/IR\/LD sensor for Gray Eagle UAS which supports force applications, battlespace awareness, force protection, and net-centric operations across the battlefield to provide wide area, near real time RSTA capabilities.   Additional initiatives will continue to focus on the transition of technologies directly supporting emerging requirements and the Army's Current and Future Force.  CSP is being procured for the Gray Eagle UAS program and has potential application to other platforms.  \n\nCSP High Definition (HD) is the first capability enhancement for the CSP which will provide the commander with HD Full Motion Video (FMV) in both the Electro-optical and Mid-wave IR spectrums for improved battlefield situation awareness and identification of high value targets.  All Gray Eagle platforms will be equipped with CSP HD.\n\nCSP Target Location Accuracy (TLA) is the final upgrade to the current capability and provides all of the CSP HD functionality but with significantly improved targeting accuracy.  CSP TLA provides the Battlefield Commander a vastly improved TLA allowing timely use of Joint Direct Attack Munitions (JDAMs) and Coordinate Seeking Weapons (CSWs) across the battlespace.  CSP TLA is being procured as an upgraded capability for the Gray Eagle UAS program and can be integrated onto other manned and unmanned aerial platforms.  All Gray Eagle platforms will be equipped with the CSP TLA capability.\n\nThe Tactical Signals Intelligence (SIGINT) Payload (TSP) is a SIGINT sensor, currently under development for the Gray Eagle that detects radio frequency (RF) emitters. The TSP system will provide a SIGINT capability to the tactical commander.  The TSP system will be a modular, scalable payload using an architecture that is software reconfigurable to allow for growth and flexibility as technology, and as the adversaries use of technology, changes. The TSP system improves situational awareness and shortens the targeting cycle by detecting and identifying emitter associated with high value targets (HVTs). The TSP system is capable of processing conventional signals, standard military signals, and modern signals of interest.\n\nFY 2013 base development dollars in the amount of $6.247 million is for the continued integration and test of the CSP HD upgrade as well as the initial pre-contract award efforts for TLA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CSP - EO\/IR\/LD"
                                    },
                                    "Description": {
                                        "val": "CSP Development, testing and final integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.379"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Final Testing"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CSP High Definition (HD) - EO\/IR\/LD"
                                    },
                                    "Description": {
                                        "val": "Development, testing and integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "CSP HD Support to NSWC Crane"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.281"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "CSP HD Development, testing and integration"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.567"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.567"
                                            },
                                            "Text": {
                                                "val": "Final CSP HD Development, testing, integration and program management support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CSP HD Target Location Accuracy (TLA) - EO\/IR\/LD"
                                    },
                                    "Description": {
                                        "val": "CSP Target Location Accuracy (TLA) - Non Recurring Engineering (NRE), design, build and test of seven CSP HDTLA integration and test assets."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.680"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.680"
                                            },
                                            "Text": {
                                                "val": "CSP HDTLA Contract prep work - RFP, SOW and Contract award for FY14 TLA development start"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STARLite ER (Extended Range) - SAR\/GMTI"
                                    },
                                    "Description": {
                                        "val": "STARLite (SAR\/GMTI) - Design, build, test and integrate 3 STARLite ER integration and test systems (Larger Antenna = Extended Range and Increased Reliability) onto the host platform (Gray Eagle)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.227"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Final testing, integration of the STARLite ER and final development of GMTI vehicle classification and Man-sized detection S\/W capability to be cut-in to production in FY12 timeframe"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.629"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalize testing events and integration onto host platform (Gray Eagle)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Signals Intelligence (SIGINT) Payload"
                                    },
                                    "Description": {
                                        "val": "Tactical Signals Intelligence (SIGINT) Payload"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.646"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Tactical Signals Intelligence (SIGINT) Payload"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0643774 131"
                                    },
                                    "Title": {
                                        "val": "NIGHT VISION SYS A\/DEV - 0603774A, 131"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.975"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "4.975"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0305204A 11B"
                                    },
                                    "Title": {
                                        "val": "Tactical Unmanned Aerial Vehicles - 0305204A, 11B"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.164"
                                        },
                                        "CurrentYear": {
                                            "val": "6.282"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.730"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.730"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.709"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.363"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.437"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "A00020"
                                    },
                                    "Title": {
                                        "val": "MQ-1 PAYLOAD - UAS - A00020"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "83.556"
                                        },
                                        "CurrentYear": {
                                            "val": "146.983"
                                        },
                                        "BudgetYearOne": {
                                            "val": "231.508"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "231.508"
                                        },
                                        "BudgetYearThree": {
                                            "val": "258.027"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.146"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.162"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "STARLite SAR\/GMTI is a threshold requirement for the Gray Eagle UAS.  The acquisition strategy for STARLite program was based on a full and open competition for the Army.  A five year competitive production contract was awarded in April 2008 to Northrop Grumman for the build, integration, test and delivery of STARLite systems with preplanned improvements for Extended Range and Increased Reliability.  STARLite will support the Gray Eagle UAS Initial Operational Test and Evaluation (IOT&E) event planned for 4th Quarter FY 2012.  No additional development dollars are planned for STARLite in FY 2013 as the program will be in Full Rate Production (FRP).\n\nCommon Sensor Payload (CSP) EO\/IR\/LD is a KPP (Key Performance Parameter) requirement for the Gray Eagle UAS.  The acquisition strategy for the CSP program was based on a full and open competition for the Army.  It was briefed and approved at the Army Systems Acquisition Review Council (ASARC) in Dec 2006.  A competitive contract was awarded in Nov 2007 to Raytheon for the build, integration, test and delivery of the CSP.  CSP will support the Gray Eagle UAS IOT&E event planned for 4th Quarter FY 2012.  No additional development dollars are planned for CSP baseline in FY 2013 as the program will be in FRP.  \n\nCSP High Definition (HD) is an upgrade to the baseline CSP program which is planned for final development, testing and integration in FY 2012. The development will conclude with a Developmental Test (DT) in early FY 2013 and a production cut-in decision will be briefed to the Milestone Decision Authority (MDA) prior to the FY 2013 CSP HD production buy.  A retrofit is also planned for award in FY 2013 to bring all of the previously procured CSP baseline systems up to the HD configuration.\n\nCSP TLA is a directed requirement for the Gray Eagle platform with enhanced capabilities addressed in the Joint Requirement Oversight Council Memorandum (JROCM 051-09).  The approved acquisition strategy for the development of this new capability is a sole source task order through the competitively awarded Navy Basic Order Agreement (BOA) with Raytheon that will provide seven integration and test assets.  These assets will be used to fully test and integrate this new capability onto the Gray Eagle platform.  Once the TLA upgrade has been fully integrated and tested, the program can enter Milestone C and begin production and replacement of the baseline CSP system.  The entire Gray Eagle fleet will be retrofitted to the CSP TLA variant."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Mgmt Personnel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM RUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.086"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.871"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.567"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.567"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PM ARES Funding for TSP"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM, ARES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.255"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.255"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.255"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "STARLite Extended Range (ER) (SAR\/GMTI)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Linthicum, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.786"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.786"
                                                    },
                                                    "TargetValue": {
                                                        "val": "6.786"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CSP EO\/IR\/LD"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McKinney, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "48.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "48.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "48.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CSP HD (High Definition)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC Crane"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.850"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.850"
                                                    },
                                                    "TargetValue": {
                                                        "val": "10.850"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CSP TLA - NRE, Build and Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC Crane"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.680"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.680"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Gray Eagle Integration Support (STARLite ER, CSP, HD & TLA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM UAS\/General Atomics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "20.344"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.191"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "STARLite ER (Extended Range) - SAR\/GMTI"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Linthicum, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "12.250"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.250"
                                                    },
                                                    "TargetValue": {
                                                        "val": "12.250"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CSP (EO\/IR\/LD)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.779"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.779"
                                                    },
                                                    "TargetValue": {
                                                        "val": "13.779"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CSP HD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC Crane"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.998"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.498"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.498"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CSP TLA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC Crane"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "CSP HD (EO\/IR\/LD)  Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CSP HD (EO\/IR\/LD)  Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CSP HD (EO\/IR\/LD)  Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CSP HD (EO\/IR\/LD)  Retrofit"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CSP TLA (EO\/IR\/LD) NRE\/Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CSP TLA (EO\/IR\/LD) Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CSP HD\/TLA (EO\/IR\/LD) Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "11B"
                    },
                    "ProjectTitle": {
                        "val": "TSP DEVELOPMENT (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.164"
                        },
                        "CurrentYear": {
                            "val": "6.282"
                        },
                        "BudgetYearOne": {
                            "val": "20.730"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.730"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.436"
                        },
                        "BudgetYearThree": {
                            "val": "2.709"
                        },
                        "BudgetYearFour": {
                            "val": "4.363"
                        },
                        "BudgetYearFive": {
                            "val": "4.437"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Tactical Signals Intelligence (SIGINT) Payload (TSP) is a SIGINT sensor, currently under development for the Gray Eagle that detects radio frequency (RF) emitters. The TSP system will provide a SIGINT capability to the tactical commander.  The TSP system will be a modular, scalable payload using an architecture that is software reconfigurable to allow for growth and flexibility as technology, and as the adversaries use of technology, changes.  This flexible architecture allows for third party software applications to be integrated into the TSP system.  The TSP system is a complementary system to the aerial and terrestrial Intelligence, Surveillance, and Reconnaissance (ISR) layers through direct interface with the Distributed Common Ground System-Army (DCGS-A) Information and Intelligence Enterprise (DI2E).  It supports Manned\/Unmanned (MUM) teaming with Brigade Combat Team ground SIGINT Terminal Guidance (STG) teams and manned airborne assets.  The TSP system improves situational awareness and shortens the targeting cycle by detecting and identifying emitters associated with high value targets (HVTs).\n\nThe TSP system is capable of processing conventional signals, standard military signals, and modern signals of interest.  This includes detection, recognition, identification, direction finding, and high confidence geo-location.  The TSP system operates in two modes, passive and active to provide an enhanced Aerial Precision Geolocation (APG) capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EMD NRE, Training Development, Other Licensing and Equipment"
                                    },
                                    "Description": {
                                        "val": "EMD NRE, Training Development, Other Licensing and Equipment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.164"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD NRE, Training Development, Other Licensing and Equipment. Awarded EMD contract"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.282"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD NRE(2), Training Development, Other Licensing and Equipment"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.730"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.730"
                                            },
                                            "Text": {
                                                "val": "Continued EMD NRE(2), Training Development, Other Licensing and Equipment"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0305204A 11A"
                                    },
                                    "Title": {
                                        "val": "NSA MIP (TSP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.520"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.669"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.669"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.795"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "22.779"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "A00020"
                                    },
                                    "Title": {
                                        "val": "MQ-1 Payload"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "83.600"
                                        },
                                        "CurrentYear": {
                                            "val": "147.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "231.500"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "231.500"
                                        },
                                        "BudgetYearThree": {
                                            "val": "258.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.100"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.200"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "989.900"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0305204A \/11A"
                                    },
                                    "Title": {
                                        "val": "Advanced Payloads Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.646"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "10.646"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "TSP is a threshold requirement for the MQ-1C Gray Eagle UAS. The TSP program entered the Engineering and Manufacturing Development (EMD) phase with a Milestone B decision in September 2011. The TSP Program EMD contract award was based on full-and-open competition and was focused on integration and test onto the Gray Eagle platform and integration and test of TSP software into the Distributed Common Ground System-Army (DCGS-A). The TSP EMD program is a derivative of systems that are currently fielded on the Hunter UAS and a variety of other manned platforms. The demonstrated scalability of these fielded materiel solutions allows the TSP EMD program to leverage efforts that directly support the TSP EMD program.\n\n\nThe TSP programs acquisition strategy has been modified to accommodate the FY 2012 Appropriation that reduces the 11B Funding Line by $14.100 Million. The TSP program is following an incremental acquisition strategy with a TSP Block 0, Block 1 and Block 2.   \n\nThe TSP Block 0 will provide an early TSP operational capability for the Gray Eagle program. \n\nThe TSP Block 1 is the current Program of Record that entered EMD in FY 2011.  \n\nBeginning in FY 2016, the TSP Block 2 effort will address System enhancements and upgrades as the threat and technology evolves."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management-Gov"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM ARES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.412"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.810"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.264"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.264"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.830"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.396"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.396"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FFRDC Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.286"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.358"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.260"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.260"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TSP EMD"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE Systems,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Nashua, NH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.841"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.544"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.953"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.953"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "..."
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.250"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.540"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental Test and Activities"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "ATEC\/APG"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.139"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.680"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.600"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Integration and Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.500"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.247"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.247"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test Range & Aircraft Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lakehurst, Ft Huachuca, others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.010"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.010"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.010"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "TSP EMD Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TSP EMD Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Integration and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development Test and Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Limited User Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LRIP Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operational Test and Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Rate Production Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "123"
                    },
                    "ProjectTitle": {
                        "val": "JOINT TECHNOLOGY CENTER SYSTEM INTEGRATION (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.483"
                        },
                        "CurrentYear": {
                            "val": "4.316"
                        },
                        "BudgetYearOne": {
                            "val": "4.326"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.326"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.244"
                        },
                        "BudgetYearThree": {
                            "val": "2.068"
                        },
                        "BudgetYearFour": {
                            "val": "3.290"
                        },
                        "BudgetYearFive": {
                            "val": "3.345"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Unmanned Aircraft System (UAS) Joint Technology Center\/Systems Integration Laboratory (JTC\/SIL) is a Joint facility that develops, integrates, and supports the enhancement of its Multiple Unified Simulation Environment (MUSE) capability for Army systems and operational concepts.  The JTC\/SIL conducts prototype hardware and software development, builds the UAS Institutional Mission Simulator (IMS) trainers for the Shadow, Hunter, and ERMP programs, and provides modeling and simulation support. The MUSE is a real-time, operator in-the-loop simulation that may be integrated with larger simulations in support of Army and Joint training and exercises.  The MUSE is also employed as a Mission Rehearsal Tool for ongoing combat operations.  This project funds the management of the JTC\/SIL and MUSE enhancements.  \n\nThis system supports the Legacy to Objective transition path of the Transformation Campaign Plan (TCP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.687"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Released MUSE 8.6 software which contained advanced weaponization, improvements for software for integrating third party software to meet user requirements such as mapping and visualization software, advanced mission planning capabilities, ease of use enhancements to assist users in operation of the system, networking software for easier connection and control in a distributed network environment, entity handling software improvements and Windows 7 64 bit operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integration of a government owned visualization package.  Develop more ease of use enhancements including standardized set up packages for the aircraft simulation.  Evaluate Ground Control Station simulation improvements for fidelity and realism.  Design, develop, implement, and release Build 8.8."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.840"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.840"
                                            },
                                            "Text": {
                                                "val": "Move to smart phone or more portable computing capabilities.  Evaluate the adaptable environment that gives the user more flexibility by choosing which components to use for a more customized environment.  Incorporate new sensor technologies.  Incorporate new aircraft and avionics.  Design, develop, implement, and release Build 8.9."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support OSD Joint UAS Interoperability Requirements and Activities"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Established the JSIL as a legitimate Joint test organization by forging relationships with Test Resources Management Center (TRMC) and Joint Interoperability Test Center (JITC).  Continued to move the UAS Control Segment Working Group (UCS WG) forward to include coordinating and integrating a tri-service demonstration of the architecture.  Developed of UCS Architecture related tools and training aids.  Established an Unmanned Systems Interoperability Profile (USIP) Management Plan which governs the USIP process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop UCS Architecture environment and compliance tools.  Develop and publish multiple new USIPs based on OSD prioritization.  Provide technical and administrative support to I IPT and associated WGs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Continue development of UCS Architecture environment and compliance tools. Continue to develop and publish multiple new USIPs based on OSD prioritization. Continue to provide technical and administrative support to I IPT and associated WGs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.796"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided coordination and oversight of MUSE product development and OSD Interoperability Requirements and Tool development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.516"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue coordination and oversight of MUSE product development and OSD Interoperability Requirements and tool development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.486"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.486"
                                            },
                                            "Text": {
                                                "val": "Continue coordination and oversight of MUSE product development and OSD Interoperability Requirements and Tool development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0603261N Navy"
                                    },
                                    "Title": {
                                        "val": "PE 0603261N Navy"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.661"
                                        },
                                        "CurrentYear": {
                                            "val": "3.573"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.600"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.600"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.667"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.689"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0305206F  Air Force"
                                    },
                                    "Title": {
                                        "val": "PE 0305206F  Air Force"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.362"
                                        },
                                        "CurrentYear": {
                                            "val": "3.235"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.464"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.464"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.504"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.387"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Continued MUSE development will be accomplished through a combination of Government in-house functional directorate support using a variety of existing contract vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMC, AMCOM, AMRDEC, SED"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.796"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.516"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.486"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.486"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MUSE Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMC, AMCOM,  AMRDEC, SED"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.687"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.800"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.840"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.840"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Interoperability Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMC, RDECOM, AMRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D10"
                    },
                    "ProjectTitle": {
                        "val": "SUAV (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.331"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funding for this project shifts to PE 0305232A RQ-11 in FY11."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Small Unmanned Aircraft System (SUAS) provides the battalion and below ground maneuver elements critical situational awareness and enhances force protection.  The system provides the small unit commander an organic and responsive tactical Reconnaissance, Surveillance, and Target Acquisition (RSTA) capability through the ability to view real-time Full Motion Video (FMV) and sensor data via the system ground control station.  Other compatible receivers, such as the One Station Remote Video Terminal (OSRVT) and appropriately equipped manned platforms may also receive the SUAS products.\n\nA SUAS includes three aircraft that must be launched by hand or by some other means that does not require an improved launch\/recovery location.  In addition to the aircraft, the system contains ground support equipment, which includes an interoperable hand controller.  This equipment is fully transportable in or on rucksack type packs that are organic to the unit.   \n\nThe SUAS RDT&E budget line includes funding for studies and incremental development\/upgrade of current SUAS capabilities that will capitalize on new technology insertions based on identified user requirements.  Past improvements include a Digital Data Link capability, introduced in 2010, which provided data link security, increased the number of communications channels allowing more aircraft to operate in close proximity, extended range through data link relay capability, and integrated advanced digital payloads.  Future enhancements will follow the natural progression of technology and exploitation of improved payloads to meet warfighter needs.  FY 2013 and future improvements will be in the areas of:  continued communications link encryption; gimbaled payloads; software blocking integration; common hand controller development and integration; ADS-B integration; and noise reduction.\n\nJustification: \n\nFY 2013 engineering services efforts will continue to focus on communication link encryption, GPS Denied \/ Comms Denied Navigation, Autonomous Air Vehicle behaviors, Simulator upgrades, ADS-B integration, and noise reduction."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management Support"
                                    },
                                    "Description": {
                                        "val": "Program Management Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.331"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Program Management Support"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RQ-11 (RAVEN  MIP) (RDT&E,A)"
                                    },
                                    "Title": {
                                        "val": "RQ-11 (RAVEN  MIP) (RDT&E,A) - 0305232A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.547"
                                        },
                                        "CurrentYear": {
                                            "val": "1.935"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.039"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.039"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.977"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.025"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.077"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "19.517"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RQ-11 (RAVEN) \/ APA - A00010"
                                    },
                                    "Title": {
                                        "val": "RQ-11 (RAVEN) \/ APA - A00010"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "37.467"
                                        },
                                        "CurrentYear": {
                                            "val": "86.062"
                                        },
                                        "BudgetYearOne": {
                                            "val": "25.798"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.798"
                                        },
                                        "BudgetYearThree": {
                                            "val": "25.342"
                                        },
                                        "BudgetYearFour": {
                                            "val": "25.356"
                                        },
                                        "BudgetYearFive": {
                                            "val": "26.675"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "250.134"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Small Unmanned Aircraft System (SUAS) acquisition strategy was based upon a full and open and was awarded in Aug 2005.  The Full Rate Production Decision Review was approved in Oct 2006 with Full Rate Production beginning in April 2007.  A significant system upgrade was completed in early FY2010 incorporated a Digital Data Link (DDL) which improved operational capability by:  incorporating an encryption capability enabling secure data links increasing the number of channels allowing for more air vehicles to be flown in a smaller areas; extending the operational range through communication relay capability; and integration of advanced digital payloads.  The first DDL systems were fielded in December 2009."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM UAS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "PM UAS"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.278"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.278"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Improvement Studies and Plans (Engineering Services)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aero Vironment"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Simi Valley, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.047"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.047"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Shadow Flight In National Air Space"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aero Vironment"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Simi Valley, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Other Government Agencies"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMRDEC \/ IMMC \/ Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL \/ Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.550"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.550"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}