{
    "id": "3365c4789f67262d15d0a6fbb92643b217e23a14",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA6_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605326A"
        },
        "ProgramElementTitle": {
            "val": "Concepts Experimentation Program"
        },
        "R1LineItemNumber": {
            "val": "140"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "17.101"
            },
            "CurrentYear": {
                "val": "28.755"
            },
            "BudgetYearOne": {
                "val": "27.902"
            },
            "BudgetYearOneBase": {
                "val": "27.902"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "24.458"
            },
            "BudgetYearThree": {
                "val": "21.544"
            },
            "BudgetYearFour": {
                "val": "19.382"
            },
            "BudgetYearFive": {
                "val": "19.627"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Army Experimentation mission enables integrated examinations with US Joint Forces Command (USJFCOM), Army Test and Evaluation Command (ATEC), Research, Development, and Experimentation Command (RDECOM), Army battle laboratories, operational units, research labs, materiel developers, industry and academia to collaborate in the development, refinement, and assessment of future force concepts.  The intended outcome of this integrative effort is to develop concept capability plans that inform the Capabilities Integration Development System (CIDS) process and define future requirements, enabling identification and acquisition of critical Doctrine, Organization, Training, Materiel, Leader Development, Personnel and Facilities (DOTMLPF) capabilities for the future force to provide land power capabilities needed by Joint and Army commanders.  In FY 2011-2013, Research, Development, Test and Evaluation (RDT&E) funding specifically enables the World Class Blue Force (subject matter experts overseeing and coordinating experiments efforts from Army Capabilities Integration Center (ARCIC) proper in collaboration with the Schools and Centers), support for Red Cell analysis, and support to Maneuver Brigade Experiments.  Experimentation enables enhanced situational awareness, planning requirements, employment and management of accelerated decision cycles in a network-enabled force, and training requirements of new and emerging technologies.    \n\nARCIC, Accelerated Capabilities Division (ACD) (formerly Asymmetric Warfare Division) develops immediate capability solutions in support of the Chief of Staff of the Army (CSA) prioritized Current Force capability gaps (i.e. Force Protection, Networked Battle Command, Logistics and Medical in Counterinsurgency Operations (COIN) and Soldier Protection).  ACD conducts Concept of Operations (CONOPS) and DOTMLPF analysis required to ensure capability gap candidate solutions are properly integrated prior to being equipped to deployed forces.  Supports pre-deployment and in-theater assessments to ensure candidate solutions meet identified requirements, support tactics, techniques and procedures development for use by deployed forces, and ensure equipped systems provide the necessary capability to fill an identified gap.  These assessments support determination of a path forward for equipped systems by identifying them as a potential Program of Record (POR) or sustain in theater.  CONOPS, DOTMLPF-Cost analysis, and assessments assist deployed forces by ensuring they are able to properly employ equipped systems and assist senior Army leadership in determining how best to resource solutions to high priority capability gaps."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.704"
                },
                "CurrentYear": {
                    "val": "28.800"
                },
                "BudgetYearOne": {
                    "val": "27.620"
                },
                "BudgetYearOneBase": {
                    "val": "27.620"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.101"
                },
                "CurrentYear": {
                    "val": "28.755"
                },
                "BudgetYearOne": {
                    "val": "27.902"
                },
                "BudgetYearOneBase": {
                    "val": "27.902"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.603"
                },
                "CurrentYear": {
                    "val": "-0.045"
                },
                "BudgetYearOne": {
                    "val": "0.282"
                },
                "BudgetYearOneBase": {
                    "val": "0.282"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.477"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.282"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.282"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.126"
                                },
                                "CurrentYear": {
                                    "val": "-0.045"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "312"
                    },
                    "ProjectTitle": {
                        "val": "Army\/Joint Experimentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.698"
                        },
                        "CurrentYear": {
                            "val": "9.148"
                        },
                        "BudgetYearOne": {
                            "val": "8.330"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.330"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.860"
                        },
                        "BudgetYearThree": {
                            "val": "2.924"
                        },
                        "BudgetYearFour": {
                            "val": "0.522"
                        },
                        "BudgetYearFive": {
                            "val": "0.531"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Army Experimentation is the conduct of experiments involving Soldiers and Leaders within live, virtual, and contructive environments of exploring concepts, capability requirements and solutions across Doctrine, Organization, Training, Materiel, Leaders, Personnel, and Facilities (DOTMLPF) domains in order to learn and mitigate risk for current and future forces.  Experiments inform Army future concepts and assess high-risk conceptual assumptions in order to focus required capabilities and represent the user's requirements in the future Army.  TRADOC's partnership with ASA(ALT) in connecting Soldiers to the ideas and capabilities earlier rather than later, provides essential user feedback and assists the acquisition community with informing the Army's investment portfolio and decreasing the number of engineering design changes.  Army experiments use the combined resources of Army battle laboratories, operational units, research labs, materiel developers, industry and academia to collaborate in the development, refinements, and assessment of future force concepts - to inform capability developments and validate concepts for current and future force.  In FY11-17, Research, Development, Test and Evaluation (RDT&E) funding enables World Class Blue Force (WCBLUFOR) to provide technical and tactical expertise in Army experiment efforts, in collaboration and integration with Joint, Interagency, Intergovermental, and Multinational partners.  In the near-term, Army experimentation will focus on Prevent, Prevail, Prepare, and Preserve as foundational elements for this campaign, assessed across all joint campaign phases, with Army level issues across the breadth of a champaign that highlights the core competencies of combined arms maneuver and wide area security."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimentation - World Class Blue Force Analysts"
                                    },
                                    "Description": {
                                        "val": "Experimentation with future concepts requires commanders who understand those concepts, but military personnel are generally proficient in current doctrine, not future Army concepts.  The WCBLUFOR bridge this gap with experienced commanders who are versed in future Army concepts.  These subject matter experts provide technical and tactical expertise, play senior blue roles in experiments, develop orders, train and mentor staff, and provide analytic expertise.  Requisite skill sets that are not available on our TDAs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.524"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "WCBLUFOR assisted and mentored planning, execution and evaluation of experiments supporting Army capstone, operational and functional concepts to provide credible incorporation of concepts into experiments.  WCBLUFOR also supported analysis and coordination for the Army's Campaign of Learning - both what we had learned and what remained to be learned."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.524"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "WCBLUFOR assist and mentor planning, execution and evaluation of experiments supporting Army capstone, operational and functional concepts to provide credible incorporation of concepts into experiments.  WCBLUFOR also support analysis and coordination for the Army's Campaign of Learning - both what we have learned and what remains to be learned."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.524"
                                            },
                                            "Text": {
                                                "val": "WCBLUFOR will assist and will mentor planning, execution and evaluation of experiments supporting Army capstone, operational and functional concepts to provide credible incorporation of concepts into experiments.  WCBLUFOR also will support analysis and coordination for the Army's Campaign of Learning - both what we have learned and what remains to be learned."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimentation - Maneuver Brigade Experiments"
                                    },
                                    "Description": {
                                        "val": "Perform maneuver brigade experiments that will address 1) integration of Heavy-Brigade Combat Teams (H-BCT)s with spin out capabilities; 2) integration of Interim Brigade Combat Team (IBCT) \/Stryker Brigade Combat Team (SBCT) with Future Brigade Combat Team (FBCT) and H-BCTs with spin out capabilities; 3) development of future IBCT, SBCT and HBCT capability Doctrine, Organization, Training, Materiel, Leader Development, Personnel and Facilities (DOTMLPF)  requirements and DOTMLPF solutions; and 4) acceleration and integration of capabilities for current force Brigade Combat Teams (BCTs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.174"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed maneuver brigade experiments that addressed 1) integration of Heavy-Brigade Combat Teams (H-BCT)s with spin out capabilities; 2) integration of Interim Brigade Combat Team (IBCT) \/Stryker Brigade Combat Team (SBCT) with Future Brigade Combat Team (FBCT) and H-BCTs with spin out capabilities; 3) development of future IBCT, SBCT and HBCT capability DOTMLPF requirements and DOTMLPF solutions; and 4) acceleration and integration of capabilities for current force BCTs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducts experiments to address learning demands supporting assigned Army Warfighting Challenges (AWFC).  Results will inform the Integrated Learning Plan for each AWFC; especifically supporting concepts, Capability Based Analysis, and Vice Chief of Staff of the Army (VCSA) portfolio reviews."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimentation -  High-Fidelity Live-Virtual-Constructive Experiments"
                                    },
                                    "Description": {
                                        "val": "Experiments address concept and capability developments including integration of capabilities for all BCT types; development of future Doctrine, Organization, Training, Materiel, Leader Development, Personnel and Facilities (DOTMLPF)  requirements and solutions; and acceleration and integration of capabilities for current force Brigade Combat Teams (BCTs)"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.806"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.806"
                                            },
                                            "Text": {
                                                "val": "Experiments will continue to address learning demands supporting critical Army Warfighting Challenges (AWFC); capstone, operational and concepts; and Capability Based Analysis.  Experiments will support learning in order to mitigate risk to Soldiers and developments providing tangible insurance against acquisition failure as well as a means to win the first battle of the next war."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "317"
                    },
                    "ProjectTitle": {
                        "val": "CURRENT FORCE CAPABILITY GAPS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.422"
                        },
                        "CurrentYear": {
                            "val": "17.742"
                        },
                        "BudgetYearOne": {
                            "val": "17.677"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.677"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.714"
                        },
                        "BudgetYearThree": {
                            "val": "16.745"
                        },
                        "BudgetYearFour": {
                            "val": "16.970"
                        },
                        "BudgetYearFive": {
                            "val": "17.256"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Training and Doctrine Command (TRADOC) lead for Accelerated Capability Developments (ACD) to address current critical operational needs.  Enable development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force.  Serve as TRADOC central coordinating organization for Headquarters Department of the Army (HQDA) staff support requirements related to accelerated capabilities developments.  Integrate ACD activities to ensure unity and priority of effort and synchronization and optimization of resources.  Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improvised Explosive Device (IED) Integrated Concept Development Team (ICDT)"
                                    },
                                    "Description": {
                                        "val": "The IED ICDT is responsible for conducting Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, and Facilities (DOTMLPF) assessments; performs gap analyses identified by HQDA and Joint Urgent Operational Needs Statement (JUONS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.587"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to coordinate home-station training programs of IED-Defeat initiatives.  Was responsible for coordinating and facilitating the IED-Defeat Council of Colonels and General Officer Steering Committees producing guidance and directives for Army-wide IED-Defeat training, initiative, and systems.  Supported various TRADOC Centers of Excellence with Counter-IED subject matter experts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.072"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Leads the Adapt the Force efforts under Army Counter-IED (CIED) Strategy supporting development and maintenance of AtF CIED database and resolution of DOTMLPF issues associated with integration of various CIED initiatives.  Is responsible for coordination and facilitating IED-Defeat Council of Colonels and General Officer Steering Committees producing guidance and directives for Army-wide IED-Defeat Training initiatives and systems.  Support TRADOC CoEs with CIED SMEs and products for all CIED Lines of Effort (DtD, ATN, Robotics)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.447"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.447"
                                            },
                                            "Text": {
                                                "val": "Will lead the Adapt the Force efforts under Army Counter-IED (CIED) Strategy supporting development and maintenance of AtF CIED database and resolution of DOTMLPF issues associated with integration of various CIED initiatives.  Will be responsible for coordination and faciliating IED-Defeat Council of Colonels and General Officer Steering Committees producing guidance and directives for Army-wide IED-Defeat Training initiative and systems.  Support TRADOC CoEs with CIED SMEs and products for all CIED Lines of Effort (DtD, ATN, Robotics)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Airborne Electronic Attack (AEA), Full Spectrum Effects Platform (FSEP), Land Warrior, Robotics"
                                    },
                                    "Description": {
                                        "val": "Funding is needed for AEA, FSEP, Land Warrior, and Robotics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.377"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "AEA is a capability to provide organic or direct support airborne electronic attack capabilities to the Brigade Combat Team.  This capability provided the unit the ability to perform airborne pre-detonation as well as threat communications suppression across the electro-magnetic spectrum in order to enhance freedom of maneuver and mission effectiveness across the unit's battlespace."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Demo\/Assess Electronic Warfare - Base Expeditionary Target and Surveillance System Combined (BETSS-C)"
                                    },
                                    "Description": {
                                        "val": "Funding is needed for the Demo\/Assess Electronic Warfare - Base Expeditionary Target and Surveillance System Combined."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.038"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported USCENTCOM Operation Needs Statement to provide reconnaissance, surveillance, and target acquisition (RSTA) by integrating eight ground-based-intelligence-surveillance-reconnaissance and battle command capabillities through an integrated sensor system of systems approach to blue force operating locations (Joint Security Stations\/Command Out Posts) and along key transit routes in Operation Enduring Freedom.  Persistent surveillance around blue force operating locations was necessary to counter threats, provide early warning, increase force protection and improve security response."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Demo\/Assess Command and Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR)- Joint Integration and Non-Lethal Fires"
                                    },
                                    "Description": {
                                        "val": "Command, Control, Communications, Computers, Combat Systems, Intelligence, Surveillance, and Reconnaissance (C5ISR) Operation Needs Statement (ONS)  (classified) is a compliation of C5ISR capabilities that eliminate critical capability performance gaps in Operation Enduring Freedom (OEF).  Phase 1 improvements include higher level network security and increased network bandwidth down to battalion level, network modem upgrades, increased biometrics and support, aerial layer network extension, network extension to mobile user (hand held), and full motion video."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.420"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "C5ISR ONS (classified) is a compliation of C5ISR capabilities that eliminate critical capability performance gaps in OEF.  Phase 1 improvements include higher level network security and increased network bandwidth down to battalion level, network modem upgrades, increased biometrics and support, aerial layer network extension, network extension to mobile user (hand held), and full motion video."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "C5ISR ONS (classified) is a compliation of C5ISR capabilities that eliminate critical capability performance gaps in OEF.  Phase 1 improvements include higher level network security and increased network bandwidth down to battalion level, network modem upgrades, increased biometrics and support, aerial layer network extension, network extension to mobile user (hand held), and full motion video."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerial Sensor Portfolio"
                                    },
                                    "Description": {
                                        "val": "Funding is needed to support the Aerial Sensor Portolio."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Aerial Sensor Portfolio (excluding Task Force Observe, Detect, Indentify, and Neutralize - TF ODIN systems) supports the accelerated developments of directed, ONS-based, quick reaction aerial sensor capabilities (Desert Owl I and II, Radiant Falcon, Copperhead II, Black Kite).  Supports improved Aerial Intelligence, Surveillance, and Reconnaissance (ISR)  Information System processing.  Consists of aerial sensor and command control systems organized to defeat assigned threats in current operational environments by integrating collection and analysis of intelligence data, shorten sensor to responder timelines, and facilitate planning, sensor cueing, data collection, and communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.280"
                                            },
                                            "Text": {
                                                "val": "Aerial Sensor Portfolio (excluding Task Force Observe, Detect, Indentify, and Neutralize - TF ODIN systems) will support the accelerated developments of directed, ONS-based, quick reaction aerial sensor capabilities (Desert Owl I and II, Radiant Falcon, Copperhead II, Black Kite).  Will support improved Aerial Intelligence, Surveillance, and Reconnaissance (ISR) Information System processing.  Will consist of aerial sensor and command control systems organized to defeat assigned threats in current operational environments by integrating collection and analysis of intelligence data, shorten sensor to responder timelines, and will facilitate planning, sensor cueing, data collection, and communications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications and Networks Portfolio"
                                    },
                                    "Description": {
                                        "val": "Funding is needed for Communications and Networks Portfolio."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.693"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Communications and Network Portfolio capabilities include Intelligence, Surveillance, and Reconnaissance (ISR) Net, Trojan Swarm, Heterogeneous Aerial Reconnaissance Team (HART), Enroute Mission Planning and Rehearsal System (EMPRS), Army Cellular Capability Development and Connecting Soldiers to Digital Applications (CSDA).  Task is to support development, deployment, and assessment of communications and networking of these and other directed systems to provide the Warfighter a network connectivity with mission command applications.  Network provides single user interface, including aerial tier, capable of assessing all required data applications, and service via the common operating environment.  Network supports distributed and small unit operations beyond line-of-sight with focus on Company and below Brigade and Battalion mission command on-the-move capabilities.  Additionally network  reduces dependence on satellite communications when connectivity is lost."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.535"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.535"
                                            },
                                            "Text": {
                                                "val": "Communications and Network Portfolio capabilities will include Intelligence, Surveillance, and Reconnaissance (ISR) Net, Trojan Swarm, Heterogeneous Aerial Reconnaissance Team (HART), Enroute Mission Planning and Rehearsal System (EMPRS), Army Cellular Capability Development and Connecting Soldiers to Digital Applications (CSDA).  Task will be to support development, deployment, and assessment of communications and networking of these and other directed systems to provide the Warfighter a network connectivity with mission command applications.  Network will provide single user interface, including aerial tier, capable of assessing all required data applications, and service via the common operating environment.  Network will support distributed and small unit operations beyond line-of-sight with focus on Company and below Brigade and Battalion mission command on-the-move capabilities.  Additionally network will reduce dependence on satellite communications when connectivity is lost."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Demo\/Assess Operational Power and Energy"
                                    },
                                    "Description": {
                                        "val": "Funding is needed for Operational Power and Energy"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.250"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "TRADOC Accelerated Capability Developments supports TRADOC Power and Energy staff management and integration responsibilities.  Supports proponents with their responsibilities relative to doctrine, organization, training, material, leader development and education, personnel, and facilities plus related matters.  Leverages Proponent input to Joint Capabilities Integration and Development System, Science and Technology, Concept Development, Capability Development for Rapid Transition, and Capability Gap Analysis Army."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.846"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.846"
                                            },
                                            "Text": {
                                                "val": "TRADOC Accelerated Capability Developments will support TRADOC Power and Energy staff management and integration responsibilities.  Will supports proponents with their responsibilities relative to doctrine, organization, training, material, leader development and education, personnel, and facilities plus related matters.  Leverages Proponent input to Joint Capabilities Integration and Development System, Science and Technology, Concept Development, Capability Development for Rapid Transition, and Capability Gap Analysis Army."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Protection Initiative (IPI)"
                                    },
                                    "Description": {
                                        "val": "Funds are needed for Integrated Protection Initiative."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "TRADOC Accelerated Capability Developments initiative provides integration and assessment support across DOTMLPF domains to equip, train, and deploy capability support for OEF problem of isolated maneuver elements at Command Outposts (COPs)\/Forward Operating Bases (FOBs) which have difficulty locating ground targets and lack timely response to engage these targets in organic, lethal, effects while minimizing collateral damage and exposure of Soldiers to unnecessary risk."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.468"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.468"
                                            },
                                            "Text": {
                                                "val": "TRADOC Accelerated Capability Developments initiative will provide integration and assessment support across DOTMLPF domains to equip, train, and deploy capability support for OEF problem of isolated maneuver elements at Command Outposts (COPs)\/Forward Operating Bases (FOBs) which have difficulty locating ground targets and lack timely response to engage these targets in organic, lethal, effects while minimizing collateral damage and exposure of Soldiers to unnecessary risk."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototype Solution Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Army Expeditionary Warrior Experiment (AEWE) addresses live, prototype experimentation requirements."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "AEWE will address live, prototype experimentation requirements with a primary focus on the Soldier and Small Unit, examining concepts and capabilities for the current and future force.  AEWE will provide Capability Developers, the S&T community and industry a repeatable, credible, rigorous, and validated operational experiment venue to support DOTMLPF concepts and materiel development efforts.  FY13 will focus on Spiral H and J support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Capability Packages (CP)"
                                    },
                                    "Description": {
                                        "val": "Capability Packages are a key element of the Army's transition to a brigade combat team (BCT) modernization strategy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Capability Packages will be a key element of the Army's transition to a brigade combat team (BCT) modernization strategy to build a versatile mix of mobile, networked and combat effective BCTs. Following the Defense Secretary's guidance to accelerate proven solutions, these packages will upgrade our units every few years so the best capabilities available at that time go to the Soldiers who need them most, based on the continually evolving combat environment. These bundles of capabilities will include doctrine, organization, and training in conjunction with materiel to fill the highest priority shortfalls and mitigate risk for Soldiers. The incremental deliveries will build upon one another as the Army continually adapts and modernizes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics"
                                    },
                                    "Description": {
                                        "val": "Testing and demonstration of increased unmanned ground vehicle capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.325"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.325"
                                            },
                                            "Text": {
                                                "val": "Will be testing and demonstration of increasingly capable unmanned ground vehicles in four separate categories (soldier transportable, self transportable, vehicle transportable, and applique?) through venues such as the Robotics Rodeo, Mounted Maneuver Battle Lab (MMBL), and Brigade Modernization Command (BMC) events. Successful robotic systems will be considered for in theater usage and DOTMLPF assessments for transition decisions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tunnel Detection (TD)"
                                    },
                                    "Description": {
                                        "val": "Test and demonstration of sensor technology."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.175"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.175"
                                            },
                                            "Text": {
                                                "val": "Will test and demonstrate a suite of sensor technology systems capable of detecting, exploiting, and remediating, clandestine purpose-built tunnels."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Exploitation"
                                    },
                                    "Description": {
                                        "val": "Document and Media Exploitation (DOMEX) is the collection and exploitation of captured equipment, documents, and media."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "Document and Media Exploitation (DOMEX) Tactical, operational, and strategic leaders are enabled with accurate information about enemy forces through the rapid and accurate extraction, exploitation, and analysis of captured enemy documents, media, and materiel. Tactically, DOMEX will be the collection and exploitation of captured equipment, documents, and media to generate actionable intelligence. The DOMEX will be a critical part of target exploitation, especially as it relates to actions on the objective during site exploitation activities. Efforts in exploitation will also support Special Operations Command (SOCOM) with DOTMLPF assessments of classified solutions supporting technical reconnaissance, and information operations associated with exploitation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Standard Capability Training Gaps"
                                    },
                                    "Description": {
                                        "val": "Training for accelerated capabilites is accomplished primarily through mandated New Equipment Training (NET) with no process for follow on efforts.  This incongruity is detrimental to effective and consistent training for the force."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.201"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.201"
                                            },
                                            "Text": {
                                                "val": "The Army has not established an approved mechanism to train non-standard equipment within operational formations or COEs.  This deficiency compels training independent of evaluated\/verifiable methods.  There will be minimal assistance in the development of Training Support Packages (TSP) and varying levels of oversight to validate if the maximum benefit of the training and capability has been attained.  This incongruity will be detrimental to effective and consistent training for the force.  Training for accelerated capabilities will accomplished primarily through mandated New Equipment Training (NET) with no process for follow on efforts.  Will support TRADOC CoEs in development of Pilot Training Programs to establish process for the integration on non-standard capability training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "33B"
                    },
                    "ProjectTitle": {
                        "val": "SOLDIER-CENTERED ANALYSES FOR THE FUTURE FORCE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.981"
                        },
                        "CurrentYear": {
                            "val": "1.865"
                        },
                        "BudgetYearOne": {
                            "val": "1.895"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.895"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.884"
                        },
                        "BudgetYearThree": {
                            "val": "1.875"
                        },
                        "BudgetYearFour": {
                            "val": "1.890"
                        },
                        "BudgetYearFive": {
                            "val": "1.840"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project will provide early application of human performance and human figure modeling tools in the development of Soldier-focused requirements to shape technology for Future Force development. Design analyses, constructive simulations and Soldier-in-the-loop assessments will ensure that manpower requirements, workload and skill demands are considered, avoid information and physical task overloads, and take optimum advantage of aptitudes, individual and collective training, and numbers of Soldiers for an affordable Future Force. The cited work is consistent with the Strategic Planning Guidance, the Army Science and Technology Master Plan (ASTMP), the Army Modernization Plan, and the Defense Technology Area Plan (DTAP). Work in this project is performed by the Army Research Laboratory (ARL)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Manpower and Personnel Integration (MANPRINT)"
                                    },
                                    "Description": {
                                        "val": "Provide dedicated modeling and analysis cell for early and accurate MANPRINT estimates to Army Materiel Command (AMC), Research, Development, and Engineering Command (RDECOM) and its Research, Development, and Engineering Centers (RDECs), TRADOC Centers, Schools and Centers of Excellence (CoEs), Army Test and Evaluation Command (ATEC) and other service laboratories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.217"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directly linked Human System Integration (HSI) analyses to systems engineering, costs, and design trade study analyses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.865"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop method to trace quantified HSI risks from Warfighter and platform performance up to mission execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.895"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.895"
                                            },
                                            "Text": {
                                                "val": "Will develop analysis methodology to link HSI risk mitigation (i.e. specific system design changes) to manpower and   health care cost avoidance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANPRINT Manpower, Personnel and Training (MPT)"
                                    },
                                    "Description": {
                                        "val": "Provide MANPRINT MPT force requirements determination support to TRADOC on selected systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Linked MPT analyses and risks to other MANPRINT domains (i.e. human engineering, system safety, health hazards)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}