{
    "id": "4a117ab61235fc8e2d83d7567fabe9347153b8a5",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604774D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Readiness Reporting System (DRRS)"
        },
        "R1LineItemNumber": {
            "val": "135"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.938"
            },
            "CurrentYear": {
                "val": "6.600"
            },
            "BudgetYearOne": {
                "val": "6.383"
            },
            "BudgetYearOneBase": {
                "val": "6.383"
            },
            "BudgetYearTwo": {
                "val": "6.393"
            },
            "BudgetYearThree": {
                "val": "6.427"
            },
            "BudgetYearFour": {
                "val": "6.364"
            },
            "BudgetYearFive": {
                "val": "6.450"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This funding supports Defense Planning Guidance (DPG) directing the Department of Defense (DoD) components to develop guidelines and procedures for a comprehensive readiness reporting system that evaluates readiness on the basis of the actual missions and capabilities assigned to the forces. The Defense Readiness Reporting System (DRRS) establishes a capabilities-based, adaptive, near real-time readiness information system for the DoD. This system is being designed to measure the readiness of military forces and supporting infrastructure to meet missions and goals assigned by the Secretary of Defense. DRRS also hosts information and applications used to support Joint Forces Command (JFCOM), Transportation Command (TRANSCOM), Special Operations Command (SOCOM) and Strategic Command (STRATCOM) in their roles as the Joint Force Providers.\n\nThe transformation of readiness reporting into a new comprehensive readiness system presents a number of significant challenges. First, there are thousands of new potential reporting entities to include in DRRS, such as Combatant Commands, Joint Task Forces, Services, Active and Reserve component units, installations, depots, ports, and major elements of the industrial base. These entities must not only define and implement reporting based on specific readiness metrics, but they must make their readiness status continuously available in near real time to DRRS. Second, the current National Military Strategy (NMS) makes substantially more complex demands on readiness reporting. Instead of basing readiness on traditional MTW-based scenarios, the NMS asks us to contemplate readiness for an entire range of operational forms, and to design DRRS to assess global readiness impact based on our integrated ability to project and sustain a mix of constructed forces in simultaneous engagements. Finally, Operation Iraqi Freedom and Operation Enduring Freedom sourcing challenges mean that force managers need applications that will query the entire Department for suitable, available organizations to meet current needs. The need for these applications and the underlying data are a top priority for the DRRS project.\n\nThe realization of DRRS requires integrating a host of key technologies in order to achieve an information system that supports distributed, collaborative, and dynamic readiness reporting in addition to continuous tool-based assessment. The primary technical goal is the creation of a highly reliable and securely integrated readiness data environment to leverage and extend current readiness information systems. This system is based on intelligent agents, dynamic databases, semantic middleware, and publish\/subscribe concepts; providing a logically uniform view into the multiple databases and information sources that feed DRRS. Crucially, through this type of advanced information environment, we dramatically expand the range of readiness queries that DRRS can be able to handle. This environment supports a suite of analysis tools that allow users to explore the consequences of readiness deficiencies in terms of the ability to generate forces and assess transportation feasibility as it pertains to specific scenarios. These tools and tool suites harness the power of the information environment to make possible the kind of quick-turnaround, excursion-driven readiness assessment that is at the heart of DRRS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.113"
                },
                "CurrentYear": {
                    "val": "6.658"
                },
                "BudgetYearOne": {
                    "val": "6.383"
                },
                "BudgetYearOneBase": {
                    "val": "6.383"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.938"
                },
                "CurrentYear": {
                    "val": "6.600"
                },
                "BudgetYearOne": {
                    "val": "6.383"
                },
                "BudgetYearOneBase": {
                    "val": "6.383"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.175"
                },
                "CurrentYear": {
                    "val": "-0.058"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.128"
                    },
                    "CurrentYear": {
                        "val": "-0.014"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.047"
                                },
                                "CurrentYear": {
                                    "val": "-0.044"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "774"
                    },
                    "ProjectTitle": {
                        "val": "Defense Readiness Reporting System (DRRS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.938"
                        },
                        "CurrentYear": {
                            "val": "6.600"
                        },
                        "BudgetYearOne": {
                            "val": "6.383"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.383"
                        },
                        "BudgetYearTwo": {
                            "val": "6.393"
                        },
                        "BudgetYearThree": {
                            "val": "6.427"
                        },
                        "BudgetYearFour": {
                            "val": "6.364"
                        },
                        "BudgetYearFive": {
                            "val": "6.450"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Defense Readiness Reporting System Efficiency Reductions - To be achieved through implementation of Government Accountability Office recommendations to staff the DRRS program office on the basis of human capital strategy that is grounded in an assessment of core competencies and essential knowledge, skills, and abilities needed to perform key DRRS program management functions, an inventory of the program office's existing workforce capabilities, and an analysis of the gap between the assessed needs and the existing capabilities. Also, DRRS Implementation Office will work with the Acquisition Component Executive to ensure all acquisition requirements are being met prior to any further certification requests."
                        },
                        "ProjectMissionDescription": {
                            "val": "This funding supports Defense Planning Guidance (DPG) directing the Department of Defense (DoD) components to develop guidelines and procedures for a comprehensive readiness reporting system that evaluates readiness on the basis of the actual missions and capabilities assigned to the forces. The Defense Readiness Reporting System (DRRS) establishes a capabilities-based, adaptive, near real-time readiness information system for the DoD. This system is\nbeing designed to measure the readiness of military forces and supporting infrastructure to meet missions and goals assigned by the Secretary of Defense. DRRS also hosts information and applications used to support Joint Forces Command (JFCOM), Transportation Command (TRANSCOM), Special Operations Command (SOCOM) and Strategic Command (STRATCOM) in their roles as the Joint Force Providers. \n\nThe transformation of readiness reporting into a new comprehensive readiness system presents a number of significant challenges. First, there are thousands of new potential reporting entities to include in DRRS, such as Active and Reserve component units, agencies, Combatant Commanders, installations, depots, ports, and major elements of the industrial base. These new entities must not only define and implement reporting based on specific readiness metrics, but they must make their readiness status continuously available in near real time to DRRS. Second, the current National Military Strategy makes substantially more complex demands on readiness reporting. Instead of basing readiness on traditional MTW-based scenarios, the NMS asks us to contemplate readiness for an entire range of operational forms, and to design DRRS to assess global readiness impact based on our integrated ability to project and sustain a mix of constructed forces in simultaneous engagements. Finally, OIF\/OEF sourcing challenges mean that force managers need applications that will query the entire Department for suitable, available organizations to meet current needs. The need for these applications and the underlying data are a top priority for the DRRS project. \n\nThe realization of DRRS will require integrating a host of key technologies in order to achieve an information system that will support massive-scale distributed, collaborative dynamic readiness reporting and continuous tool-based assessment. The primary technical goal is the creation of a high-reliability, secure integrated readiness data environment that will leverage and extend current readiness information systems. This system will be based on intelligent agents, dynamic databases, semantic middleware, and publish\/subscribe concepts; and will provide a logically uniform view into the multiple databases and information sources that will feed DRRS. Crucially, through this type of advanced information environment, we will dramatically expand the range of readiness queries that DRRS will be able to handle. Coupled to this data environment will be a set of high-speed scenario-oriented tools that support ad hoc queries and drilldown, and an advanced workflow system that can assemble existing and new scenario and assessment tools into high-level task-specific query processes. These tools and tool suites will harness the power of the information environment to make possible the kind of quickturnaround, excursion-driven readiness assessment that is at the heart of DRRS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "774  Defense Readiness Reporting System"
                                    },
                                    "Description": {
                                        "val": "DRRS is the primary means by which Defense components (Combatant Commands, Services, Agencies and their subordinate elements and units) report their readiness. The system measures readiness of the Department's components to execute the full range of missions assigned by the Secretary of Defense. \n\nThe Defense Readiness Reporting System (DRRS) establishes a capabilities-based, adaptive, near real-time readiness information system for DoD.  DRRS measures the readiness of military forces and supporting infrastructure to meet missions and goals assigned by the Secretary of Defense.  The realization of DRRS required integrating a host of key technologies to achieve an information system that supports distributed, collaborative, and dynamic readiness reporting in addition to continuous tool-based assessment.  The primary technical goal was the creation of a highly reliable and securely integrated readiness data environment to leverage and extend current readiness information systems.  DRRS contains readiness metrics and supporting data for forces and support organizations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.938"
                                            },
                                            "Text": {
                                                "val": "• Continue Software lifecycle support\n• Continue refinement of data architecture\n• Data quality improvement\n• Data latency improvement\n• Continue development and integration with Interagency readiness and preparedness systems outside DoD.\n• Expand readiness reporting capability and integration with coalition forces and allies"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.600"
                                            },
                                            "Text": {
                                                "val": "• Validation of Org Server\n• Data quality improvement\n• Data latency improvement\n• Continue development and integration with Interagency readiness and preparedness systems outside DoD.\n• Completion of SORTS transition to DRRS\n• Integration of Language Readiness Index  into DRRS"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.383"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.383"
                                            },
                                            "Text": {
                                                "val": "• Continue Software lifecycle support \n• Continue to assist the Services using DRRS to support their Component Cmdrs and the CoCOMS\n• Continue refinement of data architecture\n• Data quality improvement\n• Data latency improvement with the use of Dashboards\n• Continue development and integration with Interagency readiness and preparedness systems outside DoD.\n• Expand readiness reporting capability and integration with coalition forces and allies.\n• Complete the development and fielding of the Global Visibility Tool to support Global Force Management"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "• Ability of Combatant Commands to assess current operations and war plans based on actual forces that would be assigned\n• Mapping of Joint Capability Areas (JCAs) to joint services and agency tasks to usable total force and mission capability assessments\n• Complete the integration of active Guard and Reserve\n• Expanding readiness assessments to all DoD organizations, including installations and facilities\n• Transition to one readiness reporting system for DoD."
                        }
                    }
                }
            ]
        }
    }
}