{
    "id": "4b232cdb71a4a33cdc92a331d2195b824c0cb759",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V3A_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0207417F"
        },
        "ProgramElementTitle": {
            "val": "Airborne Warning and Control System (AWACS)"
        },
        "R1LineItemNumber": {
            "val": "148"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "201.838"
            },
            "CurrentYear": {
                "val": "117.880"
            },
            "BudgetYearOne": {
                "val": "65.200"
            },
            "BudgetYearOneBase": {
                "val": "65.200"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "192.562"
            },
            "BudgetYearThree": {
                "val": "173.544"
            },
            "BudgetYearFour": {
                "val": "66.079"
            },
            "BudgetYearFive": {
                "val": "57.349"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "1. Totals include funding for Program Resources Collection Process (PRCP) Program Number, 277, AWACS Upgrade (for Block 40\/45 Upgrade).\n2. The Cost to Complete and Total Cost for MDAP projects in this program element are documented in the R3. The Cost to Complete and Total Cost on the R2 are entered as \"Continuing\" and not reflective of the total cost for MDAP projects since the R2 does not account for prior years funding."
        },
        "ProgramElementMissionDescription": {
            "val": "Mission: AWACS is the premier airborne platform providing command and control (C2)\/battle management (BM) to Commander In Chief and combatant commander tasking for joint, allied, and coalition operations, humanitarian relief, and homeland defense. AWACS provides a real-time picture of friendly, neutral, and hostile air activity. Its capabilities include all-altitude\/all-weather surveillance of the battle space; early warning of enemy actions; a real-time ability to find, fix, track, and assess airborne or maritime threats; and detection, location, and identification of electronic emitters.\n\nThis program element funds three areas in support of the AWACS program:  1. AWACS Modernization, 2. AWACS Infrastructure and Support Systems, and 3. Material Solutions Development and Analysis. Each of the three areas includes studies and analysis to support both current planning and execution, as well as future program planning.\n\n1. AWACS Modernization (RDT&E, AF):\n\na. Block 40\/45 is replacing AWACS 1970's vintage mission systems that are experiencing Diminishing Manufacturing Sources (DMS) issues, are difficult and expensive to upgrade, and limit overall AWACS system performance. The Block 40\/45 upgrade will improve integration, quality and timeliness of sensor data to the shooter, improve Combat Identification (CID), improve AWACS contribution to Time Critical Targeting via Data Link Infrastructure (DLI), improve electronic support measures processing and enable more effective, faster upgrades via an open-system, Ethernet-based architecture. The upgrade will also update the ground support infrastructure including training systems.\n\nb. The Next Generation Identification Friend or Foe (NGIFF) Program provides AWACS with enhanced IFF interrogator operation to add a more secure Mode 5 capability. NSA declared IFF Mode 4 unsecure and obsolete on 5 Nov 2003. Joint Requirements Oversight Council Memo 047-07 requires IFF Mode 5 interrogation capability by FY14. The new Mode 5 interrogation capability extends the effective range of the AWACS interrogator, while helping discriminate against closely spaced cooperative targets. NGIFF developed and integrated a basic Mode 5 capability on Block 30\/35 starting in FY09 and began developing a full Mode 5 on Block 40\/45 in FY11. Hardware will be common between the platforms. NGIFF will also integrate Mode S, a civilian air traffic control capability residing in the NGIFF hardware, as funding allows.\n\nc. Diminishing Manufacturing Sources (DMS) Replacement of Avionics for Global Operations and Navigation (DRAGON) completes the FAA\/International Civil Aviation Organization (ICAO)\/ EUROCONTROL air traffic control mandated safety of flight capabilities. This program will provide the E-3 fleet with the flight instruments and other avionics for the Required Navigation Performance (RNP), and the surveillance and communication capabilities necessary to maintain continued critical unrestricted access to global airspace. Non-compliance will result in airspace restrictions and denials that will impact AWACS ability to support worldwide responses to situations requiring immediate on-scene command and control (C2) battle management. The DRAGON modifications replace the existing DMS Global Positioning System (GPS) Integrated Navigation System (GINS) with a modern Flight Management System (FMS) that will accommodate new capabilities including Mode 5 IFF and Joint Mission Planning System (JMPS). Also included as part of the modification is the addition of data link communications, voice and data link digital radios, and improved visual displays. Emphasis on employment of COTS avionics is expected to lower cost, reduce the tech refresh cycle, and enhance life cycle management. Replacement of critical avionics subsystems that became unsustainable beginning in 2010 is included in the DRAGON program. The Engineering and Manufacturing Development (EMD) phase of DRAGON is being executed cooperatively between the US and NATO.\n\nd. The Flight Performance Software (FPS) program automates calculations currently performed manually by the pilot and flight engineer in accordance with the E-3B and C flight manual.  Phase I, automates the Takeoff and Landing (TOLD) calculations; Phase II automates the high speed calculation.  Automated calculations, using the original source data used to create the flight manual charts increases safety, improves on time departure\/arrival, improves crew efficiency, and reduces tanker support.\n\n2.  AWACS Infrastructure and Support Systems (RDT&E, AF): These efforts synchronize modernization requirements and infrastructure support across the entire weapon system from depot and field test equipment, to maintenance trainers, to simulators, to integration labs, to the TS-3 Developmental Test and Evaluation Aircraft.\n\na. Test System-3\/AWACS Development Integration Test Support (ADITS): The E-3 AWACS Developmental Test and Evaluation (DT&E) aircraft, Test System 3 (TS-3, tail number 73-1674) is a government owned\/contractor managed, maintained and operated system level DT&E asset. Together, TS-3 and ADITS provide test-ready assets to support AWACS modernization, with already imbedded test points to support sub-system and system level developmental testing, per Boeing's TS-3 design specifications. This level of DT&E testing supports both advanced and sustainment projects, which allow AWACS to participate in live-fly exercises (e.g., Joint Expeditionary Force Experiment\/JEFX; Empire Challenge\/EC) and ground-based interoperability testing. These assets also support multiple international Airborne Early Warning and Control (AEW&C) projects on a fee basis, including projects for France, Saudi Arabia, United Kingdom, Japan, and NATO AEW&C efforts.\n\nTS-3, one of the first AWACS production aircraft, is qualified to Boeing manufacturer design specifications, unlike fleet aircraft, which are qualified to technical orders.  In FY12, the Air Force divested TS-3. Beginning in FY13, the ADITS activity will be covered in the Training, Support, and Infrastructure (TSI) effort.  \n\nb. The Training, Support, and Infrastructure (TSI) programs cover required cross-cutting programs and activities in support of AWACS modernization and enhancement efforts. These include managing the AWACS developmental infrastructure, support for equipment concurrency, modernization planning\/analysis, trainer\/simulator integration and concurrency, as well as the Avionics Integration Laboratory (AIL). The E-3 Radar Systems Integration Lab\/Software Development Facility (SIL\/SDF) is maintained, operated, and supported by contract to provide customers with a functioning E-3 radar configuration in support of AWACS US, FMS and International radar development, production, and sustainment programs. New support equipment technologies and test strategies need to be analyzed to ensure concurrent capability to sustain existing, modified, and upgraded E-3 equipment. Trainer\/simulator concurrency analysis and requirements definition is necessary to ensure trainers and simulators are kept current with the AWACS baseline. Associate contractor agreements are used to integrate the planning and execution between the prime integrator and training service providers.  In FY13, TSI will continue the remaining ADITS activity which includes the Avionics Integration Laboratory.\n\n3.  Material Solutions Development & Analysis (RDT&E, AF): These efforts look toward the future by investigating enhanced capabilities and exploring new mission areas through C2ISR System Development, while advancing the capabilities of the current weapon system through Support The War Fighter (STWF).\n\na. Command & Control, Intelligence, Surveillance and Reconnaissance (C2ISR) system improvements investigate and develop future capabilities of the AWACS weapon system, or next C2ISR platform. These efforts also include investigation, analysis and development to ensure that AWACS successfully integrates with joint and coalition forces in a net-centric environment. C2ISR primarily supports Pre-Systems Acquisition in the areas of Material Solution Analysis and Technology Development. This is accomplished by prototyping and demonstrating capabilities required by the warfighter but also includes developing an E-3 Modernization & Sustainment Roadmap that projects user capability needs, as well as material solutions for the user needs. Examples of supporting activities include, but are not limited to: \n\n     (1) Evaluating emerging operational needs, concepts, and technologies to enable integration of AWACS' capabilities to align with integrated C2ISR network architectures as defined in Joint Vision 2020, C2 Constellation Concept of Operations (CONOPS), and Air Force CONOPS.\n\n     (2) Improving sensors and identifying new sensor technologies and netted sensor architectures to meet evolving threats; communications including development of communication roadmaps and assessing related technologies e.g.: all forms of Internet Protocol (IP) communications, and multi-sensor integration such as the ability to send, receive, and fuse the air (and ground) picture via data link to fighter aircraft, through rapid prototyping, modeling, simulation, and participation in Joint exercises (e.g., JEFX and EC).\n\n     (3) Improving the timeliness and accuracy of information passed to\/from fighter aircraft in the engagement zone by providing consistent and re-playable post-mission data to provide quicker reaction capabilities to support the air war.\n\n     (4) Exploring concepts, investigating emerging and developing technologies, and demonstrating efforts that  support continuous improvements and self-protection for C2ISR capabilities of manned & unmanned platforms, space, data links, and advanced Battle Management decision tools.\n\nb. Support the War Fighter (STWF): STWF efforts support AWACS capability to create and sustain the force. Examples of these activities include, but are not limited to:  Designing, developing, and modernizing equipment and systems to ensure AWACS can respond to urgent wartime\/contingency acquisition requirements (e.g. Urgent Operational Needs (UONs) and Wartime Urgent & Compelling Needs (WUCNs)). Upgrading key capabilities to meet contingency needs, modernizing test systems, integrating battle management and data link enhancements, and supporting Reliability, Maintainability, and Availability (RM&A) initiatives which:\n\n     (1) Improve the Mission Capable (MC) rate through RM&A analysis and development projects to provide system improvements that help meet or exceed the required MC rate. These efforts focus on increasing reliability of the air vehicle, command and control systems, voice and data communications systems, computer, sensor systems and infrastructure improvements.\n\n     (2) Solve DMS logistics problems.\n\n     (3) Insert new technologies with the aim of reducing maintenance man-hours along with programmed depot maintenance (PDM) improvements to increase aircraft availability.\n\nc. Electronic Protection (EP): In FY13 EP is a new effort.  The E-3 interim radar upgrade will design and develop capability improvements to the AWACS radar that provide enhanced war fighter capability in a subset of modes identified under the Radar Modernization Program (RMP) study.  The enhanced capability will be available to the airborne radar technician and to the AWACS operators.\n\nBudget Justification: This program is in Budget Activity 7, Operational Systems Development, these budget activities include development efforts to upgrade systems currently fielded or has approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "239.755"
                },
                "CurrentYear": {
                    "val": "135.961"
                },
                "BudgetYearOne": {
                    "val": "150.120"
                },
                "BudgetYearOneBase": {
                    "val": "150.120"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "201.838"
                },
                "CurrentYear": {
                    "val": "117.880"
                },
                "BudgetYearOne": {
                    "val": "65.200"
                },
                "BudgetYearOneBase": {
                    "val": "65.200"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-37.917"
                },
                "CurrentYear": {
                    "val": "-18.081"
                },
                "BudgetYearOne": {
                    "val": "-84.920"
                },
                "BudgetYearOneBase": {
                    "val": "-84.920"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.781"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-17.300"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-19.700"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.571"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-11.646"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-84.920"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-84.920"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "1. In FY11, Other Adjustments totaling $11.646M include Congressional General Reductions ($1.646M) and Congressional Directed Reductions ($10M).\n2. The decrease in the Current President's Budget from FY 2011 to FY 2012 is due to Block 40\/45 EMD efforts ramping down\n3. The decrease between the Previous President's Budget and the Current President's Budget in FY13 is primarily due to re-phasing funds due to slow expenditures in prior years (-$76.8M); no longer converting an inventory aircraft to a test configuration (-$25M); no longer beginning a Net Centric Capability program (-$2.1M); beginning an Electronic Protection project (+$18.7M), and a small inflation adustment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "67411L"
                    },
                    "ProjectTitle": {
                        "val": "Airborne Warning & Control System (AWACS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "201.838"
                        },
                        "CurrentYear": {
                            "val": "117.880"
                        },
                        "BudgetYearOne": {
                            "val": "65.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "65.200"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "192.562"
                        },
                        "BudgetYearThree": {
                            "val": "173.544"
                        },
                        "BudgetYearFour": {
                            "val": "66.079"
                        },
                        "BudgetYearFive": {
                            "val": "57.349"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "1. Totals include funding for Program Resources Collection Process (PRCP) Program Number, 277, AWACS Upgrade (for Block 40\/45 Upgrade)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission: AWACS is the premier airborne platform providing command and control (C2)\/battle management (BM) to Commander In Chief and combatant commander tasking for joint, allied, and coalition operations, humanitarian relief, and homeland defense. AWACS provides a real-time picture of friendly, neutral, and hostile air activity. Its capabilities include all-altitude\/all-weather surveillance of the battle space; early warning of enemy actions; a real-time ability to find, fix, track, and assess airborne or maritime threats; and detection, location, and identification of electronic emitters.\n\nThis program element funds three areas in support of the AWACS program:  1. AWACS Modernization, 2. AWACS Infrastructure and Support Systems, and 3. Material Solutions Development and Analysis. Each of the three areas includes studies and analysis to support both current planning and execution, as well as future program planning.\n\n1. AWACS Modernization (RDT&E, AF):\n\na. Block 40\/45 is replacing AWACS 1970's vintage mission systems that are experiencing Diminishing Manufacturing Sources (DMS) issues, are difficult and expensive to upgrade, and limit overall AWACS system performance. The Block 40\/45 upgrade will improve integration, quality and timeliness of sensor data to the shooter, improve Combat Identification (CID), improve AWACS contribution to Time Critical Targeting via Data Link Infrastructure (DLI), improve electronic support measures processing and enable more effective, faster upgrades via an open-system, Ethernet-based architecture. The upgrade will also update the ground support infrastructure including training systems.\n\nb. The Next Generation Identification Friend or Foe (NGIFF) Program provides AWACS with enhanced IFF interrogator operation to add a more secure Mode 5 capability. NSA declared IFF Mode 4 unsecure and obsolete on 5 Nov 2003. Joint Requirements Oversight Council Memo 047-07 requires IFF Mode 5 interrogation capability by FY14. The new Mode 5 interrogation capability extends the effective range of the AWACS interrogator, while helping discriminate against closely spaced cooperative targets. NGIFF developed and integrated a basic Mode 5 capability on Block 30\/35 starting in FY09 and began developing a full Mode 5 on Block 40\/45 in FY11. Hardware will be common between the platforms. NGIFF will also integrate Mode S, a civilian air traffic control capability residing in the NGIFF hardware, as funding allows.\n\nc. Diminishing Manufacturing Sources (DMS) Replacement of Avionics for Global Operations and Navigation (DRAGON) completes the FAA\/International Civil Aviation Organization (ICAO)\/ EUROCONTROL air traffic control mandated safety of flight capabilities. This program will provide the E-3 fleet with the flight instruments and other avionics for the Required Navigation Performance (RNP), and the surveillance and communication capabilities necessary to maintain continued critical unrestricted access to global airspace. Non-compliance will result in airspace restrictions and denials that will impact AWACS ability to support worldwide responses to situations requiring immediate on-scene command and control (C2) battle management. The DRAGON modifications replace the existing DMS Global Positioning System (GPS) Integrated Navigation System (GINS) with a modern Flight Management System (FMS) that will accommodate new capabilities including Mode 5 IFF and Joint Mission Planning System (JMPS). Also included as part of the modification is the addition of data link communications, voice and data link digital radios, and improved visual displays. Emphasis on employment of COTS avionics is expected to lower cost, reduce the tech refresh cycle, and enhance life cycle management. Replacement of critical avionics subsystems that became unsustainable beginning in 2010 is included in the DRAGON program. The Engineering and Manufacturing Development (EMD) phase of DRAGON is being executed cooperatively between the US and NATO.\n\nd. The Flight Performance Software (FPS) program automates calculations currently performed manually by the pilot and flight engineer in accordance with the E-3B and C flight manual.  Phase I, automates the Takeoff and Landing (TOLD) calculations; Phase II automates the high speed calculation.  Automated calculations, using the original source data used to create the flight manual charts increases safety, improves on time departure\/arrival, improves crew efficiency, and reduces tanker support.\n\n2.  AWACS Infrastructure and Support Systems (RDT&E, AF): These efforts synchronize modernization requirements and infrastructure support across the entire weapon system from depot and field test equipment, to maintenance trainers, to simulators, to integration labs, to the TS-3 Developmental Test and Evaluation Aircraft.\n\na. Test System-3\/AWACS Development Integration Test Support (ADITS): The E-3 AWACS Developmental Test and Evaluation (DT&E) aircraft, Test System 3 (TS-3, tail number 73-1674) is a government owned\/contractor managed, maintained and operated system level DT&E asset. Together, TS-3 and ADITS provide test-ready assets to support AWACS modernization, with already imbedded test points to support sub-system and system level developmental testing, per Boeing's TS-3 design specifications. This level of DT&E testing supports both advanced and sustainment projects, which allow AWACS to participate in live-fly exercises (e.g., Joint Expeditionary Force Experiment\/JEFX; Empire Challenge\/EC) and ground-based interoperability testing. These assets also support multiple international Airborne Early Warning and Control (AEW&C) projects on a fee basis, including projects for France, Saudi Arabia, United Kingdom, Japan, and NATO AEW&C efforts.\n\nTS-3, one of the first AWACS production aircraft, is qualified to Boeing manufacturer design specifications, unlike fleet aircraft, which are qualified to technical orders.  In FY12, the Air Force divested TS-3. Beginning in FY13, the ADITS activity will be covered in the Training, Support, and Infrastructure (TSI) effort.  \n\nb. The Training, Support, and Infrastructure (TSI) programs cover required cross-cutting programs and activities in support of AWACS modernization and enhancement efforts. These include managing the AWACS developmental infrastructure, support for equipment concurrency, modernization planning\/analysis, trainer\/simulator integration and concurrency, as well as the Avionics Integration Laboratory (AIL). The E-3 Radar Systems Integration Lab\/Software Development Facility (SIL\/SDF) is maintained, operated, and supported by contract to provide customers with a functioning E-3 radar configuration in support of AWACS US, FMS and International radar development, production, and sustainment programs. New support equipment technologies and test strategies need to be analyzed to ensure concurrent capability to sustain existing, modified, and upgraded E-3 equipment. Trainer\/simulator concurrency analysis and requirements definition is necessary to ensure trainers and simulators are kept current with the AWACS baseline. Associate contractor agreements are used to integrate the planning and execution between the prime integrator and training service providers.  In FY13, TSI will continue the remaining ADITS activity which includes the Avionics Integration Laboratory.\n\n3.  Material Solutions Development & Analysis (RDT&E, AF): These efforts look toward the future by investigating enhanced capabilities and exploring new mission areas through C2ISR System Development, while advancing the capabilities of the current weapon system through Support The War Fighter (STWF).\n\na. Command & Control, Intelligence, Surveillance and Reconnaissance (C2ISR) system improvements investigate and develop future capabilities of the AWACS weapon system, or next C2ISR platform. These efforts also include investigation, analysis and development to ensure that AWACS successfully integrates with joint and coalition forces in a net-centric environment. C2ISR primarily supports Pre-Systems Acquisition in the areas of Material Solution Analysis and Technology Development. This is accomplished by prototyping and demonstrating capabilities required by the warfighter but also includes developing an E-3 Modernization & Sustainment Roadmap that projects user capability needs, as well as material solutions for the user needs. Examples of supporting activities include, but are not limited to: \n\n     (1) Evaluating emerging operational needs, concepts, and technologies to enable integration of AWACS' capabilities to align with integrated C2ISR network architectures as defined in Joint Vision 2020, C2 Constellation Concept of Operations (CONOPS), and Air Force CONOPS.\n\n     (2) Improving sensors and identifying new sensor technologies and netted sensor architectures to meet evolving threats; communications including development of communication roadmaps and assessing related technologies e.g.: all forms of Internet Protocol (IP) communications, and multi-sensor integration such as the ability to send, receive, and fuse the air (and ground) picture via data link to fighter aircraft, through rapid prototyping, modeling, simulation, and participation in Joint exercises (e.g., JEFX and EC).\n\n     (3) Improving the timeliness and accuracy of information passed to\/from fighter aircraft in the engagement zone by providing consistent and re-playable post-mission data to provide quicker reaction capabilities to support the air war.\n\n     (4) Exploring concepts, investigating emerging and developing technologies, and demonstrating efforts that  support continuous improvements and self-protection for C2ISR capabilities of manned & unmanned platforms, space, data links, and advanced Battle Management decision tools.\n\nb. Support the War Fighter (STWF): STWF efforts support AWACS capability to create and sustain the force. Examples of these activities include, but are not limited to:  Designing, developing, and modernizing equipment and systems to ensure AWACS can respond to urgent wartime\/contingency acquisition requirements (e.g. Urgent Operational Needs (UONs) and Wartime Urgent & Compelling Needs (WUCNs)). Upgrading key capabilities to meet contingency needs, modernizing test systems, integrating battle management and data link enhancements, and supporting Reliability, Maintainability, and Availability (RM&A) initiatives which:\n\n     (1) Improve the Mission Capable (MC) rate through RM&A analysis and development projects to provide system improvements that help meet or exceed the required MC rate. These efforts focus on increasing reliability of the air vehicle, command and control systems, voice and data communications systems, computer, sensor systems and infrastructure improvements.\n\n     (2) Solve DMS logistics problems.\n\n     (3) Insert new technologies with the aim of reducing maintenance man-hours along with programmed depot maintenance (PDM) improvements to increase aircraft availability.\n\nc. Electronic Protection (EP): In FY13 EP is a new effort.  The E-3 interim radar upgrade will design and develop capability improvements to the AWACS radar that provide enhanced war fighter capability in a subset of modes identified under the Radar Modernization Program (RMP) study.  The enhanced capability will be available to the airborne radar technician and to the AWACS operators.\n\nBudget Justification: This program is in Budget Activity 7, Operational Systems Development, these budget activities include development efforts to upgrade systems currently fielded or has approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AWACS Modernization"
                                    },
                                    "Description": {
                                        "val": "Focuses on development activities associated with modification efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "136.162"
                                            },
                                            "Text": {
                                                "val": "Block 40\/45: Began Mission Crew Training Set (MCTS), initial Avionics Integration Support Facility (AISF) Upgrade and Mission Computing Maintenance Trainer (MCMT) development efforts. Finished Pre-Prod activities to synchronize with first aircraft install. Completed ground infrastructure and training plans. Continued development of DLI improvements for seamless transition from Block 30\/35. Continued to administer DMS and COTS hardware tech refresh for future aircraft buys.\n\nNGIFF: Conducted Block 30\/35 flight test and DT\/OT. Reviewed requirements, interfaces, and manufacturing plans for UPX-40. Conducted Block 40\/45 software functionality and system verification on Mission Computing. Completed Installation and Checkout of hardware equipment on Block 30\/35 NGIFF. Began software system integration. Began Demonstrating software and hardware interfaces in Lab on Block 40\/45 NGIFF.\n\nDRAGON: Continued Risk Reduction efforts with the assessment of the DRAGON design on all system-level legacy requirements and mitigating Explosive Atmosphere (EA) risks.  Awarded EMD contract in July. Began development activities for System Requirements Review and Integrated Baseline Review."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "94.173"
                                            },
                                            "Text": {
                                                "val": "Block 40\/45: Continue development of MCTS (to include beginning development of the Airborne Training Set (ATS) portion of the MCTS), initial AISF Upgrade, and MCMT. Continue development of DLI improvements for seamless transition from Block 30\/35. Continue to administer DMS and COTS hardware tech refresh for future aircraft buys.\n\nNGIFF: Certify software functionality and complete system verification on mission computing for IFF on Block 40\/45. Begin software system integration in lab environment. Review requirements, interfaces, and manufacturing plans. Conduct production design decision and begin manufacturing plans. Certify software functionality and complete system verification on Mission Computing. Ensure time compliance tech orders (TCTOs) are available.\n\nDRAGON: Complete System Requirements Review and Integrated Baseline Review. Complete government review of major subcontractor's Preliminary Design Reviews (PDR) and the prime contractor's own PDR. Complete a Post PDR Assessment Review with the Milestone Decision Authority.\n\nFPS: Begin Phase II automation of High Speed TOLD calculations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.484"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.484"
                                            },
                                            "Text": {
                                                "val": "Block 40\/45: Will continue development of MCTS (to include the ATS) and MCMT. Will finish initial AISF Upgrade.  Will continue development of DLI improvements for seamless transition from Block 30\/35. Will continue to administer DMS and COTS hardware tech refresh for future aircraft buys.\n\nNGIFF: Will continue Block 30\/35 deficiency resolution from DT\/OT event. Will continue Block 40\/45 EMD.  Will complete and test software build 2.0.  Will complete UPX-40 Box 40\/45 Design Verification Test.\n \nDRAGON: Will continue DRAGON EMD. Will complete government review of major subcontractor’s Critical Design Reviews (CDR) and the prime contractor’s own CDR."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AWACS Infrastructure and Systems Support"
                                    },
                                    "Description": {
                                        "val": "Focuses on system engineering to synchronize all modernization requirements and infrastructure support across the entire weapon system-- from depot and field test equipment, to maintenance trainers, to simulators, to integration labs, to test aircraft development and support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "44.414"
                                            },
                                            "Text": {
                                                "val": "TSI:  Supported DRAGON lab integration efforts. Continued to mature emerging technologies, net-centric operations and next generation C2\/BM activities. Provided system lab support to Block 40\/45, Next Generation IFF, NCC, and Japan and RSAF radar improvement integration and test. Supported AEW&C OSD mandated interoperability testing and mandatory E-3 Operational, Safety, Suitability and Effectiveness program. Provided radar system labs in support of U.S., and Foreign Military Sales radar improvement programs\/sustainment efforts--major activities include Japan and RSAF Radar improvement activities.\n\nTS-3\/ADITS: Began TS-3 Programmed Depot Maintenance. Supported the E-3 AWACS Developmental Test and Evaluation Avionics Integration Laboratory (AIL)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.387"
                                            },
                                            "Text": {
                                                "val": "TSI:  Support Network Enabled Enclave (NEE) lab integration efforts. Continue to mature emerging technologies, net-centric operations and next generation C2\/BM activities. Provide system lab support to Block 40\/45, Next Generation IFF, NCC, RMP, and Japan and RSAF radar improvement integration and test. Support AEW&C OSD mandated interoperability testing and E-3 Operational, Safety, Suitability and Effectiveness program. Provide radar system labs in support of U.S., and Foreign Military Sales radar improvement programs\/sustainment efforts--major activities include Japan and RSAF Radar improvement activities. \n\nTS-3\/ADITS: Divest TS-3. Continue support of the E-3 AWACS Developmental Test and Evaluation Avionics Integration Laboratory (AIL)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Text": {
                                                "val": "TSI:  Will support Network Enabled Enclave (NEE) lab integration efforts that continue to mature emerging technologies.  Will provide system lab support to Block 40\/45, Next Generation IFF, TNC, SADL, RMP, Japan and RSAF radar improvement integration and test.  Will support AEW&C OSD mandated interoperability testing and support mandatory E-3 Operational, Safety, and Suitability and Effectiveness program.  Will support the E-3 AWACS Developmental Test and Evaluation Avionics Integration Laboratory (AIL)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Material Solutions Development and Analysis"
                                    },
                                    "Description": {
                                        "val": "Focuses on emerging requirements by investigating enhanced capabilities and exploring new mission areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.262"
                                            },
                                            "Text": {
                                                "val": "C2ISR: Conducted engineering\/integration study to determine required modifications and associated costs to upgrade the radar system with more robust signal processing prior to mission computing, and incorporating classified Electronic Protection measures. Executed key elements of advanced programs including:  International Cooperative Research & Development (ICR&D), NCC Requirements Definition (JCIDS related), NCCT Flight Test and data-transfer over Iridium, and DSMI-contracted risk reduction tasks. \n\nSTWF: Continued closing Link 16 gap between Block 30\/35 and Block 40\/45.  Investigated impacts of crypto modification projects on the E-3. Continued to address emerging issues.  Tested Flight Performance Software Phase I. Transitioned to Flight Performance Software Phase II. Addressed need for Situational Awareness Data Link (SADL) and BLOS Joint Range Extension Application Protocol-C (JREAP-C). Flight demonstration of SADL and BLOS JREAP-C capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.320"
                                            },
                                            "Text": {
                                                "val": "C2ISR: Conduct engineering \/ integration studies to determine required modifications and associated costs to upgrade and support Risk Reduction activities for program planning including but not limited to RMP\/EP.  Execute key program risk-reduction elements via NCC-NEE, International Cooperative Research & Development (ICR&D), Joint Track Management Capability (JTMC) and Cooperative Engagement Capability (CEC).  \n\nSTWF: Address required communication upgrades to ensure viability of AWACS Link 16 capabilities. Provide digital control of platform communication systems such as ARC-210s, SINCGARS, Have Quick and DAMA SATCOM."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.416"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.416"
                                            },
                                            "Text": {
                                                "val": "C2ISR: Will conduct engineering \/ integration studies to determine required modifications and associated costs to upgrade and support Risk Reduction activities for program planning. Will continue to execute International Cooperative Research & Development (ICR&D).  \n\nEP: Will begin development of technology solutions to mitigate issues\/concerns identified under the RMP study."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0207417F, AWACS"
                                    },
                                    "Title": {
                                        "val": "E-3 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "191.538"
                                        },
                                        "CurrentYear": {
                                            "val": "135.031"
                                        },
                                        "BudgetYearOne": {
                                            "val": "193.099"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "193.099"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "213.810"
                                        },
                                        "BudgetYearThree": {
                                            "val": "192.491"
                                        },
                                        "BudgetYearFour": {
                                            "val": "276.917"
                                        },
                                        "BudgetYearFive": {
                                            "val": "296.562"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0207417F"
                                    },
                                    "Title": {
                                        "val": "E-3 Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.031"
                                        },
                                        "CurrentYear": {
                                            "val": "16.928"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.498"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.498"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.656"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.051"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.936"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.164"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF, PE 0809731F, Training Spt"
                                    },
                                    "Title": {
                                        "val": "Maintenance Training Device Upgrades (E-3)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.468"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.614"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.698"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.705"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Most major programs (Block 40\/45, DRAGON, TS-3 and lab support) will be sole source to the Boeing Corporation, Seattle, WA."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207417F_BPAC_67411L_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NAVWAR FOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "40\/45 MCT EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "40\/45 FRP Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "40\/45 IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGIFF 30\/35 DT\/OT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGIFF EMD (Deficiency resolution for UPX-40 software developed for Block 30\/35)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGIFF EMD (UPX-40 software and firmware development for Block 40\/45)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGIFF Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGIFF 40\/45 DT\/OT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGIFF IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DRAGON Technology Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DRAGON Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DRAGON EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DRAGON DT\/OT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DRAGON Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EP Technology Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EP Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EP EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EP Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FPS Phase 1 Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FPS Phase 2 EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FPS Phase 2 DT\/OT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FPS Phase 2 Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}