{
    "id": "5320c9d4563fd62d687026e30eedda10fd48d5bd",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DARPA_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.zzz_unzipped_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0601117E"
        },
        "ProgramElementTitle": {
            "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
        },
        "R1LineItemNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "37.870"
            },
            "BudgetYearOne": {
                "val": "39.676"
            },
            "BudgetYearOneBase": {
                "val": "39.676"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "45.500"
            },
            "BudgetYearThree": {
                "val": "46.500"
            },
            "BudgetYearFour": {
                "val": "48.500"
            },
            "BudgetYearFive": {
                "val": "48.500"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Basic Operational Medical Science Program Element is budgeted in the Basic Research Activity because it will explore and develop basic research in medical-related information and technology leading to fundamental discoveries, tools, and applications critical to solving DoD challenges.  Programs in this project address the Department's identified medical gaps in taking care of the warfighter such as blast-induced traumatic brain injury.  Efforts will draw upon the information, computational modeling and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  This project will establish a fundamental understanding of brain function, short-term memory and the mechanism(s) of injury induced by exposure to blast.  Basic research that aims at new methods and medical devices includes the ability to perform in-theater, continuous analysis of a warfighter's health as a preventative measure to mitigate widespread disease and development of biomaterials that allow long-term interfaces with neural tissue, electronics that provide sound attenuation and processes to remove harmful bacteria and their toxins in blood to prevent sepsis."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "37.870"
                },
                "BudgetYearOne": {
                    "val": "44.676"
                },
                "BudgetYearOneBase": {
                    "val": "44.676"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "37.870"
                },
                "BudgetYearOne": {
                    "val": "39.676"
                },
                "BudgetYearOneBase": {
                    "val": "39.676"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.000"
                },
                "BudgetYearOneBase": {
                    "val": "-5.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-5.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013:  Decrease reflects minor repricing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MED-01"
                    },
                    "ProjectTitle": {
                        "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "37.870"
                        },
                        "BudgetYearOne": {
                            "val": "39.676"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.676"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "45.500"
                        },
                        "BudgetYearThree": {
                            "val": "46.500"
                        },
                        "BudgetYearFour": {
                            "val": "48.500"
                        },
                        "BudgetYearFive": {
                            "val": "48.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Operational Medical Science Program Element is budgeted in the Basic Research Activity because it will explore and develop basic research in medical-related information and technology leading to fundamental discoveries, tools, and applications critical to solving DoD challenges.  Programs in this project address the Department's identified medical gaps in taking care of the warfighter such as blast-induced traumatic brain injury.  Efforts will draw upon the information, computational modeling and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  This project will establish a fundamental understanding of brain function, short-term memory and the mechanism(s) of injury induced by exposure to blast.  Basic research that aims at new methods and medical devices includes the ability to perform in-theater, continuous analysis of a warfighter's health as a preventative measure to mitigate widespread disease and development of biomaterials that allow long-term interfaces with neural tissue, electronics that provide sound attenuation and processes to remove harmful bacteria and their toxins in blood to prevent sepsis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Assisted Neural Devices*"
                                    },
                                    "Description": {
                                        "val": "*Previously funded in PE 0601101E, Project BLS-01\n\nThe Human Assisted Neural Devices program will develop the scientific foundation for understanding the language of the brain for application to a variety of emerging DoD challenges, including improving performance on the battlefield and returning active duty military to their units after injury.  This will require an understanding of neuroscience, significant computational efforts, and new material design and implementation.  Key advances expected from this research include determining the nature and means through which short-term memory is encoded, and discovering the mechanisms and dynamics underlying neural computation and reorganization.  These advances will enable memory restoration through the use of devices programmed to bridge gaps in the injured brain.  Further, modeling of the brain will progress to an unprecedented level with this novel approach."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.370"
                                            },
                                            "Text": {
                                                "val": "-  Assess consistency to encode long-term memory through use of patterned neural stimulation in pre-clinical models. \n-  Identify homogeneity of neural codes involving long-term memory in preclinical studies conducting various long-term memory tasks. \n-  Develop wireless neural interface for online, closed loop recovery of long-term memory encoding and retrieval in pre-clinical studies.\n-  Determine whether networks of neurons can be differentially modulated through optogenetic neural stimulation in animal models.\n-  Investigate how connectivity affects the rate at which information is transmitted between areas of the brain. \n-  Evaluate the ability to model multi-scale brain recording and imaging data in order to accurately predict underlying spiking behavior of groups of neurons.\n-  Investigate the ability in animal models to engage in virtual sensorimotor tasks through the use of recorded neural signals.\n-  Determine if non-human primates can evaluate and make use of auxiliary sensory information provided solely through a neural interface."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.176"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.176"
                                            },
                                            "Text": {
                                                "val": "-  Expand suite of tools and methods to enable optogenetic neuromodulation of specific, diverse neural populations in animal models. \n-  Demonstrate ability of non-human primate to perform a dexterous sensorimotor task using only auxiliary sensory information provided through a neural interface.\n-  Develop models that predict the evolution of neural firing patterns following brain injury, and following the introduction of artificial neural connections aimed at facilitating recovery.\n-  Demonstrate the ability of non-human primates to perform a dexterous sensorimotor task through the use of a neural interface, without the use of neural spike recordings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT)*"
                                    },
                                    "Description": {
                                        "val": "*Previously funded in Synthetic Biology in PE 0601101E, Project TRS-01\n\nThe Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program will develop the underlying technologies to rapidly respond to a disease or threat, and improve individual readiness and total force health protection by providing centralized laboratory capabilities at non-tertiary care and individual settings.  ADEPT will develop and exploit synthetic biology for the in vivo creation of nucleic acid circuits that continuously and autonomously sense and respond to changes in physiologic state and for novel methods to target delivery, enhance immunogenicity, or control activity of vaccines, potentially eliminating the time to manufacture a vaccine ex vivo.  ADEPT advancements to control cellular machinery include research to optimize orthogonality and modularity of genetic control elements; identify methods to increase sensitivity and specificity; and demonstrate methods to control cellular machinery in response to changes in physiological status.  ADEPT will develop methodologies for measuring health-specific biomarkers from a collected biospecimen to enable diagnostics at the point-of-need or resource limited clinical facilities (point-of-care), in-garrison or deployed.  Additionally, ADEPT will initiate techniques to characterize natural signal transduction pathways, such as electrical and mechanical, that are not conventionally used to guide diagnosis, or as a therapeutic measure.  The signals will be studied in detail and their physiological function validated for measurement and modulation to determine diagnostic and therapeutic benefit.  Applied research efforts are budgeted in PE 0602115E, Project BT-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.500"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of modular and orthogonal nucleic acid-based elements for application within a sense-and-respond circuit that operates within context of a mammalian cell.\n-  Investigate controlled expression in mammalian cells of synthetic circuit that responds to physiological biomarkers associated with health status.\n-  Develop novel concepts and molecular approaches to enable deployable diagnostics.\n-  Develop novel reagents and materials for stabilizing self-collected biospecimens at room temperature for simple shipment and storage.\n-  Develop methods for sample preparation that require no operator manipulation and are consistent with point-of-need and point-of-care settings.\n-  Develop new methods for signal amplification amenable to deployable diagnostics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate development of modular and orthogonal nucleic acid-based elements for application within a sense-and-respond circuit that operates within context of a mammalian cell.\n-  Demonstrate controlled expression in mammalian cells of synthetic circuit that responds to physiological biomarkers associated with health status.\n-  Quantify performance of developed molecular approaches designed for deployable diagnostics.\n-  Quantify performance of biostabilization reagents\/materials.\n-  Quantify performance of methods for room temperature analyses and reagent stabilization.\n-  Quantify detection limits achieved with signal amplification methods.\n-  Demonstrate performance of new sample preparation methods suitable for simple and multiplexed analysis off of biospecimens that are either self-collected under low-resource settings or collected by trained professionals at the physician-office settings.\n-  Design integration of developed diagnostic methodologies. \n-  Investigate bioelectric signatures and signaling patterns related to biological responses, such as baseline status and regenerative tissue conditions. \n-  Characterize bio-electric signaling from multiple cell types\/biological environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dialysis-Like Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Sepsis, a bacterial infection of the blood stream, is a significant cause of injury and death among combat-injured soldiers.  The goal of this program is to develop a portable device capable of controlling relevant components in the blood volume on clinically relevant time scales.  Reaching this goal is expected to require significant advances in sensing in complex biologic fluids, complex fluid manipulation, separation of components from these fluids, and mathematical descriptions capable of providing predictive control over the closed loop process.  The envisioned device would save the lives of thousands of military patients each year by effectively treating sepsis and associated complications. \n\nInitial basic research will develop the component technologies that will ultimately make up the integrated device. Included in this effort will be the development of non-fouling, continuous sensors for complex biological fluids; design of high-flow microfluidic structures that do not require the use of anticoagulation; development of intrinsic separation technologies that do not require pathogen specific molecular labels or binding chemistries; and predictive modeling and control (mathematical formalism) with sufficient fidelity to enable agile adaptive closed-loop therapy.  Applied research efforts are budgeted in PE 0602115E, Project BT-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Achieve intermittent sensing technologies for the detection of pathogens and biomolecules in flowing blood, blood components, and wound fluid at least every 45 minutes with more than 2 hours of continuous operation.\n-  Attain microfluidic architectures and coatings for 100 mL\/hr microfluidic system blood flow for at least 2 hours without platelet activation or clotting.\n-  Accomplish 50% removal of pathogens and select bioagents from blood or blood components via label free separation technologies.\n-  Demonstrate a clinically relevant sepsis predictive model and training algorithm based on data sets from published literature."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Improve intermittent sensing technologies for the continuous detection of pathogens and biomolecules in flowing blood, blood components, and wound fluid.\n-  Refine microfluidic architectures and coatings for continuous blood flow without platelet activation or clotting.\n-  Enhance label-free separation technologies to successfully remove pathogens and select bioagents from blood or blood components.\n-  Validate the sepsis predictive modeling using larger anonymous clinical datasets."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}