{
    "id": "58bf37d8a8cd2f11aec4d8ec63d0f9b117e0b768",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA6_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605857A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology Mgmt Support"
        },
        "R1LineItemNumber": {
            "val": "156"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "3.084"
            },
            "CurrentYear": {
                "val": "4.953"
            },
            "BudgetYearOne": {
                "val": "4.601"
            },
            "BudgetYearOneBase": {
                "val": "4.601"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "4.037"
            },
            "BudgetYearThree": {
                "val": "4.142"
            },
            "BudgetYearFour": {
                "val": "3.872"
            },
            "BudgetYearFive": {
                "val": "3.805"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program resources environmental quality technology (EQT) related management support functions including support of RDT&E required for EQT technical integration efforts at demonstration\/validation test sites, technical information and activities, test facilities and general test instrumentation, and EQT requirement assessments.  Funds required to support the management of technology transfer associated with technology demonstrated and validated as part of Army EQT projects are included in this program element.  In addition, support to the Army weapon system acquisition community to address generic pollution prevention related requirements are included under the Environmentally Sustainable Acquisition\/Logistics Program.\n\nThe Environmentally Sustainable Acquisition\/Logistics project includes program management for developing acquisition strategies that both achieve system key performance parameters and sustain the environment without permanent and unacceptable change in the natural environment or human health from system concept refinement through disposal.  It includes systematic consideration of environmental impacts, energy use, natural resources, installation impacts, economics, and quality of life.  It provides support to the system acquisition community, e.g., program and project managers, to integrate environmental quality analyses into the system acquisition process.  The goal is to resolve environmental quality issues related to weapon systems that are identified during design, development, testing, operation, or support to reduce Army environmental liabilities and total ownership costs and includes efforts to eliminate the use of hazardous and ozone-depleting materials from weapon systems and facilities and to ensure the availability of Halon 1301 to support weapon system fire suppression requirements.  \n\nThe Unexploded Ordnance Detection and Clearance project, beginning in FY 2004, is being overseen by the Army.  The project had been overseen by Office of the Secretary of Defense in prior years.  This project funds the Unexploded Ordnance Center of Excellence (UXOCOE) to provide for coordination of unexploded ordnance (UXO) technologies across the Department of Defense.\n\nThe Pollution Prevention Technology Support project provided management support for the demonstration and validation of reformulated surface coating materials for weapon systems production and maintenance operations.  These materials increase operational sustainment and warfighter training capabilities by reducing soldier health risks, environmental impacts and compliance enforcement actions against installations while increasing coatings performance and standardization across the Army."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.195"
                },
                "CurrentYear": {
                    "val": "4.961"
                },
                "BudgetYearOne": {
                    "val": "5.075"
                },
                "BudgetYearOneBase": {
                    "val": "5.075"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.084"
                },
                "CurrentYear": {
                    "val": "4.953"
                },
                "BudgetYearOne": {
                    "val": "4.601"
                },
                "BudgetYearOneBase": {
                    "val": "4.601"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.111"
                },
                "CurrentYear": {
                    "val": "-0.008"
                },
                "BudgetYearOne": {
                    "val": "-0.474"
                },
                "BudgetYearOneBase": {
                    "val": "-0.474"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.091"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.474"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.474"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.020"
                                },
                                "CurrentYear": {
                                    "val": "-0.008"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "031"
                    },
                    "ProjectTitle": {
                        "val": "Environmentally Sustainable Acquisition\/Logistics"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.220"
                        },
                        "CurrentYear": {
                            "val": "3.704"
                        },
                        "BudgetYearOne": {
                            "val": "3.441"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.441"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.881"
                        },
                        "BudgetYearThree": {
                            "val": "2.933"
                        },
                        "BudgetYearFour": {
                            "val": "2.679"
                        },
                        "BudgetYearFive": {
                            "val": "2.632"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Environmentally Sustainable Acquisition\/Logistics (ESAL) project provides support to the system acquisition community to integrate environmental quality (EQ) issues and concerns into the life cycle system acquisition process.  To a much lesser extent, safety, occupational health (OH) and energy efficiency are also addressed.   The focus of ESAL is on improving readiness, improving acquisition processes, reducing supportability burden, and minimizing total ownership cost.  The Assistant Secretary of the Army for Installations, Energy and Environment [ASA(IE&E)] has defined the functions of the ESAL project in coordination with the Army Acquisition Executive and the Assistant Secretary of the Army (Acquisition, Logistics, and Technology).  This project provides direct support to the Army acquisition community to pursue environmental sustainability and comply with legal statutes, policies and regulations during the life cycle of Army materiel.  ESAL helps the Army achieve compliance with its weapon systems, industrial base, field and deployed activities directed by international treaties, Federal statutes, Executive Orders, Department of Defense (DoD) and Army policies and regulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Quality Support"
                                    },
                                    "Description": {
                                        "val": "Environmental Quality Support to Acquisition Programs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided support to Program Executive Officers\/Program Managers (PEOs\/PMs) to integrate EQ considerations into systems engineering activities.  This included fulfillment of National Environmental Policy Act requirements, definition of EQ technology needs to meet operational requirements, analysis of technical data to support implementation decisions, and assessment and revision of contractual and operational requirements for successful technology integration, operation and support.  Analyzed impending legal statutes impacting production, operation and support of weapon systems.  Assessed readiness impacts to weapon systems resulting from EQ impacts in capabilities of industrial base and garrisons to support production levels, training and operational tempo and maintenance activities.  Provided Army acquisition community representation in select Office of the Secretary of Defense (OSD) and Department of the Army (DA) committees addressing environmental legislation and rulemaking."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide support to PEOs\/PMs to integrate EQ considerations and, to a much lesser extent, some safety and OH considerations into systems engineering activities.  This includes fulfillment of National Environmental Policy Act requirements, definition of EQ technology needs to meet operational requirements, participation in development of test plans and protocols, oversight of testing efforts, analysis of technical data to support implementation decisions, participation in technical and cost risk assessment activities, and assessment and revision of contractual and operational requirements for successful technology integration, operation and support.  Provide technology management and technical support to logistics initiatives including the EQ aspects of the Army Corrosion Program and the DoD Corrosion Program.  Analyze impending legal statutes impacting production, operation and support of weapon systems.  Support achievement of the Executive Order 13514 energy and greenhouse gas emission reduction goals, Pollution Prevention goals, and Army industrial base facility goals; Executive Order 13423 and associated Army goals for Toxic and Hazardous Chemical Reduction; and the DFARS clause restricting the use of hexavalent chromium on all defense contracts.  Assess readiness impacts to weapon systems resulting from EQ impacts in capabilities of industrial base and garrisons to support production levels, training and operational tempo and maintenance activities.  Provide Army acquisition community representation in OSD and DA committees addressing environmental legislation and rulemaking."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.632"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.632"
                                            },
                                            "Text": {
                                                "val": "Will provide support to PEOs\/PMs to integrate EQ considerations and, to a much lesser extent, some safety and OH considerations into systems engineering activities.  This will include fulfillment of National Environmental Policy Act requirements, definition of EQ technology needs to meet operational requirements, participation in development of test plans and protocols, oversight of testing efforts, analysis of technical data to support implementation decisions, participation in technical and cost risk assessment activities, and assessment and revision of contractual and operational requirements for successful technology integration, operation and support.  Will analyze impending legal statutes impacting production, operation and support of weapon systems.  Will support achievement of the Executive Order 13514 energy and greenhouse gas emission reduction goals, Pollution Prevention goals, and Army industrial base facility goals; Executive Order 13423 and associated Army goals for Toxic and Hazardous Chemical Reduction; and the DoD policy, DFARS clause and Army policy restricting the use of hexavalent chromium.  Will assess weapon system readiness impacts (e.g., production levels, training, operational tempo and maintenance activities) resulting from EQ issues affecting industrial base and garrisons.  Will provide Army acquisition community representation in OSD and DA committees addressing environmental legislation and rulemaking."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Quality Technology (EQT) Program Management"
                                    },
                                    "Description": {
                                        "val": "Provide EQT program management support to Army programs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.701"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided system acquisition support to the Army's Environmental Technology Technical Committee (ETTC) and coordination of EQ-related systems' needs for expanded Research, Development Test and Evaluation (RDT&E) efforts.  Performed program management and oversight of technology integration efforts by Army Life Cycle Management Commands and PEO\/PM environmental integrated process teams for new design, new procurement and fielded weapon systems.  Provided technology management, technical support, and representation of the Army Materiel Command (AMC) voting member of the Army EQT program.  This included coordination of RDT&E Budget Activity (BA)-1 and BA-2 requirements among members of the EQT Pollution Prevention Technology Team and coordination of RDT&E BA-3 and BA-4 technology evaluations and operational requirements in support of weapon system platform integration.  Managed development and execution of plans for the following pollution prevention technology areas: Sustainable Painting Operations for the Total Army to enable compliance with impending regulations; reformulation of materials used in ammunition, rockets and missiles, and pyrotechnics to remove perchlorate and other hazardous constituents; and Zero Footprint Camp to reduce the fuel and water logistics burden in Overseas Contingency Operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.338"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide system acquisition support to the Army's ETTC and coordination of EQ-related systems' needs for expanded RDT&E efforts.  Perform program management and oversight of technology integration efforts by Army Life Cycle Management Commands and PEO\/PM environmental integrated process teams for new design, new procurement and fielded weapon systems.  Provide technology management, technical support, and representation of the AMC voting member of the Army EQT program.  This includes coordination of RDT&E BA-1 and BA-2 requirements among members of the EQT Pollution Prevention Technology Team, coordination of RDT&E BA-3 and BA-4 technology evaluations and operational requirements in support of weapon system platform integration, management and oversight for developing test plans, oversight of testing activities, and technical data analysis of test results to support weapon systems engineering decision making.  Participate in performance and cost\/risk assessments in support of ASA(IE&E) program objectives.  Manage development and execution of plans for the following pollution prevention technology areas: reformulation of materials used in ammunition, rockets and missiles, and pyrotechnics to remove perchlorate and other hazardous constituents; Zero Footprint Camp to reduce the fuel and water logistics burden in Overseas Contingency Operations; Reductions in Toxic Metals Used in Surface Finishing on Army Weapon Systems; Alternative Battlefield Fuels; Airborne Lead Reduction in Army Weapon Systems; and other emerging pollution prevention technology areas as necessary."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.228"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.228"
                                            },
                                            "Text": {
                                                "val": "Will provide system acquisition support to the Army's ETTC and coordination of EQ-related systems' needs for expanded RDT&E efforts.  Will manage and oversee technology integration efforts by Army Life Cycle Management Commands and PEO\/PM environmental integrated process teams for weapon systems in all stages of design, procurement and operations\/support.  Will coordinate RDT&E BA-1 and BA-2 requirements among members of the EQT Pollution Prevention Technology Team, coordinate RDT&E BA-3 and BA-4 technology evaluations and operational requirements in support of weapon system platform integration, manage and oversee test plan development, oversee testing activities, and analyze test results to support weapon systems engineering decision making.  Will participate in performance and cost\/risk assessments in support of ASA(IE&E) program objectives.  Will manage development and execution of plans for the following pollution prevention technology areas: reformulation of materials used in ammunition and pyrotechnics to remove hazardous constituents; Zero Footprint Camp to reduce the fuel and water logistics burden in Overseas Contingency Operations; Reductions in Toxic Metals Used in Surface Finishing on Army Weapon Systems; Alternative Battlefield Fuels; and Airborne Lead Reduction in Army Weapon Systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ozone Depleting Substance Management"
                                    },
                                    "Description": {
                                        "val": "Oversee Army efforts to manage the use\/eliminatin of ozone depleting substances, greenhouse gases and hazardous and toxic materials on Army weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.145"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Oversaw Army efforts to manage the use\/elimination of ozone-depleting substances, greenhouse gases, and hazardous and toxic materials on Army weapon systems.  Participated in select Federal government and multi-national forums discussing use and replacement of ozone depleting substances and greenhouse gases, justifying mission critical applications, and addressing international importation and use regulations\/restrictions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.634"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Oversee Army efforts to manage the use\/elimination of ozone-depleting substances, greenhouse gases, and hazardous and toxic materials on Army weapon systems.  Manage and oversee the Army's reserve of ozone-depleting substances that contains the Army's strategic supplies of Halon used for explosion and fire suppression systems and R-22 used in fielded environmental control units.  Coordinate with PEOs\/PMs to affect system replacement and retrofit to eliminate ozone depleting substances while minimizing greenhouse gases, obtain approval to require use of Halon in new contracts, and assist garrison commanders to assure recovery and deposit of excess Halon and R-22 into the reserve.  Participate in Federal government and multi-national forums discussing use and replacement of ozone depleting substances and greenhouse gases, justifying mission critical applications, and addressing international importation and use regulations\/restrictions.  Significant effort supports Army warfighters in Operation Enduring Freedom and Operation New Dawn assuring adequate supplies of fire\/explosion suppression and cooling agents in the theatre of operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.581"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.581"
                                            },
                                            "Text": {
                                                "val": "Will oversee Army efforts to manage the use\/elimination of ozone-depleting substances, greenhouse gases, and hazardous and toxic materials on Army weapon systems.  Will manage and oversee the Army's reserve of ozone-depleting substances that contains the Army's strategic supplies of Halon used for explosion and fire suppression systems and R-22 used in fielded environmental control units.  Will coordinate with PEOs\/PMs to affect system replacement and retrofit to eliminate ozone depleting substances while minimizing greenhouse gases, will obtain approval to require use of Halon in new contracts, and will assist garrison commanders to assure recovery and deposit of excess Halon and R-22 into the reserve.  Will participate in Federal government and multi-national forums discussing use and replacement of ozone depleting substances and greenhouse gases, justifying mission critical applications, and addressing international importation and use regulations\/restrictions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "06H"
                    },
                    "ProjectTitle": {
                        "val": "UNEXPLODED ORDNANCE CLEARANCE TECHNOLOGY SUPPORT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.823"
                        },
                        "CurrentYear": {
                            "val": "1.249"
                        },
                        "BudgetYearOne": {
                            "val": "1.160"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.160"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.156"
                        },
                        "BudgetYearThree": {
                            "val": "1.209"
                        },
                        "BudgetYearFour": {
                            "val": "1.193"
                        },
                        "BudgetYearFive": {
                            "val": "1.173"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This effort was devolved to the Army from the office of the Under Secretary of Defense for Acquisition, Technology and Logistics (USD(AT&L)).  This effort funds the Unexploded Ordnance Center of Excellence (UXOCOE), which provides the day-to-day management, coordination, and information clearinghouse functions, and serves as the Department of Defense's (DoD) center for coordinating Unexploded Ordnance (UXO) Research, Development, Test and Evaluation (RDT&E) requirements and programs across DoD; develops and promotes standards for testing, modeling, and evaluation; maintains information on technologies for UXO detection and clearance; publishes an annual report summarizing the activities and accomplishments of the UXOCOE in order to improve the effectiveness and economy of UXO detection and clearance RDT&E efforts throughout DoD; and gathers and maintains a database for the results of these efforts.  The Army manages,  oversees, and coordinates this effort on behalf of the office of the USD(AT&L)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Coordinate\/collect\/analyze UXO RDT&E information via conferences, seminars, and workshops."
                                    },
                                    "Description": {
                                        "val": "Coordinate\/collect\/analyze UXO RDT&E information via conferences, seminars, and workshops."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.257"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Coordinated\/collected\/analyzed UXO RDT&E information via conferences, seminars, and workshops."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Coordinate\/collect\/analyze UXO RDT&E information via conferences, seminars, and workshops."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.389"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.389"
                                            },
                                            "Text": {
                                                "val": "Will coordinate\/collect\/analyze UXO RDT&E information via conferences, seminars, and workshops."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Generate an annual UXO Clearance Report focused on UXO RDT&E efforts for countermine, explosive ordnance disposal, UXO remediation, humanitarian demining, and active range clearance."
                                    },
                                    "Description": {
                                        "val": "Generate an annual UXO Clearance Report focused on UXO RDT&E efforts for countermine, explosive ordnance disposal, UXO remediation, humanitarian demining, and active range clearance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.156"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Generated an annual UXO Clearance Report focused on UXO RDT&E efforts for countermine, explosive ordnance disposal, UXO remediation, humanitarian demining, and active range clearance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.232"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Generate an annual UXO Clearance Report focused on UXO RDT&E efforts for countermine, explosive ordnance disposal, UXO remediation, humanitarian demining, and active range clearance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.237"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.237"
                                            },
                                            "Text": {
                                                "val": "Will generate an annual UXO Clearance Report focused on UXO RDT&E efforts for countermine, explosive ordnance disposal, UXO remediation, humanitarian demining, and active range clearance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintain and update the UXO clearance\/detection databases and computer web site and analyze data from and programs in UXO RDT&E for potential solutions to UXO related needs."
                                    },
                                    "Description": {
                                        "val": "Maintain and update the UXO clearance\/detection databases and computer web site and analyze data from and programs in UXO RDT&E for potential solutions to UXO related needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.280"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintained and updated the UXO clearance\/detection databases and computer web site and analyze data from and programs in UXO RDT&E for potential solutions to UXO related needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.322"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintain and update the UXO clearance\/detection databases and computer web site and analyze data from and programs in UXO RDT&E for potential solutions to UXO related needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.329"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.329"
                                            },
                                            "Text": {
                                                "val": "Will maintain and update the UXO clearance\/detection databases and computer web site and analyze data from and programs in UXO RDT&E for potential solutions to UXO related needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Provide oversight of UXOCOE's Ft. A. P. Hill test site which is used for standardized scientific experiments to help gather data on and model the performance of potential UXO sensors.  Data are needed"
                                    },
                                    "Description": {
                                        "val": "Provide oversight of UXOCOE's Ft. A. P. Hill test site which is used for standardized scientific experiments to help gather data on and model the performance of potential UXO sensors.  Data are needed for the acquisition of UXO sensor performance data versus a full system evaluation.  Focus is on the sensor itself, not on full-scale operational system capability.  Full-scale development would occur during engineering and manufacturing development and be aimed at meeting validated requirements prior to full-rate production."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.130"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided oversight of UXOCOE's Ft. A. P. Hill test site which was used for standardized scientific experiments to help gather data on and model the performance of potential UXO sensors.  Data were needed for the acquisition of UXO sensor performance data versus a full system evaluation.  Focus was on the sensor itself, not on full-scale operational system capability.  Full-scale development would occur during engineering and manufacturing development and be aimed at meeting validated requirements prior to full-rate production."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.198"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide oversight of UXOCOE's Ft. A. P. Hill test site which is used for standardized scientific experiments to help gather data on and model the performance of potential UXO sensors.  Data are needed for the acquisition of UXO sensor performance data versus a full system evaluation.  Focus is on the sensor itself, not on full-scale operational system capability.  Full-scale development would occur during engineering and manufacturing development and be aimed at meeting validated requirements prior to full-rate production."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.205"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.205"
                                            },
                                            "Text": {
                                                "val": "Will provide oversight of UXOCOE's Ft. A. P. Hill test site which will be used for standardized scientific experiments to help gather data on and model the performance of potential UXO sensors.  Data will be needed for the acquisition of UXO sensor performance data versus a full system evaluation.  Focus will be on the sensor itself, not on full-scale operational system capability.  Full-scale development will occur during engineering and manufacturing development and be aimed at meeting validated requirements prior to full-rate production."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "06I"
                    },
                    "ProjectTitle": {
                        "val": "POLLUTION PREVENTION TECH SUPPORT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.041"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provided RDTE Management Support for the demonstration and validation of new and reformulated paints, paint removers, cleaners and other surface coating materials and processes for weapon systems production and maintenance operations.  The project increases operational sustainment and warfighter training capabilities by reducing soldier health risks, environmental impacts and compliance enforcement actions against installations while increasing coatings performance and standardization across the Army.  Materials and processes supported by this project are inherently compliant with all applicable National Emissions Standards for Hazardous Air Pollutants that regulate surface coating activities, thereby eliminating the need for Army installations to incur hundreds of millions of dollars in expenses to purchase, install and operate air pollution control devices.  This project provided for management of RDTE activities conducted under project 0603804A, Logistics and Engineer Equipment - Adv Dev (K42).  The project supported Sustainable Painting Operations for the Total Army (SPOTA) at facilities that produce and maintain Combat Support\/Combat Service Support systems, Ground Combat Vehicles and other Army equipment.  The project expedited technology transition from the laboratory to operational use by supporting the demonstration of new materials and processes to fulfill the performance requirements outlined in Material Specifications, Depot Maintenance Work Requirements, Technical Manuals and other technical data.  The project was managed by the Director of the Environmental Acquisition and Logistics Sustainment Program at the Headquarters, U.S. Army Research, Development and Engineering Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Painting Operations for the Total Army Management Support"
                                    },
                                    "Description": {
                                        "val": "Funding was provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.041"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Managed and oversaw implementation of reformulated surface coating materials."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}