{
    "id": "678f8a6aeccf81878c0d13d6ebfd86fd3fdb5aad",
    "meta": {
        "filename": "dod-2013_RDTE_2013_TJS_JustificationBook_The_Joint_Staff_PB_2013.zzz_unzipped_JustificationBook_The_Joint_Staff_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604787J"
        },
        "ProgramElementTitle": {
            "val": "Joint Systems Integration"
        },
        "R1LineItemNumber": {
            "val": "104"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "3.273"
            },
            "BudgetYearOneBase": {
                "val": "3.273"
            },
            "BudgetYearTwo": {
                "val": "3.275"
            },
            "BudgetYearThree": {
                "val": "3.297"
            },
            "BudgetYearFour": {
                "val": "3.293"
            },
            "BudgetYearFive": {
                "val": "3.248"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2013, funds transfer to the Joint Staff"
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Systems Integration program element provides mission funding for the Joint System Integration Center (JSIC) to conduct interoperability assessments, and develop solutions\/recommendations to improve integration of Service, Defense Agency, and coalition systems. Joint Staff J8 is the executive agent for the JSIC.  \n\nJSIC provides for the fielding of warfighter Command and Control (C2) systems through rapid systems integration, technical assessment, and operational evaluation using laboratory environments and field venues. \n \nJSIC provides Combatant Commands with a laboratory and assessment environment for the warfighter and capability developer to evaluate current and near-term joint and coalition capabilities at the operational and tactical levels.  JSIC's C2 Environment accurately replicates an operational C2 environment to assess system of systems interoperability, operational capability, procedural compliance and technical suitability of emerging and existing systems and programs to confirm readiness for deployment.  \n\nJSIC also serves as the technical analysis and operational assessment activity in support of the Joint Staff capability-driven requirements process, the Joint Capabilities Integration and Development System (JCIDS).  JSIC also serves as a joint interoperability compliance activity for the milestone decision authorities\/program managers in the Defense acquisition enterprise."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.273"
                },
                "BudgetYearOneBase": {
                    "val": "3.273"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.273"
                },
                "BudgetYearOneBase": {
                    "val": "3.273"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Transfer to the Joint Staff"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.273"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.273"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P787"
                    },
                    "ProjectTitle": {
                        "val": "Joint Systems Integration Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.273"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.273"
                        },
                        "BudgetYearTwo": {
                            "val": "3.275"
                        },
                        "BudgetYearThree": {
                            "val": "3.297"
                        },
                        "BudgetYearFour": {
                            "val": "3.293"
                        },
                        "BudgetYearFive": {
                            "val": "3.248"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2013 funds transfer to the Joint Staff.  For FY 2012 and previous years, refer to PE 0604787D8Z."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Systems Integration program element  provides mission funding for the Joint System Integration Center (JSIC) to conduct interoperability assessments, and develop solutions\/recommendations to improve integration of Service, Defense Agency, and coalition systems.  JSIC promotes Service\/Defense Agency C2 capability integration, and conducts technical, operational, and DOTMLPF assessments of Command and Control (C2) and Command, Control, Computer, Communication, Intelligence, Surveillance and Reconnaissance (C4ISR) capabilities.  JSIC serves as the technical analysis and operational assessment activity in support of the Joint Staff capability-driven requirements process, the Joint Capabilities Integration and Development System (JCIDS).  JSIC also serves as a joint interoperability compliance activity for the milestone decision authorities\/program managers in the Defense acquisition enterprise.\n\nJSIC provides Combatant Commands with a laboratory and assessment environment for the warfighter and capability developer.  This environment provides for assessment of current and near-term joint and coalition capabilities primarily at the operational and tactical levels. JSIC assesses system of systems interoperability, operational capability, procedural compliance and technical suitability of emerging and existing systems and programs to confirm readiness for deployment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interoperability Assessments(IA) and Interoperability Technology Demonstration Center(ITDC)"
                                    },
                                    "Description": {
                                        "val": "IA supports the interoperability assessment of systems in five categories: operational, system of systems, technical, software, and procedural."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.273"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.273"
                                            },
                                            "Text": {
                                                "val": "Interoperability assessments will be conducted to solve warfighter problems, including coalition challenges. Focus areas will include Joint Command and Control Capabilities, Intelligence support to C2\/ISR, Integrated Air and Missile Defense, Joint Fires Capabilities, Cyberspace, Information Sharing Capabilities, and Data Strategy Implementation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "JSIC supports interoperability of systems selected for acquisition, integration and fielding.  JSIC is intended to be a forcing function to discover and provide interoperable joint solutions as a means to foster rapid, near-term insertion of command and control technology by promoting the ability to meet the DoD direction for spiral development and evolutionary acquisition.  Services and Defense Agencies are responsible for conducting acquisition activities in Programs of Record (POR)."
                        },
                        "PerformanceMetrics": {
                            "val": "FY 2013 Strategic Goals Supported:  Joint Command and Control \n\n- Drive resolution of C4 interoperability problems with actionable recommendations stemming from technical and operational demonstrations and assessments of existing and emerging C4 capabilities.\n\n- Integrate and assess technical solutions that provide gap-filling capabilities to satisfy near-term operational requirements.\n\n- Provide a persistent C4 environment replicating an operational Joint Task Force Headquarters and\/or subordinate elements to conduct interoperability, capability, and integration assessments."
                        }
                    }
                }
            ]
        }
    }
}