{
    "id": "684b8febbbeaac0f843a6e8374a55abd6a6a7b79",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA3_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603461A"
        },
        "ProgramElementTitle": {
            "val": "HIGH PERFORMANCE COMPUTING MODERNIZATION PROGRAM"
        },
        "R1LineItemNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "227.790"
            },
            "BudgetYearOne": {
                "val": "180.582"
            },
            "BudgetYearOneBase": {
                "val": "180.582"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "180.662"
            },
            "BudgetYearThree": {
                "val": "181.609"
            },
            "BudgetYearFour": {
                "val": "182.473"
            },
            "BudgetYearFive": {
                "val": "183.914"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) demonstrates and provides high performance computing hardware, parallel software, wide area networking services, and expertise that enable the Department of Defense (DoD) Research, Development, Test, and Evaluation (RDT&E) community to investigate and understand physical phenomena and behavior of systems through large scale computational simulation. DoD users of these services work in a diverse variety of science and technology areas including structural mechanics, fluid dynamics, material science, chemistry, biology, electromagnetics and acoustics, weather, ocean modeling, signal\/image processing, forces modeling and simulation, environmental quality, electronics\/networking\/systems\/C4I, and space and astrophysical sciences.  The computational expertise and resources (massively parallel, networked, multi-core computers, advanced software applications and secure connectivity) provided by this Program enable DoD researchers and engineers to analyze complex problems and phenomena and develop novel solutions using state-of-the-art, physics-based and discrete event simulations.  The combined capabilities of the HPC centers and the Defense Research and Engineering Network (DREN) enable massive calculations to be completed more efficiently and at reduced cost than if each DoD research organization were to duplicate the necessary resources. For example, DoD personnel use High Performance Modernization Program (HPCMP) resources to do such things as improve the performance of manned and unmanned aircraft, validate design concepts and establish expected performance of new armor and penetrator designs, speed the development of new ship designs, and demonstrate the viability of weapons systems performance. The HPCMP supports the requirements of DoD scientists and engineers in three major areas of effort: DoD Supercomputing Resource Centers (DSRCs), the Defense Research and Engineering Network (DREN), and support for software applications. Dedicated HPC project investments (DHPIs) augment the DSRCs to form the total HPCMP computational capability. In 2011 the HPCMP provided approximately 1.4 billion processor hours to a user community representing requirements from all three services and the agencies of the DoD. The bulk of this capability is provided via 14 supercomputers (including systems for classified processing) located in the 5 DSRCs across the country providing a total of approximately 180,000 processors and 1.8 quadrillion floating point operations per second (1.8 petaFLOPS). DoD users store their results in 16 petabytes (16,000,000,000,000 bytes) of storage archival distributed across the centers and duplicated for backup (for a total storage capability of 32 petabytes). The DREN interconnects HPCMP resources and users nationwide via a research infrastructure that provides an aggregate network capacity of 25 billion bits per second to 36 user sites, 5 DSRCs, and 4 smaller affiliated resource centers (ARCs). Individual user site speeds range from 45 to 622 million bits per second, ARC speeds range from 155 to 2488 million bits per second, and DSRC speeds range from 622 to 3110 million bits per second. Mission-critical DoD applications across the spectrum of DoD activities are supported by the software component of the Program through training in advanced computational methods, the development of productive application development environments, tools, and methodologies, and through the direct provision of computational scientists and engineers to improve the performance, accuracy, and relevance of physics-based computational models.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThe HPCMP transferred from the Office Secretary of Defense to the Department of the Army in FY12."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "183.150"
                },
                "BudgetYearOne": {
                    "val": "183.150"
                },
                "BudgetYearOneBase": {
                    "val": "183.150"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "227.790"
                },
                "BudgetYearOne": {
                    "val": "180.582"
                },
                "BudgetYearOneBase": {
                    "val": "180.582"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "44.640"
                },
                "BudgetYearOne": {
                    "val": "-2.568"
                },
                "BudgetYearOneBase": {
                    "val": "-2.568"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "45.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.568"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.568"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.360"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DS7"
                    },
                    "ProjectTitle": {
                        "val": "HIGH PERFORMANCE COMPUTING MODERNIZATION PROGRAM"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "227.790"
                        },
                        "BudgetYearOne": {
                            "val": "180.582"
                        },
                        "BudgetYearOneBase": {
                            "val": "180.582"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "180.662"
                        },
                        "BudgetYearThree": {
                            "val": "181.609"
                        },
                        "BudgetYearFour": {
                            "val": "182.473"
                        },
                        "BudgetYearFive": {
                            "val": "183.914"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project enables the Defense research, development, test and evaluation (RDT&E) community to resolve critical scientific and engineering problems more quickly, and with more precision, using advanced, physics-based computer simulation supported by high performance computing (HPC) technology. The computational expertise and resources enable DoD personnel to analyze phenomena that are often impossible, not cost effective, too time-consuming, or too dangerous to study any other way.  The High Performance Modernization Program (HPCMP) supports the requirements of the DoD's scientists and engineers in three major areas of effort: supercomputing resource centers, the Defense Research and Engineering Network (DREN), and support for software applications. DoD Supercomputing Resource Centers (DSRCs) provide extensive capabilities and demonstrate new technologies that address user requirements for hardware, software, and programming environments. Efforts of the DSRCs are augmented by dedicated HPC project investments (DHPIs) that address near real-time and real-time HPC requirements. The total aggregate computational capability is roughly 1.8 quadrillion floating point operations per second (1.8 petaFLOPS); this capability is expected to double by 2013. All sites in the HPC Modernization Program are interconnected to one another, the user community, and major defense sites via the DREN, a research network which matures and demonstrates state of the art computer network technologies. The DREN interconnects 45 user and center sites at network speeds of up to 3 gigabits per second. The Software Application Support (SAS) effort optimizes and improves the performance of critical common DoD applications programs to run efficiently on advanced HPC systems, matures and demonstrates leading-edge computational technology from academic and commercial partners, and provides collaborative programming environments.     \n\nWork in this project supports the Army S&T Enduring Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThe HPCMP transferred from the Office Secretary of Defense to the Department of the Army in FY12."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Department of Defense (DoD) Supercomputing Resource Centers (DSRCs)"
                                    },
                                    "Description": {
                                        "val": "The program supports DoD Supercomputing Resource Centers (DSRCs) that are responsible for as large a fraction of DoD's science and technology and test and evaluation computational workload as feasible. Dedicated HPC project investments (DHPIs) support a one-time need and have no legacy within the HPC Modernization Program. DHPIs address critical HPC requirements that cannot be met at DSRCs, such as real-time, and near real-time computing requirements, and leverage significant HPC and mission expertise located at these remote sites."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "91.395"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support five DoD Supercomputing Resource Centers (DSRCs) and will award two to five competitive Dedicated HPC project investments (DHPIs). This effort was formerly under PE 0603755D8Z- HPCMP."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "92.494"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "92.494"
                                            },
                                            "Text": {
                                                "val": "Will provide advanced storage, supercomputing, and analysis capabilities to DoD S&T community via five DoD Supercomputing Resource Centers (DSRCs) and through the award of one or more competitive dedicated HPC project investments (DHPIs). It is expected that by 2013 program will provide approximately 3.2 billion processor hours and over 3.5 quadrillion floating point operations per second in aggregate. This increase in computing capability will be supported by an expected increase in storage capability to over 60 petabytes (60,000,000,000,000 bytes). This expansion in computational capacity will be supported by advanced computational expertise that will ensure the resources are available and configured to support the DoD's most challenging problems, provide analysis of the massive and complex datasets resulting from the simulations, and develop optimized applications for rapidly evolving computer technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networking"
                                    },
                                    "Description": {
                                        "val": "The Defense Research and Engineering Network (DREN) provides wide area network (WAN) connectivity among the Department's science and technology (S&T) and test and evaluation (T&E) communities via a research network. The DREN matures and demonstrates new communications technologies of relevance to DoD users, and provides the computer and network security for the HPCMP."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.862"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide network services to link all elements of the program and operation of security systems and enhancements. Continue collaborative work with the federal networking community and standards associations will continue to assure that the Defense Research and Engineering Network (DREN) will remain compatible with future technology change. This effort was formerly under PE 0603755D8Z- HPCMP."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.265"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.265"
                                            },
                                            "Text": {
                                                "val": "Will provide an advanced network platform (DREN) and mature new high performance communications and data security technologies and enable advanced computational simulations and data analysis for users in both the S&T and T&E communities with new capabilities in excess of 3 Gbps network bandwidth provided on the highest bandwidth links. Will lead and partner in efforts within the federal networking community to ensure that DoD users remain ready to take advantage of anticipated technology change."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Software Applications"
                                    },
                                    "Description": {
                                        "val": "Software Applications provide for the adaptation of broadband, widely used applications and algorithms to address research, development, test and evaluation (RDT&E) requirements; continued training of users as new system designs and concepts evolve. Continue interaction with the national high performance computing (HPC) infrastructure, including academia, industry, and other government agencies to facilitate the sharing of knowledge, tools, and expertise."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "62.533"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Computational Research and Engineering Acquisition Tools and Environments (CREATE): will continue development of supercomputer-based engineering design and test tools to improve the acquisition process for major weapons systems across the DoD; will continue development efforts in software programs will continue to mature as other projects are completed, and others begun with a greater emphasis on engineering applications. Software Institutes: will continue to develop shared scalable applications to exploit scalable HPC assets. Academic Outreach Program: will continue be supported to encourage and support computational science in universities across the United States. Programming Environments and Training (PETTT): will continue to provide computational and computer science support to the DoD HPC user community through interaction and collaborative projects with academic and industrial partners; this effort will be adjusted as the program is re-focused. This effort was formerly under PE 0603755D8Z- HPCMP."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.823"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.823"
                                            },
                                            "Text": {
                                                "val": "Computational Research for Engineering and Science (CRES): Will provide focused resources to accelerate S&T results in high-priority DoD mission areas through development of advanced software applications, algorithms, and computational technology. Software Institutes: will continue to develop shared scalable applications of critical mission importance to exploit scalable HPC assets; examples include the Blast Protection for Platforms and Personnel effort requested by the Secretary of Defense. New projects will be selected competitively based on then-current DoD needs. Programming Environments and Training (PETTT): will pursue targeted, competitively-selected computational and computer science activities on behalf of the DoD HPC user community with academic and industrial partners that support then-current DoD mission needs. Examples include training in the latest computational technologies and techniques for the DoD scientific computing community as well as focused projects to transition newly-developed technologies out of the university environment into the DoD RDT&E community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Congressional Increase"
                                    },
                                    "Description": {
                                        "val": "Congressional increase for the High Performance Computing Modernization Program."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Modernizing supercomputing center compute, management, and infrastructure capabilities to expand prior investments in energy efficient computing; Enhancing network security posture and enhanced network architecture through targeted R&D investigations; Expanding activities in support of development of supercomputer-based engineering design and test tools targeted at DoD acquisitions and expanding funding for computational and computer science support to the DoD HPC user community."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}