{
    "id": "6b7296895148021fe324110a00f1069428fefb30",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA3_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603007A"
        },
        "ProgramElementTitle": {
            "val": "Manpower, Personnel and Training Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.694"
            },
            "CurrentYear": {
                "val": "10.282"
            },
            "BudgetYearOne": {
                "val": "9.856"
            },
            "BudgetYearOneBase": {
                "val": "9.856"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "10.892"
            },
            "BudgetYearThree": {
                "val": "11.929"
            },
            "BudgetYearFour": {
                "val": "11.058"
            },
            "BudgetYearFive": {
                "val": "11.245"
            }
        },
        "ProgramElementNote": {
            "val": "FY 13 funding realigned to higher priority efforts"
        },
        "ProgramElementMissionDescription": {
            "val": "This project element (PE) matures and demonstrates advanced behavioral and social science technologies that enhance performance to ensure that the Warfighter keeps pace with the transformations in systems, weapons, equipment, and mission requirements to meet the goals of the future force.  These technologies provide key capabilities through training methods and techniques that prepare Soldiers and leaders to effectively operate in complex digitized, networked environments; enable the use of embedded training technologies envisioned for future command and control (C2) systems; as well as foster cognitive, behavioral, and psychological flexibility, adaptability, and mission readiness.  Project 792 evaluates new selection measures, refines performance metrics, assesses innovative training techniques, and analyzes methods and tools to better adapt training to meet goals and requirements. Increased funding in FY12 for this PE is based on work shifted from PE 0602785A due to need for increased focus on maturation and demonstration of selection techniques and tools as well as training methods.\n\nWork in this project complements and is fully coordinated with 0603015A (Next Generation Training & Simulation Systems), 0602308A (Advanced Concepts and Simulation), PE 0602716A (Human Factors Engineering Technology) and PE 0602785A (Manpower\/Personnel\/Training Technology.)\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy\n\nWork in this PE is performed by the US Army Research Institute (ARI) for the Behavioral and Social Sciences in Arlington, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.921"
                },
                "CurrentYear": {
                    "val": "10.298"
                },
                "BudgetYearOne": {
                    "val": "11.516"
                },
                "BudgetYearOneBase": {
                    "val": "11.516"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.694"
                },
                "CurrentYear": {
                    "val": "10.282"
                },
                "BudgetYearOne": {
                    "val": "9.856"
                },
                "BudgetYearOneBase": {
                    "val": "9.856"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.227"
                },
                "CurrentYear": {
                    "val": "-0.016"
                },
                "BudgetYearOne": {
                    "val": "-1.660"
                },
                "BudgetYearOneBase": {
                    "val": "-1.660"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.133"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.660"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.660"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.094"
                                },
                                "CurrentYear": {
                                    "val": "-0.016"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "792"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.694"
                        },
                        "CurrentYear": {
                            "val": "10.282"
                        },
                        "BudgetYearOne": {
                            "val": "9.856"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.856"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "10.892"
                        },
                        "BudgetYearThree": {
                            "val": "11.929"
                        },
                        "BudgetYearFour": {
                            "val": "11.058"
                        },
                        "BudgetYearFive": {
                            "val": "11.245"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates advanced behavioral and social science technologies that enhance performance to ensure that the Warfighter keeps pace with the transformations in systems, weapons, equipment, and mission requirements to meet the goals of the operational force.  These technologies provide key capabilities through training methods and techniques that prepare Soldiers and leaders to be effective in complex operational environments ;  training methods to meet emerging skill requirements for institutional and unit training; as well as foster cognitive, behavioral, and psychological flexibility, adaptability, and mission readiness.  Efforts include the evaluation of selection measures, the refinement of survey methodologies and performance metrics, the assessment of innovative training techniques, and the analysis of methods and tools to better adapt training to meet goals and requirements. Increased funding in FY12 for this project is based on work shifted from PE 0602785A due to need for increased focus on maturation and demonstration of selection techniques and tools as well as training methods.\n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nWork in this project complements and is fully coordinated with 0603015A (Next Generation Training & Simulation Systems), 0602308A (Advanced Concepts and Simulation), PE 0602716A (Human Factors Engineering Technology) and PE 0602785A (Manpower\/Personnel\/Training Technology.)\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Research Institute (ARI) for the Behavioral and Social Sciences in Arlington, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and assesses Soldier selection measures, techniques and tools to better predict behavior and performance to provide the Army the flexibility to adapt to changing recruiting environments.  The Army's current selection measures primarily focus on a candidate's cognitive (e.g., technical and analytical) ability which does not predict attrition, discipline, and motivation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.473"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and validated FY10 methods and technologies to streamline data collections and more rapidly assess attitudes and opinions across the Army; and evaluated trends of Soldier satisfaction, especially in regard to deployment length and dwell time (i.e., back home), and the Army's care and concern for Soldiers and their families."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.288"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluating capability of non-cognitive measures such as motivation, cooperation, and achievement to predict performance of enlisted personnel while in initial training environments;  evaluating the capability of non-cognitive measures to augment existing measures to better predict an individual's potential;  analyzing the use of non-cognitive measures to provide flexibility for selection methods that can accommodate changes in force size."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.125"
                                            },
                                            "Text": {
                                                "val": "Will mature and assess  improved non-cognitive measures for enlisted selection and classification;  perform validation checks and update enlisted longitudinal databases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training and Leader Development"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates training techniques and tools that will enable Soldiers to take full advantage of advances in technology and systems and helps the Army attain its training goals for future missions and operations.  Knowledge products, tools, methods and techniques transition to US Army Training and Doctrine Command (TRADOC) and operational units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.221"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined guidelines for training effectiveness based on operational relevance of training outcomes in TRADOC courses; demonstrated effectiveness of training tools\/methods in simulated learning environments; demonstrated adaptive leadership and negotiation skills and techniques as well as measurement methods for leader development; and developed and refined methods and models for maintaining training relevance to operational units."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.994"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developing methods to more readily assess whether training can be adapted to account for individual differences and experience levels;  developing strategies to tailor training based on Soldiers' learning progress for basic Soldier skills and for Advanced Individual Training; and analyzing the use of prototype training tools to refine training strategies in institutional and unit-based training environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.731"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.731"
                                            },
                                            "Text": {
                                                "val": "Will mature methods to assess the effectiveness of training tools to develop adaptive Soldiers and leaders (e.g., tactical decision making and judgment proficiency); mature training applications for operational units (e.g., visual threat detection, human terrain mapping) and design methods for training instructors to leverage emerging learning technologies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}