{
    "id": "6df3f69585cdb72862e70568313aea3ab91bd0a3",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605027D8Z"
        },
        "ProgramElementTitle": {
            "val": "OUSD(C) IT Development Initiative"
        },
        "R1LineItemNumber": {
            "val": "127"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.815"
            },
            "CurrentYear": {
                "val": "4.846"
            },
            "BudgetYearOne": {
                "val": "7.010"
            },
            "BudgetYearOneBase": {
                "val": "7.010"
            },
            "BudgetYearTwo": {
                "val": "5.023"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            }
        },
        "ProgramElementNote": {
            "val": "Project 928, Virtual Training Simulation was deleted.  The requirement for funding was for FY 2010 only.\nProject 950, Learning Management System was added October, 2011 (FY 2011 RDT&E funds)."
        },
        "ProgramElementMissionDescription": {
            "val": "As the Department of Defense strategic, operational and tactical plans and objectives transforms the war fighter with new capabilities and doctrine, the budgeting and accountability of funds used to pursue the Department objectives will become more complicated and detailed for senior leader to make decisions with supporting rationale for the taxpayer.  Incorporating information technology toward current and emerging business processes manifesting into a state-of-the art system of systems will result in increasing efficiencies, timely diagnostics, and reducing lifecycle costs to maintain, sustain and repair.\n\nThis initiative exploits emerging technology, processes, trends, capabilities, and techniques to incorporate state-of-the-art information technology enabling the ability, agility, and level of fidelity to collect, process, administrate and report resource management data and to automate business processes within a more robust analytical environment within the Office of the Under Secretary of Defense (Comptroller) OUSD(C)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.000"
                },
                "CurrentYear": {
                    "val": "4.993"
                },
                "BudgetYearOne": {
                    "val": "4.991"
                },
                "BudgetYearOneBase": {
                    "val": "4.991"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.815"
                },
                "CurrentYear": {
                    "val": "4.846"
                },
                "BudgetYearOne": {
                    "val": "7.010"
                },
                "BudgetYearOneBase": {
                    "val": "7.010"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.815"
                },
                "CurrentYear": {
                    "val": "-0.147"
                },
                "BudgetYearOne": {
                    "val": "2.019"
                },
                "BudgetYearOneBase": {
                    "val": "2.019"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.021"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.139"
                    },
                    "CurrentYear": {
                        "val": "-0.147"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.025"
                                },
                                "BudgetYearOne": {
                                    "val": "0.019"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.019"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Program Increase for Project 0950 - Learning Management System"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "4.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Project 0927 had reprogrammings of  -$0.21, SBIR\/STTR transfer of -$0.139, and an economic assumption of +0.018 for total adjustments of -$0.185  in FY 2011. SBIR\/STTR transfer of -$0.147 in FY 2012.  Economic assumption of +$0.019 and Other Transactions of +$2.000 in FY 2013.\n\nProject 0950 - Learning Management System was added for FY 2011 through reprogramming action."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "927"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation Resource Management System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.815"
                        },
                        "CurrentYear": {
                            "val": "4.846"
                        },
                        "BudgetYearOne": {
                            "val": "7.010"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.010"
                        },
                        "BudgetYearTwo": {
                            "val": "5.023"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department’s budget focuses on institutionalizing and financing our capabilities to fight the wars we are in today and the scenarios we are most likely to face in the years ahead, while at the same time providing a hedge against other risks and contingencies. It also begins a fundamental overhaul of the DoD’s approach to procurement, acquisition, and contracting.  As such, the complex details of budgeting and tracking of funds become increasingly critical to senior leader decision making and to provide accountability to the taxpayer.  Incorporating information technology toward current and emerging business processes manifesting into a state-of-the art system of systems will result in increasing efficiencies, timely diagnostics, and reducing lifecycle costs to maintain, sustain and repair.\n\nToday, the Office of the Under Secretary of Defense Comptroller OUSD(C) and the Cost Analysis and Program Evaluation (CAPE) uses various distinct automated systems (Comptroller Information System (CIS), PBD Wizard, Program Resource Collection Process (PRCP), Supplemental Resource Collection Process (SRCP), Budget Exhibits Generator and Standard Data Collection System (SDCS) to formulate, justify, and execute DoD budgets.  These six or more systems interact with at least several computer-based systems controlled by external organizations and agencies.  These systems manage very similar financial information, yet each uses its own scheme for representing information.  Much of the information managed by these systems is redundant.  Cross-system data representations and redundancies make it difficult to exchange and to reconcile information.  The capabilities provided by Comptroller systems, in some cases, fail to deliver services needed by its users, or fail to operate in ways that complement current and emerging business practices.  They fail to give executives information in a comprehensible form, making it difficult to draw conclusions.  Data disparities and functional redundancy make these systems more costly to keep than they need to be.\n\nThere is a critical need for the development of a state-of-the-art information technology system to modernize and replace multiple, antiquated legacy systems and processes used to formulate, justify, present and defend the entire Department of Defense Budget in the Office of the Under Secretary of Defense (Comptroller) (OUSD(C)) to meet Title 10 and Title 31 mission and reporting requirements.  The Comptroller’s plan for mitigating the deficiencies and capability gaps associated with current systems is development of the Next Generation Resource Management System.  \n\nThis initiative exploits emerging technology, processes, trends, capabilities, and techniques to incorporate state-of-the-art information technology enabling the ability, agility, and level of fidelity to collect, process, administrate and report resource management data and to automate business processes within a more robust analytical environment within the Office of the Under Secretary of Defense (Comptroller) OUSD(C). Funded efforts will improve the timeliness of resource management reviews and decisions for senior leaders and Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Resource Management System"
                                    },
                                    "Description": {
                                        "val": "Plan, develop, test and evaluate the system components (i.e. unified database, expert system, cross domain security, enterprise service bus, applications, services) and supportability requirements in modernizing the budget formulation, programming execution and reporting capabilities for the Department of Defense.  Activities will include, but not be limited to, the preparation all documentation required for Clinger-Cohen Compliance and acquisition regulations, developing requests for proposals, and oversight and management of contracts and deliverables."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.815"
                                            },
                                            "Text": {
                                                "val": "Analysis of the Alternatives (AoA) Revisions - 4Q FY 2011-1Q FY 2012\nAcquisition documentation - 4Q FY 2011\nIRB revised requirements necessitate revisions to NGRMS AoA.  Work to be initiated on acquisition docmentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.846"
                                            },
                                            "Text": {
                                                "val": "Conduct Market Investigation 2Q FY 2012-4Q FY 2012  \nContinue work on Acquisition documentation 1Q FY 2012-4Q FY 2012\nConduct market research to assess optimal means to exploit emerging technology, processes, trends, capabilities and techniques to incorporate state-of-the art capabilities in the information technology industry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.010"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.010"
                                            },
                                            "Text": {
                                                "val": "Finalize market investigation - 1Q FY 2013- 2Q FY 2013\nContinue work on Acquisition documentation 1Q FY 2013-4Q FY 2013\nContract Award  3Q FY 2013  for demonstration and preliminary designs\nDemonstrate  prototype systems that includes a unified data warehouse, user friendly business logic architecture for programming and budgeting capabilities, analytics and reports, an expert knowledge-based system incorporating user friendly language interface, cross-domain security capability, and design and demonstration of high uality user interface that promotes learning and productivity."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Analysis of the Alternatives (AoA) Revisions - 4Q FY 2011-1Q FY 2012\nAcquisition documentation - 4Q FY 2011 - 4Q FY 2013\nConduct Market Investigation 2Q FY 2012-4Q FY 2012  \nFinalize market investigation - 1Q FY 2013- 2Q FY 2013\nContract Award  3Q FY 2013  for demonstration and preliminary designs\nSelect preliminary design:  4Q FY 2013\nVerification proposed system and upgrades:  1-4Q FY 2014\n\nOnce infrastructure in place, competitive contracts in the out years for individual services\/applications."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "950"
                    },
                    "ProjectTitle": {
                        "val": "Learning Management System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funds will be used to develop a Learning Management System (LMS) that will enable the registration, tracking, validation, audit and reporting required for the Financial Management workforce of 58,000 military and civilian members.  This system is critical to the DoD Financial Management Certification Program initiative that consolidates multiple development programs across the Department into a cohesive program to effectively educate, train, and certify financial managers in support of the Civilian Strategic Human Capital Plan.  The certification program will provide stronger incentives to personnel to complete key types of training, such as, knowledge necessary to achieve auditability and analytics.  This initiative is supported by House and Senate language for the FY 2012 National Defense Authorization Act."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "LEARNING MANAGEMENT SYSTEM"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Funds will be obligated in January, 2012."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "\"Market research\" is being conducted to determine whether or not to use an existing system or have a custom system built and what the options are for contracting out.\nAnalysis is being done as to how quickly requirements can be met and the most efficient way of obtaining the desired product."
                        },
                        "PerformanceMetrics": {
                            "val": "Monthly progress reviews (plan\/research, select, develop, and launch) towards DoD Financial Management Learning Management System."
                        }
                    }
                }
            ]
        }
    }
}