{
    "id": "780061e2d0df67e65243e959cb112c013ce2de4d",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA3_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603125A"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism - Technology Development"
        },
        "R1LineItemNumber": {
            "val": "41"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.424"
            },
            "CurrentYear": {
                "val": "22.172"
            },
            "BudgetYearOne": {
                "val": "9.716"
            },
            "BudgetYearOneBase": {
                "val": "9.716"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "10.054"
            },
            "BudgetYearThree": {
                "val": "10.136"
            },
            "BudgetYearFour": {
                "val": "10.222"
            },
            "BudgetYearFive": {
                "val": "10.394"
            }
        },
        "ProgramElementNote": {
            "val": "FY 11 reduction due to realignment of funding to higher priority efforts."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) demonstrates technologies with high payoff potential to address current technology shortfalls or future force capability gaps. \n\nWork in this PE complements and is fully coordinated with PE 0602105A (Materials Technology), PE 0602303A (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602784A (Military Engineering Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology, PE 0603734A (Military Engineering Advanced Technology), and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM) and the Army Engineer Research and Development Center."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.550"
                },
                "CurrentYear": {
                    "val": "12.191"
                },
                "BudgetYearOne": {
                    "val": "9.611"
                },
                "BudgetYearOneBase": {
                    "val": "9.611"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.424"
                },
                "CurrentYear": {
                    "val": "22.172"
                },
                "BudgetYearOne": {
                    "val": "9.716"
                },
                "BudgetYearOneBase": {
                    "val": "9.716"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.126"
                },
                "CurrentYear": {
                    "val": "9.981"
                },
                "BudgetYearOne": {
                    "val": "0.105"
                },
                "BudgetYearOneBase": {
                    "val": "0.105"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "9.981"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.314"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.105"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.105"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.812"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DF5"
                    },
                    "ProjectTitle": {
                        "val": "AGILE INTEGRATION & DEMONSTRATION"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.424"
                        },
                        "CurrentYear": {
                            "val": "22.172"
                        },
                        "BudgetYearOne": {
                            "val": "9.716"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.716"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "10.054"
                        },
                        "BudgetYearThree": {
                            "val": "10.136"
                        },
                        "BudgetYearFour": {
                            "val": "10.222"
                        },
                        "BudgetYearFive": {
                            "val": "10.394"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project demonstrates technologies with high payoff potential to address current technology shortfalls or future force capability gaps. Efforts include hybrid electric power technologies to reduce use of fossil fuel generators and identifying, accelerating, and improving rapidly deployable force protection technologies to enable troops at small, remote bases or integrated in with local communities (e.g., villages) to detect, assess,and defend against a range of enemy threats since they generally do not have the organic assetts or levels of protection like that at larger bases.  \n\nThis project supports the Command Control and Communications and Ground portfolios. Work in this project is complementary to and is fully coordinated with PE 0602105A (Materials Technology), PE 0602303A (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602784A (Military Engineering Technology), 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603710A (Night Vision Advanced Technology), and PE 0603734A (Military Engineering Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM) and the Army Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Intelligent Power (HI Power) (previously titled Transportable Hybrid Electric Power Station (THEPS))"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates intelligent power management hardware and software to reduce the use of fossil fuel in tactical generators while increasing energy security. The intelligent power management technologies will be plug-and-play to enable faster power grid setup times and to eliminate human error as well as to reduce soldier planning burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.332"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated Hybrid Intelligent (HI) Power technologies for an intelligent power grid that allowed for the most efficient use of the tactical power sources available in support of remote operations and tactical command posts; demonstrated a 30 kilowatt HI Power grid; conducted efficiency testing on demonstrators; matured and demonstrated a direct current distribution architecture and associated power electronics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.691"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate an autonomous hybrid power grid architecture for the power range of 3 to 60 kilowatt capable of accepting direct current (DC) input from 20 volts DC to 32 volts DC, and be scalable to 500 kilowatts; develop and demonstrate advance control hardware and software; develop and assess a standard secure communication protocol;  continue development of a draft system specification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.859"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.859"
                                            },
                                            "Text": {
                                                "val": "Will validate performance of autonomous hybrid power grid architectures and advanced control hardware and software; fabricate and demonstrate a universal generator and Environmental Control Unit (ECU) modification kit to enable automatic start\/stop controls; fabricate microgrid power management hardware representative Brigade tactical operations center and integrate for user assessments; complete a draft performance specification."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapidly Deployable Force Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort improves design, development and employment of force protection technologies that are rapidly deployable to support troops operating in forward areas.  These technologies must be readily transportable; require minimal set up, take down, and operational effort; and easily adaptable across a variety of missions, environments, and threats. This effort is coordinated with PE 0602784A,  PE 0602786A, PE 0603734A,, and PE 0603313A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.092"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identified force protection technologies that meet the rapidly deployable construct; developed criteria for initial selection and criteria for assessments of candidate force protection technologies based on stakeholder prioritized needs for force protection functions and system characteristics; designed and conducted a series of demonstrations to baseline performance of selected force protection technologies, such as passive protection and\/or non line-of-sight sensing, and to identify improvements in design, development and implementation; coordinated proposed improvements with designers, developers, and stakeholders. Scope included assessing systems vulnerabilities regarding the ability to conduct force protection effectively."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refine and update criteria for deployable force protection technologies in order to meet capability gaps based on stakeholder input; mature and evolve promising technologies identified and assessed in prior year's effort; identify new and emerging force protection technologies that meet the rapidly deployable construct; select and assess candidate force protection technologies to support a system of systems design for force protection based on prioritized needs from stakeholders; include advanced assessments of technology improvements based on prior year's efforts; design and conduct a series of demonstrations and experiments to assess performance of selected force protection technologies and to identify improvements in design, development and implementation; include assessing systems vulnerabilities regarding the ability to conduct force protection effectively; and coordinate improvements with designers, developers, and stakeholders."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.857"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.857"
                                            },
                                            "Text": {
                                                "val": "Will design and conduct a series of experiments, including live scenarios, and coordinated demonstrations to identify the most promising new and emerging technologies for remaining high-priority gaps in deployable force protection; to stress and assess developing systems for both individual and collective systems performance in operationally relevant environments and realistic scenarios that include adaptive enemies; and to provide feedback to developers so that they can improve systems and make them more robust for operational use.  Will expand experiments across a range of realistic, relevant environments that represent current and future areas of operations and adaptive threats and incorporate complimentary sets of experimental designs. Will mature and evolve high-payoff technologies by improving deployability; by increasing systems of systems integration and interoperability; and by identifying and reducing systems and systems of systems vulnerabilities through deliberate methodologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Energy for Deployed Forces"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Congressional add funding for Alternative Energy for Deployed Forces"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}