{
    "id": "7a73635be48aa1fb9eb1bf7df94ba4e8de4c3a82",
    "meta": {
        "filename": "dod-2013_RDTE_2013_TJS_JustificationBook_The_Joint_Staff_PB_2013.zzz_unzipped_JustificationBook_The_Joint_Staff_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0303166J"
        },
        "ProgramElementTitle": {
            "val": "Support to Information Operations Capability"
        },
        "R1LineItemNumber": {
            "val": "174"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "8.238"
            },
            "BudgetYearOneBase": {
                "val": "8.238"
            },
            "BudgetYearTwo": {
                "val": "8.394"
            },
            "BudgetYearThree": {
                "val": "8.552"
            },
            "BudgetYearFour": {
                "val": "8.713"
            },
            "BudgetYearFive": {
                "val": "8.876"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Program transfers to the Joint Staff from USD(I).  For FY 2012 and previous, refer to PE 0303166D8Z."
        },
        "ProgramElementMissionDescription": {
            "val": "The National Military Strategy of the United States stresses the importance of integrating Information Operations (IO) capabilities for the success of Joint Operations and Decision Superiority.  The Defense-Wide IO Program Review revalidated a requirement for an integrated range supporting exercises, testing, and development of IO capabilities.  Further direction by the Office of the Secretary of Defense (OSD) identified the need for an integrated IO test and evaluation capability to assess IO technologies and tactics in a representative operational environment against realistic targets.  The 2006 National Security Strategy identifies \"Strengthen Alliances to Defeat Global Terrorism and Work to Prevent Attacks Against Us and Our Friends\", which involves significant Information Operations (IO) and Cyber operations as a goal.  Through the Defense Planning Guidance (DPG) and the Integrated Priority Lists, COCOMs repeatedly state the need to expand IO\/Cyber training and education for the developing cadre of IO\/Cyber professionals and provide an environment for analysis, testing, training, combat assessments, and measures of effectiveness for more reliable IO\/Cyber capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "8.238"
                },
                "BudgetYearOneBase": {
                    "val": "8.238"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "8.238"
                },
                "BudgetYearOneBase": {
                    "val": "8.238"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Information Operations Range"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "8.238"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.238"
                        },
                        "BudgetYearTwo": {
                            "val": "8.394"
                        },
                        "BudgetYearThree": {
                            "val": "8.552"
                        },
                        "BudgetYearFour": {
                            "val": "8.713"
                        },
                        "BudgetYearFive": {
                            "val": "8.876"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY2013 funds transfer to the Joint Staff.  For FY2012 and previous, refer to PE 0303166D8Z."
                        },
                        "ProjectMissionDescription": {
                            "val": "The IO Range provides a secure, flexible, and seamless environment for the Military Services and Joint warfighters to test, train, develop tactics, and exercise selected IO\/Cyber capabilities. The basis of the functional structure of the IO Range is the integration of existing ranges, laboratories, information warfare centers, and other Government facilities that currently support IO\/Cyber test, training, exercise, and experimentation events. Capabilities at the selected sites are securely connected and integrated into the IO Range. A key feature of this concept is a persistent, secure connection that links the sites together, allowing the exchange of data and the visualization of effects as we employ capabilities. Creation of a “virtual range” based on persistent connections significantly reduces the amount of lead-time required to set up each new warfighter event. The long-term goal for the IO Range is to be a full spectrum IO\/Cyber Range supporting: operations security (OPSEC), computer network operations (CNO), electronic warfare (EW), military information support operations (MISO), and military deception (MILDEC). This environment enables the warfighters to visualize non-kinetic weapons effects, understand the intricate and interactive effects generated by kinetic and non-kinetic weapons and achieve the same level of confidence and expertise in employing IO\/Cyber capabilities as they have with kinetic capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "IO Range"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.238"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.238"
                                            },
                                            "Text": {
                                                "val": "• Expand national DoD and Inter-Agency awareness and support regarding IO and cyber related activities\n\n• Improve the threat representation and operational relevance of the network\n\n• Improve the integration of live, virtual, and constructive (LVC) simulations with other Joint training and testing communities and infrastructures\n\n• Develop a long term JIOR infrastructure development, operation and sustainment management plan that supports the application of user resources allocated by JIOR stakeholders to support user activities, to include JIOR expansion and modernization and interoperability with National and DoD Cyber Ranges\n\n• Improve capability to rapidly reset, regenerate, and adapt events \n\n• Improve capability to provide timely assessment for evaluation\n\n• Establish cost-reimbursable funding construct"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Joint IO Range, under the JS Joint and Coalition Warfighting (JCW), manages the development and expansion of Joint IO Range capabilities to an increasing number of customers.  Integration into the Joint Exercise program has allowed users to increase the use and capability of the range.  Continued development of tools for the range will be required as adversarial capabilities improve."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are measured through internal management controls and external assessments.  Performance metrics include, but are not limited to time, money, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the warfighter faster access to non-kinetic capabilities than current capabilities allow?\n• Money – Will the effort enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the warfighter to create an environment that is closer to what he\/she will operate in during real world operations than current capabilities allow? \n• Fidelity – Will the effort ensure unity of efforts throughout the IO\/CYBER Community?"
                        }
                    }
                }
            ]
        }
    }
}