{
    "id": "81669ea9122767d93a45ee94293b317ca8b4a366",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA3_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603003A"
        },
        "ProgramElementTitle": {
            "val": "AVIATION ADVANCED TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "55.492"
            },
            "CurrentYear": {
                "val": "62.095"
            },
            "BudgetYearOne": {
                "val": "64.215"
            },
            "BudgetYearOneBase": {
                "val": "64.215"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "69.519"
            },
            "BudgetYearThree": {
                "val": "80.869"
            },
            "BudgetYearFour": {
                "val": "81.595"
            },
            "BudgetYearFive": {
                "val": "86.804"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates manned and unmanned rotary wing vehicle (RWV) technologies to enable Army aviation modernization.  Within this PE, aviation technologies are advanced and integrated into realistic and robust demonstrations.  Project 313 matures and demonstrates enabling component, subsystems and systems in the following areas: rotors, drive trains, structures and survivability.  Project 435 focuses on weapons integration and demonstration. Project 436 matures and demonstrates mission equipment packages to enable control of unmanned systems.  Project 447 matures and demonstrates affordable and efficient engines.  Focus areas include: engines & drive trains; rotors & vehicle management systems; platform design & structures; aircraft & occupant survivability; aircraft weapons & sensors; maintainability & sustainability; and unmanned & optionally manned systems. A major effort in this PE is the Joint Multi-Role (JMR) Aircraft Demonstrator.\n \nWork in this PE contributes to the Army S&T Air Systems portfolio and is related to and fully coordinated with PE 0602211A (Aviation Technology), PE 0603313A (Missile and Rocket Advanced Technology), PE 0603710A (Night Vision Advanced technology), and PE 0603270A (Electronic Warfare Technology).  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.   \n \nWork in this PE is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC) with facilities located at Redstone Arsenal, AL; Fort Eustis, VA; and Moffett Field, CA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "57.454"
                },
                "CurrentYear": {
                    "val": "62.193"
                },
                "BudgetYearOne": {
                    "val": "66.660"
                },
                "BudgetYearOneBase": {
                    "val": "66.660"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "55.492"
                },
                "CurrentYear": {
                    "val": "62.095"
                },
                "BudgetYearOne": {
                    "val": "64.215"
                },
                "BudgetYearOneBase": {
                    "val": "64.215"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.962"
                },
                "CurrentYear": {
                    "val": "-0.098"
                },
                "BudgetYearOne": {
                    "val": "-2.445"
                },
                "BudgetYearOneBase": {
                    "val": "-2.445"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.558"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.445"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.445"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.404"
                                },
                                "CurrentYear": {
                                    "val": "-0.098"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "313"
                    },
                    "ProjectTitle": {
                        "val": "ADV ROTARYWING VEH TECH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.692"
                        },
                        "CurrentYear": {
                            "val": "44.868"
                        },
                        "BudgetYearOne": {
                            "val": "44.814"
                        },
                        "BudgetYearOneBase": {
                            "val": "44.814"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "49.206"
                        },
                        "BudgetYearThree": {
                            "val": "60.813"
                        },
                        "BudgetYearFour": {
                            "val": "62.822"
                        },
                        "BudgetYearFive": {
                            "val": "67.836"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates components, subsystems and systems for rotorcraft (both manned and unmanned) that provide, improved aircraft & occupant survivability, reduced maintenance & sustainment costs, and greater performance through improved rotors, drives, vehicle management systems and platform design & structures.  Systems demonstrated include rotors, drivetrains, robust airframe structures and integrated threat protection systems.  A major effort in this project is the Joint Multi-Role (JMR) Aircraft Demonstrator.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy. \n \nWork in this project is performed by the Aviation Applied Technology Directorate of the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Fort Eustis, VA, and the System Simulation Development Directorate, AMRDEC, Redstone Arsenal, AL.  Work in this project is coordinated with Program Manager Aircraft Survivability Equipment (PM-ASE)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rotorcraft Survivability"
                                    },
                                    "Description": {
                                        "val": "These efforts increase rotorcraft survivability by reducing platform signatures and providing the means to more efficiently counter enemy detection and tracking systems.  This effort also enhances situational awareness, allowing manned\/unmanned aircraft to avoid enemy air threats.  This effort continues in FY13 under the Aircraft & Occupant Survivability Systems effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.880"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated the lightweight, multi-function laser on an Apache platform and demonstrated improved countermeasures effectiveness through flight testing on a threat range; and demonstrated an aircraft survivability software adapter to allow plug & play capability for legacy and future aircraft survivability equipment (ASE) components and software products through hardware-in-the-loop (HITL) lab testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.783"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct follow-on HITL demonstration of survivability software adapter utilizing Integrated Aircraft Survivability Equipment (IASE) system, developed by PM-ASE, and additional aircraft survivability systems; and finalize Super - Application Programming Interface (API) definition to allow plug & play capability for legacy and future aircraft ASE."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Aircraft and Crew Protection"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates combined rotorcraft platform durability and survivability improvements through a fully optimized and integrated and hardened structure, Vehicle Management System (VMS), and rotors\/subsystems technology integration program.  This work continues in FY13 under the Aircraft & Occupant Survivability Systems effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.275"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalized the platform system trade studies; and conducted hardware refinement and validation to mature system level solutions of structures, rotors, subsystems and VMS technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.290"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate and demonstrate, at the full-scale component level, technology optimized concepts in structures, rotors, subsystems, and vehicle management systems areas, derived from the earlier trade studies. Begin design of a combat tempered platform integrated technology demonstrator and conduct system trade studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft & Occupant Survivability Systems"
                                    },
                                    "Description": {
                                        "val": "This effort increases rotorcraft survivability by reducing platform signatures, providing the means to more efficiently counter enemy detection and tracking systems, and also increases protection to the aircraft and aircrew against ballistic munitions, crash landings, and post-crash fire events.  This effort enhances air crew situational awareness, allowing manned\/unmanned aircraft to avoid enemy air threats.  Prior to FY13, these efforts were exhibited under the Rotorcraft Survivability effort and the Integrated Aircraft and Crew Protection effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.178"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.178"
                                            },
                                            "Text": {
                                                "val": "Will research concepts that most effectively and efficiently make the pilot aware of the current threat situation and offer the best survivability actions to dynamic threats.  Design a 3D route optimization planner architecture that allows the aircraft to maneuver to its flight dynamic limits, coupled with real-time threat lethality predictions; initiate component and full-scale preliminary design of a combat tempered platform that exemplifies enhanced aircraft and crew\/occupant protection, improved battlefield durability, and reduced environmental vulnerability; begin to substantiate the results of the system level trade studies, which are key to understanding structural design parameters, and the performance of the optimized concepts through integrated, full-scale component testing; and begin system engineering trades and validation of component integration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotor Design and Capabilities"
                                    },
                                    "Description": {
                                        "val": "This effort determines the performance benefits of advanced rotors and air vehicles through the evaluation of alternative designs aimed to satisfy future force capability needs for increased system durability, speed, range and payload.  The rotor design work continues in FY13 under the Rotors & Vehicle Management Systems effort.  Air vehicle design work continues in FY13 under the Platform Design & Structures Systems effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.601"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated enhanced integrated rotor durability to assess benefit to aircraft maintenance; demonstrated permanent erosion protection, reliable icing protection and battle damage assessment as well as repair technologies on full-scale rotor blades; and demonstrated improved hover performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.487"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete assessment of reconfigurable rotors technology; design a high performance, low vibration, low noise rotor and integrated control system; investigate advanced air vehicle concepts that address Army Aviation performance gaps; and initiate trade studies that support the evaluation of candidate next generation air vehicle designs that will include performance, survivability, cost and sustainability attributes to be pursued for demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Vehicle Management System (AVMS)"
                                    },
                                    "Description": {
                                        "val": "The AVMS integrates advanced flight controls with real-time aircraft state information to enable safe, low-effort maneuvering and real-time adaptation to aircraft state changes (degradation, damage, mission, etc.).  The AVMS demonstrates technology that enables Level 1 (most acceptable) handling qualities in the entire flight envelope, reduces flight control line replaceable unit counts by over 20%, and reduces flight control system weight.  This work continues in FY13 under the Rotors & Vehicle Management Systems effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.354"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed preliminary design of required AVMS hardware and software; prioritized technologies to be flight demonstrated and conducted a risk\/reward assessment of each technology; and generated several candidate systems to analyze in simulation to support a planned flight demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.847"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finish simulation evaluation of candidate systems to determine final candidates via flight demonstration; and begin detailed analysis and design of the best candidate AVMS suites in preparation for flight demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotors & Vehicle Management Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the performance benefits of advanced rotors through the evaluation of alternative designs aimed to satisfy future force capability needs for increased system durability, speed, range and payload.  This effort also integrates advanced flight controls with real-time aircraft state information into vehicle management systems to enable safe, low-effort maneuvering and real-time adaptation to aircraft state changes (degradation, damage, mission, etc.).  Prior to FY13, these efforts were exhibited under the Adaptive Vehicle Management System effort and the rotor design work of the Rotor Design and Capabilities effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.590"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.590"
                                            },
                                            "Text": {
                                                "val": "Will conduct testing to mitigate risk and address integration issues associated with integrating multiple active technologies into a rotor system; conduct detailed design of reconfigurable rotors with integrated active rotor components; demonstrate improved state sensing subsystems (rotor states, weight on wheels, external loads), rotating to non-rotating data and power transfer, real time adaptive control laws, and software validation technologies; develop a fault tolerant architecture that combines flight safety critical, mission critical and other non-safety critical subsystems into an integrated rotorcraft guidance and control system (Adaptive VMS); design and fabricate system hardware and software components in preparation for flight demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform Design & Structures Systems"
                                    },
                                    "Description": {
                                        "val": "Design, fabricate, evaluate and demonstrate advanced vertical lift aircraft system configurations that address Joint-Multi-Role (JMR) medium class capability needs.  Utilize multiple contractors to determine optimum vehicle attributes that meet future force capability needs for increased system speed, range, payload, and reduced operating costs.  Conduct preliminary and detailed system design of multiple candidate systems.  Flight demonstrate operational capability of JMR system.  Prior to FY13, this effort was exhibited under the Rotor Design and Capabilities effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.770"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.770"
                                            },
                                            "Text": {
                                                "val": "Will complete initial Operations Analysis and will use results to assign warfighter value to aircraft features and attributes; complete Configuration Trades & Analysis tasks, utilizing multiple contractors, that document design trades, cost\/weight sensitivity studies, and vehicle configuration recommendations; investigate space, weight & power requirements and provisions for aircraft mission equipment (avionics, weapons, sensors); develop a demonstrator performance specification; initiate preliminary design of multiple aircraft concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotorcraft Drive Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates advanced rotorcraft drive technologies with the potential to: increase the horsepower-to-weight ratio; reduce drive system noise; reduce production, operating and support costs; and provide automatic component impending failure detection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.165"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated material technologies through bench testing to validate materials for lightweight housings, new bearings and ultra-highly loaded gears; initiated preliminary and detailed design of a demonstrator drive system; and evaluated these technologies relative to conventional single-speed transmissions as well as proposed multi-speed drive configurations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.992"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete detailed design and begin fabrication of drive system component test hardware to validate key materials for ultra-highly loaded gears and bearings as well as lightweight gearbox housings with improved corrosion resistance and reduced operational maintenance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will conduct testing of component hardware to validate gear and bearing designs; evaluate modeling and design tools for accuracy to predict component stresses and material properties; test advanced oils and additives for extending component durability; assess reliability of new technologies for improved aircraft affordability; and test advanced cooling technologies for reduced aircraft weight."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintainability & Sustainability Systems (previously titled as Capability-based Operations & Sustainment Technologies (COST))"
                                    },
                                    "Description": {
                                        "val": "Mature and demonstrate technologies that improve the operational availability of rotorcraft while reducing operating and support (maintenance) costs.  Efforts include component sensing, diagnostics, prognostics, and control systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed prognostic technologies to predict failures and remaining useful life of engine accessories such as fuel controls, pumps and generators; and began demonstration of on-board automatic adjustments for in-flight rotor smoothing\/balance capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.669"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate individual algorithms for prognostics of engine components, structural integrity, rotor components, and vehicle management systems for improved component time on wing and reduced maintenance; and develop data fusion techniques to improve sensor coverage and account for system-to-system influences."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.976"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.976"
                                            },
                                            "Text": {
                                                "val": "Will perform an aircraft level demonstration of the integrated set of technologies developed in FY11 and project the operational benefits and support cost savings; demonstrate additional prognostic technologies for accessories and controls; validate prognostic algorithms for structural integrity, corrosion, electrical distribution system, and rotor components; flight test energy harvesting sensors used to monitor component health and extend component service times; and validate a sensor network system for reducing aircraft weight and improving health monitoring capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Real-time Airspace Collision Avoidance and Teaming (REACT) and Joint Common Architecture (JCA)"
                                    },
                                    "Description": {
                                        "val": "This program evaluates, and integrates real-time airspace de-confliction and collision avoidance technologies.  The JCA effort will develop standards and requirements for an aviation open systems, mission processing architecture that is scalable across joint rotorcraft missions.  This effort will implement these standards into a prototype processing system and demonstrate through Software Integration Lab (SIL) testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.767"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated and demonstrated airspace\/battlespace integration technologies, including real-time situational awareness display concepts and collision avoidance technology concepts, and evaluated effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increase complexity of airspace\/battlespace scenario and demonstrate effectiveness of real-time displays and collision avoidance technologies; and begin development of a software developer toolkit and integrator toolkit to verify software compliance with defined JCA standards and requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "Will publish version 3 of the JCA standard that defines an open avionics systems architecture for future vertical lift aircraft and validate performance of the supporting JCA Ecosystem components (Software Developer's Tool Kit, Integrator's Tool Kit, Conformance Test Tool, Repository, and Simulation\/Stimulation tools)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "435"
                    },
                    "ProjectTitle": {
                        "val": "AIRCRAFT WEAPONS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.525"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates and integrates manned and unmanned sensor and weaponization technologies such as advanced missiles, guns, fire controls, advanced target acquisition and pilotage sensors into Army aviation platforms.  Efforts are directed toward reducing the integrated weight of weapons, increasing engagement ranges, providing selectable effects on a variety of threats, and enabling cost-effective integration across multiple aviation platforms.   \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Redstone Arsenal, AL and Fort Eustis, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aviation Multi-Platform Munition (AMPM)"
                                    },
                                    "Description": {
                                        "val": "Aircraft weapons efforts were consolidated in this project to focus technologies toward integrating a new lightweight weapon for use with both manned and unmanned rotorcraft systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.525"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed the system concept and system engineering plan for integration of smart weapons, to include initial definition of a universal weapon integration architecture; and demonstrated smart weapon (Shadow Hawk) integration implementing the Universal Armaments Interface (UAI) standard."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "436"
                    },
                    "ProjectTitle": {
                        "val": "ROTARYWING MEP INTEG"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.705"
                        },
                        "CurrentYear": {
                            "val": "7.607"
                        },
                        "BudgetYearOne": {
                            "val": "9.492"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.492"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "12.037"
                        },
                        "BudgetYearThree": {
                            "val": "9.805"
                        },
                        "BudgetYearFour": {
                            "val": "9.001"
                        },
                        "BudgetYearFive": {
                            "val": "10.490"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and validates man-machine integration and mission equipment software and hardware technologies for unmanned and optionally manned aircraft systems.  Efforts focus on artificial intelligence, intelligent agents, cognitive decision aiding (CDA), sensors, avionics, communications, and pilot vehicle interfaces.  This project improves the overall mission execution by demonstrating manned and unmanned system teaming, enhanced helicopter pilotage capability, improved crew workload distribution, and new capabilities for both manned and unmanned aircraft.  This project supports Army transformation by providing mature technology to greatly expand the capabilities of unmanned aircraft, in current operating roles and future unmanned wingman roles.  This project also develops, demonstrates and integrates manned and unmanned sensor and weaponization technologies such as advanced missiles, guns, fire controls, advanced target acquisition and pilotage sensors into Army aviation platforms.  Efforts are directed toward reducing the integrated weight of weapons, increasing engagement ranges, providing selectable effects on a variety of threats, and enabling cost-effective integration across multiple aviation platforms.   \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aviation Applied Technology Directorate of the Aviation and Missile Research, Development and Engineering Center (AMRDEC), Fort Eustis, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned and Optionally Manned Systems (previously titled as Intelligent Autonomy for Unmanned Systems)"
                                    },
                                    "Description": {
                                        "val": "Mature and apply tactical behavior algorithms and safe-flight technologies to enable unmanned and optionally manned aircraft to maintain safe, responsive, flexible and tactical formation flight with manned helicopters for unmanned wingman applications in re-supply, reconnaissance, surveillance and attack missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.705"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated and down-selected flight-following algorithms.  Assessed architectures for integrating flight-following algorithms and tactical behaviors with flight controls."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.719"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Migrate autonomy functions from ground control station to the unmanned aircraft to enable precise adjustment of delivery location in re-supply mission and autonomous onboard real time mission re-planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.992"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.992"
                                            },
                                            "Text": {
                                                "val": "Will complete fabrication of unattended delivery and landing system through incorporation of 3-D terrain analysis and mapping; and mature and integrate multi-vehicle control technologies for cargo\/resupply Unmanned Aerial System (UAS) operations; and prepare for flight demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Weapon & Sensor Systems (previously titled as Aviation Weapons System Integration)"
                                    },
                                    "Description": {
                                        "val": "Develop an integrated, networked sensor and weapons management system that enables manned-unmanned teams to conduct cooperative precision engagements of short dwell targets with distributed Mission Equipment Packages (MEPs) ."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.888"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop a lightweight, integrated weapon system for manned and unmanned engagements of ground and airborne targets, to include advanced munitions for platform self-defense from threat unmanned aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "Will perform detailed design of the lightweight, integrated weapon system concept developed in FY12 to defeat threat aircraft systems (manned and unmanned) and soft ground targets; design target tracking algorithms to enable airborne engagement of maneuvering targets; evaluate performance of airburst munition fuzing concepts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "447"
                    },
                    "ProjectTitle": {
                        "val": "ACFT DEMO ENGINES"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.570"
                        },
                        "CurrentYear": {
                            "val": "9.620"
                        },
                        "BudgetYearOne": {
                            "val": "9.909"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.909"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.276"
                        },
                        "BudgetYearThree": {
                            "val": "10.251"
                        },
                        "BudgetYearFour": {
                            "val": "9.772"
                        },
                        "BudgetYearFive": {
                            "val": "8.478"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates power system technologies through design, fabrication, and evaluation of advanced engine components in order to improve the performance of turbine engines for rotorcraft.  This project supports Army modernization by demonstrating mature technologies for lighter turbine engines that provide increased power, increased fuel efficiency, improved sustainability and reduced maintenance.   These advanced engine designs will significantly improve the overall aircraft performance characteristics and reduce the logistical footprint of rotary wing aircraft.    \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aviation Applied Technology Directorate of the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), at Fort Eustis, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Affordable Turbine Engine (AATE) Technology"
                                    },
                                    "Description": {
                                        "val": "Demonstrate a 3000 horsepower gas turbine engine for improved operational capability for Blackhawk, Apache, and other future rotorcraft.  AATE includes two competitive engine demonstrator efforts (1 - General Electric and 2 - Advanced Turbine Engine Company (ATEC) (Honeywell and Pratt & Whitney Joint Venture)).  Work in this project is complementary with efforts in PE 0602211A, project 47A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.570"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed optimized component evaluations and analyzed results in support of engine demonstration; integrated optimized components into goal engine demonstrator hardware; completed full engine demonstration to include final engine performance and weight assessment; completed additional engine evaluations to gain insight into engine durability characteristics; and upon completion of this effort, this program transitions to the PEO Aviation Improved Turbine Engine Program (ITEP) for Engineering Manufacturing Development (EMD)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future Affordable Turbine Engine (FATE)"
                                    },
                                    "Description": {
                                        "val": "Demonstrate an advanced, innovative 7000 shp class gas turbine engine that provides significant improvement in operational capability for current and future rotorcraft.  FATE uses sequential design and fabrication iterations to mature a design to demonstrate significant reduction in specific fuel consumption (SFC); significant improvement in horsepower-to-weight ratio; and significant reduction in production and maintenance cost compared to year 2000 state-of-the-art engine technology.  The sequential design and fabrication process will begin with the compressor subsystem, then the combuster subsystem, then the turbine subsystem, and finally the mechanical systems.  Work in this project is coordinated with efforts in PE 0602211A, project 47A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete preliminary design, detailed design, and component fabrication efforts for initial build of advanced engine system demonstrator, building on knowledge gained under other DoD Versatile Affordable Advanced Turbine Engine (VAATE) efforts; and design activities include 2-D and 3-D mechanical and aero-thermal efforts to evaluate the merits of individual components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.909"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.909"
                                            },
                                            "Text": {
                                                "val": "Will complete detailed system design activities and initiate tests for multiple engine subsystems and components (e.g. compressor, turbine, combustor, and mechanical systems), with an emphasis on the compressor and turbine subsystems of the advanced FATE design; validate the design's aerodynamic performance and mechanical integrity, prior to the first, integrated, full-engine test; analyze completed component test results to support redesign efforts as required for future engine builds."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}