{
    "id": "86bf2a62552d23a5539d753c7f6db80b833aba41",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604787D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Systems Integration Command"
        },
        "R1LineItemNumber": {
            "val": "103"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.180"
            },
            "CurrentYear": {
                "val": "12.716"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Systems Integration Command Program Element (JSIC PE) provides mission funding for the Joint System Integration Center (JSIC) to conduct interoperability assessments, and develop solutions\/recommendations to improve integration of Service, Defense Agency, and coalition systems. JSIC promotes Service\/Defense Agency C2 capability integration, and conducts technical, operational, and DOTMLPF assessments of Command and Control (C2) and Command, Control, Computer, Communication, Intelligence, Surveillance and Reconnaissance (C4ISR) capabilities.  JSIC serves as the technical analysis and operational assessment activity in support of the Joint Staff capability-driven requirements process, the Joint Capabilities Integration and Development System (JCIDS).  JSIC also serves as a joint interoperability compliance activity for the milestone decision authorities\/program managers in the Defense acquisition enterprise.\n\nThe FY 2005 National Defense Authorization Act (NDAA) directed the transfer for Research, Development, Test and Evaluation (RDT&E) funding for joint warfare experimentation and training programs from Navy accounts to new Defense Wide RDT&E accounts beginning in FY 2007.  Joint Staff J8 is the executive agent for the JSIC PE and Assistant Secretary of Defense for Research and Engineering (ASD (R&E)) provides execution oversight.\n\nJSIC provides Combatant Commands, at the joint force headquarters level, with a laboratory and assessment environment for the warfighter and capability developer.  This environment provides for assessment of current and near-term joint and coalition capabilities primarily at the operational and tactical levels. JSIC's Persistent Command and Control (C2) Environment accurately replicates an operational C2 environment. With this capability, JSIC assesses system of systems interoperability, operational capability, procedural compliance and technical suitability of emerging and existing systems and programs to confirm readiness for deployment.  Through JSIC's analysis and assessment, systems are evaluated for \"value-added\" prior to employment in joint and coalition environments typical of deployed theaters of operation.  \n\nBy establishing ground truth for interoperability and suggesting remedies for demonstrated shortfalls, JSIC is an enabler for interoperable joint and coalition solutions and provides a means to foster rapid, near-term insertion of C4ISR technology by promoting the ability to meet the DoD direction for spiral development and evolutionary acquisition.  JSIC's mission is to provide for the fielding of warfighter C2 systems through rapid systems integration, technical assessment, and operational evaluation using laboratory environments and field venues.  In the world of C2 and ISR interoperability, performance in the field is the bottom line. In terms of investment, JSIC is the \"ounce of prevention\" that precludes a \"pound\" of mission failure and loss of life due to interoperability failures in military operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.413"
                },
                "CurrentYear": {
                    "val": "13.024"
                },
                "BudgetYearOne": {
                    "val": "12.107"
                },
                "BudgetYearOneBase": {
                    "val": "12.107"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.180"
                },
                "CurrentYear": {
                    "val": "12.716"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.233"
                },
                "CurrentYear": {
                    "val": "-0.308"
                },
                "BudgetYearOne": {
                    "val": "-12.107"
                },
                "BudgetYearOneBase": {
                    "val": "-12.107"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.308"
                    },
                    "CurrentYear": {
                        "val": "-0.221"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.755"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.107"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.107"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.071"
                                },
                                "CurrentYear": {
                                    "val": "-0.087"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.099"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P787"
                    },
                    "ProjectTitle": {
                        "val": "Joint Systems Integration Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.180"
                        },
                        "CurrentYear": {
                            "val": "12.716"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Systems Integration Command Program Element (JSIC PE) provides mission funding for the Joint System Integration Center (JSIC) to conduct interoperability assessments, and develop solutions\/recommendations to improve integration of Service, Defense Agency, and coalition systems. JSIC promotes Service\/Defense Agency C2 capability integration, and conducts technical, operational, and DOTMLPF assessments of Command and Control (C2) and Command, Control, Computer, Communication, Intelligence, Surveillance and Reconnaissance (C4ISR) capabilities.  JSIC serves as the technical analysis and operational assessment activity in support of the Joint Staff capability-driven requirements process, the Joint Capabilities Integration and Development System (JCIDS).  JSIC also serves as a joint interoperability compliance activity for the milestone decision authorities\/program managers in the Defense acquisition enterprise.\n\nThe FY 2005 National Defense Authorization Act (NDAA) directed the transfer for Research, Development, Test and Evaluation (RDT&E) funding for joint warfare experimentation and training programs from Navy accounts to new Defense Wide RDT&E accounts beginning in FY 2007.  Joint Staff J8 is the executive agent for the JSIC PE and Assistant Secretary of Defense for Research and Engineering (ASD (R&E)) provides execution oversight.\n\nJSIC provides Combatant Commands, at the joint force headquarters level, with a laboratory and assessment environment for the warfighter and capability developer.  This environment provides for assessment of current and near-term joint and coalition capabilities primarily at the operational and tactical levels. JSIC's Persistent Command and Control (C2) Environment accurately replicates an operational C2 environment.  With this capability, JSIC assesses system of systems interoperability, operational capability, procedural compliance and technical suitability of emerging and existing systems and programs to confirm readiness for deployment.  Through JSIC's analysis and assessment, systems are evaluated for \"value-added\" prior to employment in joint and coalition environments typical of deployed theaters of operation.  \n\nBy establishing ground truth for interoperability and suggesting remedies for demonstrated shortfalls, JSIC is an enabler for interoperable joint and coalition solutions and provides a means to foster rapid, near-term insertion of C4ISR technology by promoting the ability to meet the DoD direction for spiral development and evolutionary acquisition.  JSIC's mission is to provide for the fielding of warfighter C2 systems through rapid systems integration, technical assessment, and operational evaluation using laboratory environments and field venues. In the world of C2 and ISR interoperability, performance in the field is the bottom line.  In terms of investment, JSIC is the \"ounce of prevention\" that precludes a \"pound\" of mission failure and loss of life due to interoperability failures in military operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interoperability Technology Demonstration Center  (ITDC) and Interoperability Assessments (IA)"
                                    },
                                    "Description": {
                                        "val": "Primary outcome (objective) for this effort is seamless interoperability between DoD systems supporting the warfighter. ITDC supports the interoperability assessment of systems in five categories: operational, system of systems, technical, software, and procedural.  Assessment projects identified for FY 2011 will focus on: Operations and Intelligence Integration, Tactical Edge Integration, Complex Problem Analysis, Acquisition Process Support, and Service-Oriented Architecture Migration.  These assessments provide supporting justification for continued development of a program within the acquisition system and resolve capability shortfalls of fielded systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.474"
                                            },
                                            "Text": {
                                                "val": "Conducted interoperability assessments and demonstrations of Command and Control, Computers, Communications, Intelligence, Surveillance, and Reconnaissance (C4ISR) developmental and fielded systems\/applications for Combatant Commanders, Services, and Agencies that support Operations and Intelligence Integration, Tactical Edge Integration, Capability Gap Analysis, Acquisition Process Support, and Service Oriented Architecture Migration activities.\n\nAfghanistan Mission Network (AMN) Coalition Interoperability Assurance Validation (CIAV) Assessments – AMN is the primary Coalition, Command, Control and Communications and Computers, Intelligence, Surveillance, and Reconnaissance (C5ISR) network in Afghanistan for ISAF forces.  The CIAV process was developed to validate Coalition Mission Threads (CMT) and Coalition Tactics, Techniques and Procedures (CTTP) and identify and address ISAF interoperability problems.  Conducted interoperability assessments of Battlespace Awareness, Counter-IED, and Joint Fires systems to ensure interoperability and functionality ISAF Joint Command. Assessment findings identified specific interoperability problems which software developers used to resolve issues prior to fielding in theater.   \n\nNATO Targeting Systems Interoperability Assessment (NTSIA) – Assessed changes to U.S. and NATO targeting system’s data interoperability to include potential solutions to automate the exchange of target data and lists. This assessment successfully demonstrated the ability to automatically transfer targeting data from U.S. targeting systems and databases to NATO targeting systems and databases. \n\nCollection Management Interoperability Assessment (CMIA) - Assessed the capability of Collection Management tools in coalition and joint environments to interact, synchronize and share information across multiple echelons. The project demonstrated the technical capability to exchange collection management data between U.S. and NATO systems. \n\nCommand and Control, Intelligence, Surveillance, Reconnaissance (C2ISR) Interoperability Assessment – Assessed correction of interoperability problems previously identified with imagery data exchange between the Global Command and Control System – Joint (GCCS-J) and Distributed Common Ground System –Army (DCGS-A) via a DCGS Integration Backbone (DIB) interface. \n\nEmpire Challenge 11 (EC11) – EC 11 was a joint ISR emerging technology demonstration sponsored by the Office of the Under Secretary of Defense for Intelligence (OUSD(I)). Completed assessments that identified capability issues discovered and recommended solutions to mitigate or resolve those issues associated with 18 assigned capabilities. \n \nCoalition Warrior Interoperability Demonstration 2011 (CWID11) Selected Trial Assessments - CWID evaluates solutions aimed at enhancing interoperability and information sharing with multinational coalition partners. Provided assessment and engineering site support hosting 16 trails and conducting 9 warfighter utility assessments. The trials and assessments focused on C2 functions to improve CTF Commander situational awareness on air and missile defense systems, information-sharing portals, air and maritime situational awareness systems and network and management applications.  Of the eight assessments completed, five trials met Sponsor Defined Requirements, two were rated as unsatisfactory, and one was marginal. \n\nGlobal Command and Control System-Joint (GCCS-J) Block V Post Implementation Review (PIR) Assessment – Completed data collection and analysis on behalf of the operational sponsor’s sustainment and synchronization requirements for GCCS-J PIR to ensure the needs of the warfighter were met. Based on the information in the PIR Report, the Joint Staff Joint Command and Control senior leaders changed their recommended course of action for JC2 from \"maintain\" (e.g., keep the same functions as the GCCS-J currently has) to \"MODIFY\" (e.g., make the investment to improve, fix, modify) the JC2 to include fixing issues identified.  GCCS-J PIR fulfilled the Clinger-Cohen Act and A-300 requirements for providing information through the DoD CIO to support congressional review requirements for major systems.  \n\nJoint Integrated Air and Missile Defense Organization (JIAMDO) Joint Sensor Integration (JSI) Spiral 2 with Integrated Air and Missile Defense Common Operational Picture (IAMD COP) Assessment - Assessed data exchanges to enable improved, comprehensive identification within all combat systems' nodes, as they pertain to using an accurate common operational picture (COP) with enriched time sensitive targeting data.\n\nTactical Edge Data Solutions (TEDS) JCTD Assessments – Conducting interoperability assessments focusing on movement of information and data between U.S. Army and U.S. Marine Corps battalion-level tactical-edge systems and applications with Joint and Coalition systems.\n\nCommand and Control (C2) Central - Expanded C2 Central’s comprehensive system descriptions; document library; images; architectures; analysis and visualization tools capabilities; yellow pages and interactive calendar of events and further refined search engine capabilities for the user.\n\nVisual Command and Control Capability Analysis and Tradeoff Suite (VCATS) – Developed an assessment framework and an interactive “dashboard” to demonstrate the ability to make C2 Doctrine, Organization, Training, Material, Leadership, Personnel, and Facilities (DOTMLPF) tradeoffs and recommendations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.327"
                                            },
                                            "Text": {
                                                "val": "Continue the efforts initiated for FY 2011 and respond to unpredictable operational issues and shortfalls. Interoperability demonstrations will be conducted to solve warfighter problems, including coalition challenges. Focus areas will include the Global Command and Control System-Joint (GCCS-J) family of systems, Distributed Common Ground System (DCGS) and interoperability with coalition systems.\n\nOperations and Intelligence Integration activities include:\n\nJoint System Baseline Assessments 2012 (JSBA12) - Assessments will focus on problem areas that impair information sharing: information exchanges between the Command and Control and Battlespace Awareness portfolios and coalition operations.\n\nCommand and Control, Intelligence, Surveillance, Reconnaissance, and Targeting (C2ISRT) Interoperability Assessment – Conduct interoperability assessments to support resolution of Integrated Priority List (IPL) and Joint Urgent Operation Need Statements (JUONS)and improve operations and intelligence interoperability.\n\nTALISMAN SABRE Interoperability Assessment – Assess selected US and coalition Command, Control, Intelligence, Surveillance, Reconnaissance and Targeting (C2ISRT) applications.\n\nTrident Warrior 2012 (TW12) Interoperability Assessments - Assess the joint interoperability of joint C2 nodes.\n\nEmpire Challenge 12 (EC12) – Perform assessments of emerging Intelligence, Surveillance, and Reconnaissance (ISR) capabilities and assess joint\/coalition interoperability.\n\nAfghanistan Mission Network (AMN) Coalition Interoperability Assurance Validation Assessment – Conduct interoperability assessments of coalition systems to determine interoperability and functionality in a coalition\/joint mission environment.\n\nTactical Edge Integration activities include:\n\nJoint Integrated Air and Missile Defense Organization (JIAMDO) Assessment Support - Assess three Joint Distributed Engineering Plant (JDEP) event candidates; Joint\/Multi-Service Sensor Integration (J\/MSI); Integrated Air and Missile (IAMD) Common Operational Picture (COP); and Joint IAMD Net-Centric Warfare Integrated Planning (JNWIP)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Assessments and Integration (TA&I)"
                                    },
                                    "Description": {
                                        "val": "Primary Outcome (objective) for this effort is to provide near-term technical solutions for integration, assessment and delivery of operational capabilities that address near-term operational and tactical requirements.  TA&I use organic laboratory resources, equipment, and technical personnel to integrate emerging technologies. JSIC also provides Doctrine, Organizational, Training, Materiel, Leadership, Personnel, Facilities (DOTMLPF) recommendations on fielding strategies for Joint Staff endorsement.  TA&I capability gap areas of concentration identified include; Tactical Edge Integration, and Acquisition Process Support activities.\n\nThe primary outputs and efficiencies realized are: 1) Reduced costs and delivery time to the warfighter through application of commercial and emerging technology to solve near-term Combatant Commander (COCOM) Command and Control (C2) capability gaps; 2) Increased cost avoidance through transition of successful commercial technology integration shortfalls to applicable Service programs of record; 3) Decreased reliance on post delivery interoperability corrections; 4) Improved assessment-based recommendations of technology solutions that address the military utility of proposed solutions and identify relevant service programs, doctrinal impacts, training implications, and personnel requirements; and 5) Improved life-cycle support for capabilities deployed to forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.840"
                                            },
                                            "Text": {
                                                "val": "Intelligence, Surveillance and Reconnaissance (ISR) Video Dissemination Integration Assessments – Performed a technical integration to validate industry-standard video technology and networking protocols Livecast®, MediaFLO®, Inca-X®, and RealityVision® are interoperable with selected systems and architectures to support fielding decisions.\n\nNational Security Agency (NSA) Secure Wireless LAN (SWLAN) Technical and Utility Pilot Assessment – Conducted a pilot implementation of NSA\/I732 Secure Wireless LAN (SWLAN) Architecture, which evaluated network performance and user perceptions in an unclassified wireless network environment using commercial-off-the-shelf (COTS) software encryption in lieu of hardware encryption devices.\n\nCommand and Control Applications Over Broadband Cellular (C2ABC) Technical Assessment – Identified and evaluated solutions for integrating cellular technology with legacy C2 applications and assessed the commercial software LifeRing® and its capability to exchange legacy C2 data with a Smartphone.\n\nNational Security Agency (NSA) Commercial Solutions for Classified (CSfC) Secure Wireless Local Area Network (SWLAN) Integration Pilot – Provided assistance to NSA in the development of a Suite B software encryption solution. This supports plans to field a capability to communicate over SECRET wireless networks without using Type-1 hardware solutions (e.g., SecNet 54, Talon, or KG-250s)\n\nJoint Internet Protocol Modem (JIPM) Assessment – Validated the operational use of the JIPM architecture to support Command and Control information exchange over a two way Global Broadcast Service environment extended over a broadband cellular wireless network.\n\nBroad Band Cellular 4G and Beyond Technical Integration Assessment – Integrated an interoperable 4G cellular solution that provides access to secure C2 and ISR applications using broadband cellular technology for dismounted users and assessed the ability of BBC4G networks to interoperate and support the transport of C2 data for applications such as Joint Automated Deep Operations Coordination System (JADOCS), Command and Control Personal Computer (C2PC), Adobe Connect, and Force XXI Battle Command Brigade and Below (FBCB2) while simultaneously providing software based encryption.  \n\nCelestial Reach Joint Capability Technical Demonstration (JCTD) Assessment – Integrated a wide-band antenna solution for joint air, ground, and maritime operations and assessed the capability’s utility in providing wide-band communications that support Command and Control (C2) and Intelligence Surveillance and Reconnaissance (ISR) applications to enroute users.\n\nDigitally-aided Personnel Recovery (DaPR) Integration and Interoperability Assessment - Conducted a technical and interoperability assessment of DaPR Personnel Recovery Support System (PRSS) standardized digital messages and applied forwarding rules to validate whether the developed message format can be passed digitally to the appropriate mission manager to initiate the recovery and then forward the information to rescue forces through existing tactical data links and Command, Control, Communications (C3) systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.472"
                                            },
                                            "Text": {
                                                "val": "Continue FY 2011 initiatives investigating potential impacts of technology advances in wireless devices, mesh and ad-hoc networking, satellite modem technology, and small lightweight secure digital capabilities on warfighter command and control capabilities and match emerging critical warfighter requirements with the technologies to identify near-term technology solutions supporting Combatant Commanders.\n\nCommand and Control (C2) Applications Over Broadband Cellular Technical Assessment – Continue technical and functional assessments of C2 applications; Joint Automated Deep Operations Coordination System (JADOCS), Command and Control Personal Computer (C2PC); Force XXI Battle Command, Brigade-and-Below (FBCB2), and Adobe Connect over broadband cellular.\n\nIntelligence, Surveillance and Reconnaissance Video Dissemination Technologies – Continue technical integration to validate industry-standard video technology and networking protocols Livecast, MediaFLO, and Inca-X are interoperable with selected systems and architectures.\n\nArmy Joint Tactical Wireless Communications Capability (JTWCC) Assessment Support – Provide broadband cellular technical subject matter experts and Command and Control (C2) Applications Over Broadband Cellular suite for use as a tool to evaluate multiple broadband solutions.\n\nNational Security Agency (NSA) Suite B Encryption Integration and Utility Assessment – Continue to provide network and technical assistance to NSA in the development of a Suite B software encryption solution.  Suite B software provides encryption capability without using a hardware solution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Capability Assessment"
                                    },
                                    "Description": {
                                        "val": "Primary Outcome (objective) for this effort is to provide objective based assessment of  Doctrine, Organizational, Training, Materiel, Leadership, Personnel, Facilities (DOTMLPF) solution sets supporting the Joint Task Force Commander.  JSIC will analyze COCOM near-term requirements using DOTMLPF criteria.  JSIC will identify current, emerging, or mature technologies to address materiel requirements.  Comprehensive assessments covering joint maturity, interoperability, warfighter utility, and operational effectiveness will be conducted on legacy and transformational projects.  JSIC will provide DOTMLPF recommendations on fielding strategies for Joint Staff endorsement.\n\nThe primary outputs and efficiencies realized are: 1) Increased number of recommended improvements that enhance the capability of Joint Task Force Headquarters (JTF HQ); 2) Increased number of verifiable capability solutions recommended for fielding to the Combatant Commander based on quantified capability improvements; 3) Increased empirical data to support benefit-cost ratio improvements of JTF HQ investment decisions to ensure JTF HQs command and control (C2) capabilities are interoperable from technical and operational standpoints; 4) Increased number of assessments conducted that identify current force JTF HQs C2 systems that are interoperable and supported, that inform and recommend solutions to integrate, modify, or retire current force systems; 5) Increased number of assessment based recommendations of technology solutions that address the military utility of proposed and existing Service solutions; and  6) Increased number of solutions deployed with recognized DOTMLPF impacts.\n\nProgram Management offices benefit because the JSIC program provides a venue for Military Utility Assessments (MUAs) of technologies before committing to implementation.  The potential savings associated with finding existing commercial technologies to provide gap filler solutions, and avoid the fielding of systems that are not interoperable or that fail to meet warfighter needs, are difficult to quantify.  Potentially life-threatening shortfalls are identified and fixed in advance of fielding.  Services benefit directly by reduced Program Manager costs and by fielding systems that are interoperable and meet warfighter needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.412"
                                            },
                                            "Text": {
                                                "val": "Unified Cross Domain Management Office (UCDMO) Cross Domain Solutions (CDS) Baseline Capability Assessment of Radiant Mercury v5.0 – Conducted a capability assessment, measuring the functional strengths and weaknesses of the Radiant Mercury v 5.0 guard against Unified Cross Domain Management Office (UCDMO) prescribed criteria.\n\nJoint Planning and Execution System (JPES) and Application Segments Test and Evaluation Support – Provided an independent observation of the maturity of JPES Integrated Gaming System (IGS) and Rapid Time Phased Force Deployment Data Builder (RTB) prior to fielding.  \n\nGlobal Combat Support System Joint (GCSS-J) Host Based Security System (HBSS) Cyber-Capability Support - Provided the required closed network environment to eliminate the risk of testing in an operational network to assess the information assurance of HBSS on the GCSS-J system prior to release to enhance usability and identify remaining capability gaps to the program management office."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Function will be eliminated as part of the USJFCOM disestablishment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Command and Control Environment \/ Federated Joint C2 Laboratories (FJC2L)"
                                    },
                                    "Description": {
                                        "val": "JSIC supports a Persistent Command and Control Environment by aggressively engaging the Services in a collaborative effort to bring joint solutions through JSIC's capability integration, interoperability demonstrations and capability assessments process.  JSIC works in collaboration and formal coordination with the Joint Staff, Combatant Commanders, Services, defense agencies, departments and agencies outside of DoD, as well as allies and other coalition partners to align efforts, create a culture of innovation, and foster the development of new joint operational capabilities, along with measures of merit, to serve as the basis for exploring future joint capabilities and operations through joint and coalition experimentation and assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.454"
                                            },
                                            "Text": {
                                                "val": "Afghanistan Mission Network (AMN) Coalition Interoperability Assurance Validation (CIAV) Engineering Support – Provided infrastructure, communications, network, information assurance, security, and engineering support as requested.\n\nBold Quest 2011 (BQ11) Exercise Engineering Support – Provided infrastructure, communications, network, information assurance, security, and engineering support as requested.\n\nCoalition Warrior Interoperability Demonstration 2011 (CWID11) Support - Provided infrastructure, communications, network, information assurance, security, and engineering support as requested.\n\nEmpire Challenge 2011 (EC11) C2 Systems Support – Provided infrastructure, communications, network, information assurance, security, and engineering support as requested.\n\nArmy Joint Tactical Wireless Communications Capability (JTWCC) Assessment Support – Provided broadband cellular technical subject matter experts and a Command and Control (C2) Applications Over Broadband Cellular suite for use as a tool to evaluate multiple broadband solutions.\n\nC2 Capability in a Denied or Degraded Environment (C2D2E) – Provided infrastructure, communications, network, information assurance, security, and engineering support as requested.\n\nAFRICOM Judicious Response (AJR) Exercise Support – Provided infrastructure, communications, network, information assurance, security, and engineering support as requested.\n\nJoint Mission Thread Architecture Framework and Data Model (JMT AFDM) - Provided infrastructure, communications, network, information assurance, security, and engineering support as requested."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.917"
                                            },
                                            "Text": {
                                                "val": "Continue FY 2011 initiatives by engaging the Services and Communities of Interest (COI) to leverage the capabilities of the Persistent Command and Control Environment by bringing joint solutions through JSIC's integration and operational assessment process.  Also continue to expand existing relationships with Service and Coalition Labs and Engineering organizations.\n\nDoD Interoperability Communications Exercise 2012 (DICE12) Support – Provide infrastructure, communications, network, information assurance, security, and engineering support as requested.\n\nJoint Users Interoperability Communications Exercise C2 Systems 2012 (JUICE12) Support – Provide infrastructure, communications, network, information assurance, security, and engineering support as requested.\n\nAfghanistan Mission Network (AMN) C2 Systems Support – Provide infrastructure, communications, network, information assurance, security, and engineering support as requested.\n\nEmpire Challenge 2012 (EC12) C2 Systems Support – Provide infrastructure, communications, network, information assurance, security, and engineering support as requested.\n\nC2 Capability in a Denied or Degraded Environment (C2D2E) – Provide a C2 JTF environment with selected legacy systems.\n\nJoint Mission Thread Architecture Framework and Data Model (JMT AFDM) - Provide infrastructure, communications, network, information assurance, security, and engineering support as requested."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transfer to Joint Stafff Accounts"
                                    },
                                    "Description": {
                                        "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "JSIC supports interoperability of systems selected for acquisition, integration and fielding.  JSIC is intended to be a forcing function to discover and provide interoperable joint solutions as a means to foster rapid, near-term insertion of command and control technology by promoting the ability to meet the DoD direction for spiral development and evolutionary acquisition.  Services and Defense Agencies are responsible for conducting acquisition activities in Programs of Record (POR)."
                        },
                        "PerformanceMetrics": {
                            "val": "Strategic Goals Supported:  Joint Command and Control. \nPlanned Performance Improvement \/ Requirement Goal:  5 percent increase in assessments, integrations and demonstrations."
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Project Selection"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Project Planning"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Procurement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Testing\/Integration\/Assessment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Report\/Findings"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}