{
    "id": "89bee5775032f29706151407ed46912331881873",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0303310D8Z"
        },
        "ProgramElementTitle": {
            "val": "Countering Weapons of Mass Destruction Systems (CWMD)"
        },
        "R1LineItemNumber": {
            "val": "69"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "4.140"
            },
            "BudgetYearOne": {
                "val": "53.946"
            },
            "BudgetYearOneBase": {
                "val": "53.946"
            },
            "BudgetYearTwo": {
                "val": "60.804"
            },
            "BudgetYearThree": {
                "val": "64.073"
            },
            "BudgetYearFour": {
                "val": "64.052"
            },
            "BudgetYearFive": {
                "val": "65.068"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The diverse and complex Countering Weapons of Mass Destruction (CWMD) – nuclear, biological and chemical threats – mission space requires an integrated approach towards capability development. Capability development must be based on a systems perspective that links strategic objectives with interrelated tasks and associated capabilities. The broad CWMD military strategic objectives and mission areas encompass many nontraditional capabilities for the Warfighter, and CWMD is not an isolated mission set unique to DoD – it is intertwined with counter-terrorism and homeland defense. Accordingly, developing an overall CWMD capability should and must leverage complementary capabilities through integration and synchronization. This program addresses developing an integrated and interconnected CWMD capabilities-based system that defines and enables a comprehensive, global awareness and readiness for CWMD steady-state and surge postures. A global CWMD situational awareness capability will be established and deployed worldwide via current communications systems and common operating pictures in support of this mission.  This program will incorporate portfolio management tools and comprehensive analyses to enable a balanced and integrated CWMD systems portfolio, an optimized CWMD force structure, and the integration with and utilization of existing military assets to fill intelligence, sensor and reconnaissance gaps in CWMD.\n\nThis program also responds to the strategic needs outlined in the President's initiative, stated in his April 2009 speech in Prague; the US Combatant Commands integrated priorities and requirements; the 2010 Quadrennial Defense Review; and the FY12-16 Defense Planning and Programming Guidance by providing improved timeliness and relevance through modernizing CWMD support to the Combatant Commands, Office of the Secretary of Defense, Joint Staff, Intelligence Community (IC), and other U.S. Government agencies as required. This program is designed to leverage existing DoD resources and proven approaches to achieve its goals and rapidly deliver a capability to the Warfighter. It will ensure sufficient funding is available for travel to support the requirements of this program element."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "7.788"
                },
                "BudgetYearOne": {
                    "val": "56.937"
                },
                "BudgetYearOneBase": {
                    "val": "56.937"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "4.140"
                },
                "BudgetYearOne": {
                    "val": "53.946"
                },
                "BudgetYearOneBase": {
                    "val": "53.946"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-3.648"
                },
                "BudgetYearOne": {
                    "val": "-2.991"
                },
                "BudgetYearOneBase": {
                    "val": "-2.991"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "CurrentYear": {
                        "val": "-0.119"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "-0.029"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.991"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.991"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Congress reduced the FY12 budget $3.5M"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P*004"
                    },
                    "ProjectTitle": {
                        "val": "Countering Weapons of Mass Destruction Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.140"
                        },
                        "BudgetYearOne": {
                            "val": "53.946"
                        },
                        "BudgetYearOneBase": {
                            "val": "53.946"
                        },
                        "BudgetYearTwo": {
                            "val": "60.804"
                        },
                        "BudgetYearThree": {
                            "val": "64.073"
                        },
                        "BudgetYearFour": {
                            "val": "64.052"
                        },
                        "BudgetYearFive": {
                            "val": "65.068"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The diverse and complex Countering Weapons of Mass Destruction (CWMD) – nuclear, biological and chemical threats – mission space requires an integrated approach towards capability development. Capability development must be based on a systems perspective that links strategic objectives with interrelated tasks and associated capabilities. The broad CWMD military strategic objectives and mission areas encompass many nontraditional capabilities for the Warfighter, and CWMD is not an isolated mission set unique to DoD – it is intertwined with counter-terrorism and homeland defense. Accordingly, developing an overall CWMD capability should and must leverage complementary capabilities through integration and synchronization. This program addresses developing an integrated and interconnected CWMD capabilities-based system that defines and enables a comprehensive, global awareness and readiness for CWMD steady-state and surge postures. A global CWMD situational awareness capability will be established and deployed worldwide via current communications systems and common operating pictures in support of this mission.  This program will incorporate portfolio management tools and comprehensive analyses to enable a balanced and integrated CWMD systems portfolio, an optimized CWMD force structure, and the integration with and utilization of existing military assets to fill intelligence, sensor and reconnaissance gaps in CWMD.\n\nThis program also responds to the strategic needs outlined in the President's initiative, stated in his April 2009 speech in Prague; the US Combatant Commands integrated priorities and requirements; the 2010 Quadrennial Defense Review; and the FY12-16 Defense Planning and Programming Guidance by providing improved timeliness and relevance through modernizing CWMD support to the Combatant Commands, Office of the Secretary of Defense, Joint Staff, Intelligence Community (IC), and other U.S. Government agencies as required. This program is designed to leverage existing DoD resources and proven approaches to achieve its goals and rapidly deliver a capability to the Warfighter. It will ensure sufficient funding is available for travel to support the requirements of this program element."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Countering Weapons of Mass Destruction (CWMD) Systems"
                                    },
                                    "Description": {
                                        "val": "CWMD Systems Development and Integration to include:\n• A global CWMD situational awareness system and concept of operation to enable a common operating picture and framework for CWMD that will integrate C4ISR, multi-modality intelligence, and other data to support simultaneous operations worldwide and address operational capability gaps.\n• A portfolio management capability based on an integrated system of systems architectural framework to evaluate potential CWMD investments.\n• Enhancements to major defense acquisition programs to address CWMD mission and systems’ gaps.\n• A CWMD organizational capabilities review and update as required."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.140"
                                            },
                                            "Text": {
                                                "val": "• Initiate development of a CWMD common operating picture (COP), now known as Global CWMD Situational Awareness System (GCAS), to leverage and integrate domain awareness, WMD intelligence and other prevention\/control data to support global\/regional awareness and the command and control of forces for CWMD.\n• Assess and develop steady state posture (DoD organizational capabilities) to provide more rapid, robust responses, develop CMWD concept of operations.\n• Develop specific end-user information requirements and the initial Concept of Operations (CONOPS) for the use and integration of GCAS capabilities into day to day operations of Analysts and Decision Makers. Include a supporting non-material solution analysis to include organizational and structural infrastructure for the GCAS system.  \n• Review and evaluate the components of operational systems and organizations that contribute towards all mission areas in CWMD.  \n• Develop an initial systems architecture for GCAS integration approach.  Derive the systems level requirements from the user requirements and system architecture.  \n• Begin technical and operational assessments of the tools for data integration and information processing, including data management and visualization alternatives.  Analysis will include demonstrated commercial and government available and applicable towards the system requirements for GCAS.\n• Initiate development of GCAS methodology using WMD intelligence and other prevention\/control data to support global\/regional awareness and the command and control of forces for CWMD.\n• Demonstrate a proof of concept of the semantic fusion component of a GCAS capability for technical risk reduction using the existing Haystack system developed by USD(I) to fuse data from various CWMD and Counter-terrorism data sources and look for new indicators and warnings not previously discovered or demonstrate correlations faster and easier than existing capabilities.\n• Identify framework and options for portfolio management of CWMD systems and begin the development of a risk-based framework to prioritize and guide investment decisions that result in improved operational capabilities. Develop qualitative metrics of performance to drive prioritization and identify options for integrated management of capability development.\n• Begin a structured assessment of DoD organizational capabilities to accomplish the integrated global CWMD mission set in order to support near-term activities and provide a framework for addressing longer-term capability, force-sizing, and force employment issues.  In FY12, the assessment focused on the CWMD mission areas of WMD Interdiction, WMD Elimination, and Consequence Management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "53.946"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "53.946"
                                            },
                                            "Text": {
                                                "val": "The FY13 program will work towards developing a capability that will address all WMD threats – nuclear, chemical, and biological – from both state and non-state sources.  It will involve information on a range of drivers of proliferation, including key actors, networks, sensitive materials, and extensive contextual information.  It will assist DoD in both preventing the loss of sensitive materials and technologies (and the deliberate or natural spread of disease), and in responding to attacks and outbreaks when they do occur.  It will integrate with information systems that the combatant commands and Services already use in their day-to-day operations.\n\nGCAS OPERATIONAL SUPPORT\n\n• Complete the GCAS Concept of Operations (CONOPS).\n• Complete the analysis of organizational and structural infrastructure options and requirements for GCAS. Focus on the personnel requirements for the centralized component of GCAS i.e. the home base for operations or analysis center.  Select location for deployment of the Initial Operating Capability.\n• Continue the structured assessment of DoD organizational capabilities to accomplish the integrated global CWMD mission set.  FY13 efforts will include Security Cooperation and Partner Activities, Threat Reduction Cooperation, and Passive Defense.\n\nGCAS PROGRAM, SYSTEMS ENGINEERING and SYSTEMS INTEGRATION\n\n• Begin information model and information architecture development.  Complete system functional and performance requirements, and specifications. \n• Complete technical and operational assessments for data integration and information processing, including data management and visualization alternatives.  Analysis will include demonstrated commercial and government available and applicable towards the system requirements for GCAS.\n• Conduct limited evaluation and downselection of integration and information processing tools based on the candidates evaluated in FY12.  Complete technology readiness evaluations as required.\n• Continue and expand the methodology for determining what Situational Awareness information should be generated to fulfill information needs to describe steady state and event tracking\/crisis monitoring. Determine the need for additional data streams to support and their availability.\n• Transition GCAS demonstration capability to an operational prototype in FY13 with the intention for fielding an initial operating capability in FY14.\n• Develop GCAS prototype. Identify, leverage and integrate appropriate existing technologies, data and fusion methodologies to produce a GCAS capability with minimal new development efforts.  Extend the Haystack data fusion demonstration system to include broader set of data streams and incorporate complementary and orthogonal analytic tools to facilitate the generation of the CWMD situational awareness actionable data.\n• Develop and implement interfaces to acquire biosurveillance and chemical data from national, international programs and sources.\n• Develop and implement interfaces to acquire nuclear threat data from nuclear security, nuclear treaty verification, nuclear monitoring, and radiation detection sources and programs.\n• Initiate exercise program to demonstrate integration and overlaying of CWMD, counterterrorism, maritime and air domain awareness, and counternarcotics for improved situational awareness. This will include the ingestion and fusion of military maritime and worldwide shipping data.\n• Work closely with and implement the information sharing mechanisms as required including policy, certifications, tags and controls.\n\nCWMD PORTFOLIO MANAGEMENT\n\n• Begin development of a CWMD systems architecture to enable comprehensive and systematic evaluation of needed capabilities as well as their relationship to each other.\n• Refine qualitative metrics and assessment criteria and begin development of quantitative metrics for evaluation, where applicable.\n• Begin development of simulation and modeling capability to evaluate and compare proposed investment options.\n\nMAJOR DEFENSE ACQUISITION PROGRAM ENHANCEMENTS\n\n• Identify those existing and planned major defense programs that can contribute to the CWMD mission by improving status, tracking, interdiction and recovery as necessary.  Begin efforts to integrate supporting data streams from major defense systems (air, land, and sea) to support the persistent surveillance of WMD threats.\n\nFY14 and beyond:\n\n• Achieve Initial Operating Capability (IOC)\n• Begin next spiral of situational awareness capability - Add new data sources, life patterns, and rule-sets\/algorithms.  Generate new methodology and supporting situational awareness feeds from new data and algorithms.\n• Continue to build\/upgrade\/modify the required infrastructure for the GCAS operations home base to include hardware and software for computational and processing capabilities, training, and organizational support to support IOC and attain full operational capability (FOC).\n• Integrate GCAS components into a service-oriented, web-based collaborative environment; register and publish all service and data capabilities; enable authorized users to subscribe to information of interest; allow accredited data sources to be added.  Where appropriate, allow integrated GCAS services and its associated updated CONOPS available to all Combatant Commands (COCOMs) and military users.\n• Scale GCAS hardware to support additional users; integrate and test analytical engine updates; perform analyst evaluation of updates.\n• Achieve network and system certifications and accreditations and identify initial capability for classified and unclassified security domains; identify additional Command and Control (C2) integration updates required; provide integrated technical user support and operational reach-back support.\n• Achieve full certification and accreditations on all security domains; provide operational GCAS capabilities on classified and unclassified networks; conduct Technology Refresh; Knowledge Refresh; provide additional of Data Sources; integrate with additional C2 systems.\n• Continue technology and data stream gap analysis and supporting research and development to fulfill the requirements for achieving CWMD situational awareness."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Success in this area is measured by compliance with various statutes and DoD directives that govern the conduct of the affairs within the Office of ASD\/NCB. Maintain cost, schedule, and performance reporting, review, and adjudication.  Maintain requirements traceability matrix."
                        }
                    }
                }
            ]
        }
    }
}