{
    "id": "8b406c938732973419b1171657e56f0616bf94bb",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603670D8Z"
        },
        "ProgramElementTitle": {
            "val": "Human Social Culture Behavior (HSCB) Modeling Advanced Development"
        },
        "R1LineItemNumber": {
            "val": "43"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.299"
            },
            "CurrentYear": {
                "val": "12.724"
            },
            "BudgetYearOne": {
                "val": "8.235"
            },
            "BudgetYearOneBase": {
                "val": "8.235"
            },
            "BudgetYearTwo": {
                "val": "8.398"
            },
            "BudgetYearThree": {
                "val": "8.606"
            },
            "BudgetYearFour": {
                "val": "8.853"
            },
            "BudgetYearFive": {
                "val": "9.016"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Human Social Culture Behavior (HSCB) Modeling Program is a vertically integrated effort to research, develop, and transition technologies, tools, and systems to programs of record and users in need. The Program exists to optimize U.S. forces’ ability to perform population-centric sensing, understand behaviors driven by social and cultural variables, and take effective courses of action in the full range of military operations. Program research enhances intelligence, surveillance, and reconnaissance (ISR) capabilities for understanding the Irregular Warfare environment and meeting the challenges of instability and violent extremism. Under three integrated program elements (PEs), the Program conducts applied research, matures and demonstrates advanced technology, and develops transition-ready components and prototypes. Work under PE 0603670D8Z is focused on developing and demonstrating general-use, cross-domain tools in two areas: computational modeling; and sociocultural behavior data collection, management, and dissemination. Research results in more effective cultural understanding in existing intelligence, influence operations, and operations planning systems; modeling capabilities for forecasting reactions to U.S.\/coalition actions; demonstration of strategic decision making tools that highlight political, religious, cultural, and related factors; tools and technologies enabling more widespread and effective use of sociocultural behavior models in operations and mission rehearsal; and toolsets that can be used as strategic decision making tools to account for sociocultural factors."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.510"
                },
                "CurrentYear": {
                    "val": "18.179"
                },
                "BudgetYearOne": {
                    "val": "20.743"
                },
                "BudgetYearOneBase": {
                    "val": "20.743"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.299"
                },
                "CurrentYear": {
                    "val": "12.724"
                },
                "BudgetYearOne": {
                    "val": "8.235"
                },
                "BudgetYearOneBase": {
                    "val": "8.235"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.211"
                },
                "CurrentYear": {
                    "val": "-5.455"
                },
                "BudgetYearOne": {
                    "val": "-12.508"
                },
                "BudgetYearOneBase": {
                    "val": "-12.508"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.112"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.230"
                    },
                    "CurrentYear": {
                        "val": "-0.367"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.000"
                                },
                                "CurrentYear": {
                                    "val": "-5.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.053"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.037"
                                },
                                "CurrentYear": {
                                    "val": "-0.088"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.508"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.508"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P370"
                    },
                    "ProjectTitle": {
                        "val": "Human Social Culture Behavior (HSCB) Modeling Advanced Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.299"
                        },
                        "CurrentYear": {
                            "val": "12.724"
                        },
                        "BudgetYearOne": {
                            "val": "8.235"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.235"
                        },
                        "BudgetYearTwo": {
                            "val": "8.398"
                        },
                        "BudgetYearThree": {
                            "val": "8.606"
                        },
                        "BudgetYearFour": {
                            "val": "8.853"
                        },
                        "BudgetYearFive": {
                            "val": "9.016"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program is focused on developing and demonstrating general-use, cross-domain tools in two areas: computational modeling; and sociocultural behavior data collection, management, and dissemination. Research results in cultural understanding technologies and overlays to support intelligence, influence operations, and operations planning systems; modeling capabilities for forecasting reactions to U.S.\/coalition actions; demonstration of strategic monitoring and decision making tools that account for political, religious, cultural, and related factors; tools and technologies enabling more widespread and effective use of sociocultural behavior models in operations. The Program ensures that supported research is clearly tied to warfighters and their needs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modeling Capabilities"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate computational models to support population-centric sensing of reactions to U.S.\/coalition informational, military, economic, or political actions. The Program’s long-term objective is to develop tools that can enable forecasting of those reactions and support analysis of alternative courses of action (COA). This is a challenging objective that requires research, development and integration of constituent technologies. Integrate and demonstrate decision making support tools useful within programs of record and operational user analysis, planning and execution systems for political, religious, cultural and other factors. Support specific operational planning tasks for selected government partners via limited technical demonstration in user settings. In addition, working with operational partners HSCB Program models will be tested in realistic environments by representative users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.605"
                                            },
                                            "Text": {
                                                "val": "Transitioned to USAFRICOM J2 a geospatial model to inform decision makers about activity of terrorist organizations in Africa. Transitioned to USSOCOM (J2) technologies and materials for analytic tools that incorporate sociocultural information and data search and tagging technology. In support of International Security Assistance Force (ISAF) Networks Effects Cell (NEC), applied and transitioned a methodology for defining precursors to adversarial events and strengthens capability for forecasting potential hostile actions. Transitioned select capabilities into DCGS-A common format to support transition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.335"
                                            },
                                            "Text": {
                                                "val": "Continue research and demonstration of integrated decision making support tools, with particular focus on hybrid modeling that can support development of COAs for countering violent extremism and mitigating instability. Research and develop components to demonstrate a prototype “social radar” application suite. Demonstrate hybrid technologies that can reduce human analytic time and increase quality of analysis of large scale human movements in potentially unstable regions. Enhance models that provide capabilities to detect and forecast instability for 175 countries. Provide prototype sentiment analysis capability and tools that incorporate social media with traditional data sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.004"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.004"
                                            },
                                            "Text": {
                                                "val": "Continue to extend and assess system for providing advance sensing of national and sub-national scale crisis. Mature “social radar” application suite.  Demonstrate tools for understanding COA impacts on nature and extent of violent extremism. Introduce forecasting capabilities for new indicators of national security interest. Develop methods, techniques, standards and tools that support model selection and verification and validation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visualization Software Toolsets"
                                    },
                                    "Description": {
                                        "val": "Demonstrate first generation decision-making tools that include sociocultural behavior factors. These tools are required to account for political, religious, cultural, and other factors as well as to vertically integrate cultural information into a military operational environment. Common, generalized (strategic to tactical) tools for visualization of Diplomatic, Information, Military and Economic (DIME) COA, and Political Military Economic Social Information Infrastructure (PMESII) effects on the battlefield, or during Security, Stability, Transition and Reconstruction phases do not exist. This Program will focus on providing visualization capabilities that support a richer understanding of sociocultural data in concert with other warfighter data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.575"
                                            },
                                            "Text": {
                                                "val": "For USSOCOM, transitioned tools and technology to support the Military Information Support Operations (MISO) planning process, including visualizations and modeling of information operations. In support of U.S. European Command and U.S. Africa Command, transitioned model and analytic methods for forecasting migration patterns. Provided framework within which to collect and visualize data in near real-time, analyze them in a relevant data-to-decisions process resulting in actionable information, and disseminate the outputs using standard data interoperability protocols."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.691"
                                            },
                                            "Text": {
                                                "val": "Demonstrate visualization methods and tools that can deal with the most challenging visualization issues, including sparse data sets, highly volatile underlying data, and inherent complexity of sociocultural behavior dynamics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Visualization research discontinued starting FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training\/Mission Rehearsal Systems"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate methods and procedures for integrating cultural information into military operations. Focus on methods and resources that will increase flexibility to rapidly deliver just-in-time training for new regions of interest and emerging mission areas (e.g. transition and reconstruction). Develop resources and tools to support integration of sociocultural behavior models with existing training systems, and to train personnel at tactical, operational, and strategic levels in the appropriate and effective use of those models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.060"
                                            },
                                            "Text": {
                                                "val": "Implemented culturally-aware conversational agents by linking agent behavior to an ontology. Defined specific communication tasks indexed to a range of warfighter missions, roles, and tasks, and began development of Two Dimensional (2D), Three Dimensional (3D), and mobile learning activities to train these communication skills."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Training research discontinued starting FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sociocultural Data Collection and Management"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate tools for improved collection of sociocultural behavior data for multiple operational echelons and denied areas. Develop and demonstrate tools to support ingest of unstructured data and structuring of data for use in computational modeling for intelligence analysis, operations analysis, and decision support. Specifically address social media and other open source data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.059"
                                            },
                                            "Text": {
                                                "val": "Developed and applied semantic wiki capability to document data produced as part of analysis for multiple ISAF NEC requests for information and in support of USMC Civil Affairs requirements for information management. Provided operational demonstration of a capability that enables rapid population of a social network for review by an analyst."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.698"
                                            },
                                            "Text": {
                                                "val": "Research and develop tools for collecting valid sociocultural data in denied or restricted environments. Demonstrate methods and tools for collecting at scale from open sources data that support understanding and COA assessment for the challenges of violent extremism and regional instability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.231"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.231"
                                            },
                                            "Text": {
                                                "val": "Demonstrate tools for data collection in denied or restricted environments. Limited investment to advance tools and methods for harvesting data at scale from open source media. Discontinue research and development of other technology enablers for monitoring and understanding the human environment without “boots on the ground”."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0602670D8Z BA 2"
                                    },
                                    "Title": {
                                        "val": "HSCB Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.199"
                                        },
                                        "CurrentYear": {
                                            "val": "8.602"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.771"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.771"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.923"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.100"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.305"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.438"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0604670D8Z BA 4"
                                    },
                                    "Title": {
                                        "val": "HSCB Research & Engineering"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.038"
                                        },
                                        "CurrentYear": {
                                            "val": "7.252"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.131"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.131"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.234"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.355"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.522"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.622"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}