{
    "id": "9546947a68f9061f32e26123c58f5f91d47c7cd8",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602668D8Z"
        },
        "ProgramElementTitle": {
            "val": "Cyber Applied Research"
        },
        "R1LineItemNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.538"
            },
            "CurrentYear": {
                "val": "4.581"
            },
            "BudgetYearOne": {
                "val": "18.985"
            },
            "BudgetYearOneBase": {
                "val": "18.985"
            },
            "BudgetYearTwo": {
                "val": "19.041"
            },
            "BudgetYearThree": {
                "val": "9.581"
            },
            "BudgetYearFour": {
                "val": "9.851"
            },
            "BudgetYearFive": {
                "val": "10.030"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Our military forces require resilient, reliable networks and computer systems to conduct effective operations. However, the number and sophistication of threats in cyberspace are rapidly growing, making it urgent and critical to improve the cyber security of Department of Defense (DoD) networks to counter those threats and assure our missions. This program focuses on innovative and sustained research in both cyber security and computer network operations to develop new concepts to harden key network and computer components, design new resilient cyber infrastructures, increase the military’s ability to fight and survive during cyber attacks, disrupt nation-state level attack planning and execution, measure the state of cyber security, and explore and exploit new ideas in cyber warfare for agile cyber operations and mission assurance. \n\nThe Cyber Advanced Technology Development program element is budgeted in the advanced technology development budget activity because it will focus on the maturation of successful applied research results and their development into demonstrable advanced cyber capabilities. The Cyber Advanced Technology\nDevelopment program will build on results of matured applied research from the Cyber Applied Research Program and other programs to develop technology demonstrations for potential transition into capabilities that support the full spectrum of computer network operations.  These approaches will include moving from cyber defense to cyber resilience by changing the defensive terrain of our existing digital infrastructure, identifying ways to raise the risk and lower the value of attack from an advanced, persistent cyber threat, and focusing on mission assurance. \n\nThis program focuses on integrating computer network defense and computer network operations, addressing the advanced persistent threat, and filling DoD technology gaps as determined by assessments conducted by the Office of the Assistant Secretary of Defense for Research & Engineering (OASD(R&E)) over the past year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.000"
                },
                "CurrentYear": {
                    "val": "9.735"
                },
                "BudgetYearOne": {
                    "val": "19.519"
                },
                "BudgetYearOneBase": {
                    "val": "19.519"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.538"
                },
                "CurrentYear": {
                    "val": "4.581"
                },
                "BudgetYearOne": {
                    "val": "18.985"
                },
                "BudgetYearOneBase": {
                    "val": "18.985"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.462"
                },
                "CurrentYear": {
                    "val": "-5.154"
                },
                "BudgetYearOne": {
                    "val": "-0.534"
                },
                "BudgetYearOneBase": {
                    "val": "-0.534"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.300"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.117"
                    },
                    "CurrentYear": {
                        "val": "-0.122"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.000"
                                },
                                "CurrentYear": {
                                    "val": "-5.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.025"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.018"
                                },
                                "CurrentYear": {
                                    "val": "-0.032"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.534"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.534"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.538"
                        },
                        "CurrentYear": {
                            "val": "4.581"
                        },
                        "BudgetYearOne": {
                            "val": "18.985"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.985"
                        },
                        "BudgetYearTwo": {
                            "val": "19.041"
                        },
                        "BudgetYearThree": {
                            "val": "9.581"
                        },
                        "BudgetYearFour": {
                            "val": "9.851"
                        },
                        "BudgetYearFive": {
                            "val": "10.030"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The program is developing technology options through the DoD S&T organizations within and across the following technical areas:\n\nINFORMATION ASSURANCE AND COMPUTER NETWORK DEFENSE (IA\/CND):\nDevelop technologies to harden DoD network components; evolve from network defense to mission assurance; and enable systems to operate through cyber attacks in degraded and contested environments.\n\nCOMPUTER NETWORK OPERATIONS (CNO):\nDisrupt adversary attack planning and execution; explore game-changing ideas over the full spectrum of CNO and new concepts in cyber warfare; increase collaboration between disparate research communities within CNO; and address identified gaps in DoD CNO S&T to prepare for cyber conflict against advanced persistent threats.\n\nCYBER METRICS AND EXPERIMENTATION:\nExplore new analytical methodologies, models, and experimental data sets to establish metrics to measure a system’s state of security, apply the scientific method to establish the foundations of a scientific framework in which cyber security research can be conducted to test hypothesis with measurable and repeatable results, and quantitative experimentation and assessment of new cyber technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Applied Research"
                                    },
                                    "Description": {
                                        "val": "The Cyber Applied Research program builds on the existing basic and applied research results and transition new successful applied research results to the Cyber Advanced Technology Development program element.  The link between the Cyber Applied Research and Cyber Advanced Technology Development program elements is intended to create a mechanism to take existing basic research results and mature them to the point of incorporation into technology demonstrations.  This program focuses on integrating computer network defense and computer network operations, addressing joint problems in cyber operations, and filling capability and technology gaps as determined by assessments in the Office of the Assistant Secretary of Defense for Research & Engineering.  Progress and results are reviewed by the DoD Cyber S&T Steering Council."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.538"
                                            },
                                            "Text": {
                                                "val": "Initiated research activities with the specific focuses technical areas of information assurance and computer network defense, computer network operations, and cyber metrics and experimentation.  Commenced a semi-annual technical program review cycle and a series of laboratory-hosted cross-fertilization workshops to enable joint collaboration across DoD S&T organizations and between the defensive and offensive S&T communities. \n\nFocuses of each technical area: \n\nINFORMATION ASSURANCE AND COMPUTER NETWORK DEFENSE (IA\/CND):\n-Resilient architectures and protocols to reduce cyber reaction time for rapid system reconstitution to a known secure state and enable critical mission operation through cyber attacks in degraded environments.\n-Agile cyber operations to enable moving target defense and defensive cyber maneuver.\n-Attack detection and understanding to reduce, rapidly and autonomously detect, and mitigate attack effects.\n-Vulnerability discovery and analysis to improve cyber risk assessment, situational awareness, and the impact of cyber assets on missions.\n\nCOMPUTER NETWORK OPERATIONS (CNO):\n-Resilient CNO frameworks and architectures.\n-Wireless discovery and access techniques.\n-Situational awareness in near real-time during cyber operations.\n-Agile cyber maneuver to disrupt and confuse adversarial attack planning cycles to increase adversary risk and work factor and decrease effectiveness during adversary attack and exploitation attempts.\n-Improved understanding of the adversarial threat.\n\nCYBER METRICS AND EXPERIMENTATION:\n-Measurements of effectiveness of existing countermeasures and the current level of DoD cyber security.\n-Measurements of impacts of new cyber security technologies.\n-Measurements of computer and network assurance levels for enhanced situational awareness.\n-Quantitative analysis and experimental testing of the effect of resilient and agile cyber operations and architectures on DoD system and network security."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.581"
                                            },
                                            "Text": {
                                                "val": "INFORMATION ASSURANCE AND COMPUTER NETWORK DEFENSE (IA\/CND):\n-Enable interoperability amongst computer network defense and computer network attack software framework capabilities for broader threat mitigation coverage.\n-Develop analytical model of resiliency of cross-layer protocols and routing techniques in the presence of jamming.\n-Investigate vulnerabilities in rich content delivery in new implementations of common web browsers.\n-Test and evaluate existing type-checking, shadow circuits, and other security mechanisms in use by separation kernels.\n-Investigate optical transport layer vulnerabilities in commoditized critical infrastructure systems, including fiber-optic telecommunications devices.\n-Develop non-signature-based monitoring and validation methods to accurately convey the integrity of running system software.\n\nCOMPUTER NETWORK OPERATIONS (CNO):\n-Development of common protocols and services to enable a common command and control infrastructure and more efficient effects development to enhance existing but disparate computer network operations software frameworks.\n-Develop and test a time difference of arrival system for tactical wireless emitter localization.\n-Design and develop algorithms and techniques for data hiding at the physical layer of wireless networks.\n-Examine the scale and breadth of control that provides adversaries a broad base from which to launch cyber attacks using botnets.\n\nCYBER METRICS AND EXPERIMENTATION:\n-Development of a composite trust metric and mission performance tradeoff analysis for mobile ad-hoc networks (MANETs)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.985"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.985"
                                            },
                                            "Text": {
                                                "val": "INFORMATION ASSURANCE AND COMPUTER NETWORK DEFENSE (IA\/CND):\n-Investigate impact of cognitive radio technology to increase network resiliency by enabling cross-layer communications.\n-Define hardware\/software interface logic language for many-core processors and systems on a chip to integrate security into automated design flows and run time systems.\n-Develop improved security framework for optical transport layers in critical infrastructure fiber-optic telecommunications devices to ensure reliability and availability of critical communications networks to both DoD and commercial operators and users.\n-Develop techniques to employ non-signature-based monitoring and validation methods to make trust decisions on information systems.\n\nCOMPUTER NETWORK OPERATIONS (CNO):\n-Decouple programming language-dependent constructs in existing CNO software frameworks to allow for development of clients developed in different languages to operate within the SW architecture.\n-Investigate and test a hybrid time of arrival and phased array system for wireless localization. \n-Construct wireless environments for implementing authentication and information hiding schemes at the physical later of wireless networks.\n-Demonstrate malicious code delivery through audio and video content vulnerabilities new implementations of common web browsers. \n-Develop techniques to address adversarial botnets in real-time.\n\nCYBER METRICS AND EXPERIMENTATION:\n-Optimization of a composite trust metric and application for risk management and mission performance tradeoff analysis for multiple-objective missions in coalition networks."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 3, PE #0603668D8Z, P113"
                                    },
                                    "Title": {
                                        "val": "Cyber Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.847"
                                        },
                                        "CurrentYear": {
                                            "val": "5.539"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.935"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.935"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.995"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.707"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.783"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.342"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}