{
    "id": "95df27a46837a0b7e51eeb2153f850d05e47d382",
    "meta": {
        "filename": "dod-2013_RDTE_2013_AIRFORCE_V1_MasterJustificationBook_Air_Force_PB_2013.zzz_unzipped_MasterJustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602788F"
        },
        "ProgramElementTitle": {
            "val": "Dominant Information Technology"
        },
        "R1LineItemNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "114.732"
            },
            "CurrentYear": {
                "val": "127.855"
            },
            "BudgetYearOne": {
                "val": "104.362"
            },
            "BudgetYearOneBase": {
                "val": "104.362"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "115.129"
            },
            "BudgetYearThree": {
                "val": "123.632"
            },
            "BudgetYearFour": {
                "val": "123.104"
            },
            "BudgetYearFive": {
                "val": "124.234"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops enterprise-centric information technology for the Air Force (AF). Advances in enterprise-centric information technologies are required to increase warfighter readiness and effectiveness by providing the right information, at the right time, in the right format, anytime, anywhere in the world. The Connectivity and Protection Tech project provides the technologies for multi-level, secure, seamless networks; advanced communications processors; anti-jam and low probability of intercept techniques, as well as technologies that deter any adversary from attacking computer systems while allowing access to, presence on, manipulation of, and operational effects on adversary computer systems. This project also develops the technology base for the next generation of ultra-wide-bandwidth, multi-channeled, air- and space-based communications networks. The Information Management and Computational Tech project provides advances in information management and dissemination technologies to ensure the delivery of high-quality, timely, secure information to the warfighter, and develop technologies to produce both advanced on-demand computational processing and computer architectures with greater capacity and sophistication for addressing dynamic mission objectives under constraints imposed by AF systems.  The Information Decision Making Tech project develops the technology to support the commander and staff's ability to command all viable options to achieve desired effects across the full spectrum of operations. The Operational Awareness Tech project develops technologies that improve their capability to generate, process, manage, fuse, exploit, interpret, and disseminate timely and accurate information. This program has been coordinated through the Reliance 21 process to harmonize efforts and eliminate duplication. This program is in Budget Activity 2, since it develops and demonstrates the technical feasibility and military utility of evolutionary and revolutionary technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "117.283"
                },
                "CurrentYear": {
                    "val": "127.866"
                },
                "BudgetYearOne": {
                    "val": "129.579"
                },
                "BudgetYearOneBase": {
                    "val": "129.579"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "114.732"
                },
                "CurrentYear": {
                    "val": "127.855"
                },
                "BudgetYearOne": {
                    "val": "104.362"
                },
                "BudgetYearOneBase": {
                    "val": "104.362"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.551"
                },
                "CurrentYear": {
                    "val": "-0.011"
                },
                "BudgetYearOne": {
                    "val": "-25.217"
                },
                "BudgetYearOneBase": {
                    "val": "-25.217"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.011"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.246"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.067"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.730"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-25.217"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-25.217"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY11: Other Adjustments include -1.230 Congressional General Reductions and -1.500 Congressional Directed Transfers\n\nDecrease in FY13 is due to higher Department of Defense priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "625315"
                    },
                    "ProjectTitle": {
                        "val": "Connectivity and Protection Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "45.950"
                        },
                        "CurrentYear": {
                            "val": "52.543"
                        },
                        "BudgetYearOne": {
                            "val": "40.834"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.834"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "50.183"
                        },
                        "BudgetYearThree": {
                            "val": "55.934"
                        },
                        "BudgetYearFour": {
                            "val": "56.025"
                        },
                        "BudgetYearFive": {
                            "val": "54.116"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The AF requires technologies that enable assured, worldwide communications among all elements of the force.  These communication technologies will provide en-route and deployed reachback communications for distributed collaborative military operations. This project provides the technologies for secure, self-configuring, self-healing, seamless networks; advanced communications processors; anti-jam and low probability of intercept communications techniques; agile, dynamic policy based network management capabilities; and modular, programmable, low-cost software radios.  This project also develops both the technology base for the next generation of ultra-wide bandwidth, multi-channeled air- and space-based communications networks on and between platforms using the technologies for implementing photonic chip scale optical Code Division Multiple Access (CDMA) and Wavelength Division Multiplexed (WMD) transceivers and prototype networks associated with advanced fiber optics and the technology to integrate current Radio Frequency (RF) with high data rate Optical Laser communications, along with network management techniques, tools, and software to support them.  In addition, the AF requires technologies to deliver a full range of options in cyberspace at par with air and space dominance in each of the areas of cyber attack, cyber defense, and cyber support to achieve the strategic capability of cyber dominance.  This project provides the technologies required to successfully deter any adversary from attacking computer systems anytime, anywhere by ensuring the AF's ability to:  1) access, maintain presence on, and deliver effects to adversary systems; 2) detect, defend, and respond to attacks on friendly computer systems as well as provide forensic analysis concerning those attack attempts; and 3) provide cyber situational awareness to AF commanders."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1."
                                    },
                                    "Description": {
                                        "val": "Develop improved, survivable, higher bandwidth communications, networking, and signal processing technologies to provide secure, adaptive, covert, anti-jam, and assured global battlespace connectivity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.265"
                                            },
                                            "Text": {
                                                "val": "Conducted in-house and university development of next generation advanced networking technologies for distributed military operations in an airborne environment.  Completed development of low probability of intercept, and low probability of detection waveform for hand held multi-data rate radio which has a small form-factor networking and reachback capability with reduced size, weight, and power.  Completed development of capability to enhance trust within airborne networks and leading wireless protocols for use in the remotely piloted aircraft environment and continue development of capability for increased V\/W band communication to a variety of airborne platforms.  Initiated investigation of mission essential functions, including mini-Common Data Link (CDL), assessing threat tolerance in contested environments, and developing mitigation strategies to alleviate risk due to cyber vulnerabilities.  Initiated both development of secure video distribution over tactical internets on demand and design of optimized, distributed, cross-layer protocol stacks for cognitive radio ad hoc networks with decentralized control.  Initiated investigation of spatial multiplex multiple-input and multiple-output (MIMO) techniques to increase channel capacity and the development of a cognitive cooperation protocol for wireless networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.665"
                                            },
                                            "Text": {
                                                "val": "Continue in-house and university development of next generation advanced networking technologies for distributed military operations in an airborne environment.   Continue both development of secure video distribution over tactical internets on demand and design of optimized, distributed, cross-layer protocol stacks for cognitive radio ad hoc networks with decentralized control.  Continue investigation of spatial multiplex multiple-input and multiple-output (MIMO) techniques to increase channel capacity and the development of a cognitive cooperation protocol for wireless networks.  Complete development of capability for increased V\/W bandwidth communication and characterization to a variety of airborne platforms with varying data rates. Complete investigation of mission essential functions, including mini-CDL, assessing threat tolerance in contested environments, and developing mitigation strategies to alleviate risk due to cyber vulnerabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.927"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.927"
                                            },
                                            "Text": {
                                                "val": "Continue development of next generation advanced networking technologies for distributed military operations in an airborne environment. Continue both development of secure video distribution over tactical internets on demand and design of distributed, cross-layer protocols for cognitive radio ad hoc networks with decentralized control. Complete investigation of spatial multiplex MIMO techniques to increase channel capacity and the development of a cognitive cooperation protocol for wireless networks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2."
                                    },
                                    "Description": {
                                        "val": "Develop cyber defense and supporting technologies to detect, defend, and respond to attacks on computer systems as well as provide forensic analysis concerning the attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.950"
                                            },
                                            "Text": {
                                                "val": "Developed technology to assure operations of our networked forces (a trusted execution environment) in high threat, contested cyber environments by demonstrating a trusted cyber delivery vehicle\/platform to support nearly all types of cyber operations.  Developed technologies to support the ability to avoid cyber attacks by increasing redundancy, diversity, and agility in AF networks to disrupt adversary attack planning by pursuing defensive cyber maneuver and agility, polymorphic code development, and concealment and obfuscation of our networks.  Completed the development of remote rendering services and thin client technology to protect end user information systems from network-delivered threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.600"
                                            },
                                            "Text": {
                                                "val": "Continue development of technology to assure operations of our networked forces (a trusted execution environment) in high threat, contested cyber environments by demonstrating a trusted cyber delivery vehicle\/platform to support nearly all types cyber operations.  Complete development of technologies to support the ability to avoid cyber attacks by increasing redundancy, diversity, and agility in AF networks to disrupt adversary attack planning by pursuing defensive cyber maneuver and agility, polymorphic code development, and concealment and obfuscation of our networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.131"
                                            },
                                            "Text": {
                                                "val": "Continue development of technology to assure operations of our networked forces (a trusted execution environment) in high threat, contested cyber environments by demonstrating a trusted cyber delivery vehicle\/platform to support nearly all types cyber operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3."
                                    },
                                    "Description": {
                                        "val": "Develop offensive cyber operations technologies to access, maintain presence on, and deliver effects to adversary systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.918"
                                            },
                                            "Text": {
                                                "val": "Developed information system access methods and developed propagation techniques. Developed the capability to exfiltrate information from adversary information systems, developed methods for increased cyber situational awareness and understanding of the battlefield, and initiated development of methods for covert data exchange.  Developed technology to deliver D5 (deny, deceive, degrade, disrupt, destroy) effects in concert with cyber platforms.  Developed stealth and persistence technologies.  Demonstrated the ability to identify foreign languages as a part of a cyber intelligence capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.309"
                                            },
                                            "Text": {
                                                "val": "Continue development of information system access methods and development of propagation techniques.  Continue development of stealth and persistence technologies and initiate investigation into anti-reverse engineering methods.  Continue development of the capability to exfiltrate information from adversary information systems, continue development of methods for increased cyber situational awareness and understanding of the battlefield, and continue the development of methods for covert data exchange.  Continue development of technology to deliver D5 effects in concert with cyber platforms.  Initiate development of a publish\/subscribe architecture for exchange and exfiltration of information while operating within adversary information systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.877"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.877"
                                            },
                                            "Text": {
                                                "val": "Complete development of information system access methods and development of propagation techniques. Continue development of stealth and persistence technologies. Initiate investigation into anti-reverse engineering methods.  Continue development of methods for increased cyber situational awareness and understanding of the battlefield, and continue the development of methods for covert data exchange.  Complete development of technology to deliver D5 effects in concert with cyber platforms.  Continue development of a publish\/subscribe architecture for exchange and exfiltration of information while operating within adversary information systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4."
                                    },
                                    "Description": {
                                        "val": "Develop methods and technologies for controlled operation of information systems during attacks and fault conditions, minimizing vulnerabilities of cyber attacks, and guaranteeing the correctness of data and codes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.382"
                                            },
                                            "Text": {
                                                "val": "Completed development of assured end-to-end quality of service (QoS) and quality of information assurance (QoIA) integration to the information system during attacks and faults to provide the ability to degrade gracefully in a controlled trade space.  Developed a resilient and self-regenerating information enterprise and initiate development of automatic machine regeneration of software to recover with immunity from cyber attack.  Conducted challenge problem in-house  and university research investigations for development of cyber domain capabilities supporting AF information systems including research in assured cyber operations in complex networks.  Investigated information assurance tenants in infrastructure as a service cloud environment, concentrating on ensuring secure processing, data storage and communication in a cloud.  Developed defensive techniques for wireless, mobile, and embedded systems.  Initiated development of methods for disruption of malware and covert channels in data transmissions without having to detect whether malware or covert channels exist in the transmission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.876"
                                            },
                                            "Text": {
                                                "val": "Complete development of methods for disruption of malware and covert channels in data transmissions without having to detect whether malware or covert channels exist in the transmission.  Initiate development of defensive cyber technologies to increase system survivability while under a cyber attack.  Complete development of a resilient and self-regenerating information enterprise and continue development of automatic machine regeneration of software to recover with immunity from cyber attack.  Continue challenge problem in-house and university research investigations for development of cyber domain capabilities supporting AF information systems including research in assured cyber operations in complex networks.  Complete investigation of information assurance tenents in infrastructure as a service cloud environments, concentrating on ensuring secure processing, data storage and communication in a cloud.  Complete development of defensive techniques for wireless, mobile, and embedded systems with vulnerability analysis and threat identification for emerging commercial wireless standards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.899"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.899"
                                            },
                                            "Text": {
                                                "val": "Continue development of defensive cyber technologies to increase system survivability while under a cyber attack.  Continue challenge problem in-house and university research investigations for development of cyber domain capabilities supporting AF information systems including research in assured cyber operations in complex networks. Continue investigation into secure processing by using hardware techniques and logic reconfiguration to drastically reduce major vulnerabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 5."
                                    },
                                    "Description": {
                                        "val": "Develop and assess wideband network technologies for application in the air and space environment, including existing and emerging modulation schemes and protocols and consisting of high capacity RF and optical technologies, for next generation platform communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.435"
                                            },
                                            "Text": {
                                                "val": "Completed in-flight verification of the Dense Wavelength Division Optical Multiplexing single mode system by testing data integrity, switching times and latency, total throughput, reconfigurability, bit error rates, and wavelength to wavelength switching during flight operations, and complete development of 40 channel multi-wavelength optical network for on-board air and space applications.   Conducted ground tests of RF waveform generation to demonstrate high capacity persistent sensor data transmission, and complete the fabrication, integration and flight tests of flight test ready optical data link system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.093"
                                            },
                                            "Text": {
                                                "val": "Initiate development of an all-optical communications system for airborne and satellite platforms, that can distribute very high rate digital data and RF signals in high shock, vibration, and radiation environments.  Initiate development of next generation of high capacity data links supporting transmission requirements of airborne and spaceborne sensors.   Continue ground tests of RF waveform generation to demonstrate high capacity persistent sensor data transmission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A.  Effort terminated due to higher Department of Defense priorities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625316"
                    },
                    "ProjectTitle": {
                        "val": "Info Mgt and Computational Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.124"
                        },
                        "CurrentYear": {
                            "val": "32.105"
                        },
                        "BudgetYearOne": {
                            "val": "27.030"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.030"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "28.872"
                        },
                        "BudgetYearThree": {
                            "val": "31.987"
                        },
                        "BudgetYearFour": {
                            "val": "31.671"
                        },
                        "BudgetYearFive": {
                            "val": "31.419"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The AF requires the capability to maximize the value, sharing, management, and use of its information and information assets in achieving its mission objectives as the importance of information grows in the current net centric environment.  Technology development in this project must be capable of taking advantage of future net-centric environments including new structured and ad hoc processes in response to rapidly changing warfare challenges.  Advances in robust information management focus on quality of service and flow of information within the enterprise, information transformation and brokering, secure information sharing across and among domains, and collaboration of workflow within the enterprise.  Technologies addressed in this project include the ability to globally share, discover, and access information across organizational, functional, and coalition boundaries and between and among domains, the timely delivery of information to tactical assets, the tailoring and prioritization of  information based on mission needs and importance, and the scaling, robustness, and collaboration features required of the AF net-centric information management environment.  In addition, the AF requires the development of superior, intelligent, on-demand computing to enable information superiority.  Technology development in this project focuses on producing:  1) computer architectures with greater capacity and sophistication for addressing constrained, dynamic mission objectives; 2) \"game-changing\" computing power to the warfighter; 3) disruptive computing technology power at the edge and the power behind grid services; and 4) interactive and real-time computing improving the usability of high performance computing to the AF.  It includes technologies in computational sciences and engineering, computer architectures, and software intensive systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1."
                                    },
                                    "Description": {
                                        "val": "Investigate and develop technologies for decision quality information dissemination services via publish, subscribe, and query with coalition partners as part of the Global Information Grid (GIG)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.322"
                                            },
                                            "Text": {
                                                "val": "Initiated development of tools and safeguards required to quickly and reliably transfer information from a higher classification domain to a lower classification domain, as well as to coalition partners.  Completed development of secure cross-domain information brokering for the discovery and sharing of web services.  Researched service oriented architecture (SOA) based architectures and services for tactical and enterprise environments that are secure, survivable, and resilient to cyber attack and failures.  Completed research into dynamic information management system infrastructure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.357"
                                            },
                                            "Text": {
                                                "val": "Continue development of tools and safeguards required to quickly and reliably transfer information from a higher classification domain to a lower classification domain, as well as to coalition partners.  Complete research of SOA based architectures and services for tactical and enterprise environments that are secure, survivable, and resilient to cyber attack and failures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.476"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.476"
                                            },
                                            "Text": {
                                                "val": "Continue development of tools and safeguards required to quickly and reliably transfer information from a higher classification security-domain to a lower classification security-domain, as well as to coalition partners. Initiate research into mission responsive data systems by mapping mission requirements to information flows."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2."
                                    },
                                    "Description": {
                                        "val": "Develop automatic and dynamically reconfigurable, affordable, scalable, distributed petaflop processing technologies for real-time global information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.250"
                                            },
                                            "Text": {
                                                "val": "Completed development of algorithms and simulations of select computationally challenging and relevant problems in the scalable quantum information science testbed for optimized information searching and processing.  Researched petaflops embedded processing on-demand and multi-core computing by completing the design and the fabrication of a  prototype for increased control of power.  Developed next generation advanced computing techniques, enabling superior information processing for AF warfighters through in-house and university research. Developed advanced processing capabilities to enable the collection and processing of information as close to the sensor as feasible.  Completed nano-computer technology development to provide high performance, secure, scalable, and survivable information dissemination.  Initiated a study of quantum cores as the foundational building blocks for a multi-core quantum processor.  Initiated study of reconfigurable electronics to enable intelligent AF systems to perform autonomous operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.462"
                                            },
                                            "Text": {
                                                "val": "Continue development of next generation advanced computing techniques, enabling superior information processing for AF warfighters through in-house and university research.  Complete study of reconfigurable electronics to enable intelligent AF systems to perform autonomous operations.   Continue development of tools to analyze codes and dynamic execution profiles and extract threads suitable for multi-core computation.  Complete development of advanced processing capabilities to enable the collection and processing of information as close to the sensor as feasible.   Continue development of embedded processing for on-demand and multi-core petaflops computing.  Continue study of quantum cores as the foundational building blocks for a multi-core quantum processor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.155"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.155"
                                            },
                                            "Text": {
                                                "val": "Continue development of next generation advanced computing techniques, enabling superior information processing for AF warfighters through in-house and university research. Complete development of tools to analyze codes and dynamic execution profiles and extract threads suitable for multi-core computation. Continue development of petaflops embedded processing on-demand and multi-core computing by demonstrating increased control of power of fabricated prototype. Complete study of quantum cores as the foundational building blocks for a multi-core quantum processor."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3."
                                    },
                                    "Description": {
                                        "val": "Develop secure cross domain discovery services for access to services outside of existing domain. Develop the tools to allow collaboration of workflows required by the AF net-centric information management environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.975"
                                            },
                                            "Text": {
                                                "val": "Completed implementation of multi-level lightweight directory access protocol (LDAP) prototype solution into a fully SOA compliant architecture, leveraging the existing multi-level repository (MLR) technology.  Developed a flexible fusion container to allow upstream processing without affecting core critical infrastructure and demonstrated its application to tracking of evasive non-linear targets.  Initiated development of advanced technologies to effectively manage large data storage warehouses within agile enterprise environments by developing quality of service enabled information management services coupled to network routing and management for tactical edge internet protocol (IP)-based networks.  Completed research efforts to improve the timeliness and accuracy of the human review process using advanced information technology.  Developed novel information management techniques as applied to all domains through in-house and university research leading to enhanced information flow across the net-centric assets of the GIG.  Developed information management capabilities in support of force protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.485"
                                            },
                                            "Text": {
                                                "val": "Initiate development of an automated security annotation framework that provides safeguarding mechanisms for the AF enterprise.   Complete an open architecture for the efficient integration of sensors, algorithms, and computing and communications hardware to support real-time tactical information collection, exploitation, and command and control.   Complete development of advanced technologies to effectively manage large data storage warehouses within agile enterprise environments by developing quality of service enabled information management services coupled to network routing and management for tactical edge IP-based networks.    Continue development of novel information management techniques as applied to all domains through in-house and university research leading to enhanced information flow across the net-centric assets of the GIG.   Continue to develop information management capabilities in support of force protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.543"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.543"
                                            },
                                            "Text": {
                                                "val": "Continue development of an automated security annotation framework that provides safeguarding mechanisms for the AF enterprise. Continue development of novel information management techniques as applied to all security-domains through in-house and university research leading to enhanced information flow across the net-centric assets of the GIG."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 4."
                                    },
                                    "Description": {
                                        "val": "Develop the architectural mechanisms that form the basis for predictable software and high assurance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.577"
                                            },
                                            "Text": {
                                                "val": "Designed and demonstrated the functionality of a modular trusted computing base architecture.  Developed a trusted, automated cyber defense capability to reduce response time down to milli-seconds vice hours.  Developed the tools, techniques, standards, and technologies required to build highly complex software-intensive systems.  Completed architectures for cognitive systems and demonstrated hierarchical brassboard.  Initiated development of a co-design of a multi-core Tagged Secure Processor, a Zero-Kernel Operating System, and Application Development Environment inherently resistant to malicious software and inherently compliant with multiple-independent-levels-of-security (MILS) systems.   Initiated design of a hybrid complementary metal-oxide semiconductor (CMOS)\/memristor logic unit that is compact and efficient for encryption algorithm implementation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.801"
                                            },
                                            "Text": {
                                                "val": "Initiate developing architectures for a compact large array of many node clusters with very low power demand for intelligent systems.  Complete development of trusted, automated cyber defense capability to reduce response time down to milli-seconds vice hours.  Continue development of a co-design of a multi-core Tagged Secure Processor, a Zero-Kernel Operating System, and Application Development Environment inherently resistant to malicious software and inherently compliant with MILS systems.  Continue design of a hybrid CMOS\/memristor logic unit that is compact and efficient for encryption algorithm implementation.  Continue the development of the tools, techniques, standards, and technologies required to build highly complex software-intensive systems including correct concurrent code for trusted embedded multi-core systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.856"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.856"
                                            },
                                            "Text": {
                                                "val": "Complete development of a trusted, automated cyber defense capability to reduce response time down to milliseconds vice hours. Continue the development of the tools, techniques, standards, and technologies required to build highly complex software-intensive systems. Complete development of a co-design of a multi-core Tagged Secure Processor, a Zero-Kernel Operating System, and Application Development Environment inherently resistant to malicious software and inherently compliant with MILS systems. Complete design of a hybrid CMOS\/memristor logic unit that is compact and efficient for encryption algorithm implementation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625317"
                    },
                    "ProjectTitle": {
                        "val": "Information Decision Making Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.309"
                        },
                        "CurrentYear": {
                            "val": "17.725"
                        },
                        "BudgetYearOne": {
                            "val": "15.787"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.787"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "15.557"
                        },
                        "BudgetYearThree": {
                            "val": "14.531"
                        },
                        "BudgetYearFour": {
                            "val": "14.554"
                        },
                        "BudgetYearFive": {
                            "val": "14.006"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The AF requires advances in technologies enabling the effective execution of military objectives that will vastly improve the ability to support the commander and staff's ability to command all viable options to achieve desired effects across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict.  Technology development in this project addressing this requirement include anticipatory decision support and course of action development, planning, scheduling and assessment, and the real-time effective portrayal of complex data sets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1."
                                    },
                                    "Description": {
                                        "val": "Develop next generation monitoring, planning, and assessment technologies  enabling aerospace commanders to develop effects-based campaigns."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.933"
                                            },
                                            "Text": {
                                                "val": "Initiated the development of capability for a full-spectrum analysis for effects attainment at all levels of a campaign, linking leading indicators to desired and undesired effects.  Developed and began demonstrating capabilities, including wargaming technologies, to mix kinetic and non-kinetic options, continuously forecast the direct, indirect, and cascading effects of each course of action (COA), and play COAs forward in time to identify key plan dependencies, decision points, and the foreclosure of options.  Initiated the development and demonstration of decision workflow and workload management capabilities to manage the command and control constellation of resources focused on specific missions.  Completed investigation of methods to seamlessly move between geospatial and non-geospatial data to enhance situational awareness and enable integrated decisions over the air, space, and cyberspace domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.856"
                                            },
                                            "Text": {
                                                "val": "Initiate development of a hybrid wargaming concept of decision theory and game theory to provide safeguarded courses of action in adversarial environments with varying degrees of partial information.   Complete development and demonstrate capabilities to mix kinetic and non-kinetic options, continuously forecast the direct, indirect, and cascading effects of each COA, and play COAs forward in time to identify key plan dependencies, decision points, and the foreclosure of options.   Continue investigation of full-spectrum, quantitative analysis techniques that aid operational assessor’s ability to link actions to effects to desired objectives.  Continue the development and demonstration of decision workflow and workload management capabilities to analyze and prioritize courses of action for space control missions and space situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.108"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.108"
                                            },
                                            "Text": {
                                                "val": "Continue development of decision theory and initiate the development of a capability for autonomous adaptive re-planning in a real-time simulation environment using a case-based planning system. Continue investigation of full-spectrum, quantitative analysis techniques that aid operational assessor’s ability to link actions to effects to desired objectives.  Initiate development of robust autonomous control algorithms for heterogeneous and distributed assets capable of learning in dynamic environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2."
                                    },
                                    "Description": {
                                        "val": "Investigate, analyze, and develop technologies for planning, execution, and automatic rapid reconfiguration of distributed intelligent and integrated command and control (C2) information systems to achieve the commander’s intent throughout varying crisis levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.376"
                                            },
                                            "Text": {
                                                "val": "Completed development of  advanced interactive displays, including information visualizations, suitable for both high fidelity, accurate wargames and for rapid deployment in harsh environments with C2 applications and command centers.  Initiated development of capabilities to be more agile within a net centric enabled environment by developing models of cyber network attacks to enable better operation of cyber assets with air and space assets.  Conducted in-house and university development of next generation planning, decision making, and COA tools supporting the commander's ability to exercise a wide range of command and execution options for AF forces.  Completed research to achieve the capability to analyze multiple COA having cascading effects in near-real-time.  Completed the investigation of processes and technologies and recommend solutions to enable the Air Operations Center (AOC) to conduct kinetic\/non-kinetic monitor-assess-plan-execute (MAPE) procedures while under degraded conditions due to cyber attacks.  Developed the capability to rapidly integrate and analyze C2 systems within a developmental environment.  Initiated development of a cooperative multi-agent system to maximize sensor task completions and provide an adaptive and flexible solution to deal with the dynamics of new asset task allocations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.869"
                                            },
                                            "Text": {
                                                "val": "Continue development of capabilities to be more agile within a net centric enabled environment by developing models of cyber network attacks to enable better operation of cyber assets with air and space assets.  Complete development of a cooperative multi-agent system to maximize sensor task completions and provide an adaptive and flexible solution to deal with the dynamics of new asset task allocations.  Continue in-house and university development of next generation planning, decision making, and COA tools supporting the commander's ability to exercise a wide range of command and execution options for AF forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.679"
                                            },
                                            "Text": {
                                                "val": "Complete development of capabilities to be more agile within a net centric enabled environment by developing models of cyber network attacks to enable better operation of cyber assets with air and space assets. Continue in-house and university development of next generation planning, decision making, and COA tools supporting the commander's ability to exercise a wide range of command and execution options for AF forces.  Continue development of techniques for visualizing cyber situational awareness, appropriately selecting cyber assets to achieve desired effects and assuring Ops Center functionality while under cyber attack."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625318"
                    },
                    "ProjectTitle": {
                        "val": "Operational Awareness Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.349"
                        },
                        "CurrentYear": {
                            "val": "25.482"
                        },
                        "BudgetYearOne": {
                            "val": "20.711"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.711"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "20.517"
                        },
                        "BudgetYearThree": {
                            "val": "21.180"
                        },
                        "BudgetYearFour": {
                            "val": "20.854"
                        },
                        "BudgetYearFive": {
                            "val": "24.693"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The AF requires technologies that improve and automate their capability to generate, process, manage, fuse, exploit, interpret, and disseminate timely and accurate information.  This project provides not only a network-centric, collaborative intelligence analysis capability that enables the fusion of multi-intelligence and sensor sources to provide timely situational awareness, understanding, and anticipation of the threats in the battlespace, but also the advanced, novel exploitation technologies needed to intercept, collect, locate, and process both covert and overt raw data from intelligence and sensor sources.  It leads the research, discovery, and development of technology that enables the fusion of multi-intelligence sources to provide accurate object tracking and identification (ID), situational awareness, understanding, and anticipation of the threats in the battlespace (air, ground, space, and cyber).  It also leads in the development of advanced exploitation technologies to maximize the intelligence gained from our adversaries in the areas of spectral detection and geolocation, signal recognition and analysis, and the data tagging, tracking, and tracing via the insertion of secure, imperceptible signal embedding for future fusion and understanding of the information."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Major Thrust 1."
                                    },
                                    "Description": {
                                        "val": "Develop higher-level fusion and the enabling text information\/knowledge base technologies to achieve situational awareness and understanding at all command levels for dynamic planning, assessment, and execution processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.138"
                                            },
                                            "Text": {
                                                "val": "Completed demonstration of the ability to track targets, exploiting feature data, for an average of greater than one hour in moderate traffic density. Began development and implementation of techniques to increase the scalability of tracking algorithms from 10's to 1000's of ground targets in a large rural-urban environment.  Initiated development of techniques and algorithms to improve analysis of multi-sensor data for mining data across multi-INT repositories for behavioral patterns to identify terrorist networks and track movement  and that process moving-target indication data from airborne sensors, and automatically classify airborne targets, including remotely piloted aircraft (RPA).  Developed techniques for analyzing and assessing activities to support situation assessment.  Conducted in-house and university research dealing with level 1 - 4 fusion using multi-source intelligence and sensor feeds to advance the AF capability to anticipate the variety of threats from the ground, air, and cyber domains.  Initiated development of automated generation of ontology from free-text or heterogeneous data sources and develop augmented analyst workflow techniques.  Designed an automated feature aided tracking and pattern recognition capability for onboard processing of a high-resolution, wide-area video staring sensor with cueing from lower bandwidth sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.226"
                                            },
                                            "Text": {
                                                "val": "Continue development and implementation of techniques to increase the scalability of tracking algorithms from 10's to 1000's of ground targets in a large rural-urban environment.  Initiate development of techniques for performing indications and warnings, pattern recognition, and information fusion for information exploitation.   Continue development of techniques and algorithms to improve analysis of multi-sensor data for mining data across multi-INT repositories for behavioral patterns to identify terrorist networks and track movement and that process moving-target indication data from airborne sensors, and automatically classify airborne targets, including RPA.  Complete design and demonstration of an automated feature aided tracking and pattern recognition capability for onboard processing of high-resolution, wide-area video staring sensor with cueing from lower bandwidth sensors.  Continue in-house and university research dealing with level 1 - 4 fusion using multi-source intelligence and sensor feeds to advance the AF capability to anticipate the variety of threats from the ground, air, and cyber domains.  Complete development of techniques for analyzing and assessing activities to support situation assessment.  Initiate developing software to aid the analyst in determining the entity’s behavior, including direction, speed, maneuvers, and operation of equipment.  Complete development of automated generation of ontology from free-text or heterogeneous data sources, and automated task suggestion in response to requests for intelligence information and assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.188"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.188"
                                            },
                                            "Text": {
                                                "val": "Complete development and implementation of techniques to increase the scalability of tracking algorithms from 10's to 1000's of ground targets in a large rural-urban environment. Continue development of techniques for performing indications and warnings, pattern recognition, and information fusion for information exploitation. Complete development of techniques and algorithms to improve analysis of multi-sensor data for mining data across multi-INT repositories for behavioral patterns to identify terrorist networks and track movement and that process moving-target indication data from airborne sensors, and automatically classify airborne targets, including RPA. Continue in-house and university research dealing with level 1 - 4 fusion using multi-source intelligence and sensor feeds to advance the AF capability to anticipate the variety of threats from the ground, air, and cyber domains. Continue developing software to aid the analyst in determining the entity’s behavior, including direction, speed, maneuvers, and operation of equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 2"
                                    },
                                    "Description": {
                                        "val": "Develop digital information exploitation technologies for electronic communications and special signals intelligence, imagery, and measurement signatures to increase accuracy, correlation, and timeliness of the information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.874"
                                            },
                                            "Text": {
                                                "val": "Developed and evaluated watermarking techniques for multimedia, beginning extensions to non-multimedia data and executable code.  Completed supervisory control and data acquisition (SCADA) protocols, integrated all algorithms, demonstrated and tested a prototype analysis suite as an extensible proof-of-concept, and verified and validated algorithm performance against simulated real-world data.  Conducted in-house and university research in advanced exploitation techniques that maximize the AF ability to gather, process, and display information from multi-INT sources identifying threats to warfighters across the physical and cyber domains.  Developed optimizing exploitation across sensors to enhance multi-intelligence fusion and initiated investigation into a deeper understanding of and linguistic decomposition of tonal languages. Developed a capability to detect and geo-locate surveillance and mobile threat emitters and initiated investigation to perform specific emitter identification to exploit differences in transient characteristics and aid in intercept disambiguations.  Initiated development of a signal processing methodology for exploiting multi-sensor data to detect, identify, and geo-locate emerging signals.  Initiated development of a target-specific baseline to test and integrate a capability to assess and exploit passive, semi-active and active radio frequency identification devices and biologically motivated techniques for object detection, recognition, and tracking in video and imagery data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.249"
                                            },
                                            "Text": {
                                                "val": "Complete the development and evaluation of watermarking techniques, focused on streaming media. Complete investigation of combined temporal, spatial, and frequency techniques to provide a multi-domain approach for information provenance, pedigree, and assurance. Continue the development, test, and evaluation of real-time, tactical information exploitation software using laboratory tools and operational data.  Develop a wide variety of exploitation methods to enhance signals situational awareness.  Continue in-house and university research in advanced exploitation techniques that maximize the AF ability to gather, process, and display information from multi-INT sources identifying threats to warfighters across the physical and cyber domains.  Complete the development of optimizing exploitation across sensors to enhance multi-INT fusion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.574"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.574"
                                            },
                                            "Text": {
                                                "val": "Complete the development, test, and evaluation of real-time, tactical information exploitation software using laboratory tools and operational data. Continue development of a wide variety of exploitation methods to enhance signals situational awareness. Continue in-house and university research in advanced exploitation techniques that maximize the AF ability to gather, process, and display information from multi-INT sources identifying threats to warfighters across the physical and cyber domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Major Thrust 3."
                                    },
                                    "Description": {
                                        "val": "Develop modeling and simulation technologies for the next generation of planning, assessment, and execution environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.337"
                                            },
                                            "Text": {
                                                "val": "Completed development of the \"core\" nation state model (to include both the physical and social subsystems).  Completed development to model and explore policy actions and reactions taken by the different modeled entities activities.  Initiated development of tools for the analyst to identify the optimum set of leverage points to meet commander's objectives.  Initiated the identification of degree to which the adversary can achieve hypothesized enemy COAs (eCOAs) based on predicted goals.  Completed verification and validation for integration of the various frameworks. Initiated development of an integrated set of possible combinations of adversary COAs and adversarial intentions based on the adversary's abilities and capabilities to perform activities associated with various domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.007"
                                            },
                                            "Text": {
                                                "val": "Continue development of tools for the analyst to identify the optimum set of leverage points to meet commander's objectives.  Continue the identification of degree to which the adversary can achieve hypothesized eCOAs based on predicted goals.   Continue development of an integrated set of possible combinations of adversary COAs and adversarial intentions based on the adversary's abilities and capabilities to perform activities associated with various domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.949"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.949"
                                            },
                                            "Text": {
                                                "val": "Complete development of tools for the analyst to identify the optimum set of leverage points to meet commander's objectives. Complete the identification of degree to which the adversary can achieve hypothesized eCOAs based on predicted goals. Complete development of an integrated set of possible combinations of adversary COAs and adversarial intentions based on the adversary's abilities and capabilities to perform activities associated with various domains."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}