{
    "id": "9f39986de96cff437b27bb6fd64cc75c00e2c64b",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA6_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604256A"
        },
        "ProgramElementTitle": {
            "val": "THREAT SIMULATOR DEVELOPMENT"
        },
        "R1LineItemNumber": {
            "val": "135"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "25.367"
            },
            "CurrentYear": {
                "val": "26.117"
            },
            "BudgetYearOne": {
                "val": "18.090"
            },
            "BudgetYearOneBase": {
                "val": "18.090"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "16.934"
            },
            "BudgetYearThree": {
                "val": "19.180"
            },
            "BudgetYearFour": {
                "val": "22.863"
            },
            "BudgetYearFive": {
                "val": "22.932"
            }
        },
        "ProgramElementNote": {
            "val": "FY11 includes a Congressional Add of $9,166K for the JFCOM Mission Transfer."
        },
        "ProgramElementMissionDescription": {
            "val": "This program supports the design, development, acquisition, integration and fielding of realistic mobile threat simulators and realistic threat simulation products utilized in Army training and developmental and operational tests.  While this project originally funded simulators representing Soviet equipment, the changing world order has expanded the scope of this program to address other world threats.  Army Threat Simulator and Threat Simulation products are utilized to populate test battlefields for U.S. Army Test and Evaluation Command (ATEC), to conduct developmental and operational tests, and to support Program Executive Office (PEO) required user testing in System Integration Laboratories and hardware\/simulation in-the-loop facilities.  Army threat simulator and threat simulation products developed or fielded under this program support Army-wide, non-system specific threat product requirements. Each capability is pursued in concert and coordination with existing Army and tri-service capabilities to eliminate duplication of products and services, while providing the proper mix of resources needed to support Army testing and training. These battlefield simulators represent systems (e.g. missile systems, command, control and communications systems, electronic warfare systems, etc.) that are used to portray a realistic threat environment during testing of U.S. weapon systems. Simulator development is responsive to Office of the Secretary of Defense and General Accounting Office guidance for the Army to conduct operational testing in a realistic threat environment. Actual threat equipment is acquired when appropriate (in lieu of development) and total package fielding is still required (i.e., instrumentation, operations and maintenance, manuals, new equipment training, etc.). Threat simulator development is accomplished under the auspices of the Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) and the Director, Operational Test and Evaluation, Threat Simulator Investment Working Group."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "26.158"
                },
                "CurrentYear": {
                    "val": "16.992"
                },
                "BudgetYearOne": {
                    "val": "17.442"
                },
                "BudgetYearOneBase": {
                    "val": "17.442"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "25.367"
                },
                "CurrentYear": {
                    "val": "26.117"
                },
                "BudgetYearOne": {
                    "val": "18.090"
                },
                "BudgetYearOneBase": {
                    "val": "18.090"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.791"
                },
                "CurrentYear": {
                    "val": "9.125"
                },
                "BudgetYearOne": {
                    "val": "0.648"
                },
                "BudgetYearOneBase": {
                    "val": "0.648"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "9.166"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.519"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.648"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.648"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.272"
                                },
                                "CurrentYear": {
                                    "val": "-0.041"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "976"
                    },
                    "ProjectTitle": {
                        "val": "ARMY THREAT SIM (ATS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.367"
                        },
                        "CurrentYear": {
                            "val": "26.117"
                        },
                        "BudgetYearOne": {
                            "val": "18.090"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.090"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.934"
                        },
                        "BudgetYearThree": {
                            "val": "19.180"
                        },
                        "BudgetYearFour": {
                            "val": "22.863"
                        },
                        "BudgetYearFive": {
                            "val": "22.932"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program supports the design, development, acquisition, integration, and fielding of realistic mobile threat simulators and realistic threat simulation products used in Army training, developmental tests, and operational tests. While this project originally funded simulators representing Soviet equipment, the operational environment has expanded the scope of this program to address other world threats. Army Threat Simulator and Threat Simulation products are used to populate test battlefields for U.S. Army Test and Evaluation Command (ATEC), to conduct developmental and operational tests, and to support Program Executive Office (PEO) required user testing in System Integration Laboratories and hardware\/simulation in-the-loop facilities. Army threat simulator and threat simulation products developed or fielded under this program support Army-wide, non-system specific threat product requirements. Each capability is pursued in concert and coordination with existing Army and tri-service capabilities to eliminate duplication of products and services, while providing the proper mix of resources needed to support Army testing and training. These battlefield simulators represent systems (e.g. missile systems, command, control and communications systems, electronic warfare systems, etc.) that are used to portray a realistic threat environment during testing of U.S. weapon systems. Simulator development is responsive to Office of the Secretary of Defense and Government Accountability Office guidance for the Army to conduct operational testing in a realistic threat environment. Actual threat equipment is acquired when appropriate (in lieu of development) and total package fielding is still required (i.e., instrumentation, operations and maintenance, manuals, new equipment training, etc.).  Threat simulator development is accomplished under the auspices of the Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) and the Director, Operational Test and Evaluation, Threat Simulator Investment Working Group."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continues Engineering Manfacturing and Development (EMD) for the Network Exploitation Test Tool (NETT)."
                                    },
                                    "Description": {
                                        "val": "Continues EMD for the NETT as a comprehensive Computer Network Operations (CNO) tool."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.253"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the Network Exploitation Test Tool (NETT) as a comprehensive Computer Network Operations (CNO) tool, designed for Test & Evaluation (T&E), to portray evolving hostile and malicious Threat effects within the cyber domain.  The program provided an integrated suite of open-source\/open-method exploitation tools which were integrated with robust reporting and instrumentation capabilities.  NETT was used by Threat CNO teams to replicate the tactics of state and non-state Threat and was supported by a robust CNO development environment and has steadily incorporated leading Threat tools, tactics, techniques, and procedures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.332"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the Network Exploitation Test Tool (NETT).  Network Exploitation Test Tool is a comprehensive Computer Network Operations (CNO) tool, designed for T&E, to portray evolving hostile and malicious Threat effects within the cyber domain.  The program provides an integrated suite of open-source\/open-method exploitation tools which are integrated with robust reporting and instrumentation capabilities.  NETT is used by Threat CNO teams to replicate the tactics of state and non-state Threat and is supported by a robust CNO development environment.  Current hacking tools and capabilities are being introduced daily to the hacking community.  The NETT program researches these new capabilities and uses an in-depth process to clean, fix, and integrate required Threat tools, tactics, and techniques that are needed during T&E."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.461"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.461"
                                            },
                                            "Text": {
                                                "val": "NETT is a comprehensive Computer Network Operations (CNO) tool, designed for T&E, to portray evolving hostile and malicious Threat effects within the cyber domain.  The program will provide an integrated suite of open-source\/open-method exploitation tools which are integrated with robust reporting and instrumentation capabilities.  NETT will be  used by Threat CNO teams to replicate the tactics of state and non-state Threat and will be supported by a robust CNO development environment.  Current hacking tools and capabilities will be introduced daily to hacking community.  The NETT program researches these new capabilities and utilizes an in-depth process to clean, fix, and integrate required Threat tools, tactics, and techniques that are needed during T&E.  FY13 funding will support the continuation of exploit development, will continue support to the NETT Users Group, and will maintain pace with advanced exploit research and tool integration required to support the growing demand for the Threat CNO Team and mission."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Congressional Add - Threat Simulator Development Unfunded Joint Forces Command (JFCOM) Mission Transfer."
                                    },
                                    "Description": {
                                        "val": "Completes the engineering and manufacturing Development (EMD) for Joint Forces Command (JFCOM) Mission Transfer."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.166"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completes the Engineering and Manufacturing Development (EMD) required to facilitate the seamless Joint Forces Command (JFCOM) Mission Transfer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Program Management for the Threat Systems Management Office Operations (TSMO)."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for TSMO."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.660"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Government Program Management for the Threat Systems Management Office Operations funded the maintenance management, and sustainment capability for Threat systems within the Army's Threat inventory. Satisfied the requirement to provide operations and maintenance, spares, training, special tools, recurring Department of Defense Information Assurance and Certification Process (DIACAP), etc, for fielded Threat systems and infrastructure. Funding supported manpower, storage, and integration facilities associated with the sustainment and operational readiness of the Army's Threat force."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.904"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Government Program Management for the TSMO Operations funds the maintenance management, and sustainment capability for Threat systems within the Army's Threat inventory. Funding supports manpower, storage, and integration facilities associated with the sustainment and operational readiness of the Army's Threat force. Satisfies the requirement to provide operations and maintenance, spares, training, special tools, recurring DIACAP, etc, for fielded Threat systems and infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.704"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.704"
                                            },
                                            "Text": {
                                                "val": "Government Program Management for the TSMO Operations will fund the operation, maintenance, management, and sustainment capability for Threat systems used to portray a realistic threat environment during Army testing and training within the Army's Threat inventory.   Will include acquisition life cycle management support (operation, maintenance, spares, new equipment training, special tools and instrumentation, safety, environmental, security, information assurance, etc) of new threat systems fielded into the Army's Threat inventory.  Funding will support the scheduled entry and drawdown of equipment within the Threat inventory."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continues Engineering and Manufacturing Development (EMD) for the Threat Intelligence and Electronic Warfare Environment (TIEW ENV)."
                                    },
                                    "Description": {
                                        "val": "Continues EMD for the Threat Intelligence and Electronic Warfare Environment (TIEW ENV) to simulate Electronic Warfare capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.874"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the TIEW ENV that provided the constructive Threat representation environment for Army T&E and provided the primary capability to interact between live, virtual, and constructive Threat Information Operations (IO) environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the TIEW ENV.  TIEW ENV provides the constructive Threat representation environment for Army T&E and provides the primary capability to interact between live, virtual, and constructive Threat IO environments. The TIEW ENV integrates Threat IO (Electronic Attack, Electronic Support, CNO) models into the One Semi-Automated Force (OneSAF) baseline. The models' representative effects are also integrated through use with Communications Effects Servers. Integration of OneSAF with the Integrated Threat Force (ITF) enables the Live and Constructive T&E environments to interface."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.967"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the TIEW ENV.  The TIEW ENV will support the establishment of a wrap-around threat environment required to evaluate, demonstrate, and employ the EW capabilities of Enemy Forces in simulated real-world test\/training events.  The TIEW ENV will provide the capability to import vignettes, establish virtual entities, connect live assets, and interact between the live, virtual, and constructive environments. The TIEW ENV will fully integrate with the ITF to enable Opposing Forces (OPFOR) command of threat EW assets across Live, Virtual, and Constructive (LVC) domains. FY13 will satisfy Army requirements by funding development, platform integration and sustainment of this capability.  Program will field incremental capabilities in support of upcoming spin out events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continues the Engineering and Manufacturing Development (EMD) for the Integrated Threat Force (ITF), formerly named Threat Battle Command Center (TBCC) to support new threat systems\/equipment."
                                    },
                                    "Description": {
                                        "val": "Continues the EMD for the ITF to support new threat systems\/equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.858"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the EMD for the ITF that provided an integrated, scalable Threat command and control for all Army Threat representations as well as provided the Test & Evaluation (T&E) solution to satisfy the System of Systems (SoS) requirement of a Free Thinking Threat force."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the ITF which provides an integrated, scalable Threat command and control for all Army Threat representations to provide the T&E solution to satisfy the SoS requirement of a Free Thinking Threat force."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.510"
                                            },
                                            "Text": {
                                                "val": "Will continues EMD for the ITF which will provide an integrated, scalable Threat command and control for all Army Threat representations. This program will leverage prior Central Test & Evaluation Investment Program (CTEIP) investments to create a highly adaptable and unique threat force capability required to meet T&E requirements for the evaluation of network-centric platforms and SoS capabilities by closely simulating expected real-world threat environments.  FY13 funding will be used for the continued hardware\/software development\/build-out supporting the threat force architecture, visualization, Command and Control (C2), and fusion needs required to successfully meet scalability and reconfigurability needs for current T&E requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continues the Engineering and Manufacturing Development (EMD) for the Threat Signal Injection Jammer (TSIJ)."
                                    },
                                    "Description": {
                                        "val": "Continues the EMD for the TSIJ to provide the Army an alternative to open-air Electronic Attack (EA) in a test environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.128"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the EMD for the TSIJ to provide the Army an alternative to open-air Electronic Attack (EA) in a test environment by using direct input to a receiver unit and remote control on\/off employment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.411"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completes EMD for the TSIJ to provide the Army an alternative to open-air Electronic Attack (EA) in a test environment by using direct input to a receiver unit and remote control on\/off employment. Develop design for 2-channel man-pack Remote Jamming Unit (RJU) and 10 watt environmentally sealed Control Signal Transmitter (CST) for TSIJ."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Completed the Engineering and Manufacturing Development (EMD) for the Control of Signal Transmission-Open Air Capability (CST-OAC) and Signal Intelligence\/Direct Finding (SIGINT\/DF)."
                                    },
                                    "Description": {
                                        "val": "Completed the EMD for the CST-OAC and SIGINT\/DF sensors onto a larger aerial platform for Threat Devices capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.667"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed EMD for the CST-OAC and SIGINT\/DF sensors onto a larger aerial platform for Threat Devices capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Technical Test Instrumentation and Targets Project 62C Modeling and Simulation Instrumentation"
                                    },
                                    "Description": {
                                        "val": "Project 976 includes $7.600 million FY11 RDTE incorrectly placed in this funding line."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Project 976 includes $7.600 million FY11 RDTE incorrectly placed in this funding line.  It was intended for 0605602A - Army Technical Test Instrumentation and Targets Project 62C Modeling and Simulation Instrumentation in support of operational and developmental testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continues Government Program Management for the Threat Computer Network Operations Teams (TCNOT) to support threat events."
                                    },
                                    "Description": {
                                        "val": "Continues Government Program Management for the TCNOT to support threat events in order to maintain a team of highly qualified, trained, and certified Computer Network Operations (CNO) professionals qualified for the employment of Threat CNO in support of Army T&E."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.327"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued Government Program Management for the Threat Computer Network Operations Teams (TCNOT) to support threat events in order to maintain a team of highly qualified, trained, and certified CNO professionals qualified for the employment of Threat CNO in support of Army T&E.  The mission was for the Threat CNO Team to accurately replicate the hacker intent of state and non-state Threats through identification of system vulnerabilities that could be exploited by Threat forces, replicating loss of service, or exploiting network enabled systems to gain critical information or create a desired effect."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.378"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the Threat CNO Team program.  Threat CNO Team program establishes and maintains a team of highly trained and certified CNO professionals qualified for the employment of Threat CNO in support of Army T&E.  The Threat CNO Team mission is to accurately replicate the hacker intent of state and non-state Threats through identification of system vulnerabilities that could be exploited by Threat forces, replicating loss of service, or exploiting network enabled systems to gain critical information or create a desired effect."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.448"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.448"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the Threat CNO Team program.  The Threat CNO Team program will establish and maintain a team of highly trained and certified CNO professionals qualified for the employment of Threat CNO in support of Army T&E.  The Threat CNO Team mission is to accurately replicate the capabilities and hacker intent of state and non-state Threats through identification of Army system vulnerabilities that could be exploited by Threat forces, replicating loss of service, or exploiting network enabled systems to gain critical information or create a desired effect. The funding supports unique training, credentials, and authorizations involving organizations such as Army 1st IO Command, NSA, HQDA-G2, and industry.  The FY13 will fund requirements to include continued research of the intelligence-based TCNO TTPs and threat portrayal capabilities up to the Nation State level; development of the necessary, highly specialized TCNO Training program; development, research, and analysis of continually emerging foreign threat capabilities; and data collection capability.  The program will establish analytical services needed to identify and correlate data of historical and real time malicious activity within the Army Land Warrior Network (LWN) and external to the DOD.  This program will also establish services and near real-time processing of information needed to develop threat targeting packages that accurately profile the cyber enemy, types of systems they attack, frequency of attacks, their intent, doctrine, training, techniques, tools and operational tactics.  The program will result in creation of teams of Threat CNO professionals, working in concert with the Intelligence Community, capable of accurately portraying validated real world CNO threat to meet operational test requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "THREAT SIMULATOR Test Programs Supported:  Aircraft (MH-47E) Follow On Operational Test II, MH-60K Aircraft, Aircraft (MH-60K) Follow On Operational Test II, RAH-66 Comanche EUTE, RAH-66 Comanche FDTE I, Suite of Integrated Radio Countermeasures (SIRFCM), Suite of Integrated Radio Countermeasures (SIIRCM), Unmanned Aerial Vehicle (UAV) - Payload, Force XXI Battle Command Brigade and Below, Army Airborne Command and Control, Army TACMS Block II\/BAT, Bradley Fighting Vehicle-A3, Crusader FDTE, Extended Range MLRS, FAAD Block III, GPS in Joint Battle Space Environment, Guardrail\/Common Sensor System II, Handheld Standoff Mine Field Detection System, IEW Tactical Proficiency Trainer, Joint Close Air Support HT&E, Joint Suppression of Enemy Air Defense (JSEAD), Land Warrior, Long Range Advanced Scout Surveillance System, Navigational Warfare Global Positioning System, OH-58D Kiowa Warrior, Patriot Advanced Capabilities PAC-3 Config-3, UH-60Q, Theater High Altitude Area Defense System."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}