{
    "id": "a95d4fd1d6a6696c4b5097671a6015cb85cc3f68",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DARPA_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.zzz_unzipped_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602702E"
        },
        "ProgramElementTitle": {
            "val": "TACTICAL TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "205.871"
            },
            "CurrentYear": {
                "val": "202.422"
            },
            "BudgetYearOne": {
                "val": "233.209"
            },
            "BudgetYearOneBase": {
                "val": "233.209"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "236.851"
            },
            "BudgetYearThree": {
                "val": "248.447"
            },
            "BudgetYearFour": {
                "val": "263.251"
            },
            "BudgetYearFive": {
                "val": "262.912"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element is budgeted in the Applied Research Budget Activity because it supports the advancement of concepts and technologies to enhance the next generation of tactical systems.  The Tactical Technology program element funds a number of projects in the areas of Naval Warfare, Advanced Land Systems, Advanced Tactical Technology, Aeronautics Technology and Network Centric Enabling technologies.\n\nThe Naval Warfare Technology project develops advanced enabling technologies for a broad range of naval requirements.  Technologies under development will increase survivability and operational effectiveness of small and medium surface vessels in rough seas and demonstrate advanced technologies for hypersonic flight.  New areas to be investigated include ship self defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations and unmanned sea vehicles for anti-submarine warfare.\n\nThe Advanced Land Systems project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  Advanced manufacturing demonstration activities are also funded.\n\nThe Advanced Tactical Technology project is exploring the application of compact and solid state lasers; high performance computational algorithms to enhance signal processing, target recognition and tracking, electromagnetic propagation, and processing of advanced materials and microelectronics; precision optics components for critical DoD applications; aerospace electronic warfare systems; new tactical systems for enhanced air vehicle survivability, advanced airbreathing weapons, and enabling technologies for advanced space systems; and Training Superiority programs that will create revolutionary new training techniques.\n\nThe Aeronautics Technology project explores technologies to reduce costs associated with advanced aeronautical systems and provide revolutionary new capabilities for current and projected military mission requirements. This project funds development of a hybrid ground\/air vehicle, an advanced helicopter rotor capable of being optimized for each mission, and robust study efforts.\n\nThe Network Centric Enabling Technology project funds sensor, signal processing, detection, tracking and target identification technology development required for true network-centric tactical operations.  Technologies developed in this project will enable localized, distributed and cross-platform collaborative processing so that networks of sensors can rapidly adapt to changing force mixes, predictive modeling tools to evaluate failing nation states and identify potential hot spots, and social networking approaches to identify and track potential terrorist cells."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "224.378"
                },
                "CurrentYear": {
                    "val": "206.422"
                },
                "BudgetYearOne": {
                    "val": "217.032"
                },
                "BudgetYearOneBase": {
                    "val": "217.032"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "205.871"
                },
                "CurrentYear": {
                    "val": "202.422"
                },
                "BudgetYearOne": {
                    "val": "233.209"
                },
                "BudgetYearOneBase": {
                    "val": "233.209"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-18.507"
                },
                "CurrentYear": {
                    "val": "-4.000"
                },
                "BudgetYearOne": {
                    "val": "16.177"
                },
                "BudgetYearOneBase": {
                    "val": "16.177"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-2.978"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-4.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-19.312"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "9.510"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.727"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "16.177"
                                },
                                "BudgetYearOneBase": {
                                    "val": "16.177"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011: Decrease reflects internal below threshold reprogrammings, reductions for Section 8117 Economic Adjustment, rescissions, Sec 8024(f) FFRDCs, and the SBIR\/STTR transfer. \nFY2012:  Decrease reflects reduction to new starts.\nFY 2013: Increase reflects transfer of the Visual Media Reasoning program from PE 0602305E to Project TT-13."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "TT-03"
                    },
                    "ProjectTitle": {
                        "val": "NAVAL WARFARE TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.062"
                        },
                        "CurrentYear": {
                            "val": "37.740"
                        },
                        "BudgetYearOne": {
                            "val": "59.473"
                        },
                        "BudgetYearOneBase": {
                            "val": "59.473"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "62.842"
                        },
                        "BudgetYearThree": {
                            "val": "63.392"
                        },
                        "BudgetYearFour": {
                            "val": "57.392"
                        },
                        "BudgetYearFive": {
                            "val": "44.839"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities such as drag reduction, ship stability, hypersonic missiles, logistically friendly distributed lighting systems, ship self-defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, and high bandwidth communications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-Submarine Warfare (ASW) Continuous Trail Unmanned Vessel (ACTUV)"
                                    },
                                    "Description": {
                                        "val": "The Anti-Submarine Warfare (ASW) Continuous Trail Unmanned Vessel (ACTUV) program has three primary goals: (1) to build and demonstrate an experimental unmanned vessel with beyond state-of-the-art platform performance based on clean sheet design for unmanned operation, (2) demonstrate the technical viability of operating autonomous unmanned ships at theater or global ranges under a sparse remote supervisory control model, and (3) leverage unique ACTUV characteristics to transition a game changing ASW capability to the Navy.  By establishing the premise that a human is never intended to step on board at any point in the operational cycle, ACTUV concepts can take advantage of an unexplored design space that eliminates or modifies conventional ship design constraints such as internal arrangement, reserve buoyancy, and dynamic stability in order to achieve disproportionate speed, endurance, and payload fraction.  The resulting unmanned naval vessels must possess sufficient situational awareness and autonomous behavior capability to operate in full compliance with the rules of the road and maritime law to support safe navigation for operational deployments spanning thousands of miles and months of time.  When coupled with innovative sensor technologies, the ACTUV system provides a low cost unmanned system with a fundamentally different operational risk calculus that enables game changing capability to detect and track even the quietest diesel electric submarine threats.  Key technical areas include unmanned naval vessel design methodologies, ship system reliability, high fidelity sensor fusion to provide an accurate world model for autonomous operation, novel application of sensors for ASW tracking, and holistic system integration due to unique optimization opportunities of the ACTUV system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.941"
                                            },
                                            "Text": {
                                                "val": "-  Completed multiple comprehensive integrated system concept design activities for ACTUV including supporting technology surveys, concept of operations development, preliminary operational performance assessments, and fabrication planning.\n-  Completed sensor and autonomy risk reduction and proof of principle testing for ACTUV.\n-  Developed ACTUV system concept of operations and conducted preliminary operational performance assessments.\n-  Integrated preliminary system performance specifications from competing system concepts into ACTUV best-of-breed system performance specification for the demonstration activity.\n-  Completed initial Tactical Expandable Maritime Platform (TEMP) Humanitarian Assistance and Disaster Relief (HA\/DR) Concept of Operations.\n-  Refined TEMP HA\/DR conceptual designs.\n-  Completed TEMP Modular Sea Depot dry land docking testing.\n-  Completed TEMP Modular Sea Depot in-water propulsion testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.740"
                                            },
                                            "Text": {
                                                "val": "-  Initiate ACTUV integrated prototype detailed design, fabrication, and demonstration activity.\n-  Conduct incremental demonstrations of ACTUV critical enabling technologies.\n-  Commence development of ACTUV surrogate hardware-in-the-loop system.\n-  Complete ACTUV concept of operations and preliminary operational performance assessments including situational awareness sensor performance, sonar sensor performance, and autonomous control architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.798"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.798"
                                            },
                                            "Text": {
                                                "val": "-  Complete ACTUV detailed design and conduct critical design review.\n-  Perform demonstrations of ACTUV critical enabling technologies.\n-  Conduct integrated system demonstration on ACTUV surrogate hardware-in-the-loop system.\n-  Complete high fidelity ACTUV operational performance assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactically Expandable Maritime Platform (TEMP)"
                                    },
                                    "Description": {
                                        "val": "The Tactically Expandable Maritime Platform (TEMP) concept, an outgrowth of the ACTUV program, seeks to develop and demonstrate macroscopic integrated systems built up from International Organization for Standardization (ISO) modular technologies that can be operated from unmodified commercial container ships and deliver credible naval capability for high priority missions.  TEMP will develop critical enabling modular technologies and evaluate the feasible range of naval missions that can be serviced from this highly flexible and cost effective unconventional force structure model.  An initial mission to be explored will be the modular sea depot concept to enable a remote unmonitored refueling capability for small craft; enabling independent operation from host ships.  TEMP will also evaluate a Humanitarian Assistance and Disaster Relief (HA\/DR) mission, engineering a modular first responder capability that allows the rapid force closure capability of TEMP to deliver immediate lifesaving operations in the hours and days following a disaster event, prior to the time that conventional platforms and organizations are able to respond."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete TEMP HA\/DR critical technology risk reduction demonstrations.\n-  Complete TEMP HA\/DR preliminary design activity and conduct a preliminary design review.\n-  Complete TEMP Modular Sea Depot autonomy, water docking, and fuel\/ballast testing.\n-  Conduct TEMP Modular Sea Depot prototype operational demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate TEMP HA\/DR detail design, prototype development, and operational demonstration activity.\n-  Commence TEMP HA\/DR incremental risk reduction testing of critical enabling technologies, including modularized crane system, modularized air delivery vehicle, and modularized sea delivery vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sea Change"
                                    },
                                    "Description": {
                                        "val": "Sea Change is a portfolio of disruptive approaches to critical operational challenges in the maritime domain.  The goal of the Sea Change program is to develop integrated system technologies that offer fundamentally new capabilities to address long-standing operational limitations of naval forces.  Sea Change focus areas include platform concepts to increase operational capability and efficiency of maritime systems and development of standoff technologies for rapid defeat of anti-access mines through a hydroacoustic anti-mine array.  The hydroacoustic anti-mine array effort will explore the technical feasibility of a novel mine clearance approach using coordinated high energy density acoustic sources to deliver standoff clearance of mines throughout the water column and on the ocean bottom.  By eliminating all explosive neutralizers and maintaining effectiveness with uncertain mine identification and location, the hydroacoustic anti-mine array concept has the potential to achieve dramatic reductions in area mine clearance timelines."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete concept studies and operational assessments of novel maritime propulsion approaches.\n-  Complete proof of principle testing for hydroacoustic anti-mine array source technology.\n-  Conduct design activity for novel propulsion system proof of principle demonstration.\n-  Initiate hydroacoustic anti-mine array preliminary design activity and conduct developmental risk reduction testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete design activity for operational prototype of novel maritime propulsion approaches and hold critical design review.\n-  Initiate fabrication and integration activity for novel maritime propulsion system operational demonstration.\n-  Commence operational prototype design for hydroacoustic anti-mine array system technology and hold critical design review."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Arctic Operations"
                                    },
                                    "Description": {
                                        "val": "The Arctic Operations initiative is focused on developing technology to assure U.S. capability to achieve access and situational awareness in Arctic environments.  Due to retreating Arctic ice in the coming decades there is an expectation for increased shipping traffic during the summer months, and increased interest in exploiting natural resources along the Arctic continental shelf.  Given the unique physical challenges and stressful environmental conditions, Arctic operations today are mainly limited to expeditions requiring specialized platforms, support infrastructure, and preparation.  This program will exploit unique physical attributes and emergent environmental trends in the Arctic to create surprising new capabilities, and will develop technologies for persistent and affordable sensing and communication both above and below the ice to ensure responsive operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.675"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.675"
                                            },
                                            "Text": {
                                                "val": "-  Conduct system studies for environmentally adaptive communications, navigation and mobility.\n-  Conduct system studies for novel under-ice and near-ice sensing, surveillance, and measurement.\n-  Develop canonical datasets including environmental data collections to support future design studies and technology efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Super-Fast Submerged Transport (Underwater Express)"
                                    },
                                    "Description": {
                                        "val": "The Super-Fast Submerged Transport (Underwater Express) program explored the application of supercavitation technology to underwater vehicles, enabling high speed transport of personnel and\/or supplies.  The inherent advantages of traveling underwater are: the ability to transit undetected, no radar or visible signature, and avoidance of rough sea conditions that may limit or deny mission execution.  Supercavitation places the vehicle inside a cavity where vapor replaces the water, and drag due to fluid viscosity is reduced by orders of magnitude, thus reducing the power requirement dramatically.  This program used modeling, simulation, experiments and testing to develop the understanding of the physical phenomena associated with supercavitation and the application to underwater vehicles.  The program culminated in an at-sea demonstration of a scaled vehicle."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.241"
                                            },
                                            "Text": {
                                                "val": "-  Completed at-sea testing of a scaled vehicle.\n-  Analyzed vehicle performance for speed, power and stability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Submersible Aircraft"
                                    },
                                    "Description": {
                                        "val": "This program combined the speed and range of an airborne platform with the stealth of an underwater vehicle by developing a vessel that can both fly and submerge.  The program exploited lightweight materials, unique dynamic structures and advanced propulsion systems to overcome the technical barriers to achieving this capability.  The program goals were to enable insertion and extraction of special operations and expeditionary forces at greater ranges, and higher speeds in locations not previously accessible with minimal direct support from additional military assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed developmental activities including modeling and experiments, demonstrating technologies, and approaches that can overcome the identified performance objectives.\n-  Completed objective system design based on the results of developmental activities, providing an accurate projection of the systems operational envelope."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-traditional Active Sonar"
                                    },
                                    "Description": {
                                        "val": "The Non-traditional Active Sonar program developed alternative solutions for anti-submarine warfare active sonar.  Given the trend of submarine quieting, passive sonar is of diminishing value to the Navy.  The existing alternatives are high-power active sonar systems that are overt and difficult to use in peace time, especially in far forward or congested littoral areas.  The program investigated new approaches which exploit special acoustic phenomena and techniques, through advanced active sonar signal processing to achieve advanced active sonar.  Emphasis is on data-driven algorithm development applicable across existing Navy hydrophone sensor arrays."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.880"
                                            },
                                            "Text": {
                                                "val": "-  Iterated on algorithm designs to assess detection capability (for example range) and extrapolate performance to other environments and concepts of operations.\n-  Conducted at-sea data collection with real targets, and identified existing data to support assessment of processing algorithm performance under realistic conditions.\n-  Demonstrated processing feasibility for relevant system designs.\n-  Documented results for use by the Navy for investigations and further research into Antisubmarine Warfare applications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-04"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED LAND SYSTEMS TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.529"
                        },
                        "CurrentYear": {
                            "val": "34.857"
                        },
                        "BudgetYearOne": {
                            "val": "40.977"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.977"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "36.551"
                        },
                        "BudgetYearThree": {
                            "val": "35.609"
                        },
                        "BudgetYearFour": {
                            "val": "35.609"
                        },
                        "BudgetYearFive": {
                            "val": "35.185"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  This project will also explore novel design technologies for the manufacture of ground vehicles and new tools for systems assessments of emerging DARPA technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fast, Adaptable, Next Generation Ground Combat Vehicle (FANG)"
                                    },
                                    "Description": {
                                        "val": "The goals of the Fast, Adaptable, Next-Generation Ground Combat Vehicle (FANG) program are to employ a novel, model-based correct-by-construction design capability, a highly-adaptable foundry-style manufacturing capability, and crowd-sourcing design methods to demonstrate 5X-10X compression in the timeline necessary to build an infantry fighting vehicle.  The program seeks to create an open-source development infrastructure for the aggregation of designer inputs applicable to complex electromechanical systems as well as software, and to exercise this infrastructure with a series of design challenges, leading to prize awards and builds of winning designs in a foundry-style, rapidly configurable manufacturing facility.  The design challenges will culminate in a complete build of a next generation infantry fighting vehicle to a requirements set loosely analogous to an existing program of record -but executed on a roughly one-year timescale.  Additionally, the program will pursue an explicit outreach activity to high school-age students to teach the principles of model-based design and distributed foundry-style manufacturing to build a next-generation cadre of manufacturing innovators.  Initial ground vehicle design work is funded under the META program in PE 0602303E, Project IT-02."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.961"
                                            },
                                            "Text": {
                                                "val": "-  Complete the development and begin operational testing of the crowd-sourced vehicle design environment.\n-  Perform experimental subsystem designs and subsequent design builds using the vehicle design environment as well as the iFAB foundry.\n-  Promulgate component model libraries, foundry capabilities, and objective design criteria for a mobility and drivetrain challenge.\n-  Initiate a high school outreach effort for the procurement, deployment, and utilization of a distributed additive manufacturing capability with a focus on developing the necessary software, hardware and organizational infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.977"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.977"
                                            },
                                            "Text": {
                                                "val": "-  Maintain and develop incremental upgrades to the crowd-sourced vehicle design environment.\n-  Conduct a competitive, crowd-sourced design challenge for the mobility and drivetrain subsystem of an infantry fighting vehicle.\n-  Promulgate component model libraries, foundry capabilities, and objective design criteria for a chassis and integrated survivability challenge.\n-  Conduct a competitive, crowd-sourced design challenge for the chassis and survivability subsystem of an infantry fighting vehicle.\n-  Continue the high school outreach effort by testing the developed infrastructure and running a design\/build challenge involving teams from at least 10 high schools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Avatar"
                                    },
                                    "Description": {
                                        "val": "Key advancements in telepresence and remote operation of ground systems are being made towards the ultimate goal of developing remotely operated robotic systems that can operate in dismounted environments.  In order to demonstrate the utility of bi-pedal machines on real missions and accelerate their development, the synergistic partnership between machine and operator must be leveraged.  The Avatar program will develop interfaces and algorithms to enable a soldier to effectively partner with a semi-autonomous bi-pedal machine and allow it to act as the soldier's surrogate.  Once developed, Avatar will allow soldiers to remain out of harm's way while still leveraging their experience and strengths to complete important missions such as sentry\/perimeter control, room clearing, combat casualty recovery, and, eventually, dismounted combat maneuver.  Anticipated service users include the Army, Marines and Special Forces."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate power, locomotion, perception and control of surrogate bipedal machine platforms.\n-  Begin initial development of algorithms to allow the function of a bidirectional master controller between a human user and a remote bipedal machine.\n-  Initiate investigations into tethered and untethered power options to allow operation over relevant mission envelopes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C-Sniper"
                                    },
                                    "Description": {
                                        "val": "Based on promising results obtained under the Crosshairs program, the C-Sniper effort will develop the capability to detect and neutralize enemy snipers before they can engage U.S. Forces.  The program will deliver a field testable prototype suitable for experimentation on a compatible vehicle such as the Stryker.  The C-Sniper system will identify threats before they can fire.  Enemy snipers may be operating both with and without telescopic sights and other optical systems in highly cluttered urban environments.  The C-Sniper system will operate day and night from a static or mobile military vehicle and will provide the operator with sufficient information to make a timely engagement decision.  Once a decision is made, the C-Sniper will provide data and control to point and track the on-board weapon to the selected target.  The final decision to fire the weapon will be left to the operator."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.254"
                                            },
                                            "Text": {
                                                "val": "-  Developed, delivered and demonstrated the operation of C-Sniper on moving vehicles.\n-  Integrated C-Sniper on a test vehicle and demonstrated full system capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.896"
                                            },
                                            "Text": {
                                                "val": "-  Complete demonstration of fully integrated system capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Magneto Hydrodynamic Explosive Munition (MAHEM)"
                                    },
                                    "Description": {
                                        "val": "The Magneto Hydrodynamic Explosive Munition (MAHEM) program demonstrated compressed magnetic flux generator (CMFG)-driven magneto hydrodynamically formed metal jets and self-forging penetrators (SFP) with significantly improved performance over explosively formed jets (EFJ) and fragments.  MAHEM offers the potential for higher efficiency, greater control, the ability to generate and accurately time multiple jets and fragments from a single charge, and the potential for aimable, multiple warheads (multimodal warhead) with a much higher EFJ velocity, hence increased lethality precision, than conventional EFJ\/SFP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.210"
                                            },
                                            "Text": {
                                                "val": "-  Designed, fabricated and tested a first-of-its-kind ring initiator to be used for the multimodal warhead configuration.\n-  Completed fabrication of Flux Compression Generator (FCG) components, shaped charge liners, and Magneto-formed penetrators (MFPs).\n-  Performed testing of FCG components.\n-  Tested shaped charge liners and MFPs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Crosshairs"
                                    },
                                    "Description": {
                                        "val": "The Crosshairs program developed a vehicle mounted threat detection and countermeasure system that detected, located, and engages enemy shooters against a variety of threats to include bullets, Rocket Propelled Grenades (RPGs), Anti-Tank Guided Missiles, and direct fired mortars, both stationary and on the move.  Threat identification and localization is accomplished in sufficient time to enable both automatic and man-in-the-loop responses.  Phase I of the program focused on initial development and testing of the Crosshairs sensor system.  Phase IA culminated with a static live fire test to determine the most effective candidate sensor system.  During Phase IB, enhancements were made to the sensor system for on the move performance, and on the move testing against multiple threats was conducted.  DARPA and the U.S. Army Rapid Equipping Force (REF) entered into an MOA for Phase IIA.  Phase IIA consisted of a moving demonstration of the hardened, packaged, and enhanced Phase I sensor system on two networked HMMWVs, integration with candidate response systems, and testing and evaluation of the complete systems in relevant environments.  In Phase IIB, the Crosshairs sensor system was integrated with the Iron Curtain Active Protection System (IC-APS) on four up-armored vehicles.\n\nDARPA worked with the Army REF and the Project Manager Mine Resistant Ambush Protected Vehicles to validate the capabilities and initiate transition to combat forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.900"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated integrated system capability, including active protection, in live fire tests.\n-  Transitioned Crosshairs technology to the military."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rocket Propelled Grenade (RPG) Nets"
                                    },
                                    "Description": {
                                        "val": "The Rocket Propelled Grenade (RPG) Nets program developed a near-term counter RPG net system with performance at least equivalent to bar or slat armor, but that is lighter and easier to deploy; and a mid-term net-based system with active elements that has greatly improved performance.  Development of these systems was supported by modeling to enhance understanding of the net interactions and with extensive live fire testing against RPGs.  Successful candidates have been installed on vehicles for evaluation in an operational context.  DARPA is working with the Marine Program Manager for Motor Transport to develop, test and transition this capability to combat forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "-  Completed evaluation of near-term net system and completed transition to military service."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Helicopter ALert and Threat Termination (HALTT)"
                                    },
                                    "Description": {
                                        "val": "The Helicopter ALert and Threat Termination (HALTT) program provided Army and Navy\/Marine helicopters with a way to detect small arms and provide shooter location to improve their ability to respond.  System effectiveness with emphasis on low false alarm rates is critical.  The program goal was to successfully demonstrate protection of helicopters by automatic threat detection of small arms with an \"o'clock\" accuracy in azimuth as well as elevation and range to shooter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.265"
                                            },
                                            "Text": {
                                                "val": "-  Integrated and demonstrated acoustic system on multiple platforms.\n-  Demonstrated a fully integrated HALTT system in-theater."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lightweight Ceramic Armor (LCA)"
                                    },
                                    "Description": {
                                        "val": "The Lightweight Ceramic Armor (LCA) program leveraged recent breakthroughs in novel ceramic fabrication processes developed in the Materials Processing Technology project to drive a dramatic performance shift in the trade-off between weight and ballistic projectile protection of body armor.  Currently fielded body armor is heavy and its weight and bulk limit a soldier's agility and mobility.  Utilizing recent breakthroughs in unconventional ceramics processing technology, the LCA program has demonstrated greater than ten percent reduction in weight for equal ballistic protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Scaled the unconventional ceramic consolidation process to consistently produce curved ceramic plates up to specified size.\n-  Developed the procedure (including preparation, consolidation, and cooling) to manufacture side ballistic inserts consistent with U.S. Army specifications.\n-  Evaluated the ballistic performance of the scaled, uniquely layered armor system against multiple armor piercing threats.\n-  Validated the capability to produce a full-size side ballistic armor insert at greater than ten percent reduction in weight as compared to current state-of-the-art solutions.\n-  Demonstrated the capability to produce at least 10,000 ceramic plates per year."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-06"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED TACTICAL TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "68.304"
                        },
                        "CurrentYear": {
                            "val": "58.539"
                        },
                        "BudgetYearOne": {
                            "val": "25.797"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.797"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "26.545"
                        },
                        "BudgetYearThree": {
                            "val": "29.716"
                        },
                        "BudgetYearFour": {
                            "val": "50.616"
                        },
                        "BudgetYearFive": {
                            "val": "70.443"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project focuses on three broad technology areas: a) compact, efficient, frequency-agile, diode-pumped, solid-state lasers for infrared countermeasures, laser radar, holographic laser sensors, communications, and high-power laser applications; b) high performance computational algorithms for signal processing, target recognition and tracking, electromagnetic propagation, and processing of advanced materials and microelectronics; c) new approaches for training and mission rehearsal in the tactical\/urban environment.  Additionally, this project will develop new tactical systems for enhanced air vehicle survivability, precision optics, electronic warfare, and advanced air breathing weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Excalibur"
                                    },
                                    "Description": {
                                        "val": "The Excalibur program will develop high-power electronically-steerable optical arrays, with each array element powered by a fiber laser amplifier.  These fiber-laser arrays will be sufficiently lightweight, compact, and electrically efficient to be fielded on a variety of platforms with minimal impact to the platform's original mission capabilities.  Each array element will possess an adaptive-optic capability to minimize beam divergence in the presence of atmospheric turbulence, together with wide-field-of-view beam steering for target tracking.  With each Excalibur array element powered by high power fiber laser amplifiers (at up to 3 kilowatts (kW) per amplifier), high power air-to-air and air-to-ground engagements will be enabled that were previously infeasible because of laser system size and weight.  In addition, this program will also develop kilowatt-class arrays of diode lasers which will provide an alternate route to efficiently reaching mission-relevant power levels, and they will test the ultimate scalability of the optical phased array architecture.  Excalibur arrays will be conformal to aircraft surfaces and scalable in size and power by adding elements to the array.  By defending airborne platforms such as unmanned aerial vehicles against proliferated, deployed, and next-generation man-portable air-defense systems (MANPADS), Excalibur will enable these reconnaissance platforms to fly at lower altitude and obtain truly persistent, all-weather ground reconnaissance despite low-lying cloud cover.  Proliferated and emerging threats will be evaluated for the potential of developing a near-term capability utilizing a single high-power fiber laser amplifier.  Further capabilities include multichannel laser communications, target identification, tracking, designation, precision defeat with minimal collateral effects as well as other applications.\n\nThe Excalibur Budget Activity 2 program will develop the core set of laser components for efficiently driving elements of high-power electronically steerable optical arrays, namely, high-power coherently- and spectrally-combinable fiber laser amplifiers, high-brightness laser diodes for efficiently pumping the fiber laser amplifiers, and kW-class single-mode laser diode arrays.  In addition, advanced techniques (packaging, thermal and power management, beam control, target tracking, etc.) will be developed for light-weight (300-500 lb), high power (3 kW - 10 kW) fiber-laser based and podded High Energy Laser Countermeasure (HELCM) systems enabling near-term options for low-altitude self-defense against MANPADS.  The vulnerabilities of MANPADS and their potential to incorporate counter-countermeasures to HELCM systems will also be measured and assessed.  These techniques and measurements will be designed to work in tandem with and to support the HELCM prototype subsystems developed under the Budget Activity 3 Excalibur program in PE 0603739E, Project MT-15.\n\nThe Excalibur Budget Activity 2 program will also conduct several analytical studies relevant to scaling and applications of high-efficiency (30% - 40% wall plug efficient) high power electric lasers, that will examine: the potential to scale the output power of diode pumped alkali lasers (DPALs) to tactical and strategic levels (100's kW - MW class); the potential for integrating low-cost, high-sensitivity, wide-field-of-view imaging seekers and directional acoustic cueing into extended-altitude MANPADS; and the potential to use high power fiber lasers for long range target identification and tracking."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.455"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated a 1.6kW coherently combinable fiber laser amplifiers with an electrical efficiency exceeding 30% and near-perfect beam divergence (approximately 1.2x diffraction-limited) while developing methods to increase the combinable power to 3 kW.\n-  Demonstrated a single laser diode bar (1 cm x 3.5 mm) with an output power of 250 W and a lifetime of greater than 100 hours on a compact low thermal-resistance (<60mK\/W) heat sink.\n-  Demonstrated a single-pass laser diode amplifier at an output greater than 1 W with linear output behavior (no perturbation instability) and no catastrophic optical damage to the facets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate 3 kW coherently combinable fiber laser amplifiers at electrical efficiencies exceeding 30% and with near-perfect beam divergence (better than 1.4x diffraction-limited).\n-  Coherently combine five compact 100 W single-mode laser diode modules to produce a single 500 W output beam with >40% efficiency.\n-  Demonstrate a single wavelength-stabilized laser diode bar coupled to an optical fiber (100 µm core, 0.22NA) with 300 W exiting from the fiber with a lifetime of 200 hours.\n-  Initiate the development of advanced packaging, power storage and management, thermal management and integration techniques needed for the fabrication and testing of a 5 kg\/kW high power laser subsystem and a light-weighted beam control system.\n-  Initiate the development of advanced active target detection, confirmation and tracking techniques to support proactive threat warning and increased precision (<10 micro-radian) fine-tracking needed for HELCM systems relative to those (~milli-radians) of current DIRCM systems.\n-  Establish requirements and initiate design of prototype HELCM open architecture subsystems (laser, beam-control, command, threat warning\/lase-quality declaration, lightweight pod).\n-  Identify the requirements and develop the conceptual design for a proactive threat warning capability for HELCM systems.\n-  Prepare plans and logistics for lethality testing to assess vulnerability levels and potential HEL counter-countermeasures (CCMs) of emerging MANPADS seeker technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.797"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.797"
                                            },
                                            "Text": {
                                                "val": "-  Complete the development of advanced packaging, power storage and management, thermal management and integration.  Techniques needed for the fabrication and testing of a 5 kg\/kW high power laser subsystem and a light-weight beam control system.\n-  Continue the development of advanced active target detection, confirmation and tracking techniques to support proactive threat warning and increased precision (<10 micro-radian) fine-tracking needed for HELCM systems relative to those (~milli-radians) of current DIRCM systems.\n-  Complete the design of prototype HELCM open architecture subsystems (laser, beam-control, command, threat warning\/laser-quality declaration, lightweight pod).\n-  Design for a proactive threat warning capability for HELCM systems.\n-  Conduct lethality testing to establish vulnerability levels and assess the potential for incorporating HEL CCMs into emerging MANPADS seeker technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Liquid Laser Area Defense System (HELLADS)"
                                    },
                                    "Description": {
                                        "val": "The goal of the High Energy Liquid Laser Area Defense System (HELLADS) program is to develop a high-energy laser weapon system (150 kW) with an order of magnitude reduction in weight compared to existing laser systems.  With a weight goal of <5 kg\/kW, HELLADS will enable high energy lasers (HELs) to be integrated onto tactical aircraft, and will significantly increase engagement ranges compared to ground-based systems, enabling high precision, low collateral damage, and rapid engagement of fleeting targets for both offensive and defensive missions.  The HELLADS program has completed the design and demonstration of a revolutionary prototype unit cell laser module.  That unit cell demonstrated power output and is demonstrating optical wavefront performance that supports the goal of a lightweight and compact 150 kW high energy tactical laser weapon system.  Two unit cell module designs with integrated power and thermal management systems were fabricated and tested; they demonstrated an output power exceeding 34 kW.  Based on the results of the unit cell demonstration, additional laser modules will be replicated and connected to produce a 150 kW laser that will be demonstrated in a laboratory environment.  The 150 kW laser will then be integrated with beam control, prime power, thermal management, safety, and command and control subsystems all based upon existing technologies to produce a ground-based laser weapon system field demonstrator.  The capability to shoot down tactical targets such as surface-to-air missiles and rockets and the capability to perform ultra-precise offensive engagements will be demonstrated in a realistic ground test environment.  Additional funding for this integration effort will be provided for HELLADS testing in Project NET-01, PE 0603766E.  The HELLADS laser will then be transitioned to a tactical platform for performance demonstration of ground, sea, or airborne precision engagements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.894"
                                            },
                                            "Text": {
                                                "val": "-  Completed unit cell performance optimization to obtain beam quality to support full system performance.\n-  Developed advanced diagnostic tools to assess high energy laser beam quality.\n-  Prescribed and built the active optical component to provide remaining correction of static and dynamic optical disturbances in the high energy laser.\n-  Continued subsystem testing of the ground-based demonstrator laser weapon system.\n-  Completed the detailed design of the 150 kW laser.\n-  Initiated the fabrication and laboratory testing of the 150kW laser."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.197"
                                            },
                                            "Text": {
                                                "val": "-  Complete the fabrication of the 150 kW laser. \n-  Complete planning and preparations to integrate the 150 kW laser with the ground-based demonstrator laser weapon system. \n-  Complete subsystem testing of the ground-based demonstrator laser weapon system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aero-Adaptive\/Aero-Optic Beam Control (ABC)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Aero-Adaptive\/Aero-Optic Beam Control (ABC) program is to improve the performance of high-energy lasers on tactical aircraft, against targets in the aft field-of-regard.  In order to achieve a large field-of-regard, current optical turret designs protrude into the flow.  This causes severe optical distortions in the aft field-of-regard due to turbulence in the wake and the unsteady shock movement over the aperture.  These distortions decrease the power flux on target (the measure of lethality for a directed energy system) and consequently limit the utility of directed energy systems to targets in the forward field-of-regard.  This program will optimize flow control strategies for pointing angles in the aft field-of-regard.  The program will also explore the ability to synchronize the flow control system with adaptive optics.  This effort will initially focus on wind tunnel testing to prove the feasibility of steady and periodic flow control techniques to reduce or regularize the large scale turbulent structures surrounding an optical turret.  These tests will culminate in a hardware-in-the-loop demonstration utilizing flow control with an adaptive optics system in a full-scale wind tunnel test for the turret.  Following successful wind tunnel demonstrations, a preliminary design of a flight test turret incorporating flow control will be undertaken.  Completion of detailed design and fabrication will be carried on under the HELLADS program budgeted in PE 0603766E, Project NET-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "-  Performed initial testing of full-scale flow control in open-loop wind tunnel testing of ABC turret.\n-  Demonstrated and validated ABC concept with closed-loop adaptive optic system and flow control in a full-scale wind tunnel test.\n-  Initiated preliminary design of a flight test turret incorporating flow control and optical compensation of residual distortions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.227"
                                            },
                                            "Text": {
                                                "val": "-  Complete preliminary design for mechanical surrogate turret and the flight test turret.\n-  Identify new mission capabilities enabled by aero-effects control technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Polarizing Keyless Cryptography (POLKA)"
                                    },
                                    "Description": {
                                        "val": "Cryptographic security of the Department of Defense's point-to-point data links is fundamentally important and faces an emerging threat as encryption devices are rapidly out-paced by the increasing data rates of links.  Building upon concepts developed under the Integrated Sensing and Processing program, the Polarizing Keyless Cryptography (POLKA) program will demonstrate a compelling all-optical encryption system that has the potential to meet the Department's needs.  Traditional encryption techniques rely on mathematical algorithms implemented on electronic devices; POLKA will develop a physics-based, all-optical technique for encryption.  Along with its transition partner, DARPA will analyze the theoretical and practical vulnerabilities of the POLKA system and demonstrate experimental verification of its efficacy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.115"
                                            },
                                            "Text": {
                                                "val": "-  Integrate optical encryption with Information Theoretic Security Code for secure high speed data transfer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Sensing and Processing"
                                    },
                                    "Description": {
                                        "val": "The Integrated Sensing and Processing program explored a new paradigm for application of mathematics to the design and operation of sensor\/exploitation systems and networks of such systems by developing and applying novel optimization methodologies for integrating sensing, processing, encryption and information exploitation functionality in sensor systems.  This program created tools that enabled the design and global optimization of advanced sensor system architectures comprising fully interdependent networks of functional elements, each of which can fill the roles and functions of several distinct subsystems in current generation sensor systems.  Payoffs included improved performance with reduced complexity of hardware and software in a wide variety of systems, including agile adaptive arrays for missile seekers, unmanned air vehicles, and space-borne sensors; novel waveforms, and novel approaches to multiplexed hyper-spectral chemical\/biochemical sensing systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.370"
                                            },
                                            "Text": {
                                                "val": "-  Developed stochastic topological theory of non-parametric statistics.\n-  Developed clock-free strongly open-loop controls and information state estimation for minimal-sensing in localization and navigation problems.\n-  Developed sensors and algorithms for multi-body inspection, rendezvous and formation flight in zero gravity environments.\n-  Developed novel optical encryption design and initiated component development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Performance Algorithm Development"
                                    },
                                    "Description": {
                                        "val": "The High Performance Algorithm Development programs identified, developed and demonstrated new mathematical paradigms to enable maximum performance at minimum cost in a variety of DoD systems applications.  The programs looked for opportunities to aggressively leverage the power of mathematical representations in order to effectively exploit large-scale computational resources as they apply to specific problems of interest.  They also cultivated theoretical breakthroughs in areas of basic mathematics having relevance to emerging defense sciences and technologies.  The products are typically advanced algorithms and design methodologies.  Well-conditioned fast algorithms and strategies for the exploitation of high-dimensional data (i.e., data with a high number of degrees of freedom) in order to deal with a variety of complex military problems were developed, including digital representation and analysis of terrain and other geospatial data, efficient high fidelity scattering computations of radar scattering for predictive design and exploitation of radar cross sections, and efficient automatic mapping and optimization of signal processing kernels onto advanced departmental computational hardware architectures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed an Ito-style stochastic calculus to build theoretical models to improve uncertainty prediction. \n-  Developed novel topological tools to analyze non-linear dynamical systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Superiority"
                                    },
                                    "Description": {
                                        "val": "The Training Superiority program provided new capabilities for military training by developing new approaches to increase technical competence.  This includes a digital tutoring system that builds expertise through high-quality, individualized learning at a scale necessary to meet DoD requirements.  Elements of the human-tutor interaction form the foundation of computer-based models that identify student motivation and memory in order to optimize learning and consolidation.  The digital tutoring system replicates the methods of expert instructors and provides interactive lessons and remediation strategies based upon individual student needs.  The outcome of this program was a functional prototype that is capable of IT training at a high proficiency level in reduced time, creating warfighters with superior knowledge."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.235"
                                            },
                                            "Text": {
                                                "val": "-  Incorporated an Exercise Framework which provides tailored student activities within the technical domain and decreases programming time of content by a factor of 10.\n-  Created a semantic model, abstractions, and Application Program Interface that allows Socratic dialogs capable of handling a large number of semantic responses rather than a predefined set of answers.\n-  Incorporated an extension of the Natural Language Understanding system to encompass the full range of the IT domain.  This system provides the framework necessary for the digital tutor to interpret responses to open ended questions as generated by students using informal English.\n-  Incorporated a Memory Model framework to project and target student refresh\/remediation needs on a weekly, monthly and\/or annual basis.\n-  Completed testing of eight week version of the digital tutor, showing a near five-sigma improvement in learning student outcomes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RealWorld"
                                    },
                                    "Description": {
                                        "val": "The RealWorld program exploited technical innovation and integration to provide any U.S. warfighter with the ability to open a laptop computer and rehearse a specific mission in the relevant geo-specific terrain, with realistic physics.  Because the system is scalable and distributed, a warfighter can practice by himself, in a small group, or with as many other warfighters as needed for the mission over a local or distributed network, and across all relevant platforms (dismounts, vehicles, helicopters, and fast movers).  Most important is the understanding that RealWorld is not a static simulation; it is a simulation builder with applications across the spectrum of modern kinetic and non-kinetic warfare.  The program created tools that allow warfighters to rapidly and easily build their own missions through the introduction of new methodology for building simulation software.  This methodology and adherence to a highly modular approach has resulted in a fundamental paradigm shift in the acquisition, as well as the construction, of DoD modeling and simulation products."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.250"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated ability to support joint air\/land\/sea operations.\n-  Created mission planning tools within the core system including a mission scripting system.\n-  Upgraded performance to support high resolution digital imagery, 100-times greater terrain import speeds, seamless inclusion of vector-based roads, and representation of tens of thousands of buildings generated from building shapefiles.\n-  Improved player immersion by creating character animations that support natural 1st and 3rd person views of avatars and augmented the graphic system to increase scene variation for a richer simulation experience."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-07"
                    },
                    "ProjectTitle": {
                        "val": "AERONAUTICS TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.298"
                        },
                        "CurrentYear": {
                            "val": "27.876"
                        },
                        "BudgetYearOne": {
                            "val": "25.573"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.573"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "23.655"
                        },
                        "BudgetYearThree": {
                            "val": "24.806"
                        },
                        "BudgetYearFour": {
                            "val": "24.806"
                        },
                        "BudgetYearFive": {
                            "val": "26.245"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Aeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion and vehicle concepts, sophisticated fabrication methods, and examination of novel materials for aeronautic system applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Transformer (TX) Vehicle"
                                    },
                                    "Description": {
                                        "val": "The Transformer (TX) Vehicle program will develop a vertical take-off and landing (VTOL), road-worthy vehicle that can carry a 1,000 lb payload at a range of 250 nautical miles on a single tank of fuel.  With a flyable\/roadable vehicle, the warfighter has the ability to avoid road obstructions as well as improvised explosive devices and ambush threats, providing flexibility for tactical military and personnel transport missions.  The primary focus of this program is to demonstrate the ability to build a ground vehicle that is capable of configuring into a VTOL air vehicle that provides sufficient flight performance and range, while carrying a payload that is representative of four troops with gear.  The enabling technologies of interest include hybrid electric drive, advanced batteries, stowable wing structures, ducted fan propulsion, lightweight materials, and advanced sensors and flight controls for stable transition from vertical to horizontal flight.  TX vehicles could be dispatched for downed airman recovery, for evacuating injured personnel from difficult-to-access locations, or to resupply isolated small units.  TX will also be suitable for enhanced company operations concepts which would provide the warfighter\/team increased situational awareness for operations in an urban environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Continued detailed trade studies to develop a vehicle design in areas including propulsion, adaptable wing structures, lightweight materials, advanced flight control system, air\/ground configuration designs, and energy storage and distribution.\n-  Developed a detailed technology maturation plan that provides an integrated risk reduction strategy and achieves the ground and flight test goals of the demonstration prototype vehicle.\n-  Developed conceptual designs for the operational field vehicle. \n-  Developed the system requirements of a demonstration prototype vehicle.\n-  Successfully completed tests of key enabling propulsion related technologies.\n-  Conducted technology interchange meetings to develop integration plan for vehicle critical enabling technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.500"
                                            },
                                            "Text": {
                                                "val": "-  Conduct preliminary design review of TX prototype vehicle concepts to examine the prototype vehicle solutions in higher detail and the detailed program plans and cost for the remaining phases.\n-  Integrate critical enabling technology development efforts into overall vehicle development.\n-  Conduct component testing to show feasibility and function of key technology components.\n-  Initiate risk reduction experiments and modeling to validate design performance.\n-  Track traceability of the prototype vehicle to the field vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.960"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.960"
                                            },
                                            "Text": {
                                                "val": "-  Conduct critical design review of TX prototype vehicle concept to ensure that it can proceed to fabrication, test, and demonstration.\n-  Conduct component testing to show feasibility and function of key technology components.\n-  Prepare test plans for hardware-in-the-loop testing to ensure successful integration of prototype vehicle subsystems.\n-  Prepare test plans for ground and flight test demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Adaptive Rotor (MAR)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Mission Adaptive Rotor (MAR) program is to develop and demonstrate the capability to achieve dramatic improvements in rotor performance, survivability, and availability through the use of technologies that enable adaptation of the rotor throughout military missions and\/or mission segments.  Recent research indicates that significant performance benefits could be achieved by actively morphing the shape or properties of the rotor system; additionally, active rotors with on-blade control could eliminate the need for a rotor swashplate.  MAR capability will result in dramatic improvements in system performance, operational availability, sustainability, and survivability, including reduction in acoustic susceptibility and rotor vibration while increasing useful payload fraction and range.\n\nThe MAR program will mature active rotor technologies that enable the effective operation of military rotorcraft in performance-limited environments of high-altitude mountainous terrain and deserts.  The MAR program will also focus on development of advanced technologies for application to future helicopter, tiltrotor, and other rotorcraft platforms and demonstrate the benefits of adaptation on a fielded system to facilitate upgrade of current multi-service rotorcraft systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.798"
                                            },
                                            "Text": {
                                                "val": "-  Defined quantitative results of design trade studies and risk mitigation assessments.\n-  Initiated preliminary design of the MAR demonstration rotor system.\n-  Conducted a principal investigators meeting for joint-Service and industry collaboration to identify critical enablers (tools, test facilities, specification revisions) for successful adaptive rotor development and deployment.\n-  Defined a rotor system design for technology demonstration.\n-  Completed objective system application development.\n-  Completed technology maturation plan for the MAR rotor system.\n-  Completed systems requirement review for the MAR demonstration rotor system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.376"
                                            },
                                            "Text": {
                                                "val": "-  Perform systems requirements and mission analyses to quantify operational MAR objective rotor system capabilities.\n-  Initiate planning for sub-scale ground testing of MAR demonstration rotor technologies.\n-  Procure hardware in support of sub-scale ground testing of MAR demonstration rotor technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.613"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.613"
                                            },
                                            "Text": {
                                                "val": "-  Conduct major component risk reduction and technology maturation through bench, ground, and flight tests.\n-  Conduct risk reduction and technology maturation of integrated rotor hub and blade assemblies at sub-scale and full scale."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aeronautic Technologies"
                                    },
                                    "Description": {
                                        "val": "The Advanced Aeronautics Technologies program will examine and evaluate aeronautic technologies and concepts through applied research.  These may include feasibility studies of novel or emergent materials, devices and tactics for both fixed and rotary wing air vehicle applications, as well as manufacturing and implementation approaches.  The areas of interest range from propulsion to control techniques to solutions for aeronautic mission requirements.  The result of these studies may lead to the design, development and improvement of prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "-  Conducted feasibility and trade studies of candidate technologies and architectures.\n-  Performed military utility analyses of proposed tactics and concepts of operation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform modeling of concepts and architectures.\n-  Conduct enabling technology and sub-system feasibility experiments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue to perform evaluation studies of emergent technologies.\n-  Initiate conceptual designs and conduct performance trade analyses.\n-  Conduct testing of enabling technology components."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-13"
                    },
                    "ProjectTitle": {
                        "val": "NETWORK CENTRIC ENABLING TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "73.678"
                        },
                        "CurrentYear": {
                            "val": "43.410"
                        },
                        "BudgetYearOne": {
                            "val": "81.389"
                        },
                        "BudgetYearOneBase": {
                            "val": "81.389"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "87.258"
                        },
                        "BudgetYearThree": {
                            "val": "94.924"
                        },
                        "BudgetYearFour": {
                            "val": "94.828"
                        },
                        "BudgetYearFive": {
                            "val": "86.200"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Network Centric Enabling Technology project develops network-centric mission applications that integrate information arising from: 1) sensors and signal\/image processors; 2) collection platforms and weapon systems; 3) intelligence networks; and 4) open and other external sources.  Technical challenges include the need to process huge volumes of diverse, incomplete, and uncertain data streams in tactically-relevant timeframes.  Processing here includes a number of critical steps including conditioning of unstructured data, content analysis, behavioral modeling, pattern-of-life characterization, economic activity analysis, social network analysis, anomaly detection, and visualization.  Operational benefits include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon.  Promising technologies are evaluated in the laboratory and demonstrated in the field to facilitate transition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nexus 7"
                                    },
                                    "Description": {
                                        "val": "The Nexus 7 program applies forecasting, data extraction, and analysis methodologies to develop tools, techniques, and frameworks for the automated interpretation, quantitative analysis, and visualization of social networks.  Social network theory has emerged in recent years as a promising approach for understanding groups of individuals connected through a variety of shared interests and collaborative activities.  For the military, social networks provide a promising model for understanding terrorist cells, insurgent groups, and other stateless actors whose connectedness is established not on the basis of shared geography but rather through the correlation of their participation in coordinated activities such as planning meetings, training\/mission rehearsal sessions, sharing of materiel\/funds transfers, etc.  The Nexus 7 program will develop and apply emerging methods for edge finding and cluster analysis to detect, characterize, and predict the dynamics of social networks.  The resulting capabilities have important application in tactical contexts to aid analysts and operators in connecting the dots amid complex, conflicting, and incomplete data sets.  They also establish a foundation for cultural intelligence - understanding the stability, governance, and economic indicators of a region - and the capability to better focus stability, security, transition, and reconstruction operations on high-payoff initiatives.  The Nexus 7 program is an outgrowth of the data analysis tools explored in the Integrated Crisis Early Warning System (ICEWS) program and previous information integration work in the cognitive computing and transformative sciences areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.027"
                                            },
                                            "Text": {
                                                "val": "-  Developed and applied techniques for measuring the stability of a region from economic and other quantitative indicators.\n-  Developed, applied, and evaluated social network analysis techniques on large-scale real-world data sets.\n-  Created geospatial and temporal statistical algorithms and applied the algorithms to multiple data sources.\n-  Provided intelligence, ranging from the strategic level to the tactical level, to multiple organizations in Afghanistan including Commander, International Security Assistance Force (ISAF), Commander's Initiative Group; ISAF Joint Command; and Regional Command South."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.605"
                                            },
                                            "Text": {
                                                "val": "-  Develop techniques for simulation, visualization, inference, and prediction of economic and other quantitative indicators.\n-  Develop geospatial techniques for modeling the interactions between and within cooperating\/competing\/conflicting social networks, sub-networks, and super-networks and for predicting the merging and splitting of social networks.\n-  Evaluate tools and techniques on real-world social-cultural-network data.\n-  Provide analytic quick-response reach-back capability to forward command echelons.\n-  Transition initial suite of algorithms, software, and tools throughout DoD including Distributed Common Ground System (DCGS)-Army and NSA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.712"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.712"
                                            },
                                            "Text": {
                                                "val": "-  Provide analytic quick-response reach-back capability to forward command echelons.\n-  Extend algorithms, tools, and methodologies to address new datasets and new formats applicable to other\nnational security interests.\n-  Develop techniques for obtaining timely, relevant information from social media and web-posted data streams that may be incomplete and\/or inaccurate.\n-  Transition full suite of algorithms, software, and tools throughout DoD including DCGS-Army and NSA."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Flow Analytics (NFA)"
                                    },
                                    "Description": {
                                        "val": "The Network Flow Analytics (NFA) program develops quantitative approaches for detecting illicit activities such as terrorist financing by monitoring flows in international financial networks.  Such terrorist financing often supports drug trafficking or other criminal activities.  NFA will address some of the most challenging aspects of detecting illicit money flows including correlating individual transactions that have been intentionally structured by the adversary to defy easy detection and correctly identifying the small number of illicit flows within the large background of legitimate flows.  In addition, to detecting illicit activities the program will focus on the development of systems to combat corruption and ensure the integrity of networked financial systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.275"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.275"
                                            },
                                            "Text": {
                                                "val": "-  Develop techniques for obtaining timely, relevant information from financial transaction data streams that may be incomplete and\/or inaccurate. \n-  Develop automatic data conditioning and regularization tools on terabyte scale.\n-  Create advanced visualizations to enable humans to uncover illicit activities in large-scale datasets.\n-  Initiate transition of algorithms, tools, and methodologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visual Media Reasoning (VMR)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Web-Scale Information Integration.  Previously funded in PE 0602305E, Project MCN-01. \n\nThe Visual Media Reasoning (VMR) program will create technologies to automate the analysis of enemy-recorded photos and videos and identify, within minutes, key information related to the content.  Such identification will include the names of individuals within the image (who), the enumeration of the objects within the image and their attributes (what), and the image's geospatial location and time frame (where and when).  Large data stores of enemy photos and video are available but cannot be easily leveraged by a warfighter or analyst attempting to understand a specific new image.  The VMR program will enable users to gain insights rapidly through application of highly parallelized image analysis techniques that can process the imagery in massive federated image stores.  VMR technology will serve as a force-multiplier by rapidly and automatically extracting tactically relevant information for the human analyst and alerting the analyst to scenes that warrant the analyst's expert attention."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.102"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.102"
                                            },
                                            "Text": {
                                                "val": "-  Refine the user interface as well as the accuracy and performance of the system based on warfighter\/analyst user group input.\n-  Identify requirements and prototype a cloud-based hardware system for VMR image processing and storage of image indices.\n-  Support the formation of expert user groups by automatically identifying individuals with related capabilities and interests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Auditable Systems (CAS)"
                                    },
                                    "Description": {
                                        "val": "The Cyber Auditable Systems (CAS) program will create the technologies necessary for the military to elicit public response and perform sentiment analysis in a secure and auditable manner over the internet.  Stability, security, transition, and reconstruction operations are enhanced by the creation of democratic institutions and the elimination of systematic corruption within newly formed governments.  These goals depend on the ability of users to speak freely without fear of reprisal and to participate in public referendums with privacy protections.  CAS will create technology to enable safe discourse and trustworthy elections over the internet.  This will require addressing all three elements of the traditional security triad - confidentiality, integrity, and availability - while also providing for new auditing mechanisms such as the capability for individuals to confirm their vote was correctly recorded and for stakeholder organizations to confirm only legitimate votes were counted.  The program will expand traditional encryption algorithms and protocols to encompass auditability in systems requiring public trust."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.300"
                                            },
                                            "Text": {
                                                "val": "-  Design and develop the underlying technology for an internet voting system that protects voter confidentiality, assures the integrity of the vote, and provides auditing features adequate to confirm that the results of an election are correct in relation to the votes cast.\n-  Perform a proof-of-concept demonstration of a prototype internet voting system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Video and Image Retrieval and Analysis Tool (VIRAT)"
                                    },
                                    "Description": {
                                        "val": "The Video and Image Retrieval and Analysis Tool (VIRAT) program will develop and demonstrate a system for video data exploitation that enables an analyst to rapidly find video content of interest from archives and provides alerts to the analyst of events of interest during live operations.  The ability to quickly search large volumes of existing video data and monitor real-time video data for specific activities or events will provide a new capability to the U.S. military and intelligence agencies.  Currently, video analysis is very labor intensive, limited to metadata queries, manual annotations, and \"fast-forward\" examination of clips.  The software tools developed under VIRAT will radically improve the analysis of huge volumes of video data by: 1) alerting operators when specific events or activities occur at specific locations or over a range of locations and; 2) enabling fast, content-based searches of existing video archives.  The final product of the VIRAT program is a system that can be transitioned to an integrated, operational military system, such as the Distributed Common Ground System (DCGS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.793"
                                            },
                                            "Text": {
                                                "val": "-  Developed an approach to deal with burned-in metadata in Predator video data.\n-  Developed efficient indexing and interactive retrieval against a larger set of activities.\n-  Built a prototype system.\n-  Satisfied a preliminary evaluation by Air Force Electronic Systems Center (ESC) for potential transition into the Air Force DCGS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.521"
                                            },
                                            "Text": {
                                                "val": "-  Develop technologies to accommodate stationary, ground-mounted video sources.\n-  Add geo-registration capability to support operational use of the data.\n-  Complete development and optimization of technologies to accommodate larger datasets.\n-  Test and evaluate performance of the system against an experienced analyst's performance.\n-  Complete a second phase of evaluation by Air Force ESC for potential transition into Air Force DCGS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Crisis Early Warning System (ICEWS)"
                                    },
                                    "Description": {
                                        "val": "The Integrated Crisis Early Warning System (ICEWS) program develops and integrates a set of data analysis tools into a unified information system to support Theater Security Cooperation.  The ICEWS system monitors, assesses and forecasts leading indicators of events that make countries vulnerable to crises.  ICEWS technologies include quantitative and computational social science modeling and simulation, scenario generation, ontological modeling of security problems, advanced interactive visualization techniques, and agent-based programming.  ICEWS will also develop a collaborative, open-source testbed that will facilitate the integration and evaluation of alternative, operationally relevant social theories.  Natural language processing is required to identify and extract information that is predictive from text and speech-based media and to distill that information into a form that is actionable by civilian and military leadership.  ICEWS will develop a large body of test cases (source data and outcomes) against which the social science theories can be evaluated.  When integrated, these tools will allow combatant commanders and their staff to understand and anticipate conditions that precipitate instability and conflict while there is still time to influence them.  ICEWS will also help commanders anticipate unintended consequences of actions taken to influence or remediate situations, consequences that may be delayed by months or years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.863"
                                            },
                                            "Text": {
                                                "val": "-  Tested the ICEWS forecasting algorithms against intelligence analysts' judgment at PACOM and deployed additional ICEWS components to PACOM for test and evaluation.\n-  Extended the ICEWS data extraction and analysis methodologies to SOUTHCOM, and deployed ICEWS components to SOUTHCOM.\n-  Tested new unclassified data feeds from the Open Source Center for integration into ICEWS.\n-  Experimented with state-of-the-art natural language processing methodologies to extract more accurate real time event data and other indices important for crisis forecasting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.284"
                                            },
                                            "Text": {
                                                "val": "-  Transition ICEWS components to USSTRATCOM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extreme Accuracy Tasked Ordnance (EXACTO)"
                                    },
                                    "Description": {
                                        "val": "The Extreme Accuracy Tasked Ordnance (EXACTO) program demonstrated the ability to engage targets at extremely long ranges, regardless of target motion or crosswinds, with previously unachievable accuracy.  The EXACTO system is comprised of an advanced targeting optic, the first ever guided, power-generating, small caliber bullet, innovative guidance and control software, and a conventional sniper rifle.  The EXACTO 50-caliber bullet and brass-board optical sighting technology greatly extends the day and night ranges over current state-of-the-art sniper systems allowing sniper teams to engage tactically important moving targets including accelerating vehicle-borne targets, in high crosswind conditions.  EXACTO enhances survivability by allowing greater shooter standoff range and reduces target engagement timelines by a factor of 5."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.218"
                                            },
                                            "Text": {
                                                "val": "-  Revised component, software, and prototype system design as necessary to optimize performance.\n-  Continued risk reduction simulation and testing of EXACTO system, component hardware and software.\n-  Performed initial bullet packaging demonstration.\n-  Developed detailed design and initiated fabrication of EXACTO prototype system and bullets.\n-  Validated critical integrated sub-systems and performance models with software-in-the-loop simulations, and benchtop and live-fire tests.\n-  Validated EXACTO system performance by incrementally demonstrating key system functionality.\n-  Completed design and integration of brass-board targeting optic subsystem.\n-  Completed guidance and control software package development and debugging.\n-  Fully integrated guidance and control software into control computer and brass-board targeting optic.\n-  Fabricated, delivered, assembled, and integrated the first EXACTO demonstration system.\n-  Incrementally tested and evaluated EXACTO brass-board targeting optic with prototype bullets in increasingly complex live-fire tests leading to demonstration of fully guided EXACTO bullets. \n-  Conducted the first fully guided projectile live-fire testing at full range in representative operational environments with representative target motion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PERsistent Stare Exploitation and Analysis System (PerSEAS)"
                                    },
                                    "Description": {
                                        "val": "The PERsistent Stare Exploitation and Analysis System (PerSEAS) program prototyped a tool to automatically and interactively identify activity-based events of interest from persistent, wide area, motion imagery data with support from signals intelligence and other sources.  Persistent, wide area surveillance imagery is an ever increasing source of operational data, but exploitation of this data at present is mostly manual and requires hours to days to produce results.  PerSEAS addressed the need for tools to automatically detect potentially significant adversary activities and to discriminate these from nominal background activity.  Additionally, the program established prototype libraries of activity patterns, logic to generate hypotheses about which activities are being observed, and mechanisms to quantitatively score the consistency of the data with each activity hypothesis to detect and defeat threats in real-time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Implemented and evaluated techniques on wide area motion imagery data.\n-  Developed a demonstration prototype.\n-  Refined and improved modeling techniques for normalcy modeling and anomaly detection.\n-  Refined and improved inferencing algorithms to recognize complex chains of activities and events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Home Field"
                                    },
                                    "Description": {
                                        "val": "The Home Field program developed networked video and Laser Detection and Ranging (LADAR) processing technology to rapidly and reliably update a 3-D model of an urban area.  It provided 3-D situational awareness with sufficient detail and accuracy to remove the \"home field advantage\" enjoyed by opponents.  The Emissive Micro Displays (EMD) effort developed technologies to support the fabrication of Low-cost High pixel density Power efficient Direct emission Microdisplays (LHPDM).  Current microdisplay systems use light modulation systems (liquid crystal displays, digital micromirror devices,) and by using LHPDM, it will enable the transmission of larger fractions of light from the illumination source."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.777"
                                            },
                                            "Text": {
                                                "val": "-  Completed demonstration of fabrication technologies that support affordable emissive microdisplays.\n-  Demonstrated UV micro-emitter array.  \n-  Designed red, green, blue capability for EMD program displays.\n-  Completed development and fabrication of all EMD modules."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}