{
    "id": "affe21737385e7dc7cd711a5981bd134dc4b0b05",
    "meta": {
        "filename": "dod-2013_RDTE_2013_NAVY_BA1_3_MasterJustificationBook_Navy_PB_2013.zzz_unzipped_MasterJustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603640M"
        },
        "ProgramElementTitle": {
            "val": "MC Advanced Technology Demo"
        },
        "R1LineItemNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "110.068"
            },
            "CurrentYear": {
                "val": "124.115"
            },
            "BudgetYearOne": {
                "val": "130.598"
            },
            "BudgetYearOneBase": {
                "val": "130.598"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "132.400"
            },
            "BudgetYearThree": {
                "val": "135.244"
            },
            "BudgetYearFour": {
                "val": "137.678"
            },
            "BudgetYearFive": {
                "val": "140.396"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Science and Technology (S&T) Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential S&T efforts that will enable the continued supremacy of United States Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nAs a key component of naval expeditionary forces, the Marine Corps has unique and technologically stressing requirements because of its expeditionary mission and intensive operational tempo, Marine Air-Ground Task Force (MAGTF) structure, and conduct of maneuver warfare.  Critical requirements in this PE are: Command, Control, Communications, Computers (C4); Intelligence, Surveillance, and Reconnaissance (ISR); maneuver techniques and means; force protection; logistic sustainment; human performance, training and education; and firepower. There are ongoing actions to develop and demonstrate advanced technologies and concepts in operational environments. Joint service efforts are aligned with Defense Technology Objectives and Joint Warfighting Capability Objectives. In addition, there is funding for experimentation in warfighting concepts as well as operational assessment of emerging technologies, to include technical support of operating forces to assess military utility of selected technologies. This PE specifically supports: continued development of enhanced warfighting capabilities through field experiments with Marine operating forces; rapid response to low-, mid-, and high-intensity conflicts in the Overseas Contingency Operation (OCO); methods for countering irregular threats; and expansion of seabasing and naval force packaging capabilities. The investment directly assists in fulfilling the forward presence requirements of Sea Shield and the transformational capabilities prescribed by Sea Strike. The Future Naval Capability (FNC) process is supported and funds are programmed accordingly. This PE is largely focused on demonstration of products and capabilities from the knowledge base and Discovery and Invention (D&I) phases of Naval S&T. As Naval partners, the Navy and Marine Corps S&T Team strive to transition technologies that will implement objectives outlined in the Naval Operations Concept. This PE also funds technical solutions designed to increase Naval force capability, such as the Naval Expeditionary Combat Command. Investments in S&T provide the opportunities for future capabilities and will prevent technological surprise. The PE as a whole will advance the amphibious and expeditionary capabilities for the Combatant Commanders helping to meet their emerging challenges by enhancing Naval S&T contributions to the long commitment to the OCO.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "115.089"
                },
                "CurrentYear": {
                    "val": "124.324"
                },
                "BudgetYearOne": {
                    "val": "129.381"
                },
                "BudgetYearOneBase": {
                    "val": "129.381"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "110.068"
                },
                "CurrentYear": {
                    "val": "124.115"
                },
                "BudgetYearOne": {
                    "val": "130.598"
                },
                "BudgetYearOneBase": {
                    "val": "130.598"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.021"
                },
                "CurrentYear": {
                    "val": "-0.209"
                },
                "BudgetYearOne": {
                    "val": "1.217"
                },
                "BudgetYearOneBase": {
                    "val": "1.217"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.209"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.141"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.190"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.059"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.059"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.276"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.276"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.690"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: FY 2010 and out resources reflect funding for a DoD directed integrated capability demonstration supporting the Protection of Ground Forces and Systems.  DoD directed this initiative in response to the determination that its S&T investment is likely too small to meet the imposing security threats that challenge our Nation, and it may not be adequately postured to take advantage of key scientific and technological opportunities that offer breakthrough advantages to our warfighters.  This broad, multi-year (through FY2013) initiative will expand existing technology integration and increase\/spur the application of more fundamental technologies to force and platform protection.  The goal is multiple broad phased force protection applications and technologies, with off-ramps for fielding successes; therefore, funding associated with this DoD initiative is reflected throughout the PE.  In FY 2011 preparation efforts continue in areas of technology that are ready for major, integrated technology demonstration.  All technical work is being coordinated throughout DoD on these demonstrations.  In areas such as vehicle technology demonstrations, the goal is to deliver multiple classes of advanced technology ground vehicle demonstrations leading to new classes of protective, efficient, ground vehicles.\n\nSchedule: Project 2297, Worldwide contingency and combat operations (e.g., Operation Enduring Freedom (OEF) and humanitarian efforts)) have increased the operations tempo of the operating forces to the extent that their support of, and participation in, the Marine Corps Warfighting Laboratory (MCWL) experimentation was\/remains challenging to coordinate and often directly impacts planned projects.  Additionally, rapid responses to emergent warfighter needs impacts planned projects.  Also, experimentation itself is not a precise business and information gained throughout the process can also effect program plans.  Thus, executing planned projects becomes \"an art\" in an effort to balance complicated and competing needs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2223"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps ATD"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "74.546"
                        },
                        "CurrentYear": {
                            "val": "83.870"
                        },
                        "BudgetYearOne": {
                            "val": "87.138"
                        },
                        "BudgetYearOneBase": {
                            "val": "87.138"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "88.335"
                        },
                        "BudgetYearThree": {
                            "val": "90.233"
                        },
                        "BudgetYearFour": {
                            "val": "91.857"
                        },
                        "BudgetYearFive": {
                            "val": "93.671"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Critical Marine Corps requirements\/imperatives addressed in this Project are: Maneuver; Force Protection; Human Performance, Training and Education; Logistics; Command, Control, Communications and Computers (C4); Intelligence, Surveillance and Reconnaissance (ISR) and Firepower.   These are ongoing efforts to develop and demonstrate advanced technologies and system concepts in an operational environment.  Multiple transitions into the Sub-system\/Component Advanced Development Phase are planned, as well as fieldable prototyped to reduce risk in System Concept Development and Demonstration.  A tactically effective Mine Countermeasures (MCM) capability is vital to Force Protection and necessary if Maneuver on land is to become a functional component of Naval Expeditionary Maneuver Warfare.  Maneuver, supported by MCM provides synchronization and speed of detection, breaching, clearance, proofing, and marking operations.  This project supports: 1) engaging regional forces in decisive combat on a global basis; 2) responding to all other contingencies and missions in the full spectrum of combat operations (high, middle, and low intensity), in Military Operations in Urban Terrain (MOUT), and in Operations other than War (OOTW); and 3)  warfighting experimentation.  By providing the technologies to enable these capabilities, this project supports the goals and objectives of the Strike, Littoral Warfare and Surveillance Joint Mission Areas.  These are ongoing efforts to develop and demonstrate advanced technologies and system concepts in an operational environment. \n\nIn addition, this project supports the goals and objectives of the Littoral Combat\/Power Projection related Enabling Capability (EC) within the Future Naval Capabilities (FNC) portfolio.  The focus of the EC within this PE is technology related to Urban, Asymmetric, and Expeditionary Operations (UAEO).  The UAEO Capability Gap is a science and technology developmental area that is of the highest importance to Marine Corps operations in Iraq and Afghanistan and is one of the highest ranked Capability Gaps prioritized by the Chief of Naval Operations and the Marine Corps Combat Development Command (MCCDC).  The UAEO technology gap is being pursued as part of an overall effort that addresses the Sea Strike Capability Gap."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMMAND, CONTROL, COMMUNICATIONS, COMPUTERS (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity integrates and demonstrates enhanced communications and situational awareness in warfighting environments and communication and situational awareness technologies for near term USMC operations. The focus is on development and leveraging advanced C4 technologies to enable enhanced Distributed Operations, Irregular Warfare, and Marine Corps Expeditionary Warfare.  Specifically, the C4 Thrust intends to demonstrate markedly improved capabilities in over-the-horizon (OTH), beyond line-of-sight, and restricted environment communications; mobile networking; tactical decision making; tactical situational awareness; and small unit position location and navigation.  Advanced technology resources will be applied to complement commercial, other service, and defense agency investments to produce a technology base to address identified Marine Corps technology gaps."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.196"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued urban navigation with limited Global Positioning System availability demonstrations.\n- Continued demonstrations of improved urban communications capabilities.\n- Continued creating a service oriented sensor network for expeditionary forces' current and future tactical sensors.\n- Continued developing tailored tactical Human to Machine Interfaces aligned to primary operational functions and non-intrusive within the battlespace.\n- Continued creating services for the tactical network that are fully operable with DCGS and the DCGS Integration Backbone.\n- Completed Fires interoperability, Advanced HF Communications and Restricted Communications. \n- Initiated Application-Network Architectures, Conformal Antenna Integration and Demonstration Spiral 2 and C3 for the Individual Marine Spiral Two."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.781"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above. Conformal Antenna Integration and Demonstration Spiral 2 and C3 for the Individual Marine Spiral Two have been combined into M2C3 Development.\n- Complete Tactical Information Services.\n- Initiate Application Network Architecture(reprioritized from FY11) and Automated Small Unit Decision tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.043"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.043"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as completed above.\n- Complete Application Network Architecture and Advanced Software Reconfigurable Relay.(Application Network Architecture initiated in FY2011 and Advanced Software Reconfigurable Relay initiated in FY2008).\n- Initiate Advanced Communications Systems and Small Unit C3."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIREPOWER"
                                    },
                                    "Description": {
                                        "val": "This activity develops technology for application on current and future expeditionary weapons and elements of the kill chain.  It includes, but is not limited to, the following technologies: fuze, fire control, launch\/propulsion, lethality, and accuracy.\n\nThe FY2011 to FY2012 funding increase is due to the initiation of the development of Miniature Urban Missile.\n\nThe increase in the Firepower funding from FY2012 to FY2013 is due to the acceleration and completion of the Caseless (CL) Ammunition project.  This priority effort directly supports the Commandant of the Marine Corps' Guidance to Lighten the Marine Air-Ground Task Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.739"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued scalable effects conventional warhead concept development.\n- Continued improved mortar munition integration and demonstrations.\n- Continued development of targeting and engagement technologies for distributed operations collaborative fires integration and demonstrations.\n- Continued design, development, prototyping and testing of lightweight technologies that provide individual Marines enhanced capabilities to detect and identify man-size targets out to at least the maximum effective range of their personal weapons during all conditions (daylight, limited visibility, & darkness) by integrating multiple capabilities into a single system.\n- Continued a Flight Control Kinematic Unit effort (effort renamed Flight Control Mortar). Design & develop technology that provides guidance, navigation, and controls (GNC) to 81mm mortar rounds to enable trajectory shaping in urban environment to precisely & accurately strike specific targets.\n- Continued Non-Magnetic Azimuth Sensing (NMAS previously identified as completed in PB 2011)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.992"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above.\n- Complete development and testing of enhanced range mortar munitions.\n- Initiate development of Miniature Urban Missile, leveraging technology from MEMS, designation, guidance and control, and warhead design, to develop a shoulder launched missile capable of defeating a variety of targets.\n- Initiate development of precision 60mm mortar system, to demonstrate increased precision, range, and lethality in a light mortar, providing indirect fire support through projectile flight trajectory shaping."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.914"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.914"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Narrative Clarification:\nFY 2012 plans to initiate development of Miniature Urban Missile, leveraging technology from MEMS, designation, guidance and control, and warhead design, to develop a shoulder launched missile capable of defeating a variety of targets has been delayed due to technical difficulties.\n \nFY 2012 plans to initiate development of precision 60mm mortar system, to demonstrate increased precision, range, and lethality in a light mortar, providing indirect fire support through projectile flight trajectory shaping has been delayed due to technical difficulties.\n\n- Continue all efforts of FY 2012, less those noted as completed above\n- Complete MEMS Initiation Safety Device (ISD) development and testing, for MilStd 1901A compliant igniters, to incorporate into current and developmental weapons propulsion systems.\n- Complete development of MEMS S&A.\n- Complete development of Caseless (CL) Ammunition.(Caseless (CL) Ammunition Effort was initiated in FY2006)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE PROTECTION"
                                    },
                                    "Description": {
                                        "val": "This activity supports the Force Protection Thrust's Advanced Technology Demonstration efforts in the areas of individual Marine platforms, equipment and autonomous systems.  This includes technologies to enable detection, neutralization, breaching, and clearing of mines, Improvised Explosive Devices (IEDs), and unexploded ordnance from the beach exit to inland objectives.  Efforts supported under Force Protection also include the demonstration of technologies such as Counter Rocket, Artillery, and Mortar (CRAM) and Counter Sniper technologies in support of maneuver warfare, small unit distributed operations, and fixed installation protection and technologies for improved Personnel Protective Equipment for individual protection against blast, ballistic, and blunt impact threats as well as in a chemical, radiological, and biological environment.  Physical Security technologies to support expeditionary maneuver warfare, pier\/port and base infrastructure are also addressed under this thrust.  Beginning in FY 2009, Mine Countermeasures (MCM) efforts were funded within the Force Protection activity.  FY 2009 was the first reporting cycle where Force Protection Thrust efforts are separated from the Maneuver activity.  Counter-IED and Counter-RPG Technologies remain high priority Marine Corps focal areas.\n\nThe FY 2011 to FY 2012 increase in funding is due to enhanced funding for Anti-Tank Guided Missile (ATGM) technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.858"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of technologies to defeat side\/top attack and advanced fuze mines through signature reduction and advanced signature duplication.\n- Continued development of technologies to locate and defeat IEDs.\n- Continued development of technologies to defeat advanced mine fuzes (seismic, acoustic, and infrared).\n- Continued efforts to detect IEDs using radio frequency sources.\n- Continued technology development programs to address force protection capability gaps.\n- Continued new Explosives Hazard Defeat to address the Suicide-Bomber threat. This effort will combine multiple sensor modalities, analysis algorithms, and data fusion to demonstrate high Pd, low FAR detection of suicide bombers from standoff distances from multiple aspect angles.\n- Continued a new Anti-Tank Guided Missile (ATGM) effort to defeat ATGMs in complex urban environment.\n- Continued Warfighter modeling and simulation efforts for the Warfighter-as-a-System analysis approach and methodology combining survivability, mobility, and warfighter performance parameters.\n- Continued the Urgent Theater Warfighting Requirement for countering Improvised Explosive Devices (IED) and vehicle bourne IED.\n- Continued high-power solid state source development for IED neutralization.\n- Continued vulnerability assessment of threat targeting sensors to directed energy.\n- Completed modeling and simulation (M&S) efforts for the Warfighter-as-a-System analysis approach and methodology combining survivability, mobility, and warfighter performance parameters.\n- Completed countermeasures technology development against seismic fuzed landmines.\n- Completed development of stand-off detection of explosives utilizing Raman and Laser Induced Breakdown Spectroscopy sensor modalities. (Relates to FY 2009 initiation of new Explosives Hazard Defeat Plan). \n- Initiated efforts to neutralize incoming rocket, artillery, and mortar threats via non-kinetic means.\n- Initiated development and evaluation of landmine detection utilizing ground penetrating radar from an airborne platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.092"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above.\n- Continue efforts to neutralize incoming rocket, artillery, and mortar threats via non-kinetic means.\n- Continue development and evaluation of landmine detection utilizing synthetic aperture radar from an airborne platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.354"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.354"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as completed above.\n- Continue to develop and demonstrate technologies that will detect RPGs and ATGMs prior to launch and countermeasures after launch. \n- Initiate the development of detecting and locating sniper weapons using the return of their unique radar signatures.\n- Initiate the development automated human detection via spectral imaging during low-light level operation conditions (e.g. dusk\/dawn\/moonlit\/starlit night). \n- Initiate fusion of technologies that will detect and classify optics (sniper scopes, ccds, eyeball, etc) from a moving platform. \n- Initiate the demonstration of the feasibility of a deployable mission package consisting of technologies capable of screening multiple individuals rapidly over a wide area to detect, classify and track suicide bombers at relevant distances within a critical time frame for action. \n- Initiate demonstration of laser technology readiness for battlefield employment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN PERFORMANCE, TRAINING & EDUCATION"
                                    },
                                    "Description": {
                                        "val": "This activity develops and demonstrates advanced training technology and technologies that enhance neural and cognitive aspects of human performance including tactical decision-making, modeling, simulation, range instrumentation, synthetic environment generation and training effectiveness evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.228"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of \"Warfighter as a System\" modeling tools. (Effort renamed to Enhancing warfighter psycho-physical performance).\n- Continued development of adaptive experiential learning tools for Distributed Operations Training. (Effort renamed to Real-time adaptive training environments).\n- Continued evaluations and validations of applications geared towards peak neural and cognitive performance-in distributed operations.\n- Continued development of early prototype systems for Human Performance and Training efforts (Cognitive and physical enhancement, modeling and simulation, and virtual reality and mixed reality squad level training in support of Distributed Operations).\n- Completed development of automated behavioral and neurophysiological performance measurement technologies for Distributed Operations Warfighter assessment, classification and assignment to training. \n- Completed evaluations and validations of applications geared towards peak neural and cognitive performance-in distributed operations. (Technologies supporting peak cognitive performance). \n- Completed Distributed Operations training system investigations into perceptual skills enhancement that lead to enhanced cognition and decision making.\n- Completed development of early prototype systems for Human Performance and Training efforts (Cognitive and physical enhancement, modeling and simulation, and virtual reality and mixed reality squad level training in support of Distributed Operations).\n- Completed development of adaptive experiential learning tools for Distributed Operations Training.\n- Complete in-depth analysis, state-of-the-art report, and testing on all USMC physical training regimens, their effectiveness, and their injury incidence rates.\n- Initiated efforts to apply learning theories for language and culture training. \n- Initiated team immersive language and cultural learning in simulation environments.\n- Initiated classroom\/field testing of learning theories extended to complex tasks for a range of expertise levels; training mitigation strategies triggered by neurophysiological markers of learning, cognition and expertise; and principles of expertise development on a continuum of novice to expert. (Rename effort Algorithms Physiologically-derived to Promote Learning Efficiency (APPLE)).\n- Initiated field evaluations of training mitigation strategies triggered by behavioral and neurophysiological markers of learning, cognition, and expertise.\n- Initiated effectiveness and validation studies of Advanced Mobile Field Assessment and Readiness Technologies to improve the capability to assess situational awareness in the field and predict physical performance by developing mobile and rugged tools, algorithms, and models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.539"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above. Due to operational urgency in FY 2011 initiated development of an autonomous robotic adversarial target system to extend simulation marksmanship training to live-fire ranges with the use of robotic targets (all-terrain, mobile, tactical, return fire) and integrate with simulation feedback and scoring for transition to Marine Corps Systems Command (PM-Training Systems). \n- Continue effectiveness and validation studies of Advanced Mobile Field Assessment and Readiness Technologies to improve the capability to assess situational awareness in the field and predict physical performance by developing mobile and rugged tools, algorithms, and models. \n- Complete development of adaptive experiential learning tools for Distributed Operations Training. (Effort renamed to Real-time Adaptive Training Environments).\n- Complete development of \"Warfighter as a System\" modeling tools. (Effort renamed to Enhancing warfighter psycho-physical performance).\n- Complete development of algorithms physiologically derived to promote learning efficiency (Relates to early prototype systems for Human Performance and Training efforts initiated in FY10).\n- Complete development of expressive interactions for desktop virtual environments (Relates to early prototype systems for Human Performance and Training efforts initiated in FY10).\n- Complete efforts to apply learning theories for language and culture training. \n- Complete team immersive language and cultural learning in simulation environments.\n- Complete classroom\/field testing of learning theories extended to complex tasks for a range of expertise levels; training mitigation strategies triggered by neurophysiological markers of learning, cognition and expertise; and principles of expertise development on a continuum of novice to expert. (Rename effort Algorithms Physiologically derived to Promote Learning Efficiency (APPLE)).\n- Complete field evaluations of training mitigation strategies triggered by behavioral and neurophysiological markers of learning, cognition, and expertise.\n- Initiate development of sleep deprivation mitigations (phase II) to enhance warfighter performance during extended operations (initial phase completed in FY10).\n- Initiate development of technologies supporting peak cognitive performance of warfighters. \n- Initiate development of physical conditioning assessment and training optimization methods to improve warfighter performance (previous efforts related to physical conditioning impacts on combat readiness resourced by PE 0602131M).  \n- Initiate development of applied training technologies for Squad Immersive Training Environments (SITE). \n- Initiate evaluation of neurological symptoms of performance at altitude to reduce the incidences of acute mountain sickness (AMS). \n- Initiate development and demonstrate immersive training communication analysis systems to support instructor assessment of infantry units."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.035"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.035"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY2012, less those noted as completed above.\n- Continue development of sleep deprivation mitigations (phase II) to enhance warfighter performance during extended operations (initial phase completed in FY10). \n- Continue development of technologies supporting peak cognitive performance of warfighters. \n- Continue development of physical conditioning assessment and training optimization methods to improve warfighter performance - performance enhancement technologies\/integration (previous efforts related to physical conditioning impacts on combat readiness resourced by PE 0602131M).\n- Continue the demonstration of the utility of using Tyrosine supplementation for reducing stress in irregular warfare, asymmetric environments.\n- Continue the development of the utility of analyzing neural mechanisms for affecting mental skills resilience.\n- Continue the development of Integrated Models for Warfighter Performance Enhancement.\n- Continue development of applied training technologies for Squad Immersive Training Environments(SITE). \n- Continue development and demonstrate immersive training communication analysis systems to support instructor assessment of infantry units.\n- Continue the demonstration of the utility of Integrated Learning Management System (LMS).\n- Continue the assessment and validation of an injury prevention methodology for use in-theater (CoRE)\n- Continue effectiveness and validation studies of Advanced Mobile Field Assessment and Readiness Technologies to improve the capability to assess situational awareness in the field and predict physical performance by developing mobile and rugged tools, algorithms, and models. \n- Continue research into heat stress mitigations for the individual Warfighter, and develop intervention strategies to improve performance in hot environments. \n- Complete development of an autonomous robotic adversarial target system to extend simulation marksmanship training to live-fire ranges with the use of robotic targets (all-terrain, mobile, tactical, return fire) and integrate with simulation feedback and scoring for transition to Marine Corps Systems Command (PM-Training Systems). \n- Complete the demonstration of the utility of a comprehensive instructional strategies framework that takes as input learner and knowledge characteristics and then provides as output recommended strategies to developers for enhancing training within simulation based training environments (APPLE).\n- Complete development of automated capture, measurement, performance assessment & after-action-review (AAR) for small team communications during training, showing improved situational awareness and team coordination among warfighters in a MOUT training environment (Relates to FY09 initiated effort to demonstrate and field studies of mitigation \/augmentation capabilities that enhance squad communications).\n- Complete studies into next generation physical performance enhancement methodologies and technologies (enhanced warfighter psycho-physical performance). \n- Initiate mobile field technologies for predicting readiness and performance into more advanced development and demonstration of utility. \n- Initiate development of technologies and methodologies for integrated mental skills resilience training (previous efforts neural mechanisms of mental skills resilience)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INTELLIGENCE, SURVEILLANCE, AND RECONNAISSANCE (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity supports the demonstration of technologies to enhance situational awareness and tactical decision making through automated analysis, fusion of data, rapid integration of information, and acquired knowledge resulting in actionable intelligence at the lower command levels. The activity includes the demonstration of ISR efforts involving enhanced reconnaissance and persistent surveillance, and sensors for unmanned ground and aerial vehicles.   Advanced Technology demonstrations also include the collection of information [monitoring, sensing, and locating] in the 3D urban battlespace as well as exploiting information [identifying and classifying data] as part of the intelligence preparation of the battlespace in order to facilitate operational maneuver and distributed operations.\n\nThe FY2011 to FY2012 funding increase is due to acceleration of efforts to develop agile tactical sensor nets to improve the availability, timeliness, and usefulness of battlespace intelligence.  \n\nThe increase in the ISR Thrust funding from FY2012 to FY2013 is due to the initiation of Tagging, Tracking, and Locating efforts to demonstrate a system that will automatically translate large amounts of wide area surveillance data into tracks, useful to expose entity to entity associations; build urban context, as well as detect events and anomalies; and associate objects, tasks, locations and events for creating actionable intelligence in on-board firmware which is a USMC and United States Special Operations Command (SOCOM) priority. Efforts to mature the semantic web construct needed to enable information dissemination and utilization will also be initiated.  Efforts to infer and disambiguate graphs generated from structured and unstructured data will be accelerated as will development in processing low signal to noise audio data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of advanced tactical sensor nets that localize mobile detection of threats in a complex environment.\n- Continued development and demonstration of measurement and signature intelligence data management and integration capability.\n- Continued integration and demonstration of naval tactical warfighting applications and network connectivity.\n- Continued tagging, tracking, and locating efforts to demonstrate the effectiveness of tactically relevant tag readers which support track classification algorithms.\n- Continued efforts to refine enemy course of action prediction software to adapt to stimuli.\n- Continued new Actionable Intelligence for Expeditionary and Irregular Warfare efforts which include Human Network Decision Modeling and the fusion across modeling approaches to increase prediction accuracy.\n- Continued development of tactical sensor nets with organic unattended multi-level security processing and information dissemination.\n- Continued new Relevant and Situational Information on Demand such as Identity Dominance Enabled by an Integrated Biometric\/Tag Track and Locate (TTL) Capability, providing human tracking algorithms based on models of biometric (face, voice and soft) and TTL (optical taggant) capabilities and modeling a biometric\/optical taggant system relevant to human tracking across an urban 5 km x 2 km area.\n- Continued new Sensor Fields efforts such as Nanotechnology Enabled Witness Fields, development of sensors that provide near real time decision support to distributed operations by detecting specific interactions, and nanotechnology efforts which offer the potential to revolutionize tactical sensors. To enable this capability, nanomaterials that change state in the presence of another nanomaterial will be developed.\n- Continued tagging, tracking, and locating efforts to demonstrate a system that will automatically translate large amounts of wide area surveillance data into tracks, useful to expose entity to entity associations; build urban context, as well as detect events and anomalies; and associate objects, tasks, locations and events for creating actionable intelligence.\n- Continued algorithm development for base classification on context, similarity to clutter, and nearness to suspicion.\n- Continued efforts to analyze and expose enemy networks using close observations of entity to entity associations and social network analysis. This includes development of audio tools which enable automated understanding of analog and digital recordings, as well as text files.\n- Continued efforts to develop methods and techniques for investigating open source information on the Internet to form a human terrain map indicating space and time features to aid network identification and prediction of enemy activity.\n- Continued efforts to incorporate social models for human decision making with statistical models. This includes new Actionable Intelligence for Expeditionary and Irregular Warfare efforts which include Human Network Decision Modeling and the fusion across modeling approaches to increase prediction accuracy and also the development of an active dynamic resource manager to make collected data better available to decision makers.\n- Initiated new Operational Adaptation Enablers effort to provide one analysis framework for the incorporation of interdisciplinary techniques related to addressing contextual questions.  \n- Initiated efforts to extend the utility of track classification algorithms to sparse data.\n- Initiated efforts to automatically fuse data across all identifiers (TTL, biometrics, symbols) based on similarity measures.\n- Initiated efforts to show entity tracking using disparate ground and air sensors and tools that automatically compute latent area atmospheric measures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.897"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above.\n- Complete efforts to use the warfighter as a supplementary sensor in the battlespace to improve ISR to C2 connectivity.\n- Complete efforts to develop agile tactical sensor nets to improve the availability, timeliness, and usefulness of battlespace intelligence.\n- Initiate development of model based own force decision tools based on adversarial decision making models. \n- Initiate development of an active layered sensing capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as completed above.\n- Complete development of an active dynamic resource manager to make collected data better available to decision makers.\n- Complete Operational Adaptation Enablers effort to provide one analysis framework for the incorporation of interdisciplinary techniques related to addressing contextual questions. \n- Complete efforts to analyze and expose enemy networks using close observations of entity to entity associations and social network analysis. This includes development of audio tools which enable automated understanding of analog and digital recordings, as well as text files. \n- Initiate research on the development of automated data tagging algorithms that enable connected graphs of structured and unstructured data.- Initiate research to develop more audio exploitation algorithms that can be used on audio files with a low signal to noise.\n- Initiate technology development required to enable tactical UAS on-board processing of terabytes of data in real time.\n- Initiate development of a user composable search and display capability enabled by map reduce technology.\n- Initiate Tagging, Tracking, and Locating efforts to demonstrate a system that will automatically translate large amounts of wide area surveillance data into tracks, useful to expose entity to entity associations; build urban context, as well as detect events and anomalies; and associate objects, tasks, locations and events for creating actionable intelligence."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LITTORAL COMBAT\/POWER PROJECTION (LC\/PP)"
                                    },
                                    "Description": {
                                        "val": "This activity is aligned with the Sea Strike, Sea Shield, Sea Basing, FORCEnet and the Expeditionary Maneuver Warfare pillars as well as Force Health Protection and Platform Enablers. It provides the capability for the demonstration and transition of technologies developed through the related Marine Corps S&T programs directly to an acquisition program of record.  Littoral Combat\/Power Projection is the Enabling Capability (EC).\n\nThe funding profile reflects the alignment of the FNC program investments into ECs.  Funding for each EC is aligned to a 6.2 or 6.3 Budget Activity (BA) as appropriate.  The focus of the ECs within this PE will be on technology related to Urban, Asymmetric, Littoral and Expeditionary Operations.  The related science and technology development is of the highest importance to Marine Corps operations in Iraq, Afghanistan and the OCO.  Understandably, these Warfighter Capability Gaps are among those highest ranked of the prioritized Capability Gaps (prioritized by the OPNAV and the MCCDC).  The technologies associated with these gaps are being pursued as part of an overall effort that addresses Sea Strike, Sea Shield, Sea Basing and FORCEnet Capability Gaps.  Warfighter Capability Gaps are made up of ECs and supporting products.  This activity includes support to the Urban, Asymmetric Operations-related to EC's for IED's, Modular Scalable Effects Weapons, Advanced Naval Fires Technology, Dynamic Target Engagement, Position Location Information, Transparent Urban Structures, Hostile Fire Detection and Response, Lightweight Protective Systems, and Lightening the Load of Dismounted Combatants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.622"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of improved lightweight computational fire control interface.\ntechnology. (Concurrent funding from PE 0602131M, PE 0602236N, PE 0603236N and PE 0603782N).\n- Continued development of improved fire control systems technologies to Expeditionary Fire Support System artillery and mortar systems (concurrent funding from PE 0602131M and 0602114N. These PEs complete the effort in FY 2010).\n- Continued development of transparent urban structures technologies. (Concurrent funding from PE 0602131M).\n- Continued development of modular scalable effects prototype weapon. (Concurrent funding from PE 0602131M).\n- Continued development of tactical urban breaching technologies.\n- Continued development of counter improvised explosive devices technologies. (Concurrent funding from PE 0602131M).\n- Continued development of individual Warfighter protection technologies. (Concurrent funding in PE 0602131M; funding will also be provided by PE 0603236N in FY 2009).\n- Continued development of advanced survivability and mobility technologies for Marine Corps tactical and combat vehicles. (Concurrent funding in PE 0602131M; funding will also be provided by PE 0603236N in FY 2010).\n- Completed development and transition transparent urban structures technologies which will enable tactical units to detect, classify and discriminate between friendly and enemy personnel in urban structures, and to gather ground data to dynamically develop 3D models to map urban areas using a UAV (Unmanned Air Vehicle)\/UGV (Unmanned Ground Vehicle)-based system. (Concurrent funding provided by PE 0602131M). \n- Completed development of individual warfighter lightweight protective system technologies that will reduce body armor weight, improve survivability and increase the mobility of the warfighter.\n- Initiated development of technologies to lighten the load of warfighters by 1) reducing the weight of and improving the capability of the day\/night weapon sight, 2) eliminating battery incompatibility, and 3) providing Graphical User Interface (GUI-based) software for tradeoff analyses based on Military Operational Posture. (Previous FY10 effort resourced by PE 0602236N and PE 0603236N. Concurrent FY11 funding provided by PE 0602131M and PE 0603236N)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.075"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as complete above. Due to urgent operational needs the development of tactical urban breaching technologies will complete in FY2011 to transition to the Marine Corps System Command SMAW II Rocket Launcher program.  Due to required program necessities resourcing for the development of Modular Scalable Effects Weapons (selectable output weapon) technologies has been realigned to PE 0602114N and 0603114N.\n- Complete development of counter Improvised Explosive Device (IED) technologies. (Concurrent funding in PE 0602131M.)\n- Complete development of advanced survivability and mobility technologies for Marine Corps tactical and combat vehicles.  (Concurrent funding in PE 0602131M and 0603236N).\n- Initiate development of wide area surgical and persistent surveillance technologies. (Concurrent funding in PE 0602271N and PE 0602131M)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.616"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.616"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as completed above.\n- Continue development of technologies to lighten the load of warfighters by 1) reducing the weight of and improving the capability of the day\/night weapon sight, 2) eliminating battery incompatibility, and 3) providing Graphical User Interface (GUI-based) software for tradeoff analyses based on Military Operational Posture. (Concurrent funding provided by PE 0602131M). \n- Continue development of wide area surgical and persistent surveillance technologies. (Concurrent funding in PE 0602131M).\n- Complete development of improved lightweight computational fire control interface technology. \n- Complete development of improved fire control systems technologies to Expeditionary Fire Support System artillery and mortar systems. \n- Complete development of transparent urban structures technologies. \n- Complete development of individual Warfighter protection technologies. \n- Initiate development of precision urban mortar attack technologies in FY11 due to operation contingencies. (Concurrent funding in PE 0602231M).\n- Initiate development of fuel efficient Medium Tactical Vehicle Replacement (MTVR) technologies. (Concurrent funding in PE 0602231M).\n- Initiate development of the Ground Based Air Defense On-the-move high energy laser demonstrator.  (Concurrent funding in PE 0602231M, PE 0602123N and PE 0603123N)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LOGISTICS"
                                    },
                                    "Description": {
                                        "val": "This activity supports Marine Corps Expeditionary Logistics which is the practical discipline and real world application of the deployment, sustainment, reconstitution, and re-deployment of forces engaged in expeditionary operations.  Expeditionary Logistics replaces mass with assured knowledge and speed, is equally capable ashore or afloat in austere environments, and is fully scalable to meet uncertain requirements.  Expeditionary Logistics logically divides into five pillars:  deployment support, force closure, sustainment, reconstitution\/redeployment, and command and control.  These pillars are thoroughly integrated and perpetually related in execution.\n\nThe FY 2011 to FY2012 funding increase results from operational demands to complete development of Marine Corps backpacks designed to minimize injurious peak oscillatory skeletal loading and generate electric power while walking during combat missions.\n\nThe FY 2012 to FY2013 funding decrease the completion of the high priority development of backpacks designed to minimize injurious peak oscillatory skeletal loading and generate electric power while walking."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.639"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued exploring the development of portable fuel cell technologies capable of providing Power in the 100 Watt to 500 Watt power range.\n- Continued efforts to develop a micro turbine generator capable of 100W average power.\n- Continued research into developing a replaceable electrode battery power source that consists of a metallic structure that is consumed during power generation and then easily replaced with a new metallic component that restores a full charge. (Realigned from PE 0602131M).\n- Continued analysis of material alternatives for automated vehicle health monitoring and reporting.\n- Continued development of a backpack that prevents oscillatory and transient peak loading forces from causing skeletal injury while enhancing human mobility with heavy loads.\n- Continued the development and demonstration of advanced materials for corrosion prevention and wear reduction for USMC vehicles and equipment.\n- Completed development of a low-cost, autonomous autogyro aerial logistic delivery system for resupplying small dispersed combat units.  This includes: development of a fluid particle separator for small scale water purification;\ndevelopment of load sharing and energy storage capability for enhancing the efficiency of military power generators;  and development of a Modular Composite Bridging demonstration based on prior applied research success.\n- Completed technology demonstration of a full scale bridge constructed from lightweight versatile modular composite components.\n- Initiated development of advanced lightweight fuel to energy conversion concepts.  This includes development of power management electronics for reducing power requirements for military radios."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as completed above.\n- Initiate demonstration of advanced concepts for mobile infrastructure.\n- Complete development of backpacks designed to minimize injurious peak oscillatory skeletal loading and generate electric power while walking. Narrative Clarification: This effort was planned for completion in FY 2011 but was delayed due to technical challenges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.211"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.211"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as completed above. \n- Complete the development and demonstration of advanced materials for corrosion prevention and wear reduction for USMC vehicles and equipment. \n- Initiate integration and demonstration of electrochemical ultracapacitors into hybrid electric power systems. \n- Initiate efforts to improve advanced electrical power generation from fuel cells and renewable sources as well as to improve the efficiency of conventional generation via hybridization and smart-grid technologies.\n- Initiate integration and demonstration of advanced materials to reduce maintenance into selected vehicle and machinery components.\n- Initiate the development of robotic systems to facilitate the packaging and handling of logistic supplies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANEUVER"
                                    },
                                    "Description": {
                                        "val": "The Maneuver Thrust Technology Area focuses on the development, demonstration, and transition of technologies that will increase the warfighting capabilities and effectiveness of current and future Marine Corps maneuver systems.  This Thrust aims at capturing emerging and \"leap ahead\" technologies in the areas of mobility, materials, propulsion, survivability, durability, signature reduction, modularity, and unmanned systems.  Beginning in FY 2009, Mine Countermeasures (MCM) efforts are funded under the Force Protection activity.  Presently, MCM supports and enhances the maneuver and force protection Marine landing forces with the development of technologies to enable detection, neutralization, breaching, and clearing of mines, Improvised Explosive Devices (IEDs), and unexploded ordnance from the beach exit to inland objectives.  MAGTF MCM is a functional component of Naval Expeditionary Maneuver Warfare and includes Ship to Objective Maneuver (STOM), Expeditionary Operations from a Sea Base, sustained Operations Ashore, Urban and Asymmetric Operations, and OOTW.\n\n\nThe FY 2011 to FY 2012 increase in funding is to due to plans to initiate programs to address and enhance maneuver capability gaps in mobility aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.778"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Advanced Electromagnetic Armor technology development efforts.\n- Continued development of fuel efficiency and battlefield power systems for improved performance.\n- Continued development of a Combat S&T Vehicle demonstrator to enhance crew survivability and vehicle fuel efficiency.\n- Continued survivability improvements and technologies to mitigate acceleration and traumatic brain injuries to occupants to enhance tactical mobility and survivability.\n- Continued advanced suspension systems development with ride height adjustment, ride quality adjustment, rollover prevention, and load equalizing systems for USMC tactical wheeled platforms to enhance tactical mobility in support of Distributed Operations\n- Continued a Survivability\/ Active Protection Systems Improvement effort to increase effectiveness of defeat (Pdefeat) of shoulder launched RPG type threats and ATGM threats on light platforms utilizing non-kinetic kill technologies.\n- Continued new mobility efforts for On-Board Vehicle Power to increase mobile exportable power for Diesel Electric Propulsion Concepts and a Fuels effort to investigate future fuel alternatives for internal combustion engines to include Fischer-Tropsch and coal gasification processes for use in military tactical wheeled vehicles.\n- Continued Maneuver Enabling Technologies such as Vehicle Stabilization to improve vehicle suspension and control technologies to stabilize the platforms themselves to improve ride quality, shoot on the move capability and human systems integration.\n- Continued studies to identify technology development plans to close identified force protection capability gaps.\n- Continued a Vehicle Demonstrator program to design and fabricate an Integrated Power Demonstrator platform capable of producing the power needs for mobility and survivability concept demonstrations.\n- Continued efforts to evaluate current ground fleet platforms for their mobility and control capabilities as they relate to potential inclusion of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Completed development of a test bed to demonstrate advanced survivability concepts.\n- Initiated efforts to demonstrate Integrated Armor Solutions that provide lighter weight armor materials with enhanced protection to vehicle occupants thereby enhancing tactical Mobility and Survivability in support of Distributed Operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.625"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011.\n- Initiate programs to address and enhance maneuver capability gaps in mobility such as efforts, transitioned from 6.2, aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.468"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.468"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this PE is the development of technologies to meet unique Marine Corps needs in conducting Expeditionary Maneuver Warfare.  The program consists of a collection of projects categorized by critical warfighting function.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2297"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps Warfighting Lab - Core"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "35.522"
                        },
                        "CurrentYear": {
                            "val": "40.245"
                        },
                        "BudgetYearOne": {
                            "val": "43.460"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.460"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "44.065"
                        },
                        "BudgetYearThree": {
                            "val": "45.011"
                        },
                        "BudgetYearFour": {
                            "val": "45.821"
                        },
                        "BudgetYearFive": {
                            "val": "46.725"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Marine Corps Warfighting Laboratory (MCWL) examines lessons learned from current operations, explores emerging threats and opportunities, and explores Joint and emerging service concepts through concept-based experimentation in order to enhance current and future warfighting capabilities.  MCWL conducts service experiments, service experiments in a joint force context, and participates in joint experimentation, using manual wargaming methods, modeling and simulation (M&S) supported virtual\/constructive methods, and through live force experiments.\n\nManual wargames are conducted to initially frame emerging warfighting concepts, establish the Joint context for Marine Corps Expeditionary Force Development System process, and establish priorities for development of experimental and non-experimental capabilities.\n\nM&S based events allow MCWL to examine capabilities with larger scale venues and forces than is practical with live forces at lower cost in terms of funding and in terms of operating force personnel and equipment.  M&S also enables assessment of proposed capabilities before making investments in costly concept demonstrator technologies required in live force experiments. \n\nLive force experimentation permits exploration of prototype and surrogate technologies, as well as Tactics, Techniques, and Procedures (TTPs), in order to better refine equipment requirements and to identify Doctrine, Organization, Training, Materiel, Leadership, Personnel, and Facilities (DOTMLPF) initiatives needed to produce future capabilities.  Experimentation encompasses inquiries into multiple warfighting areas, including:  Combat Service Support (CSS) and Force Protection; Command, Control, Communications, and Computers (C4); Intelligence, Surveillance, and Reconnaissance (ISR); Fires, Targeting, and Maneuver; and Warfighting Excellence.\n\nUsing operational forces, MCWL conducts Advanced Warfighting Experiments (AWEs) supported by Limited Objective Experiments (LOEs), Limited Technical Assessments (LTAs), Wargames, and Studies.  These events are planned and scheduled as part of a series of experimentation campaigns focusing on one or more central warfighting concepts.  These campaigns are executed under the guidance of the Commandant of the Marine Corps (CMC) and under the auspices of the Deputy Commandant of the Marine Corps for Combat Development and Integration (D\/C CD&I).\n\nThe current MCWL Experiment Campaign Plan is focused on the challenges associated with the Enhanced Marine Air-Ground Task Force (MAGTF) Operations (EMO), Ship-To Objective Maneuver (STOM) and Seabasing concepts.  This campaign began in FY 2011 and is forecasted to culminate with an AWE in 2015.  EMO experimentation seeks to capitalize on the enhancements achieved during the previous MCWL campaign, Enhanced Company Operations (ECO), completed in FY 2010 which centered on expanding the combat capabilities of the Marine Infantry Company.  EMO experimentation examines and develops the capabilities of other elements of the MAGTF beyond the infantry company.  Focus areas for this effort are logistics, command and control (C2), and fires, targeting, and maneuver.  During FY 2010, the Commandant of the Marine Corps (CMC) designated MCWL as the lead agency for all United States Marine Corps (USMC) Counter Improvised Explosive Device (CIED) activities, thereby expending MCWL's responsibilities in this critical area.  Additionally, MCWL will continue to support the immediate needs of deployed forces and exploit opportunities presented by promising emerging technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMBAT SERVICE SUPPORT (CSS) AND FORCE PROTECTION"
                                    },
                                    "Description": {
                                        "val": "This activity includes MCWL CSS and force protection experimentation efforts including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced capabilities.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. \n\nFY 2012 and beyond funding provided for MCWL specific\/USMC centric Defense Advanced Research Projects Agency (DARPA)-legged robot program efforts was realigned from Warfighting Excellence to CSS and Force Protection.\n\nThe increase in MCWL CSS and Force Protection activity funding from FY 2011 to FY 2012 is due to larger investments in the MCWL specific DARPA-legged robot and the sustainment of tactical level units from the sea-base efforts.  \n\nThe increase from FY 2012 to FY 2013 is also due to costs related to the DARPA-legged robot effort as well as increased investment in technologies that reduce the demand required to support the MAGTF, such as Adaptive Logistics pursuits."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.771"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to develop and experiment with bio-science (medical) technologies.\n- Continued assessment of unmanned ground logistics delivery technologies that support infantry small unit operations.\n- Continued assessment of technologies for of tactical level units from the sea-base.\n- Continued new investigations into point-of-wound stabilization and emerging technologies that support casualty evacuation (CASEVAC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.389"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011.\n- Complete investigations into point-of-wound stabilization and emerging technologies that support CASEVAC.\n- Initiate research and assessment of technologies that reduce the demand required to support the MAGTF.\n- Initiate development, and test unmanned versions of current cargo vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all effort of FY 2012, less those noted as complete above. \n- Continue research and assessment of technologies that reduce the demand required to support the MAGTF by completing development and assessment of a Marine Corps version of an Adaptive Logistics System as an operational as well as tactical level logistics decision support tool."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "COMMAND, CONTROL, COMMUNICATIONS, COMPUTERS (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity encompasses all MCWL C4 related experimentation efforts including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced C4 capabilities.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. \n\nThe increase in MCWL C4 activity funding from FY 2011 to FY 2012 is due to the assessment of enhanced Marine Air-Ground Task Force (MAGTF) communications concept demonstrators and the initiation of the development of the Internally Transportable Vehicle (ITV) based C4 concept demonstrator.  The investigation and assessment of a MAGTF Command and Control (C2) architecture and an integrated C2 application in support of the Enhanced MAGTF Operations (EMO) concept also initiate in FY 2012. \n\nThe decrease in MCWL C4 activity funding from FY 2012 to FY 2013 is due to cost savings encountered by being able to adapt many Enhanced Combat Operations (ECO) technologies to different\/larger EMO venues being purused by MCWL in the C4 arena."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.254"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued C4 extended user assessments of selected prototype technologies in support of forces engaged in Operation Enduring Freedom (OEF) and Operation Iraqi Freedom (OIF).\n- Completed experimentation of concept demonstrators to support company and below alternative C2 architectures.\n- Completed assessment of network management systems for Capability Set (CAPSET) V (all C2 below Battalion) networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as complete above. \n- Initiate assessment of enhanced MAGTF communications concept demonstrators.\n- Initiate development and assessment of Internally Transportable Vehicle (ITV) based C4 concept demonstrator.\n- Initiate investigation and assessment of a MAGTF C2 architecture and an integrated C2 application in support of the EMO concept.\n- Initiate development and assessment of a MAGTF network management system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.697"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.697"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIRES, TARGETING, AND MANEUVER"
                                    },
                                    "Description": {
                                        "val": "This activity includes MCWL experimentation efforts in the areas of fires, targeting, and maneuver including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced capabilities.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. \n\nThe increase in MCWL Fires, Targeting, and Maneuver activity funding from FY 2011 to FY 2012 is due to the development and testing of concept demonstrator technologies for enhanced fire support and fire support coordination.  The increase from FY 2012 to FY 2013 is due to the continuation of small unit precision munitions\/loitering weapons\/armed Unmanned Aerial System (UAS) efforts; as well as the pursuit of investigations into weaponized unmanned ground robotic systems, vehicle mounted hostile indirect-fire detection systems, and networked target information efforts.\n\nThe increase in MCWL Fires, Targeting, and Maneuver activity funding from FY 2012 to FY 2013 is due to the continuation of small unit precision munitions\/loitering weapons\/armed Unmanned Aerial System (UAS) effort; as well as the pursuit of investigations into weaponized unmanned ground robotic systems, vehicle mounted hostile indirect-fire detection systems, and networked target information efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.604"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued assessment of small unit precision munitions\/loitering weapons\/armed Unmanned Aerial System (UAS) concept demonstrators.\n- Continued assessment of concept demonstrator precision targeting devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.811"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2011, less those noted as complete above.\n- Initiate investigation, development, and testing of concept demonstrator technologies and TTPs for enhanced fire support and fire support coordination associated with the EMO concept.\n- Initiate development and assessment of weaponized unmanned ground robotic systems.  \n- Initiate development and testing of Networked Target information that allows the MAGTF to share targeting images generated by armored vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.980"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.980"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2012.\n- Continue investigation, development, and testing of concept demonstrator technologies and TTPs for enhanced fire support by pursuing development and testing of a vehicle mounted hostile indirect-fire detection system.  \n- Complete assessment of concept demonstrator precision targeting devices.\n- Complete development and assessment of weaponized unmanned ground robotic systems.\n- Complete development and testing of Networked Target information that allows the MAGTF to share targeting images generated by armored vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INTELLIGENCE, SURVEILLANCE, AND RECONNAISSANCE (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity includes MCWL ISR related experimentation efforts including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced ISR capabilities.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. \n\nThe decrease in MCWL ISR activity funding from FY 2012 to FY 2013 is due to the termination of UAS Research Surrogate payload and TTP efforts; and the earlier than anticipated completion of small infantry unit UGV, UAS, and unattended ground sensor employment methods as well as integrated company level C4 ISR network assessments.  In addition, the micro UAS platform planned for use in the perch and stare capability investigations is no longer available for experimentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.842"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued additional IED investigations into promising detect and neutralize technologies.\n- Continued efforts to develop TTPs required for small infantry units to employ UGVs, UASs, and unattended ground sensors.\n- Continued assessment of integrated company level C4 ISR network.\n- Continued investigations into rotary wing\/hovering tactical level UAS concept demonstrators.\n- Completed experimentation with TTPs and payloads for a Research Surrogate (formerly referred to as Tier II) UAS concept demonstrator to provide persistent ISR at regimental and battalion levels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.842"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011, less those noted as complete above. \n- Complete efforts to develop TTPs required for small infantry units to employ UGVs, UASs, and unattended ground sensors.\n- Complete assessment of integrated company level C4 ISR network.\n- Complete investigations into rotary wing\/hovering tactical level UAS concept demonstrators. \n- Initiate and complete experimentation with sensors tailored to the requirements of a Combat Logistics Patrol."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.954"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.954"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as complete above.\n- Initiate the development and testing of a common tactical Radio Frequency (RF) communications module that operates all USMC Group 1 unmanned systems.\n- Initiate assessment of integrated MAGTF level C4 ISR network in support of EMO efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE CORPS WARFIGHTING LABORATORY (MCWL) OPERATIONS (SUPPORT)"
                                    },
                                    "Description": {
                                        "val": "MCWL Operations (Support) efforts include overall MCWL experimentation doctrine, planning, analysis, data collection, as well as technology transition tracking efforts.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.391"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to synthesize results and lessons learned into proposed DOTMLPF recommendations for the Marine Corps.\n- Continued to provide technical, strategic, and managerial support to Marine Corps experimentation.\n- Continued to provide overall analysis and reporting of experimentation efforts, analytical assistance during experiment design, and maintenance of an ad-hoc analysis capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.366"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.798"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.798"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WARFIGHTING EXCELLENCE"
                                    },
                                    "Description": {
                                        "val": "This activity includes MCWL efforts in the development and assessment of joint and service warfighting concepts, joint and service missions, analysis of emerging threats and opportunities, and joint capability experimentation.  It also includes MCWL service experimentation in areas that impact multiple warfighting functions.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near-real-time operational impact. \n\nFY 2012 and beyond funding for DARPA-legged robot program was realigned from Warfighting Excellence to CSS and Force Protection. \n\nThe increase in MCWL Warfighting Excellence activity funding from FY 2012 to FY 2013 is due to increased focus on modeling and simulation based training, to include investment into improving Wargaming abilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.660"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued executive agent responsibilities for Joint Title X programs, such as Unified Quest, Unified Course, and Unified Engagement. Title X war games address future capabilities in the context of Title X readiness responsibilities.\n- Continued management and oversight of non-Title X Wargaming, including the highly visible Office of the Secretary of Defense Net Assessment Transformation War Game series and the Special Operations Command wargaming series.\n- Continued to support the Center for Emerging Threats and Opportunities (CETO) mission: 1) prevent operational and tactical surprises to senior Warfighting Commanders by assessing future security environments in light of emerging threats and potential conceptual and technological opportunities; 2) help focus science, technology, and experimental efforts by appraising promising concepts and technologies; 3) serve as a catalyst to stimulate thought and debate on issues of importance to the Marine Corps.\n- Continued funding contributions to Joint Concept Technology Demonstrations (JCTDs) and Advanced Concept Technology Demonstrations (ACTDs). Both JCTDs and ACTDs are intended to rapidly field needed capabilities by using emergent mature technologies matched with innovative operational concepts.\n- Continued experimentation of simulation based training technologies to enhance individual and small unit combat task proficiency and decision making. \n- Continued a MCWL-DARPA partnership for the development and demonstration of a MCWL centric legged robot in an effort to \"Lighten the Load\" of individual Marines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.937"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2011."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.782"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.782"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this PE is the development of technologies to meet unique Marine Corps needs in conducting Expeditionary Maneuver Warfare. The program consists of a collection of projects categorized by critical warfighting function. Individual project metrics reflect the technical goals of each specific project. Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                }
            ]
        }
    }
}