{
    "id": "b2b2902f19c5402ebe5010aa7f0ea95f192f214a",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603711D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Robotics Program\/Autonomous Systems"
        },
        "R1LineItemNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.567"
            },
            "CurrentYear": {
                "val": "9.516"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program supports the technology development activities of the Joint Ground Robotics Enterprise (JGRE) with a focus on the development of subsystems and components, and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in simulated environments. Projects deliver advanced technology with direct relevance to enhancing warfighters' capabilities that have been identified during operational assessments and field feedback of current unmanned systems.  By exercising its oversight role through a Technology Advisory Board, O-6 Council and Senior Steering Group (Flag level), Joint Ground Robotics applies this program to enable coordination between the Services and places emphasis on interoperability and commonality among unmanned ground systems.  The primary purpose of this program is to support efforts to overcome technology barriers in the thrust areas of unmanned ground system technologies to include Autonomous & Tactical Behaviors, Manipulation Technologies, Collaborative Operations, Interoperability, Man-portable Unmanned Ground Systems, and Technology Transition\/Transformation.  Development and integration of technologies within the thrust areas of unmanned ground system technologies will expedite technology transition from the laboratory to operational use.  The technologies are generally at Technology Readiness Levels (TRL) of three or four with the intent to mature them through JGRE efforts to TRL six."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.843"
                },
                "CurrentYear": {
                    "val": "9.756"
                },
                "BudgetYearOne": {
                    "val": "10.071"
                },
                "BudgetYearOneBase": {
                    "val": "10.071"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.567"
                },
                "CurrentYear": {
                    "val": "9.516"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.276"
                },
                "CurrentYear": {
                    "val": "-0.240"
                },
                "BudgetYearOne": {
                    "val": "-10.071"
                },
                "BudgetYearOneBase": {
                    "val": "-10.071"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.190"
                    },
                    "CurrentYear": {
                        "val": "-0.175"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.033"
                                },
                                "CurrentYear": {
                                    "val": "-0.065"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Section 8117 - Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.051"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOne": {
                                    "val": "-10.071"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.071"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P710"
                    },
                    "ProjectTitle": {
                        "val": "Joint Robotics Program\/Autonomous Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.567"
                        },
                        "CurrentYear": {
                            "val": "9.516"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Joint Robotics Program\/Autonomous Systems program supports the technology development activities of the Joint Ground Robotics Enterprise (JGRE) with a focus on the development of subsystems and components, and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in simulated environments. Projects deliver advanced technology with direct relevance to enhancing war fighters' capabilities that have been identified during operational assessments and field feedback of current unmanned systems.  By exercising its oversight role through a Technology Advisory Board, O-6 Council and Senior Steering Group (Flag level), Joint Ground Robotics applies this program to enable coordination between the Services and places emphasis on interoperability and commonality among unmanned ground systems.  The primary purpose of this program is to support efforts to overcome technology barriers in the thrust areas of unmanned ground system technologies to include Autonomous & Tactical Behaviors, Manipulation Technologies, Collaborative Operations, Interoperability, Man-portable Unmanned Ground Systems, and Technology Transition\/Transformation.  Development and integration of technologies within the thrust areas of unmanned ground system technologies will expedite technology transition from the laboratory to operational use.  The technologies are generally at Technology Readiness Levels (TRL) of three or four with the intent to mature them through JGRE efforts to TRL six."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Command, Communication & Control"
                                    },
                                    "Description": {
                                        "val": "Development of data delivery, control and display, or task execution technologies which will enhance unmanned ground vehicle operations, reduce operator loads and improve effectiveness.  Development and integration of communication, mission planning, human-robot interface technologies, and advanced intelligence capabilities to support robotic operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.791"
                                            },
                                            "Text": {
                                                "val": "1)  Natural Human Robot Interface - This effort involves the development of a natural human-robot interface that eliminates the need for bulky platform-specific controllers (OCUs) that are operator intensive, with minimal dependence upon robot-specific hardware.  The Natural Human-Robot Interface (HNRI) can control both a mobile platform and one or more highly dexterous (six plus DOF) manipulators.  This project is expected to start in FY 2012.\n2)  Distributed Control & Data for Small Unmanned Ground Vehicles - Distributed control and data sharing for EOD small UGVs will increase capabilities of EOD technicians during tactical operations.  The majority of EOD missions require two EOD technicians to safely and effectively carryout tactical procedures.  One of the EOD technicians operates the UGV, while the other technician (the lookout EOD technician) observes the mission from over the shoulder of the UGV operator.  The distributed control and information capability will provide the lookout EOD technician with independent control and data from the UGV visual sensors.  This capability will reduce time on target and increase mission effectiveness by evenly distributing tactical tasks between the EOD team members.  This project is expected to start in FY 2012.\n3)  Non-Radio Frequency (RF) Communication for Small Unmanned Ground Vehicles - This project will research, develop, and evaluate alternative methods to RF communications small UGV.\n     -  Completed Interrogator Fabrication\n     -  Completed Interrogator field tests\n     -  Completed Interrogator Demonstrations\n     -  Completed Modulating Retro-Reflector Fabrication\n     -  Finalized Pod Relay Fabrication\n     -  Finalized Pod Relay Mount Fabrication\n     -  Held System Demonstration and Delivery"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.118"
                                            },
                                            "Text": {
                                                "val": "1)  Natural Human Robot Interface\n     -  Track technologies will be combined with state-variable information describing the mission to determine the proper supporting behavior for the robot under    the current conditions, somewhat analogous to the synergistic interaction of a hunter and a bird-dog\n     -  A non-obtrusive human-robot interface will be developed that will allow the Warfighter to employ the same equipment currently used to communicate with other Warfighters in order to interact with the UGV to supervise or modify its behavior if needed, thus obviating the need for a dedicated OCU\n2)  Distributed Control & Data for Small Unmanned Ground Vehicles\n      -  Investigate and develop distributed control system"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Natural Human Robot Interface\n     -  Platform demonstrations and final report will be completed\n2)  Distributed Control & Data for Small Unmanned Ground Vehicles\n     -  Technology Demonstration and assessments will be performed to examine technology in operational environment"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Interoperability"
                                    },
                                    "Description": {
                                        "val": "Promote and guide technology development to meet joint requirements and promote ground as well as air unmanned systems interoperability.  Support the bridging of currently incompatible robots and controllers from various manufacturers, using different communications channels and hardware.  Optimize best features of prior\/ongoing research efforts into a maturing, standardized system that can be easily ported to robotic platforms used throughout the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.857"
                                            },
                                            "Text": {
                                                "val": "1)  Interoperability Profiles - Development of a set of interoperability profile documents based on SAE AS 4.0 messages, open standards and interfaces for platforms, payloads, control, and communications data links along with video\/audio standards.  The immediate need for more complex systems such as unmanned Applique Kit(s) that can turn systems designed to function with soldiers at specific control stations into unmanned systems, and the desire for more autonomy in general will require IOP documents to be more complex with more variable solutions. \n     -  Conducted Architecture Trade Studies\n     -  Developed and staffed Interoperability Profiles guidance document\n     -  Create Robotic System Integration Lab and Virtual System Integration Lab Validation Plan\n     -  Analyzed Robotic Operating System and Joint Architecture for Unmanned Systems\n     -  Conducted meeting with NATO Industrial Advisory Group Study Group\n     -  Publish Interoperability Profile\n     -  Conducted Robotic System Integration Lab and Virtual System Integration Lab Validation\n     -  Delivered Robotic System Integration Lab and Virtual System Integration Lab Validation Report"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Interoperability Profiles\n      -  Extend IOP V0 to autonomous systems, specifically those with Applique Kits"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Interoperability Profiles\n      -  Develop testing capability\/environment associated with the IOPs for autonomous systems \n      -  Verify test environment\/procedures, an Applique Kit prototype solution will be provided and tested"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manipulation"
                                    },
                                    "Description": {
                                        "val": "Incorporation of new or existing technologies to enable a greater range of robotic manipulation, support the development of mobile manipulation, and improve manipulator performance.  Development of these technologies will enable unmanned systems to conduct highly dexterous tasks that today are accomplished manually, but currently place war fighters in extremely vulnerable and dangerous situations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.706"
                                            },
                                            "Text": {
                                                "val": "1)  Highly Dexterous Manipulators for Explosive Ordnance Disposal Robots - The purpose of this project is to develop a Highly Dexterous Manipulator that approaches the dexterity of a human and is targeted for use on a small EOD UGV with a total vehicle weight (including the manipulator) of 164 pounds.  The manipulator is to be capable of performing bimanual tasks as required in the Capability Development Document (CDD) for Advanced Explosive Ordnance Disposal Robotic System (AEODRS).  The direct benefit to the Warfighter is increased performance and capability over the current state-of-the-art which will translate into reduced mission time.\n     -  Dexterous heavy lift hardware and technical documentation package\n     -  Feed-forward controls development\n     -  Human-machine interfaces phase 1 development and report\n     -  End effector interface family technical data package and hardware\n     -  Human-machine interface phase II development and report\n     -  Operator haptic interface\n     -  System integration and testing\n2)  Modular Point to Manipulate - Robot manipulators on current configured EOD robots are predominately controlled one joint at a time.  This type of control makes it difficult for the robot operator to precisely control the position of the manipulator, increasing operator workload and the time it takes to complete the EOD ssion.  In order to assist the robot operator in performing manipulation tasks, point to manipulate technology will be developed.  With point to manipulate technology, the robot operator simply identifies an object within a video feed on the control unit, and the manipulator automatically moves into position for further inspection and manipulation.  The design of the point to manipulate technology, both hardware and software, will focus on a modular design that can be easily ported to different robot platforms with different manipulators.  The design will also focus on providing a compact and lightweight package using low-cost parts, such that even inexpensive lightweight platforms can benefit from the technology.  This project is expected to start in FY2012.\n3)  On-Board Shock Tube Dispenser - The purpose of this effort is to develop an On-Board Shock Tube Dispenser (ORSTD) for robotic platforms that allows for greater maneuverability of the platform, a reduction of the operator’s time on target, more inclusive searches of the target area, and a reduction in the amount of shock tube that must be transported.  The ORSTD will allow the robot operator the flexibility to stage a counter charge on-board the MTRS prior to proceeding down range initially making more efficient use of the on-board firing circuit, and would not require the robot to be tethered to the command post.  The ORSTD would provide a reusable spool for shock tube that would enable connection of counter charges to the on-board robot firing system, a designated payload area to carry the counter charge reachable by the robot manipulator, and an automatic cutter for separating the robot from the shock tube once the charge has been initiated.\n      -  Stakeholder requirement documentation\n      -  Developmental technical data package delivery\n      -  TRL six prototype\n      -  Developmental test and report\n      -  Technology demonstration\n      -  Transition plan"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.720"
                                            },
                                            "Text": {
                                                "val": "1)  Highly Dexterous Manipulators for Explosive Ordnance Disposal Robots\n      -  Development and complete integration of Haptic feedback\n      -  System integration (arm, end effector interface and end effector) and system testing\n      -  Dexterous hardware support\n2)  Modular Point to Manipulate\n      -  Integration of the hardware onto representative EOD UGVs in a modular way that does not rely heavily on precise, manipulator-specific calibration or hard-coded algorithms"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Projects for this area will be determined by 4Q FY 2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission\/Platform Specific"
                                    },
                                    "Description": {
                                        "val": "Development of a technology to address the requirements of a particular mission or to be integrated with a specific platform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.610"
                                            },
                                            "Text": {
                                                "val": "1)  Robotic Range Clearance Competition \n      - Conduct research and experiments to develop, design, and support a robotic vegetation clearance competition. \n      -  Purchase necessary equipment to support experimental activities for the vegetation clearance competition design.\n      -  Completed Environmental Assessment\n      -  Finalized Rules and Metrics for the Competition\n      -  Held In Progress Reviews with competitor teams\n      -  Final Competition held in Guernsey, Wyoming\n      -  Complete report on the competition and filed with Congress\n2)  Counter Tunnel Exploitation\/Mapping - The scope of this effort is to develop and demonstrate robotic system technologies that will enable insertion of a robotic \nsystem through a small bore hole into a suspect tunnel cavity for the purpose of conducting precision mapping and characterization operations in the austere \ntunnel environments (hand-dug border tunnels, caves, etc.).  \n      -  Finalized and delivered snakebot platform\n      -  Started development with sensor suite for the platform\n      -  Continued development of the Bore Hole Support Apparatus"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.620"
                                            },
                                            "Text": {
                                                "val": "1)  Counter Tunnel Exploitation\/Mapping\n      -  Develop Autonomy Architecture\n      -  Develop 3D Mapping Capability\n      -  Integrate first generation Sensor Suite \n      -  Miniaturize Sensor Suite\n      -  Conduct experiments of the Bore hole apparatus and the snakebot"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Counter Tunnel Exploitation\/Mapping\n      -  Integrate sensor suite onto the platform\n      -  Conduct user assessment of the system\n      -  Finalize report on system progress and development\n2)  Other projects for this area will be determined by 4Q FY 2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navigation"
                                    },
                                    "Description": {
                                        "val": "Development of reliable motion planning, path planning, obstacle detection\/obstacle avoidance, characterization, and decision analysis capabilities based on the perceived environment and specific missions outlined for the robot."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Autonomous Mobility Applique System Joint Capability Technology Demonstration - To mitigate risks associated with current and future expected threat environments, the US Army is investigating the possibility of integrating multi-levels of robotic technology into the existing manned fleet through the deployment of an Autonomous Mobility Appliqué System (AMAS).  This project is expected to start in FY 2012."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.420"
                                            },
                                            "Text": {
                                                "val": "1)  Autonomous Mobility Applique System Joint Capability Technology Demonstration\n      -  Provide scalable autonomy in a single material solution agnostic of vehicle platform\n      -  Comprised of two kits: (1) an Autonomy Kit and (2) a By-wire kit. The Autonomy Kit will include the intelligence, sensing, and control capabilities necessary for semi-autonomous behaviors\n      -  Enable scalable autonomy through incorporation of a flexible open framework with defined interfaces \n      -  Provide an A kit that will provide scalable autonomy and be transferable between platforms with minimum modification and configuration enabling a single point solution for existing manned vehicle fleet"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Projects for this area will be determined by 4Q FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Outreach & Harmonization"
                                    },
                                    "Description": {
                                        "val": "Promote and guide technology development and demonstration through joint requirements with DoD entities, United States government agencies and other civilian organizations to promote the proliferation of ground robotic vehicle capability understanding."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.603"
                                            },
                                            "Text": {
                                                "val": "1)  University Support and Outreach - This project provides support to develop our future engineers in the field of robotics at Universities through two separate events\/avenues.  Support to the Intelligent Ground Vehicle Competition allows the event to take place each year up at Oakland University in Rochester Michigan. \nDesign and construction of an Intelligent Vehicle fits well in a two semester senior year design capstone course, or an extracurricular activity earning design credit. The deadline of an end-of-term competition is a real-world constraint that includes the excitement of potential winning recognition and financial gain. \nSupport to the United States Air Force Academy allows a senior design team to work on systems designed to fulfill the anti-tunnel capability by performing ISR in cave environments where weapons and\/or high value targets are located.  The project employs five to ten cadets from USAFA, graduate student(s) (likely from the \nUniversity of Texas (UT) at Austin), faculty advisors from both USAFA and other universities, as well as engineering mentors\/sponsors.  Execution of the project design effort involves creative and well established engineering design methods used in both education and industry.  A specific focus for this project is to \ninvestigate creative design solutions that have not been previously used.\n      -  Supported the Intelligent Ground Vehicle Competition and provided judging for the Joint Architecture for Unmanned Systems challenge as well as the autonomy challenge.\n2)  SBIR Fast Track - Current cargo pallet on-load\/off-load operations are rate-limited by availability of manpower and pallet handling equipment at both garrison and contingency airbases. As such, steps to move to an automated cargo handling system are necessary.\n      -  Fabricated and built a prototype system, and demonstrated requirements of objective and description above\n      -  Developed Engineering Design Package\n      -  Developed a plan for system demonstration\n      -  Conducted system demonstration\n      -  Prepared demonstration report \n3)  Cost Benefit Analysis - This study will provide the Department of Defense with an independent cost benefit assessment of the potential effects that robotic systems could have on force structure, focusing on manpower savings within several yet to be determined mission areas (logistics, convoy operations, demining efforts, combat operations, etc).  It is expected to start in FY 2012.\n4)  Test & Evaluation - As more and more Unmanned Ground Systems needs are being determined the number of programs of record for UGVs is increasing.  An issue that has been encountered across the UGV community is the minimal capabilities that the test community currently has for testing and certifying safety for these systems.  This effort will help to determine what the current capability gaps are and where the T&E community needs to invest resources to fill those gaps.  This effort is expected to start in FY 2012."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.470"
                                            },
                                            "Text": {
                                                "val": "1)  University Support and Outreach \n      -  Continue to support and fund both the intelligent ground vehicle competition sponsored by association for unmanned vehicle systems international and the senior capstone program at the United States Air Force Academy\n2)  Cost Benefit Analysis\n      -  Determine the appropriate mission areas for the Cost Benefit Analysis\n      -  Develop a framework for estimating the potential integration of robotic systems\n      -  Analyze the cost-effectiveness and the net benefit of the potential robotic solutions in the selected areas of the framework\n3)  Test & Evaluation\n      -  Through data gathering efforts determine the current capabilities and capability gaps for T&E with regards to UGVs \n      -  Develop methodology to fill the T&E gaps\n      -  Implement test procedures to fill the gaps identified"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Projects for this area will be determined by 4Q FY 2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Perception"
                                    },
                                    "Description": {
                                        "val": "Development of post-processing software technologies (proprioceptive and\/or exetroceptive) which will enhance unmanned ground vehicle perception capabilities for navigation, manipulation, and general unmanned ground vehicle situational awareness in a wide range of environments and conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Adverse Environment Obstacle Detection - Much work has been done to develop the capabilities of UGV perception sensors for autonomous navigation, however the main advancements to date have focused on performance in a clear and unobstructed environment.  While various techniques using multi-sensor \nperception have shown the ability to extend the detection range of static and moving obstacles, in many cases the addition of dust, rain, snow, or fog in the local \nenvironment causes sensor performance degrading or complete failure.  This project will endeavor to answer the questions:  When do perceptual sensors fail, and why?  What combination of sensors would be appropriate for a given operational scenario?  Can perceptual sensor failure be reliably detected and mitigated?  This project is expected to start in FY 2012.\n2)  Real Time Radio Modeling - The goal of the Real Time Radio Modeling for Robotics project for FY 2011 is to integrate and demonstrate the capability to perform tradeoff analysis of different radios and waveform technologies in performance of the tele-operation functionality in a simulated relevant mission environment.\n     -  Integrate PEO-I Communication Effects Server  with Joint Tactical Radio System (JTRS)\n     -  Integrate JTRS with TARDEC Image Generator (IG)\n     -  Integrate JTRS with TARDEC UGV\n     -  Development\/Integration of COFDM:  Qualnet developers from SNT have offered to provide COFDM models.  These models can be updated and integrated into the Qualnet tool as needed to measure their performance on streaming video.  RS JPO is interested in evaluating COFDM performance on streaming         video\n     -  Development of Common Data Link (CDL) Model \n     -  Development of Digital Data Link  (DDL) Model\n     -  COFDM\/CDL\/DDL JTRS Comparison Analysis\n     -  Integration of Building Properties of the systems into the model\n3)  3D Mapping for Off Road Terrain - A real-time (20 Hz or better) 3D mapping and visualization system is needed to realistically field small UGVs that can operate and provide situational awareness in both indoor and outdoor environments. Most 3D mapping solutions for small UGVs are heavily stereo and visual odometry based, which present significant overload for computation and, in some cases, for illumination for nighttime performance.  Therefore, a lidar-based solution is solely proposed here, providing all of the following: \n     -  Day and night capabilities, with significant range in both indoor and outdoor conditions, including off-road environments \n     -  Operate in robust to complex, dynamic environments that are composed of varying objects such as indoor clutter, outdoor vegetation, etc. \n     -  Adaptable to varying 3D sensor fidelity and scalable to varying small UGV configurations \n     -  Output high-resolution 3D data capable of being streamed, rendered, and\/or displayed in real-time within reasonable bandwidth constraints\n     -  Implemented in a modular fashion with government-owned API’s to ensure 3rd party integration and comparison to new algorithms and sensors that become available in the future\n4)  Negative Obstacle Detection - This project will be a focused effort to examine perception requirements and surveying the existing, new, and \"coming soon\" \nsensor systems. Based on that analysis, a development approach will be determined and executed to combine existing sensors, modify existing sensors, or \ndevelop sensors for this specific application. A large part of the project will be in developing the algorithms to fuse and utilize the selected combination of sensor.  This project is expected to start in FY 2012.\n5)  Enhanced Traversability Analysis for Small Unmanned Ground Vehicles - This project will address the difficulty of small UGVs perceiving off-road environments, which inhibit them from reliably navigating in rough, vegetated terrain. A new class of sensors will be used to greatly improve small UGV traversability analysis and terrain classification. This project will fuse this data with camera imagery to provide enhanced information for better terrain classification. Typical obstacle detection\/avoidance will be improved by allowing small UGVs to classify and thus navigate traversable objects, such as grass, brush, and vegetation that would otherwise be perceived as solid objects to avoid completely. The 3D geometry of the terrain can also be better analyzed from a perspective low to the ground, enhancing terrain analysis for off-road path planning.  This project is expected to start in FY 2012."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.297"
                                            },
                                            "Text": {
                                                "val": "1)  Adverse Environment Obstacle Detection\n     -  Preliminary analysis to determine the prime areas of competence of candidate sensor solutions, and the combination of sensors most promising for a set of \n        representative UGV scenarios\n2)  Real Time Radio Modeling\n     -  Integration with Building Properties into the model\n     -  Integration of Building Properties with TARDEC IG\n     -  Integration of Building Properties with TARDEC UGV\n     -  Development of Urban Canyon Models\n     -  Building Clearing\/Urban Canyon Comparison Analysis\n     -  Development of rain, snow, wind, and smoke models\n3)  3D Mapping for Off Road Terrain\n     -  Apply proven 2D mapping capabilities to 3D sensors\n     -  Implement in modular fashion and design well-developed API’s\n     -  Test at both day and night in indoor environments with some clutter and in outdoor, non-planar surfaces.\n4)  Negative Obstacle Detection\n     -  Analyze the perception requirements for negative obstacle detection will be conducted to include\n     -  Conduct survey and analysis of existing solutions\n     -  Develop reference design\n     -  Test and\/or simulate reference design\n5)  Enhanced Traversability Analysis for Small Unmanned Ground Vehicles\n     -  Fuse newely available small, multi-return, 3D lidar data with camera imagery\n     -  Build upon current methods for traversability analysis"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Adverse Environment Obstacle Detection\n     -  Develop the final system involving multi-sensor solutions for obstacle detection in adverse environments\n2)  Real Time Radio Modeling\n     -  Development of rain, snow, wind, and smoke models\n     -  Integration with TARDEC IG\n     -  Integration with TARDEC UGV\n     -  Weather Comparisons Analysis\n3)  3D Mapping for Off Road Terrain\n     -  Develop prototype\n     -  Optimize software\n     -  Extend tests to outdoor off-road terrain\n     -  Develop software solutions to output 3D maps to 3D visualization software\n4)  Negative Obstacle Detection\n     -  Continue to refine design\n     -  Implement design in hardware\n     -  Modify existing sensors suites to meet NOD issues\n     -  Develop data fusion and algorithms for the sensors\n     -  Test design on a midsized UGV over a wide variety of terrains, negative obstacles types and sizes, and vehicle speeds\n5)  Enhanced Traversability Analysis for Small Unmanned Ground Vehicles\n     -  Apply the new sensor data to vegetation classification and 3D geometry of the terrain\n     -  Conduct tests on various small UGV configurations to track robustness and portability to varying platform types"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vision\/Sensors"
                                    },
                                    "Description": {
                                        "val": "Development of technologies (hardware and software) which will enhance unmanned ground vehicle sensory (visual, audible and\/or tactile) capabilities for navigation, manipulation, and general unmanned ground vehicle situational awareness in a wide range of environments and conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  3D Improvised Explosive Device Sweep Detection - This proposed project would use existing 3D sensing techniques and a COTS\/GOTS high degree of freedom manipulator.  The specific technology developed under this effort would be the 3D sweep trajectory generation (using existing 3D sensing techniques) and planning to cover general 3D surfaces while maintaining a sweep profile (speed, surface offset, rate of advance, etc.) that is conducive to optimal sensor performance.  This project would address a currently un-addressed objective requirement of the AMDS program CDD.  This project is expected to start in FY 2012."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.871"
                                            },
                                            "Text": {
                                                "val": "1)  3D Improvised Explosive Device Sweep Detection\n         - Conduct initial trajectory planning work using COTS\/GOTS simulation tools using 3D sensor data from a man-transportable UGV in a relevant environment   within the simulator as well as a kinematically and dynamically correct model of the manipulator and base platform"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  3D Improvised Explosive Device Sweep Detection\n       -  Transition algorithms to real hardware (platform, manipulator, and sensors) \n       -  Develop and capture test plans and performance metrics\n       -  Conduct a HRI study and design will be conducted and implemented for this specific application\n2)  Other projects for this area will be determined by 4Q FY 2012"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "(BA4) PE 0603709D8Z"
                                    },
                                    "Title": {
                                        "val": "Joint Robotics Program"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.522"
                                        },
                                        "CurrentYear": {
                                            "val": "11.129"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA5) PE 0604709D8Z"
                                    },
                                    "Title": {
                                        "val": "Joint Robotics Program"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.763"
                                        },
                                        "CurrentYear": {
                                            "val": "2.782"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1.  Technologies to be funded & developed are reviewed by Capabilitiy Area focused working groups to determine progress, transition plans, and relevance of each project.\n2.  Project plans are submitted, evaluated and analyzed by the Joint Robotics Ground Enterprises management and technical staff for risk and progress.\n3.  Project progress toward goals and milestones is assessed during mid-year and end-of-year reviews.\n4.  Technologies developed by the Joint Robotics Ground Enterprises (JGRE) are tracked and documented using the DOD Technology Readiness Level (TRL) scale for developing TRL three or four technologies to TRL six and adhering to the integrated baselines with regard to cost and schedule."
                        }
                    }
                }
            ]
        }
    }
}