{
    "id": "cd4a619d2868088ddad9f2209b4e0033ef598177",
    "meta": {
        "filename": "dod-2013_RDTE_2013_DARPA_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.zzz_unzipped_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602715E"
        },
        "ProgramElementTitle": {
            "val": "MATERIALS AND BIOLOGICAL TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "278.704"
            },
            "CurrentYear": {
                "val": "219.816"
            },
            "BudgetYearOne": {
                "val": "166.067"
            },
            "BudgetYearOneBase": {
                "val": "166.067"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "191.363"
            },
            "BudgetYearThree": {
                "val": "201.316"
            },
            "BudgetYearFour": {
                "val": "209.963"
            },
            "BudgetYearFive": {
                "val": "221.828"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element is budgeted in the Applied Research Budget Activity because its objective is to develop material, biological and energy technologies that make possible a wide range of new military capabilities.\n\nThe major goal of the Materials Processing Technology project is to develop novel materials, materials processing techniques, mathematical models and fabrication strategies for advanced structural and functional materials and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems.  Included in this project are efforts across a wide range of materials including: structural materials and devices, functional materials and devices, and materials that enable new propulsion concepts for land, sea, and space vehicles and low distortion optical lenses.\n\nThe Biologically Based Materials and Devices project acknowledges the growing and pervasive influence of the biological sciences on the development of new materials, devices and processes, as well as the commensurate influence of materials, physics and chemistry on new approaches to biology and biochemistry.  Contained in this project are thrusts in the application of biomimetic materials and devices for Defense, the development of biochemical materials to maintain performance, the use of biology's unique fabrication capabilities to produce structures that cannot be made any other way, and the development of manufacturing tools that use biological components and processes for material synthesis.  It also supports a major thrust that will revolutionize the development of prosthetics for the wounded soldier.\n\nThe Tactical and Strategic Energy Technology project is focused on the unique challenges facing the DoD in developing and demonstrating advanced power generation and energy storage technologies.  It will address critical military needs for improved energy efficiency and availability to support a range of military missions that include individual warfighter and small unit operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "312.586"
                },
                "CurrentYear": {
                    "val": "237.837"
                },
                "BudgetYearOne": {
                    "val": "253.396"
                },
                "BudgetYearOneBase": {
                    "val": "253.396"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "278.704"
                },
                "CurrentYear": {
                    "val": "219.816"
                },
                "BudgetYearOne": {
                    "val": "166.067"
                },
                "BudgetYearOneBase": {
                    "val": "166.067"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-33.882"
                },
                "CurrentYear": {
                    "val": "-18.021"
                },
                "BudgetYearOne": {
                    "val": "-87.329"
                },
                "BudgetYearOneBase": {
                    "val": "-87.329"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-1.564"
                    },
                    "CurrentYear": {
                        "val": "-3.021"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-5.000"
                    },
                    "CurrentYear": {
                        "val": "-15.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-15.316"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-4.085"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-7.917"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-87.329"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-87.329"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2011: Decrease reflects reductions for the Section 8117 Economic Adjustment, unsustained growth, internal below threshold reprogrammings, rescissions and the SBIR\/STTR transfer. \nFY 2012:  Decrease reflects reductions for excessive growth and Section 8023(f) FFRDC reduction.\nFY 2013:  Decrease reflects the end of energy programs such as Vulcan and Tactical Advanced Power.\n."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MBT-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS PROCESSING TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "166.249"
                        },
                        "CurrentYear": {
                            "val": "107.592"
                        },
                        "BudgetYearOne": {
                            "val": "128.444"
                        },
                        "BudgetYearOneBase": {
                            "val": "128.444"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "145.829"
                        },
                        "BudgetYearThree": {
                            "val": "153.818"
                        },
                        "BudgetYearFour": {
                            "val": "158.114"
                        },
                        "BudgetYearFive": {
                            "val": "171.828"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The major goal of the Materials Processing Technology project is to develop novel materials, materials processing techniques, mathematical models and fabrication strategies for advanced structural and functional materials and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems.  Included in this project are efforts across a wide range of materials including structural materials and devices, functional materials and devices, low distortion optical lenses, and materials that enable new propulsion concepts for land, sea, and space vehicles."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Materials Processing and Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Materials Processing and Manufacturing thrust is exploring new manufacturing and processing approaches that will dramatically lower the cost and decrease the time required to fabricate DoD systems.  It will also develop approaches that yield new materials and materials capabilities that cannot be made through conventional processing approaches as well as address efficient, low-volume manufacturing.  Included are disruptive manufacturing approaches for raw materials and components, advanced carbon fiber material and manufacturable gradient index optics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.034"
                                            },
                                            "Text": {
                                                "val": "-  Initiated carbon nanotube templating as a means of alleviating nano-scale defects and enhancing carbon fiber tensile strength and modulus.\n-  Prioritized graphene plane alignment over cross-planar bonding based on preliminary data for strength\/modulus enhancement.\n-  Started evaluation and testing by Air Force Composites Testing Lab to establish first-generation advanced carbon fiber insertion points within Air Force systems.\n-  Demonstrated successful casting of superalloy turbine blades using ceramic molds made or produced via direct digital manufacturing.\n-  Demonstrated fabrication of large composite wing (at the 50 ft x 10 ft scale) and a complex polymer composite structure using the out-of-the-autoclave process for High Altitude Long Endurance (HALE) prototype aircraft.\n-  Demonstrated gradient index (GRIN) lenses in imaging and non-imaging applications such as a high-resolution imager for solid state-tracking solar concentrator. \n-  Demonstrated expanded range and rate of refractive index gradient through new materials development or processes.\n-  Developed and tested new metrology for GRIN materials and optics.\n-  Produced scale to manufacturing plan including cost model and risk management plan.\n-  Initiated efforts to allow access to and expand the base of manufacturing by establishing centers that enable competition of small firms and non-traditional performers with larger industry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate microstructure\/property\/process relationship needed for overcoming critical defect limitations in carbon fiber performance for structural applications.\n-  Demonstrate carbon fiber with 50 percent improvement in stiffness over today's state-of-the-art high-strength structural carbon fibers.\n-  Establish viability of fiber production process for structural carbon fiber in suitable quantities for small-lot manufacturing.\n-  Develop rapid, robust manufacturing and processing capabilities that result in an expanded base of manufacturing, improved performance, reduced production times, and more affordable manufacturing. \n-  Establish rapid qualification and certification methodologies to enable low-cost, high-confidence prediction of performance in actual manufactured products."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.550"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate carbon fiber with 100 percent improvement in strength and 50 percent improvement in stiffness over today's state-of-the-art high-performance structure carbon fibers, at manufacturing scale.\n-  Develop and demonstrate rapid, robust manufacture processes with an end goal of 20 percent increase in key material properties, 50 percent reduction of cost over baseline, and 50 percent reduction in time over baseline. \n-  Establish impartial manufacturing centers of expertise that provide capability to non-traditional suppliers for demonstration, testing, and qualification of new manufacturing technologies; assist in transition to the supply chain; provide access to potential customers; and facilitate training.\n-  Perform virtual manufacturing system exercises that pass design, manufacture, and verification of a specific part through the entire chain. \n-  Demonstrate rapid qualification and certification methodologies that empirically optimize part qualification and employ probabilistics models for variability analysis and risk, with end goal of 50 percent reduction in certification time and cost."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Structural Materials and Coatings"
                                    },
                                    "Description": {
                                        "val": "The Structural Materials and Coatings thrust is exploring and developing new materials that will provide enhanced structural and\/or surface properties for DoD applications.  Included are approaches that avoid corrosion through engineered material surfaces, provide superior strength at greatly reduced material density, provide the basis for a new generation of structural composite and submarine propeller materials, and enable prolonged lifetimes for DoD systems and components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.369"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated meltless titanium consolidation.\n-  Demonstrated the ability to extrude bulk amorphous aluminum alloy billets from low hydrogen content powder to produce dense billets, while accurately measuring temperature rise due to adiabatic heating.\n-  Fabricated two 24\" by 96\" by 12\" thick multi-material beam manufacturing demonstration articles (approximately 50 percent of the weight with equivalent stiffness of a nickel aluminum bronze (NAB) beam). \n-  Fabricated multi-material panel manufacturing demonstration articles for experimental modal analysis (2x NAB panel performance). \n-  Developed and initiated demonstration of non-destruction evaluation techniques and associated calibration standards to detect all defects greater than 2 inches in diameter in the multi-material structures.\n-  Continued development of the Coupling Software Environment (CSE) including the hybrid multi-material rotor (HMMR) model\/domain code coupling.  Developed a Beta-version of the CSE and initiated evaluation.\n-  Performed a small-scale diagnostic flexible hydrofoil experiment in the 12\" diameter water tunnel (WT) and used the measurement techniques developed to perform the steady flow rigid and flexible hydrofoil benchmark 48\" diameter WT tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate that meltless titanium alloy exhibits properties equivalent to the same conventionally processed alloy.\n-  Demonstrate the use of digital direct manufacturing for bulk amorphous alloys for injection molding dies.\n-  Complete testing of two 24\" x 96\" x 12\" thick multi-material beam manufacturing demonstration articles.\n-  Design, fabricate, and evaluate complex artifacts to determine the ability to adapt multi-material technology to complex geometries including addressing mechanical properties, structural details, modal characteristics, shock, fatigue, and dimensional controls.\n-  Address high-risk aspects of multi-material manufacturing and testing methods to scale-up the manufacturing process to full-scale articles.\n-  Design, fabricate, and test half artifact for experimental modal analysis to measure natural frequencies and mode shapes.\n-  Develop plans and test methods to address critical high-risk structural details of the blade connection methods.\n-  Continue development and initiate verification of the CSE to enable strong coupling of the HMMR domain codes required for time-accurate performance predictions of multi-material rotors.\n-  Initiate development of customizable, adaptive, and self-indicating surfaces by modifying the mechanical, electrical, thermal, and biological interactions of surfaces with their surroundings.\n-  Initiate development of alternative materials to replace environmentally hazardous coatings, such as chromium, currently used to prevent wear and corrosion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete Coupling Software Environment (CSE) development and verification to enable strong coupling of the HMMR domain codes required for time-accurate performance predictions of multi-material rotors.\n-  Complete laboratory demonstrations of materials with superior performance and extended lifetimes due to enhanced surface mechanical characteristics such as wear resistance, fracture toughness, friction, and hardness.\n-  Manufacture and evaluate complex structural test specimens demonstrating ability to design robust products with multi-material technology. \n-  Develop a new class of corrosion-resistant materials for a wide variety of operating environments and environmental interfaces, such as marine\/air exposure. \n-  Utilize the CSE to develop a design for a scaled multi-material propeller or rotor for testing on a large-scale vehicle.\n-  Design full-scale propeller or rotor blades for mechanical evaluations.\n-  Develop manufacturing process plans for large-scale vehicle and full-scale propeller or rotor blades.\n-  Develop integrated and multi-phased sensing techniques for the determination of surface or coating integrity without damaging or removing an in-service part for inspection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multifunctional Materials and Structures"
                                    },
                                    "Description": {
                                        "val": "The Multifunctional Materials and Structures thrust is developing materials and structures that are explicitly tailored for multiple functions and\/or unique mechanical properties.  This thrust also explores novel materials and surfaces that are designed to adapt structural or functional properties to environmental and\/or tactical threat conditions.  Included in this thrust are efforts that will lower the weight and increase the performance of aircraft, enhance the efficiency of turbines, and improve the performance of surface dominated properties (friction, wear, and membrane permeability).  New materials synthesis processes for thin films will also be explored to extend equipment lifetime and reduce logistics costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.941"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated improved ability to fabricate carbon nanotube cold cathodes towards goal of electron emission with high current densities of 50 mA\/cm2 and low voltages at or below 500 V.\n-  Designed and fabricated hardware for cold cathode\/Hall effect thruster integration. \n-  Completed designs for the ability to produce flexible cadmium telluride (CdTe) solar cells with the goal of 10 percent efficiency.\n-  Developed hot target pulsed direct current deposition for web-based manufacturing of CdTe photovoltaics.\n-  Designed and tested new technologies and novel membranes with high flux-transport properties that will desalinate seawater with 3x increase in flux compared to state-of-the-art desalination membranes.\n-  Demonstrated a portable seawater desalination system that provides 30 gph potable output from synthetic seawater while requiring approximately half the energy requirement of existing fielded system.\n-  Demonstrated the proof of concept of a human-powered, lightweight (20 lbs) desalination system with an overall power consumption of less than or equal to 5W\/gph.\n-  Continued developmental activities, including finite element modeling and shake table experiments, to validate the predicted performance of the negative stiffness structural elements for application to aircraft and high-speed maritime platforms.\n-  Initiated the design of an adaptive structural sub-assembly incorporating mechanical programs of tiered, negative-stiffness structural elements; activities included preliminary design and finite element modeling of the sub-assembly being used in the demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Design a man-powered pump to drive a desalination device enabling 75 gph potable output from seawater with an overall power consumption of less than or equal to 5W\/gph.\n-  Finalize the design and test adaptive structural sub-assemblies incorporating tiered negative stiffness structural elements; activities include final design construction and testing of adaptive structural systems.\n-  Complete the development, construction, and testing of an adaptive structural sub-assembly that incorporates mechanical programs of tiered negative stiffness structural elements. \n-  Exploit latest generation laser technology to enable high-temperature chemical reactions at room temperature."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a lightweight (20 lbs) desalination system that provides 75 gph potable output from seawater with an overall power consumption of less than or equal to 5W\/gph.\n-  Establish techniques to create a high flux of gas-phase reactants to a surface at ambient pressure and temperature.\n-  Demonstrate enhanced mobility of reactant molecules on a surface layer for material growth without bulk substrate heating. \n-  Exploit phenomena such as surface plasmon resonances to enable site-specific nucleation and growth of high-temperature coatings at room temperature."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials for Force Protection"
                                    },
                                    "Description": {
                                        "val": "The Materials for Force Protection thrust is developing novel materials and materials systems that will greatly enhance protection against ballistic, blast, and explosively formed projectile threats across the full spectrum of warfighter environments.  Included in this thrust are novel topological concepts as well as entirely new structural designs that will afford enhanced protection and functionality, at reduced weight and\/or cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.966"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated transparent armor based on high purity glass and ceramic formulations capable of achieving multi-hit performance at weights equivalent to that of opaque armor. \n-  Demonstrated durability of enhanced performance transparent armor across required operating temperatures.\n-  Demonstrated, in collaboration with the Army and Marine Corps, enhanced levels of survivability to underbody explosive blast of a lightweight (~17,000 lb) tactical vehicle configuration.  \n-  Demonstrated enhanced performance results from synergistic effects of blast mitigation technologies that include blast gas venting and vehicle cab stiffening from a structural blast channel, underbody shaping, energy absorbing floor, and energy mitigating seats incorporated into an integrated system.\n-  Continued to identify and evaluate promising new armor concepts from non-traditional organizations both for military personnel and vehicles.\n-  Developed candidate concepts to capture kinetic energy from ballistic threats and convert it quickly into a form that can be applied to counteract the same threat.\n-  Initiated characterization of the fundamental mechanisms and properties that control threat energy propagation and material response under dynamic loads across applicable regimes.\n-  Initiated development of physics-based models to explicitly compute dynamic behavior of armor materials to include load paths, critical energy spreading\/dissipation\/conversion mechanisms, and failure modes.\n-  Initiated development of mechanisms that can be incorporated into candidate armor material systems to manipulate ballistic energy to maximize rate of degradation without degrading material strength, at a minimum weight. \n-  Initiated development of mechanisms that can be incorporated into candidate armor material systems that can maximize absorption, diversion, or reflection of blast energy at a minimum weight.\n-  Developed new passive armor solutions that exploit unique high-strength\/polymer composite\/ceramic\/glass hybrid configurations. \n-  Began development of multifunctional passive and active hybrid systems concepts with efficient structural load support capabilities and protection within critical size, weight, and power constraints.\n-  Assessed advanced hybrid composite technologies using low-cost materials and unique material composition and topology for incorporation into explosive reactive armor (ERA), non-explosive reactive armor (NERA), and electromagnetic armor (EMA) systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.538"
                                            },
                                            "Text": {
                                                "val": "-  Extend the multi-hit performance capability of transparent armor at weights equivalent to that of opaque armor and its durability across the range of military operating environments (e.g., temperature, humidity, rock strike). \n-  Continue to identify and evaluate promising new armor concepts from non-traditional organizations both for military personnel and vehicles.\n-  Conduct experimental characterization of candidate energy management integrated into armor materials across stress levels, strain rates, and impulsive loading regimes characteristic of ballistic and blast threat regimes.\n-  Continue development and initiate validation of physics-based models to explicitly compute dynamic behavior of armor materials that incorporate essential materials properties, critical response characteristics, and relevant energy management mechanisms.\n-  Continue development of ballistic and blast energy management mechanisms and initiate integration with material properties into candidate armor material systems for optimization against specific threats.\n-  Apply developed high performance armor technologies to maritime platform armor concepts and adapt them for applications where traditional materials would not be appropriate for the operational environment.\n-  Demonstrate laboratory scale synergistic passive and active armor systems for warhead defeat in multi-material configurations within critical size, weight, power, space, and cost constraints.\n-  Optimize advanced armor solutions utilizing the ERA and NERA concepts.  Test, model, and simulate target interactions to determine armor performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.573"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.573"
                                            },
                                            "Text": {
                                                "val": "-  Scale up transparent armor solution with multi-hit performance capability of transparent armor at weights equivalent to that of opaque armor and demonstrate the ability to produce transparent armor in military relevant sizes and shapes while maintaining optical and ballistic performance characteristics.\n-  Initiate development of capability to accurately account for and track load paths during an underbody blast event and provide material properties and energy management mechanisms to meet survivability objectives.\n-  Continue to identify and evaluate promising new armor concepts from non-traditional organizations both for military personnel and vehicles.\n-  Perform validation testing of optimized advanced armor solutions that exploit the high-performance characteristics of low-cost materials using unique combinations of material composition and topology.\n-  Initiate effort to identify critical parameters that will permit scaling of subscale ballistic modeling and testing into the regime of military relevance. \n-  Develop and demonstrate the high-risk manufacturing methods to transition the advanced armor technologies from laboratory scale into large-scale manufacturing and quality control processes that provide a marinized armor solution.\n-  Use the validated physics-based models and simulations previously developed to guide the design, development, and fabrication of ballistic and blast armor. \n-  Continue integration of ballistic and blast energy management mechanisms into material systems and incorporate into candidate armor material systems for optimization against specific threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials for Initiation and Actuation"
                                    },
                                    "Description": {
                                        "val": "The Materials for Initiation and Actuation thrust explores and develops materials for initiation and propagation of mechanical and\/or chemical effects.  Included efforts are structures for meso-scale electrically initiated combustion and modulation of flame plasmas using acoustics and electrical fields."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.230"
                                            },
                                            "Text": {
                                                "val": "-  Extinguished a pool flame of 160 cm^2 using an acoustic field.\n-  Extinguished an array of gas flames of 10 cm^2 total area using a hand-held electrode wand.\n-  Determined likely mechanism and initiated modeling for electrostatic and acoustic field flame extinction.\n-  Demonstrated both structural and energetic function in a single material composite and the ability to produce multiple samples with specified properties in sizes greater that one half pound.\n-  Demonstrated ability to initiate energy release in a material composite that has the density of steel and a high (>100 kilopounds per square inch tensile) strength.\n-  Demonstrated blast performance from an explosive filled reactive case of at least four times that achievable with a similar explosive charge in an inert case."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Identify and test approaches for scaling up electrostatic and acoustic flame suppression to address fires of 1 m^2, alone and in conjunction with conventional approaches.\n-  Demonstrate scalability of fabrication, mechanical properties, and blast performance of high-strength reactive cases to 1 kg scale."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reconfigurable Structures"
                                    },
                                    "Description": {
                                        "val": "In the Reconfigurable Structures thrust, new combinations of advanced materials, devices, and structural architectures are being developed to allow military platforms to move, morph, or change shape for optimal adaptation to changing mission requirements and unpredictable environments.  This includes the demonstration of new materials and devices that will enable the military to function more effectively in the urban theater of operations.  Another focus is to build synthetic versions of biological systems that exhibit strong reversible adhesion via van der Waals forces, magnets, or microspines to scale vertical surfaces without using ropes or ladders.  In addition, this thrust will develop a more principled, scientific basis for robotic ground mobility and manipulation, and leverage these results to develop and demonstrate innovative robot design tools, fabrication methods, and control methodologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.037"
                                            },
                                            "Text": {
                                                "val": "-  Developed design parameters for scaling up gecko nanoadhesives for dynamic human climbing.\n-  Transitioned Z-MAN prototype technologies (magnets and microspines) to initial Services clients.\n-  Developed components of new design tools for accelerating high-quality design of robots by non-experts; to include an interactive design tool based on \"functional blueprints\" that automatically varied design, another design tool where user preferences served as fitness functions, and a software toolkit that handled 3-D rigid body kinematics and dynamics for any arbitrary robot.\n-  Developed fabrication method proof-of-concept prototypes for producing robots at low cost including polyimide films for pressure sensing skin and Kevlar components to prevent punctures.\n-  Demonstrated components of new control algorithms able to improve the mobility and manipulation performance of robots; to include a controller that moved a simulated variable-compliance arm through dense obstacles with a success rate of 95 percent compared to 40 percent for a state-of-the-art planner and generation of roll and yaw instability warnings based on automatic system identification from vehicle movement.\n-  Simulated proof-of-concept robots with higher mobility and manipulation performance than currently available including a physics-based simulation of a cheetah animal and a cheetah robot galloping at high speed.\n-  Developed proof-of-concept components for increasing robot mobility and manipulation performance.   \n-  Designed a robot upper body with piston-driven arms and vane-actuated shoulders for a humanoid robot and developed behaviors explicitly using the arms for walking, steep climbing, and vaulting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Transition additional Z-MAN prototype technologies (magnets and microspines) to initial Services clients.\n-  Demonstrate a human static load hanging from gecko nanoadhesive. \n-  Demonstrate that a soldier with operationally relevant equipment (250 lb upper limit) can climb 25-foot walls built from mission-relevant materials using gecko nanoadhesive.\n-  Integrate and demonstrate components of new design tools for accelerating high-quality design of robots by non-experts, to include replacing human programming by user-guided evolution of a controller.\n-  Create new brass board fabrication methods for producing robots at low cost, to include printing components of a walking robot.\n-  Demonstrate new control algorithms in simulation that significantly improve performance including mobility algorithms that allow robots to locomote at least two times more efficiently and manipulation techniques that can operate in confined spaces.\n-  Design proof-of-concept full robots with higher-performance mobility including bipeds that can walk on rough terrain, which current platforms cannot, and robots that locomote at speeds at least twice as fast as current platforms.\n-  Explore the actuation design space and develop concepts for actuators with optimized power factor, optimized transmission, and minimized modulation loss."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.598"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.598"
                                            },
                                            "Text": {
                                                "val": "-  Transition additional Z-MAN prototype sets of gecko nanoadhesive to the Services.\n-  Apply novel design tools to reduce time of design of robots by more than 50 percent to include user-guided evolution of structures and controller, and automated morphological design processes. \n-  Apply fabrication methods to produce robot components at substantial (> 50 percent lower) cost savings, to include printing and assembly by folding of a walking robot, and fabrication of a soft pneumatically actuated robot.\n-  Demonstrate new control algorithms on real robots, to include mobility efficiency improvements of at least 2X, prevention of rollover by reasoning about vehicle dynamics, and a touch-sensitive arm to reach through a cluttered workspace.  \n-  Build and demonstrate robots with higher-performance mobility, including biped robots that can walk on previously inaccessible rough terrain, and robots that locomote at speeds at least twice as fast as current platforms.\n-  Develop and demonstrate optimal impedance actuators:  mechanical power factor correctors; mechanical, hydraulic, and electrical approaches for lightweight, high-power, variable-ratio transmissions; and switching modulation for hydraulic actuators, stepper motors, and purely mechanical systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternate Power Sources"
                                    },
                                    "Description": {
                                        "val": "The Alternate Power Sources thrust aims to develop materials and technologies to utilize alternative power sources with the potential to provide significant strategic and tactical advantages to the DoD.  A consistent DoD need continues to be greater efficiency in a portable form factor.  Portable photovoltaic technologies will strive to meet this need and at low cost manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.043"
                                            },
                                            "Text": {
                                                "val": "-  Developed backpack-portable PV technologies that resist heat, cold, humidity, and repeated flexure.\n-  Demonstrated new portable PV cells that function at up to 15.5 percent power conversion efficiency and have a minimum radius of curvature of 5 cm.\n-  Demonstrated portable PV cells that allow for low-cost manufacturing at $3.75 per Watt.\n-  Demonstrated portable PV cells with a density of less than or equal to 2000 grams per square meter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate portable PV devices that produce at least 70 percent of their specified electrical output after one year duration and after exposure to environmental hazards such as punctures, humidity, temperature extremes, rain, and dust.\n-  Design portable PV devices that function at greater than or equal to 20 percent power conversion efficiency.\n-  Design PV devices that have a density of less than or equal to 1500 grams per square meter.\n-  Design portable PV devices that have a maximum radius of curvature of 3 cm."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "-  Design portable PV devices that produce at least 80 percent of their specified electrical output after one year duration and after exposure to environmental hazards such as punctures, humidity, temperature extremes, rain, and dust. \n-  Demonstrate portable PV devices that function at greater than or equal to 20 percent power conversion efficiency.\n-  Demonstrate portable PV devices that allow for $2 per Watt manufacturing.\n-  Demonstrate PV devices that have density of less than or equal to 1500 grams per square meter."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Functional Materials and Devices"
                                    },
                                    "Description": {
                                        "val": "The Functional Materials and Devices thrust will address problems with high performance functional materials development.  Functional materials deployed for applications are most often bulk structures and performance is limited to those properties found in nature.  Improved materials require deliberate control at the scale of the relevant phenomena.  This thrust will leverage the advanced fabrication capabilities currently available, coupled with design of material and structure, to drive functional materials to high performance for DoD applications by design.  Novel optical materials exploiting three-dimensional degrees of freedom to increase wavefront control, and IR emissive materials are examples of near-term materials in which design of structure at the scale of the critical phenomena can have significant impact on their performance.  To eliminate the intelligence surveillance and reconnaissance capability gap that currently exists at the soldier-scale, capability will be developed to provide high space\/time resolution throughout the soldier-scale, space\/time sphere of influence by developing task-specific functionality.  These functions include hands-free zoom, automated brightness adjustment, threat detection, targeting assistance, change detection, and supplementary data overlay.  This thrust will also explore newly emerging areas where structure may play an important role."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed plans to improve efficiency and performance of emerging infrared optical materials.\n-  Demonstrated modeling capabilities to predict material performance.\n-  Designed initial contact lens binocular telescope providing hands-free, 10x, all-optical zoom, on demand.\n-  Designed initial low-profile contact lens-based heads-up display with resolution comparable to the unaided eye."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Fabricate and test contact lens binocular telescope providing hands-free, 10x, all-optical zoom, on demand.\n-  Fabricate and test low profile heads-up display with field of view and resolution comparable to the unaided eye.\n-  Demonstrate algorithms for computer-enhanced vision in conjunction with low size, weight and power micro-cameras."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstration and user testing of contact lens binocular telescope. \n-  Demonstration and user testing of low profile heads-up display. \n-  Design integrated micro-camera array to work in conjunction with low-profile head-up display."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturable Gradient Index Optics (M-GRIN)"
                                    },
                                    "Description": {
                                        "val": "Based upon technology development from the Materials Processing and Manufacturing thrust, the Manufacturable Gradient Index Optics (M-GRIN) program seeks to advance the development of GRIN lenses from a Technology Readiness Level (TRL) 3 to a Manufacturing Readiness Level (MRL) 8.  The program will expand the application of gradient index optics (GRIN) by providing compact, lightweight, and cost-effective lenses with controlled dispersion and aberrations that will replace large assemblies of conventional lenses.  The ability to create entirely new optical materials and surfaces creates the potential for new or significantly improved military optical applications, such as solar concentrators, portable designators, highly efficient fiber optics, and imaging systems.  The program also seeks to extend GRIN manufacturing technologies to glass, ceramic, and other inorganic materials in order to allow for small, lightweight, customized optical elements for mid-wave and longwave infrared (MWIR and LWIR) applications.  A key component of the program is to develop new design tools that enable optics designers to incorporate dynamic material properties, fabrication methods, and manufacturing tolerances.  The integration of new materials, design tools, and manufacturing processes will enable previously unattainable 3-D optical designs to be manufactured.  This new manufacturing paradigm will enable flexible production of GRIN optics in quantities of one unit to thousands of units."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.054"
                                            },
                                            "Text": {
                                                "val": "-  Develop new materials with variable index of refraction (lens tunability).\n-  Improve materials and designs to further reduce size and weight of optical assemblies for solar concentrator and high resolution telephoto lens.\n-  Develop new methods for controlling refractive index in thin layers of infrared (IR)-transparent materials.\n-  Develop and demonstrate fusion and shaping of multiple layers of IR-transparent materials into lenses and characterize their optical performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.223"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.223"
                                            },
                                            "Text": {
                                                "val": "-  Design and fabricate tunable lens from variable refractive index materials.\n-  Establish GRIN exchange to expand materials development and share design tools.\n-  Complete GRIN lens production scale-up from MRL-4\/5 to MRL-7\/8 consistent with yields of 1-1000 units as well as rapid redevelopment cycles.\n-  Design and build prototype IR lenses using previously developed GRIN lens design tools and metrology methods."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Components"
                                    },
                                    "Description": {
                                        "val": "This thrust explored and developed novel components for use in diverse power systems to dramatically increase overall energy efficiency, typically with a substantial savings of weight\/volume as well as cost.  Included in this thrust were high energy density capacitors as well as new permanent magnetic materials with significantly higher magnetic strength and higher operating temperature for motors and generators.  Radically new thermoelectric architectures that allow for high efficiency in converting heat to electricity were investigated.  Novel energy systems focused on immediate DoD needs such as long endurance small unmanned aerial systems, and far-future technologies to exceed the efficiency limits imposed by combustion of hydrocarbons were developed.  Materials technology is also being developed to enhance power conditioning for large power applications such as Navy ships."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.776"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated thermoelectric nanomaterials with state-of-the-art power conversion efficiency over a wider temperature range to improve energy efficiency for ground, air, and unmanned vehicles.\n-  Created new capacitors that provide reliable (>1500 hours continuous operating time), high-power pulsed discharges (<1 microsecond) under stress operating conditions (>125 degrees Celsius, 5kV breakdown) and possess three times the energy density than those currently available in pulse power weapon military systems and electromagnetic vehicle armor.\n-  Demonstrated nanogap thermo-tunneling device with efficiency greater than 16 percent at a temperature difference of 350 degrees Celsius. \n-  Completed flight tests of 8+ hour fuel-cell-enabled, long-endurance small unmanned aerial system.  Began transition to user community via memorandum of agreement with Marine Corps Warfighting Laboratory. \n-  Demonstrated path to commercially viable packaging methods of one cubic millimeter Li-ion batteries with improved energy density for potential transition to the user community.\n-  Demonstrated viability of novel hybrid energy storage systems and down selected most promising technologies for increasing effective energy storage capacity of DoD BA-5590 battery pack form factor.\n-  Initiated investigation of new approaches for electrochemical conversion of stored energy in carbon-based fuels to exceed the efficiency limits imposed by combustion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Very High Efficiency Solar Cell (VHESC)"
                                    },
                                    "Description": {
                                        "val": "The Very High Efficiency Solar Cell (VHESC) program goal was to raise the system power efficiency of a new class of solar modules to forty percent and deliver engineering prototype modules that are producible.  The modules use a novel optical system that splits light from the Sun into at least two different paths corresponding to the color of the light, and concentrates the light onto photovoltaic (PV) cells that cover different segments of the solar spectrum.  System power efficiency includes all factors that impact the system (module) power efficiency, such as the transmission of light through the optics as well as the individual efficiencies of the PV cells.  Analysis predicted that fifty percent efficiency at the PV cell level yields a system power efficiency of at least forty percent."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigated effects on PV materials in high altitudes and high solar concentration environments.\n-  Evaluated further development and improvements in solar cell technology for future DoD applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prognosis"
                                    },
                                    "Description": {
                                        "val": "The Prognosis thrust developed new concepts, physics-based models, and advanced interrogation tools to assess damage evolution and predict future performance of the structural materials in defense platforms\/systems.  Included were demonstrations on Navy and Air Force aircraft structures and engines for advanced jet aircraft and helicopters.  Also included were sensor and model development required to support the damage prediction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Transitioned data sets and technology to the Air Force.  Hardened and miniaturized acoustic sensors to make them suitable for flight.\n-  Exploited developments in acoustic emission sensor technology for rogue flaw detection in multiple aircraft critical wing zones, and demonstrated the capability to identify crack location within 1 percent of the wing zonal area.\n-  Performed probabilistic predictions of the current and future state of aircraft wing zones using adapted fatigue models and incorporated sensor characterization; conducted model analysis based on inspection feedback.\n-  Identified fatigue initiation and crack growth mechanisms in titanium and began development of physics-based models to characterize its microstructure and damage progression properties."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biofuels"
                                    },
                                    "Description": {
                                        "val": "The Biofuels program explored longer term, higher risk approaches to obtaining and using energy.  A pathway to affordable self-sustainable agriculture-sourced production of an alternative to petroleum-derived JP-8, that meets all DoD needs, were investigated.  Initial efforts focused on the conversion of crop oil triglycerides to JP-8.  Additional efforts expanded the spectrum of convertible feedstocks to cellulosic, algal, and other similar materials, enabling a diversified feedstock portfolio that can meet the entire DoD need within a sustainable commercial framework.  An important variant of this latter category is the development of man- and vehicle-portable technologies that produce substantial quantities of JP-8 and other useful liquid fuels from indigenously available or harvestable resources near desired locations worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.853"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated system scale-up and validated cost goal.\n-  Demonstrated technology to enable very low cost triglyceride oil from algae with competitive projected production costs of JP-8 at initial commercial scale implementation (50M gal\/yr).\n-  Demonstrated technologies to enable increasing conversion efficiency of cellulosic materials with competitive projected production costs of JP-8 at initial commercial scale implementation (50M gal\/yr).\n-  Evaluated sensitivity of biofuel cost of production in multiple locations by developing business models that take advantage of the economies of scale and shows that the technology will meet or exceed the cost goals for oil and JP-8 when extrapolated to a production scale (less than or equal to 50M gal\/yr).\n-  Investigated commercialization path to include production, co-product application, and transition to industry and DoD."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MBT-02"
                    },
                    "ProjectTitle": {
                        "val": "BIOLOGICALLY BASED MATERIALS AND DEVICES"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "112.455"
                        },
                        "CurrentYear": {
                            "val": "49.645"
                        },
                        "BudgetYearOne": {
                            "val": "37.623"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.623"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "45.534"
                        },
                        "BudgetYearThree": {
                            "val": "47.498"
                        },
                        "BudgetYearFour": {
                            "val": "51.849"
                        },
                        "BudgetYearFive": {
                            "val": "50.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project acknowledges the growing and pervasive influence of the biological sciences on the development of new DoD capabilities.  This influence extends throughout the development of new materials, devices and processes, and relies on the integration of biological breakthroughs with those in engineering and the physical sciences.  Contained in this project are thrusts in the application of biomimetic materials and devices for Defense, the use of biology's unique fabrication capabilities to produce structures that cannot be made any other way, the application of materials in biological applications, and the development of manufacturing tools that use biological components and processes for materials synthesis.  This project also includes major efforts aimed at integrating biological and digital sensing methodologies and maintaining human combat performance despite the extraordinary stressors of combat.  Finally, this thrust will develop new diagnostics, therapeutics, and procedures to save lives on the battlefield, as well as restore full functional capabilities to combat amputees by developing a revolutionary upper limb prosthetic device.  Annotated medical programs continue in FY 2012 in PE 0602115E, Project BT-01."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maintaining Combat Performance"
                                    },
                                    "Description": {
                                        "val": "The Maintaining Combat Performance thrust utilizes breakthroughs in biology and physiology to sustain the peak physical and cognitive performance of warfighters operating in extreme conditions.  Today, warfighters must accomplish their missions despite extraordinary physiologic stress.  Examples of these stressors include temperature extremes (-20 degrees F to 125 degrees F), oxygen deficiency at high altitude, personal loads in excess of 100 lbs, dehydration, psychological stress, and even performance of life-sustaining maneuvers following combat injury.  Not only must troops maintain optimum physical performance, but also peak cognitive performance, which includes the entire spectrum from personal navigation and target recognition, to complex command and control decisions, and intelligence synthesis.  The Maintaining Combat Performance thrust leverages breakthroughs in diverse scientific fields in order to mitigate the effects of harsh combat environments ranging from fundamental research elucidating the biological mechanisms of adaptation to application of novel body-worn actuation materials to reduce soldier loads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.568"
                                            },
                                            "Text": {
                                                "val": "-  Determined range of effective dose for compounds to accelerate natural acclimatization at high altitudes to use as basis for dosing in combinational drug model.\n-  Developed field-deployable, accelerated acclimatization therapeutic that includes minimal training requirements and demands on supporting infrastructure for optimal battlefield use.\n-  Analyzed the acclimatization therapeutic's efficiency, toxicity, and pharmacokinetic information in animal studies.\n-  Prepared Investigational New Drug (IND) application for use in an FDA Phase I clinical trial. \n-  Studied the cause and effect of injuries within the scope of dismounted mission data.\n-  Identified component technologies to augment soldier load in order to reduce fatigue and injuries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.711"
                                            },
                                            "Text": {
                                                "val": "-  Initiate a limited FDA Phase I clinical trial for pharmacokinetics, surrogate-efficiency markers, and tolerance to determine drug safety. \n-  Assist in creating the Mountain Warfare Research Center for Excellence (MWRCE) at the Marine Corps Mountain Warfare Training Center, which will be sustained by support from each of the Services to facilitate high-altitude medical R&D, equipment testing, and clinical trials.  \n-  Establish baseline physiology testing at the MWRCE in support of Phase 2 clinical trials for the prevention of altitude illness. \n-  Coordinate a technical review with major pharmaceutical companies to prepare for commercialization of the rapid altitude and hypoxia acclimatization therapeutics.\n-  Initiate relevant core technology efforts: analysis, design, and\/or benchtop testing of subsystems.\n-  Initiate development of human and system performance analytical models (as a baseline) and system performance to assess injury mitigation strategies in a simulation environment.\n-  Use initial output of core technology efforts to begin developing descriptions of requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete altitude illness prevention clinical trials packet for review by Food and Drug Administration\/Center for Drug Evaluation and Research (FDA\/CDER). \n-  Complete altitude illness treatment clinical trials packet for review by FDA\/CDER. \n-  Prepare for transition of rapid altitude and hypoxia acclimatization therapeutics and preventives to Defense Threat Reduction Agency\/Transformational Medical Technologies (DTRA\/TMT).\n-  Prepare for transition of Mountain Warfare Research Center for Excellence to the Services to allow for continued testing of cold weather and high altitude equipment and therapeutics and collaboration with the U.S. Army Research Institute of Environmental Medicine (USARIEM)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neuroscience Technologies"
                                    },
                                    "Description": {
                                        "val": "The Neuroscience Technologies thrust leverages recent advances in neurophysiology, neuro-imaging, cognitive science and molecular biology to sustain and protect the cognitive functioning of the warfighter faced with challenging operational conditions.  Warfighters experience a wide variety of operational stressors, both mental and physical, that degrade critical cognitive functions such as memory, learning, and decision making.  These stressors also degrade the warfighter's ability to multitask, leading to decreased ability to respond quickly and effectively.  Currently, the long-term impact of these stressors on the brain is unknown, both at the molecular and behavioral level.  This thrust area will utilize modern neuroscientific techniques, in conjunction with emerging solutions in neurally enabled human-machine interface technologies, to develop quantitative models of this impact and explore mechanisms to protect, maintain, complement, or restore cognitive functioning during and after exposure to operational stressors.  In addition, new approaches for using neural signals to make human-machine systems more time efficient and less workload intense will be identified, developed, and evaluated.  This project will also investigate the integration of recently characterized properties of human brain function and real-time signal processing to enable rapid triage of target-containing imagery.  This thrust area will have far-reaching implications for both current and future military operations, with the potential to protect and improve cognitive performance at the individual and group level both prior to and during deployment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.792"
                                            },
                                            "Text": {
                                                "val": "-  Developed brain imaging, cognitive monitoring and stimulation technologies for optimization of individual and group learning in existing military training paradigms.\n-  Established a fast, functionally relevant, brain-based measurement of the stress response system that captures the basic features of physiological responses associated with changes in acute and chronic stress state. \n-  Developed technologies for real-time detection of brain biochemical changes in response to stress.\n-  Identified key molecules, pathways and anatomical connections involved in stress-related dysfunction that are amenable to behavioral and\/or pharmacological interventions.\n-  Developed methods for identifying critical stress response genes that work as part of a network of genes responsible for stress and resiliency. \n-  Developed a new Magnetic Resonance Imaging analysis package that is currently being transferred into human clinical use. \n-  Validated and improved optogenetic techniques as they apply to animal models of chronic stress."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.282"
                                            },
                                            "Text": {
                                                "val": "-  Reconstruct a multi-scale network linked to specific stressors and stress response systems using integrated genetics, quantitative model building, bioinformatics, and computational biology approaches.\n-  Continue modeling and verification of causal factors and relationships between variables in the complex systems and networks involved in the response to stress and the ability to resist stress.\n-  Modulate genes and pathways mediating acute and chronic stress-induced dysfunction in circuits for reward, fear, and habit learning for reduction of stress-related dysfunction.\n-  Develop and implement interventions for prevention of stress-induced cognitive dysfunction in animal models of acute and chronic stress. \n-  Expand studies of stress-related dysfunction to include identifying gene, network and specific brain region dysfunction as it relates to suicide.\n-  Transition optimization of individual and group learning technologies into standalone training platforms for military partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Integrate human data on stress genes to determine human stress-related gene networks for targeting interventions. \n-  Determine whether choice in exercise protocol in the services can prevent stress-evoked cognitive declines. \n-  Relate clinical and psychological profiles of patients with post-traumatic stress disorder to neural networks, neurochemicals and behavior. \n-  Develop empirically validated intervention strategies to include stress reduction (exercise, meditation), stress inoculation (video training\/therapy) and\/or pharmacological interventions, while maintaining performance.\n-  Using recent advances in information, new quantitative measures of neuro-physical performance will be defined to develop a novel warfighter training environment. \n-  Develop biometric characterization to replace environmental characterization in order to quantify and optimize training efficacy and cohesion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blood Pharming"
                                    },
                                    "Description": {
                                        "val": "The Blood Pharming program objective is to develop an automated culture and packaging system that yields transfusable levels of universal donor red blood cells (RBCs) from progenitor cell sources.  The goal is to produce 100 units of universal donor (Type O negative) RBCs per week for eight weeks in an automated closed culture system using a renewing progenitor population, and to demonstrate a two hundred million-fold expansion of progenitor cell populations to mature RBCs.  The program will capitalize advances in cell differentiation, expansion, and bioreactor technology developed early in the program.  Successful completion of the Blood Pharming effort will provide a safe donorless blood supply that is the functional equivalent of fresh donor cells, satisfying a large battlefield demand and reducing the logistical burden of donated blood in theater."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.245"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated a 20x improvement in magnetic sorting using a new fabricated multi-magnet array.  Bioreactor is now capable of sorting 1\/10 of a unit in 24hrs; result is scalable to reach clinically relevant quantities.       \n-  Demonstrated a 30% reduction in cost per unit of RBCs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.250"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate continuous production of universal donor RBCs in a large scale bioreactor perfusion system yielding a total of 10 units of RBCs over an 8 week period.\n-  Demonstrate a multi-fold reduction in cost per unit of RBCs by increasing the RBC cell density in the bioreactor and by reducing the media cost from $250L to $40\/L to meet production goals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "-  Expand capability of bioreactor to produce plasma or other high value blood products beyond packed red blood cells."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BioDesign"
                                    },
                                    "Description": {
                                        "val": "BioDesign is a new intellectual approach to biological functionality.  It will employ system engineering methods in combination with biotechnology and synthetic chemical technology to create novel beneficial attributes.  BioDesign mitigates the unpredictability of natural evolutionary advancement primarily by advanced genetic engineering and molecular biology technologies to produce the intended biological effect.  This thrust area includes designed molecular responses that increase resistance to cellular death signals and improved computational methods for prediction of function based solely on sequence and structure of proteins produced by synthetic biological systems.  Development of technologies to genetically tag and\/or lock synthesized molecules would provide methods for prevention of manipulation (\"tamper proof\" synthetic biological systems)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Identified mechanisms to protect unauthorized use of a research microorganism."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.191"
                                            },
                                            "Text": {
                                                "val": "-  Develop genetically encoded locks to create \"tamper proof\" DNA. \n-  Develop strategies to create a synthetic organism \"self-destruct\" option to be implemented upon unapproved removal and transport of an organism."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.023"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.023"
                                            },
                                            "Text": {
                                                "val": "-  Develop novel genomic security technologies to identify microorganisms which were intentionally made resistant to antimicrobials. \n-  Develop novel genomic circuits which identify microorganisms which were tested for virulence using live animals.\n-  Develop strategies that time-limit production  of high-value commercial microorganisms licensed for international use. \n-  Develop lock-key recall enzyme reporting systems which resurrect event recording from proprietary microorganisms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of Living Foundries is to create a revolutionary, biologically-based manufacturing platform to provide new materials, capabilities and manufacturing paradigms for the DoD and the Nation.  The program seeks to develop the new tools, technologies and methodologies to transform biology into an engineering practice, speeding the biological design-build-test cycle and expanding the complexity of systems that can be engineered.  The goal is to enable the rapid development of previously unattainable technologies and products, leveraging biology to solve challenges associated with production of new materials, novel capabilities, fuels and medicines and providing novel solutions and enhancements to military needs and capabilities.  For example, one motivating, widespread and currently intractable problem is that of corrosion\/materials degradation challenge that costs the DoD nearly $23 billion per year and has no near term solution in sight.  Living Foundries, with its ability to truly program and engineer biology, will enable the capability to design and engineer systems to rapidly and dynamically prevent, seek out, identify and repair corrosion\/materials degradation.  Ultimately, Living Foundries aims to provide game-changing manufacturing paradigms for the DoD, enabling distributed, adaptable, on-demand production of critical and high-value materials, devices and capabilities in the field or on base.  Such a capability will decrease the DoD's dependence on tenuous material and energy supply chains that could be cut due to political change, targeted attack or environmental accident.   \n\nResearch thrusts will focus on the development and demonstration of open technology platforms, or bio-foundries, that integrate the tools and capabilities developed in PE 0601101E\/TRS-01 to prove out capabilities for rapid (months vs. service-oriented architecture years) design and construction of new biological production systems.  The ultimate vision is to develop point-of-use, on-demand, distributed and customized production of strategic materials and systems that exploit the capabilities and programmability (through DNA) of biology.  Activities in this area will accelerate the development of DoD-focused applications and shift the field from simple, isolated genetic circuits to whole genome engineering.  Such a platform spans from the ability to design, optimize and simulate (in silico) a synthetic genetic regulatory network to the automated fabrication and validation of the synthetic design in a biological system.  Demonstration platforms will be challenged to build a variety of military-relevant and complex functionalities, such as the ability to withstand harsh environments, to synthesize complex mixtures of chemicals, or to rapidly and dynamically prevent, seek out, identify and repair corrosion\/materials degradation."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate integration of fundamental tools and capabilities developed in PE 0601101E\/TRS-01 to speed the design, build, and test loop of biological manufacturing and start bio-foundries development.\n-  Begin development and refinement of tools and capabilities to translate designs across multiple platforms and biological systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Revolutionizing Prosthetics"
                                    },
                                    "Description": {
                                        "val": "The goal of this thrust is to radically improve the state of the art for upper limb prosthetics, moving them from crude devices with minimal capabilities to fully integrated and functional limb replacements.  Current prosthetic technology generally provides only gross motor functions, with very crude approaches to control.  This makes it difficult for wounded soldiers to re-acquire full functionality and return to military service if so desired.  The advances required to provide fully functional limb replacements will be achieved by an aggressive, milestone driven program combining the talents of scientists from diverse areas including: medicine, neuroscience, orthopedics, engineering, materials science, control and information theory, mathematics, power, manufacturing, rehabilitation, psychology and training.  The results of this program will radically improve the ability of combat amputees to return to normal function.  This effort will be funded in PE 0602115E, Biomedical Technology beginning in FY 2013."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.393"
                                            },
                                            "Text": {
                                                "val": "-  Continued qualification testing and demonstrations of neural interfaces suitable for submission to FDA.\n-  Initiated experiments to determine level of sensory stimulation that can be delivered to patients through neural interface.\n-  Designed and fabricated new neural interfaces to enable complex stimulation and control; initiated design and testing of active implantable arrays to reduce number of wires passing through surgical site.\n-  Completed 26 clinical trials with Veterans Affairs subjects and 5 take-home trials with other subjects; applied user feedback to design of pre-production mechanical arm system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate neural control of arms by spinal cord-injured patients.\n-  Demonstrate safety and stability of neural interfaces over multiple month periods.\n-  Support transition efforts of final limb, components, and refinements required by the FDA.\n-  Provide clinical data to support FDA submission.\n-  Optimize the sensor configuration and algorithm development of the hand and arm to provide meaningful sensory feedback."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Technology Threat Warning System (CT2WS)"
                                    },
                                    "Description": {
                                        "val": "Recent advances in computational and neural sciences indicate it is possible to push the visual threat detection envelope to enable more response choices for our soldiers than ever before.  The objective of the Cognitive Technology Threat Warning System (CT2WS) program is to drive a breakthrough in soldier-portable visual threat warning devices by leveraging discoveries in the disparate technology areas of flat-field, wide-angle optics, large pixel-count digital imagers, visual processing pathways, neurally based target detection signatures and ultra-low power analog-digital hybrid signal processing electronics.  This program will lead to the development of prototype soldier-portable digital imaging threat cueing systems capable of effective detection ranges of 1-10 km against dismounts and vehicles.  Simultaneously, the system will survey a 120-degree or greater field of view, enabling the warfighter to detect, decide and act on the most advantageous timeline in complex operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.533"
                                            },
                                            "Text": {
                                                "val": "-  Integrated and packaged fully functional prototype systems, both hardware and software, for extended field testing in a range of real environments including desert and tropical conditions.\n-  Conducted mid-phase Test Readiness Review that validated both the maintenance of the performance efficacy previously demonstrated and suitable device ruggedization to support extended field testing.\n-  Conducted two field tests, one in open desert terrain at Yuma Proving Ground, the other in tropical terrain in Hawaii.  Results showed excellent performance, with an 89% probability of detection and a 0.002% probability of false alarm.  The system outperformed trained human observers using binoculars, who achieved a 60% probability of detection.\n-  Improved operator interface design to allow operator to monitor and enhance real-time detection and classification performance.\n-  Coordinated with ARMY Night Vision Lab for test and evaluation in Phase 3, and possible transition beyond Phase 3."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "-  Extend algorithms to handle imagery from Army and Marine Corps systems such as the Cerebus SCOUT, which generate visible, IR, and radar imagery from mast-mounted systems.  \n-  Improve algorithms to increase frame rate.  \n-  Improve brain machine interface to use wearable dry electroencephalogram (EEG) sensors. \n-  Integrate and package threat warning system prototype. \n-  Perform extended field testing and evaluation at sites selected by Night Vision Lab."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neovision2"
                                    },
                                    "Description": {
                                        "val": "Biological vision systems have the exquisite ability to recognize, categorize, and learn new objects in fractions of a second.  While animals and humans accomplish this seemingly effortlessly and constantly, computational vision systems have, to date, been unable to replicate this feat of biology.  The Neovision2 program is pursuing an integrated approach to developing an advanced object recognition capability based on the visual pathways in the mammalian brain.  Specifically, this program will develop a cognitive sensor technology with limited size, weight, and power that transforms data from an imaging sensor suite into communicable knowledge for mobile, autonomous surveillance systems.  To achieve the vision, the program will utilize advanced device design, signal processing and mathematical techniques across multiple brain regions to revolutionize the field and create an electronic neuro-biological (neuromorphic) vision system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.642"
                                            },
                                            "Text": {
                                                "val": "-  Completed algorithm design and partial implementation of next-generation neuromorphic vision system capable of emulating the entire mammalian visual pathway, from the retina to object recognition.  \n-  Completed hardware design and partial fabrication of breadboard neuromorphic object recognition systems with the goal of enhanced visual function capabilities beyond state of the art, that met size, weight, and power constraints for unmanned systems.\n-  Began spike-sorting and modeling selected physiological data sets to support object-recognition algorithm development.\n-  Coordinated with Joint Unmanned Air Systems Center of Excellence to identify promising technology transition opportunities, such as processing and exploitation of data onboard UAVs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.461"
                                            },
                                            "Text": {
                                                "val": "-  Complete Phase 1 algorithm development, hardware system implementation, and physiology data collection. \n-  Conduct Phase 1 test and evaluation.  For algorithms, compare performance (probability of detection, probability of false alarm) of neuromorphic systems to conventional, engineered systems on 150 videos taken from a tower, a low-flying helicopter, and a low-flying fixed wing aircraft.  For hardware, assess degree of fidelity to the mammalian visual system, performance in collecting and processing data, and potential for low-power operation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Biomedical Technologies"
                                    },
                                    "Description": {
                                        "val": "The Tactical Biomedical Technologies thrust will develop new approaches to deliver life-saving medical care on the battlefield, as well as novel technologies for reconstruction and rehabilitation of severely injured warfighters.  Implicit in this thrust is the fact that there are unique, warfighter-specific challenges in acute and chronic treatment that are not addressed by civilian research and development.  Today, more than half of American battlefield fatalities are due to hemorrhage, particularly due to improvised explosive devices (IEDs).  To prevent these deaths, there is an urgent need for technologies that enable relatively unskilled personnel (battlefield medics) to diagnose and treat injuries, including the ability to locate and coagulate non-compressible sites of bleeding in the thorax or abdomen.  This effort continues in FY 2012 in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.978"
                                            },
                                            "Text": {
                                                "val": "-  Identified targeting ligand\/receptor pairs that show specific and selective binding only to wounded tissue.\n-  Developed a polymeric carrier material that demonstrates conformal coverage in a severe splenic injury model. \n-  Initiated an integrated targeting ligand\/polymeric carrier material that can be delivered to a closed, intracavity space and binds specifically to damaged tissue as demonstrated in situ by immunohistology.\n-  Demonstrated induction of a patterned regenerative response in a small animal limb when treatment with bone morphogenetic protein-2 is concurrent with natural wound closure.\n-  Began planning for capability to manufacture a set of commonly-used organic pharmaceuticals in a small form-factor device while maintaining comparable mass efficiency to shelf-stable products.\n-  Developed initial plans to build a continuous flow chemistry device platform for manufacturing multiple pharmaceuticals of DoD relevance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Medical Imaging"
                                    },
                                    "Description": {
                                        "val": "The Military Medical Imaging thrust will develop medical imaging capabilities to support military missions and operations.  Examples include novel technologies to miniaturize and enhance the capabilities and speed of computerized axial tomography (CAT) scanners and to develop non-invasive imaging modalities for use by medics.  The emergence of advanced medical imaging includes newly recognized physical properties of biological tissue, or metabolic pathway, or physiological function in order to map it into an image of diagnostic utility and performance.  This effort continues in FY 2012 in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Identified data types required to recreate traumatic battlefield events.\n-  Recreated battlefield engagements using open-source data to facilitate visual presentation using Real World software.\n-  Demonstrated and independently verified that visible light with orbital angular momentum (OAM) induces 1.5% nuclear polarization equivalent to a 2000T magnet.\n-  Endowed a 12.8 kiloelectron volt (keV) X-ray beam with OAM equal to 40, which is the highest OAM value imparted for that X-ray energy.\n-  Demonstrated X-rays with OAM induces 0.15% nuclear polarization, which is 200x larger than current state of the art."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reliable Neural-Interface Technology (RE-NET)"
                                    },
                                    "Description": {
                                        "val": "Wounded warriors with amputated limbs cannot fully exploit recent advances in prosthetic-limb technology because the neural interfaces used to extract limb-control information are low-performance and unreliable.  The goal of the Reliable Neural-Interface Technology (RE-NET) program is to develop the technology and systems needed to reliably extract information from the nervous system at the scale and rate necessary to control state-of-the-art high-performance prosthetic limbs.  In support of this goal, the RE-NET program is developing methods to quantitatively assess, model, predict, and accelerate the leading causes of neural interface degradation and failure.  The program will also increase the channel-count (amount information) of reliable peripheral-nervous-system interfaces and increase the operational lifetime (reliability) of central-nervous-system interfaces.  Through this focus on reliability and high-level performance, the RE-NET program will enable clinically relevant technology transitions in support of wounded warriors.  This effort continues in FY 2012 in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.980"
                                            },
                                            "Text": {
                                                "val": "-  Identified manufacturing defects in commercially produced state-of-the-art cortical probes.\n-  Developed prototype meandering-microwire electrodes that have a mechanical stiffness that is 1000 to 1,000,000 times more compliant than existing state-of-the-art neural microprobes in each axis. \n-  Demonstrated unique experimental capability to perform chronic in vivo high-resolution 2-photon microscopy of large cortical regions.  \n-  Demonstrated open-source software that can rapidly and accurately process high-resolution 3-D neuroimaging data to clearly map neural tissue (e.g., vasculature, shape and location of neurons, microglia, astrocytes, etc.). \n-  Incorporated advanced adaptive-learning algorithms into open-source cell-characterization software to automate cell identification and sorting.\n-  Expanded relationship with the FDA beyond performing independent verification and testing of neural-interface advances that could speed the clinical transition of RE-NET technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pathogen Defeat"
                                    },
                                    "Description": {
                                        "val": "Pathogens are well known for the high rate of mutation that enables them to escape drug therapies and primary or secondary immune responses.  The Pathogen Defeat thrust area will provide revolutionary capabilities to predict future threats and to deflect pathogen evolution to non-human spaces such as animals, insects, and bacteria.  This area will also determine malicious intent by monitoring key technology acquisitions and commercialization of potential dual-use technologies.  Pathogen Defeat focuses not on the threats that are already known but rather on the threats of newly emerging agents and mutations in the future, allowing pre-emptive preparation of vaccine and therapy countermeasures.  This will include novel vaccine delivery systems.  This program continues in FY 2012 in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Strategized methods to induce and monitor evolutionary change through the application of individual selective pressures such as variable growth conditions, host switching, and resistance to host cell antiviral strategies such as interferons.\n-  Demonstrated a vaccine's effect at directing the outcome of viral evolution. \n-  Developed in vivo and in vitro evolution platforms for generating datasets used to build and validate algorithms predictive of viral evolution.\n-  Initiated concept test for predictive algorithm, biological validation system, and metrics demonstrating successful prediction of evolution. \n-  Developed and began testing new carrier molecule for messenger RNA delivery. \n-  Began in vitro testing of mRNA vaccine constructs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Preventing Violent Explosive Neurologic Trauma (PREVENT)"
                                    },
                                    "Description": {
                                        "val": "The Preventing Violent Explosive Neurologic Trauma (PREVENT) program seeks to understand the causes of blast-induced traumatic brain injury (TBI), an injury that while previously described in the warfighter population, has been referred to as a potential \"hidden epidemic\" in the current conflict.  PREVENT will use a variety of modeling techniques based on in-theater conditions to assess potential TBI caused by blast in the absence of penetrating injury or concussion.  Research will create a model that can be directly correlated to the epidemiology and etiology of injury seen in returning warfighters, and attempt to determine the physical and physiological underpinnings and causes of the injury.  Mitigation and treatment strategies will be formulated based on our new knowledge of blast-induced brain injury with the eventual goal of reducing injury severity across the forces by over fifty percent, improving recovery time, and preventing future injuries.  This program continues in FY 2012 in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.324"
                                            },
                                            "Text": {
                                                "val": "-  Investigated the long-term effects of multiple exposures to blast on warfighters following return from deployment through comparison to pre-deployment baselining across a battery of psychological, neurological, and behavioral tests and correlation to data collected from in-theater blast events.\n-  Investigated candidate therapeutics to alleviate acute inflammation and limit chronic apoptotic injury in preclinical models."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MBT-03"
                    },
                    "ProjectTitle": {
                        "val": "TACTICAL AND STRATEGIC ENERGY TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "62.579"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is focused on the unique challenges facing the DoD in developing and demonstrating advanced power generation and energy storage technologies.  It will address critical military needs for improved energy efficiency and availability to support a range of military missions.  At the individual warfighter and small unit operations level, efforts are addressing the need for mission extending power generation and energy storage technologies with particular emphasis on portability and robustness challenges that are unique to the DoD.  As electronic systems are common to all scales of power generation and energy storage and management, this project also investigates improved board-level power conversion and regulation strategies to more efficiently convert and distribute high voltages to locally required low voltages for powering integrated circuits and sensors.  The project also includes an effort that is exploring ultra-high-efficiency gas turbine engines for power generation on large platforms including Navy cruisers and destroyers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Advanced Power (TAP)*"
                                    },
                                    "Description": {
                                        "val": "*Previously funded under Power Components in project MBT-01\n\nThe Tactical Advanced Power (TAP) program is solving high-risk, mission-critical portable power and energy challenges (approximately 1 kilowatt and below) that are unique to DoD.  TAP provides near-term solutions to DoD energy needs through an integrated approach that leverages available technologies, further develops existing science, and establishes new methods of energy generation, extraction, transmission, conversion, and storage.  TAP is deploying fuel cell-enabled small (hand-held) unmanned aerial vehicles for long-endurance missions (greater than 5 hours)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.800"
                                            },
                                            "Text": {
                                                "val": "-  Transition deployable long-endurance small, unmanned aerial system to user community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vulcan*"
                                    },
                                    "Description": {
                                        "val": "*Previously funded in PE 0603286E, Project AIR-01, Advanced Aerospace Systems\n\nThe goal of the Vulcan program is to design, build, and ground test a pressure gain combustion (PGC) technology system that demonstrates a 20% reduction in specific fuel consumption for power generation turbine engines.  PGC technology has been under development for more than a decade and considerable progress has been made in key enabling technology areas.  The technology is believed mature enough to permit a dramatic new system capability.  PGC, when combined with turbine engines, offers the ability to design a new class of hybrid turbine power generation engines and Mach 4+ air breathing propulsion systems.  The Vulcan system consists of a full scale PGC, a compressor, and a turbine, and has direct application to ship power generation and propulsion turbine engines, aviation turbine engines, high-mach air breathing engines, as well as commercial turbine engines of the same variety."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.779"
                                            },
                                            "Text": {
                                                "val": "-  Complete risk reduction testing and demonstrations of key PGC component technologies and subsystems.\n-  Complete fabrication of final phase II rig demonstration hardware and test.\n-  Demonstrate pressure gain combustion in combustor components.\n-  Demonstrate combustor\/turbine interaction to verify utility of harnessing pressure gain combustion.\n-  Develop preliminary design of a full scale gas turbine engine with an integrated PGC module."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Microscale Power Conversion"
                                    },
                                    "Description": {
                                        "val": "The Microscale Power Conversion (MPC) program will address the fundamental limitations of power conversion by enabling a new technology and approach that exploits advances in basic power devices that can operate at very high frequencies with low losses.  A key benefit of these new devices is that they can be integrated into very compact circuits and assemblies that will provide dramatic advances to the power bus of a platform.  Specifically, this program will develop the technology to enable DC to DC power conversion for military applications at the scale of an integrated circuit so it can be embedded within the electronics subsystem and a new distributed power architecture can be realized.  The focus of this program is on attaining 100MHz internal operation frequencies of power circuits since the size of the passive elements (inductors and capacitors) in a power converter scales inversely as the fourth power of the internal operating frequency.  This program was previously funded in PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue development of very high frequency, low-loss power switch technology for implementing large envelope-bandwidth modulators for RF power amplifiers.\n-  Continue co-design of advanced X-band power amplifier technologies to include drain and gate bias modulation, dynamic output impedance matching, and closed-loop control to enable fast-switching power modulation.\n-  Continue design and prototype amplifier architectures for highly efficient handling of large peak-to-average ratio RF waveforms for military systems.\n-  Prototype demonstrations of converter efficiency and losses, including co-designed power amplifiers of many classes and approaches.\n-  Design low-loss packaging strategies and monolithic integration approaches for most promising amplifier-modulator circuit combinations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}