{
    "id": "cf40d23c458b88080262b6e6fdc72c292f103904",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA4_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603807A"
        },
        "ProgramElementTitle": {
            "val": "Medical Systems - Adv Dev"
        },
        "R1LineItemNumber": {
            "val": "69"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "27.247"
            },
            "CurrentYear": {
                "val": "35.543"
            },
            "BudgetYearOne": {
                "val": "24.384"
            },
            "BudgetYearOneBase": {
                "val": "24.384"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "20.818"
            },
            "BudgetYearThree": {
                "val": "20.425"
            },
            "BudgetYearFour": {
                "val": "21.441"
            },
            "BudgetYearFive": {
                "val": "21.336"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) funds development of medical materiel at the start of an official program of record, within the early system integration portion of the System Development and Demonstration phase of the acquisition life cycle using 6.4 funding.  Program efforts support transition of promising Science and Technology candidate medical technologies (drugs, vaccines, medical devices, diagnostics, and mechanisms for detection and control of disease carrying insects) to larger scale testing in humans for safety and effectiveness.  Programs are aligned to meet Future Force (F2) requirements stressed within concept documents and organizational structures.  The PE provides funding for Food and Drug Administration (FDA) regulated human clinical trials to gain additional information about safety and effectiveness on the path to licensure for use in humans.  The Projects supported by this PE are: \n\n(PROJ 836) funds the demonstration and validation of medical products for enhanced combat casualty care and follow-on care, including rehabilitation.  This project also funds the human clinical trials that test the safety and effectiveness of biologics, devices and demonstration.  Clinical trials are conducted in accordance with U.S. Food and Drug Administration (FDA) regulations.  Products from this project will transition to 832.\n\n(PROJ 808) funds development of candidate medical countermeasures for infectious diseases of military relevance. Efforts include vaccines, drugs, diagnostic kits\/devices, and insect control measures.  These funds support human clinical efficacy trials of the drug\/vaccine in a larger group that are designed to assess performance and to continue safety assessments in a larger group of volunteers. Products from this project will transition to 849.\n\n(PROJ 811) funds the development of military relevant human immunodeficiency virus (HIV) medical countermeasures.  It provides funding for planning and conducting of human clinical trials in a group of healthy volunteers to assess the drug\/vaccine for safety, tolerability, how the drug\/vaccine is distributed, metabolized, and excreted from the body, and investigate the appropriate dose for therapeutic use.  Products from this project will transition to Project 812. \n\n(PROJ VS7) program upgrades, retrofits, trains, and sustains the 256 Medical Evacuation legacy helicopters that continue to play a major role in Iraq and Afghanistan. The force design will increase the number of air frames in the force from 12 to 15 aircraft for 37 MEDEVAC companies to better meet operation needs.  Products from this project will transition to VS8.\n\nThis program is managed by U.S. Army Medical Materiel Development Activity (USAMMDA) and U.S. Army Medical Materiel Agency (USAMMA)  of the US Army Medical Research and Materiel Command"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "28.132"
                },
                "CurrentYear": {
                    "val": "34.997"
                },
                "BudgetYearOne": {
                    "val": "23.291"
                },
                "BudgetYearOneBase": {
                    "val": "23.291"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "27.247"
                },
                "CurrentYear": {
                    "val": "35.543"
                },
                "BudgetYearOne": {
                    "val": "24.384"
                },
                "BudgetYearOneBase": {
                    "val": "24.384"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.885"
                },
                "CurrentYear": {
                    "val": "0.546"
                },
                "BudgetYearOne": {
                    "val": "1.093"
                },
                "BudgetYearOneBase": {
                    "val": "1.093"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.662"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.093"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.093"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.223"
                                },
                                "CurrentYear": {
                                    "val": "0.546"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "808"
                    },
                    "ProjectTitle": {
                        "val": "DOD DRUG & VACC AD"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.006"
                        },
                        "CurrentYear": {
                            "val": "11.750"
                        },
                        "BudgetYearOne": {
                            "val": "9.987"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.987"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "10.292"
                        },
                        "BudgetYearThree": {
                            "val": "10.072"
                        },
                        "BudgetYearFour": {
                            "val": "11.963"
                        },
                        "BudgetYearFive": {
                            "val": "12.083"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds development of candidate medical countermeasures for infectious diseases of military relevance.  These efforts are in: vaccines, drugs, diagnostic kits\/devices, and insect control measures.  These funds support human clinical efficacy (capacity to produce a desired size of an effect under ideal or optimal conditions) trials of the drug\/vaccine in larger groups that are designed to assess how well the drug\/vaccine works, and to continue safety assessments in a larger group of volunteers.  Funding supports both technical evaluations and human clinical testing to assure the safety and effectiveness of medical diagnostic kits and devices.  This work, which is performed in military laboratories or civilian pharmaceutical firms, is directed toward the prevention of disease, early diagnosis, and speeding recovery once diagnosed.  All clinical trials are conducted in accordance with U.S. Food and Drug Administration (FDA) regulations, a mandatory obligation for all military products placed into the hands of medical providers or service members.  Product development priorities are determined based upon four major factors: (1) the extent and threat of the disease within the Combatant Commands theater of operations, (2) the clinical severity of the disease, (3) the technical maturity of the proposed solution, and (4) the affordability of the solution (development and production)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD Drug and Vaccine Advanced Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort in the development of candidate medical countermeasures for military relevant infectious disease."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.006"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Prepared to accept transition of a new military topical insect repellent from project 810 at Milestone B into Engineering & Manufacturing Development phase.  If candidate was ready, transitioned new malaria vaccine candidate from project 810 into Engineering & Manufacturing Development phase. For the Infectious Disease Diagnostic (multiple candidates), prepared to accept transition of project into the Engineering & Manufacturing Development phase of advanced development. The DTV vaccine continued FDA required vaccine potency and stability testing and all other DTV activities have transitioned to project 849.  For Topical Antileishmanial Cream, continued a human treatment protocol in the US, the industry partner continued stability testing of the drug product, and project 849 supported the overseas human trials activities of the topical cream."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Review evaluations, and human clinical trials of malarial\/anti-malarial drugs, vaccines, diagnostics, insect repellents, and grouped infectious disease (Dengue [a severe debilitating disease caused by a virus and transmitted by a mosquito] and Leishmania [a skin-based disease caused by a parasite and transmitted by sand flies]) vaccines, drugs and diagnostics.  Seeking industry partner and evaluating and completing down-selection of drug candidates for human trials for prevention or treatment of malaria.  Continuing to evaluate the vaccine candidate for Dengue with industry partner Sanofi Pasteur.  For Topical Antileishmanial Cream, continue a human treatment protocol in the US, the industry partner continues stability testing of the drug product, and project 849 supports the overseas human clinical trials activities of the topical cream."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.987"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.987"
                                            },
                                            "Text": {
                                                "val": "The New Standard Military Insect Repellant testing transitioned to advanced development in FY 2011, to be funded with Defense Health Program Budget Activity 7 funding as the potential candidates are all commercially available.  Will review evaluations, and data from the Phase 2 safety\/efficacy clinical trials completed in FY 2012 for the Topical Antileishmanial Cream; complete preparation for Phase 3 Pivotal clinical trials for Topical Antileishmanial Cream; continue site development efforts in Cambodia and begin a Phase 3 Pivotal clinical trial for Malaria Prophylaxis with commercial partner Glaxo-Smith Kline; finalize analysis and evaluation of Phase 2 efficacy and safety data for the vaccine candidate for Dengue with industry partner Sanofi Pasteur; transition JBAIDS assay planned to advanced development and begin developmental testing; complete final process validation for Leishmania Rapid Diagnostic Device (LRDD); complete FDA approval and transition to Project 849 for Antimalarial Drug, Artesunate Intravenous."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Test and evaluate in-house and commercially developed products in extensive government-managed clinical trials to gather data required for FDA licensure and Environmental Protection Agency registration."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs  greater than $1M individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "12.062"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.250"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.919"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.919"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs  greater than $1M individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "12.509"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.269"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.080"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.080"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development of Malaria Prophylaxis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Walter Reed Army Institute of Research"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Silver Spring, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs  greater than $1M individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.385"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.431"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.388"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.388"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs  greater than $1M individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "43.318"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "New Standard Military Topical Insect Repellant (MS-B)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Anti-Malarial drug candidates Product Design Review (PDR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Leishmania Skin Test  CDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Topical Antileishmanial Cream CDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Topical Antileishmanial Cream Phase 2 Safety Studies"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "811"
                    },
                    "ProjectTitle": {
                        "val": "MIL HIV VAC&DRUG DEV"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.819"
                        },
                        "CurrentYear": {
                            "val": "2.384"
                        },
                        "BudgetYearOne": {
                            "val": "2.294"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.294"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.904"
                        },
                        "BudgetYearThree": {
                            "val": "0.884"
                        },
                        "BudgetYearFour": {
                            "val": "0.845"
                        },
                        "BudgetYearFive": {
                            "val": "0.859"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds development of militarily relevant human immunodeficiency virus (HIV) medical countermeasures.  It provides funding for the planning and conducting of human clinical trials in a group of healthy volunteers to assess the drug\/vaccine for safety, tolerability, how the drug\/vaccine is distributed, metabolized, and excreted from the body, and to investigate the appropriate dose for therapeutic use.  Development efforts are focused on militarily unique needs effecting manning, mobilization, and deployment. \n \nThe major contractor is Henry M. Jackson Foundation for the Advancement of Military Medicine, Rockville, MD.  Research efforts are coordinated with the National Institutes of Health."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Military HIV Vaccine & Drug Development"
                                    },
                                    "Description": {
                                        "val": "This project funds advanced development research to develop candidate HIV vaccines, assess their safety and effectiveness in evaluations with human subjects, and protect military personnel from risks associated with HIV infection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.819"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sought new industry partnership for selected candidate(s) drug\/vaccine for HIV medical treatment\/prevention."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.384"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform three inter-related studies to enhance our understanding of precisely how the vaccine strategy used in the 2009 safety\/efficacy trial caused vaccine recipients to be protected from infection, including intense laboratory studies using samples from the trial, and commencement of two small clinical vaccine trials to generate data and samples to define what vaccine responses to try to generate for next increment studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.294"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.294"
                                            },
                                            "Text": {
                                                "val": "Will complete three inter-related previous clinical trials aimed at refining our understanding of immune responses elicited by the increment 1 HIV vaccine strategy.  Analyze laboratory interrogation of samples from trial participants."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Test and evaluate commercially developed drug\/vaccine candidates in government-managed trials."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Not Applicable"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater than $1M individually."
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not Applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.135"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.473"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.456"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.456"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater than $1M individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.258"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.360"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.574"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.574"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Not Applicable"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater than $1 Million individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.493"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.444"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.534"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.534"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.471"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Not Applicable"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater than $1M individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not Applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.012"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.107"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.730"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.730"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.849"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "RV305 Phase 2 Study  of Secondary Boost"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RV306 Phase 2 Study"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RV328 Phase 2 Study of AIDSVAXB\/E"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prime\/Boost Phase 3 Study"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "836"
                    },
                    "ProjectTitle": {
                        "val": "Field Medical Systems Advanced Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.422"
                        },
                        "CurrentYear": {
                            "val": "19.769"
                        },
                        "BudgetYearOne": {
                            "val": "11.638"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.638"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "9.060"
                        },
                        "BudgetYearThree": {
                            "val": "9.012"
                        },
                        "BudgetYearFour": {
                            "val": "8.227"
                        },
                        "BudgetYearFive": {
                            "val": "8.279"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this PE."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the demonstration and validation of medical products for enhanced combat casualty care and follow-on care, including rehabilitation.  This project funds human clinical trials to test the safety and effectiveness of biologics (products derived from living organisms) and devices necessary to meet medical requirements.  When available, commercial-off-the-shelf (COTS) medical products are also tested and evaluated for transition to system development and demonstration.  Consideration is also given to reducing the medical logistics footprint through smaller weight, volume, and equipment independence from supporting materials.  All clinical trials are conducted in accordance with U.S. Food and Drug Administration (FDA) regulations.\nMajor contractors\/intra-governmental agencies include:  IGR Enterprises, Inc.; Army Medical Department Board Test Center; SeQual Technologies, Inc.; Ultrasonic Diagnostics, Inc.; HemCon Medical Technologies, Inc.; Hemerus Medical, LLC.; Fast Track Drugs & Biologics, LLC; Clinical Research Management, and Walter Reed Army Institute of Research (WRAIR) and Institute of Surgical Research (ISR) for user evaluation. Other military agencies include Program Executive Office (PEO) Soldier, PEO Combat Service Support, and Naval Undersea Warfare Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Field Medical Systems Advanced Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for demonstration and validation of medical products for enhanced casualty care and follow-on care, including rehabilitiation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.422"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Total Intravenous Anesthesia (TIVA): Performed clinical trials and submitted required documents for FDA clearance\/approval. Auto Critical Care System (ACCLS): Conducted validation testing and Army DT\/OT\/AWC.  Submitted the 510K for FDA review for modified devices. Urinary Facilitation Device: Tested, reported, and reviewed for FDA approval.  PEAK Surgical System (Plasma Blade): preclinical results were favorable, conducted environmental testing and identified any needed design modifications to produce a fieldable unit.  Pursued additional regulatory approvals as needed. Plasma Knife: preclinical results were favorable, conducted environmental testing and identified design modifications to produce a fieldable unit.  Pursued additional regulatory approvals as needed. Hydrosurgery System: Conducted operational and environmental testing. Remote Diagnostic Access (RDA): Developed software, conduct testing, and refinement for MOC Sensor Modual Development phase. Treatment Table for PM, HBCT Medical Mission Package for Treatment Variants: Tansitioned to Project 832.  Refrigerator for PM, HBCT for Medical Mission Package for Treatment Variant: Transitioned to Project 832. Shock and Vibration Isolation System for Patient Litters in Ground and Air Medical Evacuation Vehicles: Transitioned to Project 832.  Shelter for PM, HBCT for Medical Mission Package for Treatment Variant: Transitioned to Project 832. Passive Cold Chain Capability for Temperature Sensitive Medical Materiel: Transitioned to Project 832. The intranasal ketamine drug effects study transitioned to project 832 for Systems Development and Demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Field Medical Systems Advanced Development - PM Medical Devices"
                                    },
                                    "Description": {
                                        "val": "Advanced development funding is provided for the following development of medical devices in support of enhanced combat casualty care."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.428"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Non-invasive Multi-Analyte Monitor: submit RFP for the use of Infra Red Spectrometry to assess analyte concentration in blood.  Hydration Meter: Conduct validation testing.  Plasma Knife: Transition product to Project 832. Eye Tracking System for assessing concussions is a traumatic brain injury diagnostic tool that begins clinical trial to move to FDA submission. Fibrinogen Bandages will use an antimicrobial irrigation solution to protect blast injury wound sites from bacterial infection. Conduct final review of Good Manufacturing Practice (GMP) for movement forward to FDA submission. Cardiopulmonary Enhancement: Conduct multiple collaborative clinical protocols to review arrest and life threatening trauma devices for enhanced treatment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.480"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.480"
                                            },
                                            "Text": {
                                                "val": "Total Intravenus Anesthesia (TIVA): This product will transition to Tech Watch in FY 2012 and is not scheduled for further development in FY 2013.  Auto Critical Care System (ACCLS): Program is cancelled as it is no longer a viable product.  Urinary Facilitation Device: No further R&D funding required as this is now a commercial product.  PEAK Plasmablade:  No further R&D funding required as this is now a commercial product.  Hydrosurgery System: No further R&D funding required as this is now a commercial product. Non-invasive Multi-Analyte Monitor: submission cancelled because the Small Business innovation Research (SBIR) Product failed to meet future need\/requirement.  Eye Tracking System for Assessing Concussions (system is a traumatic brain injury diagnostic tool): IPT for Smooth Pursuit Eye Tracking will rebaseline plan in January 2012 for next steps to reach MSB in FY 2013-FY 2014.  Fibrinogen Bandages: Phase I clinical trial is scheduled to begin in FY 2013.  No further funding is planned after current contract.  Product is a biologic and is transitioning back to S&T.  Cardiopulmonary Enhancement:  Currently there is no device requirement identified. Bandits Banyan Biomarkers (now called TBI Diagnostic Assay System _ Increment II and Increment III Handheld): Enrollment for clinical trials continues and will identify a handheld platform for independent testing in June 2012.  Will schedule Milestone B review."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Field Medical Systems Advanced Development - PM Pharmaceuticals"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for advanced development of biologic medical products managed by PM Pharmaceuticals."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.063"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cryopreserved Platelets formerly Platelet Derived Hemostatic Agent (use of cryopreserved platelets for control of severe bleeding): Conduct clinical safety evaluations and conduct good manufacturing practices preliminary validation studies of the product. The Freeze-Dried Plasma Program (hemorrhage treatment candidate):  Conduct preliminary clinical evaluations and conduct good manufacturing practices preliminary validation studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.486"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.486"
                                            },
                                            "Text": {
                                                "val": "Blood Pathogen Reduction\/Inactivation transitioned to advanced development in FY 2012, transitioning from Army to be funded with Defense Health Program RDT&E funding; transitioned to Freeze-dried Plasma program to maintain current schedule and avoid delays Conduct Milestone B decision reviews for both Cryopreserved Platelets and Freeze-Dried Plasma Programs (New high priority from DoD leadership).  Accelerated fielding of a FDA-approved Freeze-Dried Plasma was validated in the   June 2011 Army Surgeon General's Report by the Blast Injury Task Force.   Cryopreserved Platelets: Start Phase 2 safety\/efficacy clinical trial in cancer patients with platelet deficiency. Freeze-Dried Plasma program: Complete Phase 2 clinical trial of safety and efficacy through a Cooperative Agreement with industry partner."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Field Medical systems Advanced Development - PM Integrated Clinical Systems (ICS)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort for medical products managed by PM ICS."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.888"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct final testing of Phase IV of the Remote Diagnostic Access (RDA). Develop a universal security compliant access portal to serve as a standardized compliance wrapper for all vendors, medical technology, and even IT management products that may traverse between the .com and .mil networks. The Milestone Decision Authority (MDA) is scheduled to review the RDA project in 2011 for continuation of development or termination due to commercial availability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Field Medical Systems Advanced Development - PM Medical Support Systems"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort in the development of products that support the medical mission in combat casualty care and health care operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.390"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Prepare and complete testing of the Treatment Table and Blood Refrigerator prototypes for PM HBCT.  Shock and Vibration Litter Isolation project terminated by MDA. Test new cold chain technologies for MES set inclusion. Prototype evaluation of Quad fold litter, litter straps, and hands-free litter system: Test new ISO shelter panel and transition back into ISO shelter specification for future shelter buys. Test Trauma Tiered Medical Bag and transition to PEO soldier. Continue to finalize soft-walled shelter development for Force Provider modules for use in Combat Support Hospitals. Develop and transition prototype Water and Waste Water Management system to Project 832 for further development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.672"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.672"
                                            },
                                            "Text": {
                                                "val": "Will transition treatment table and blood refrigerator for PM HBCT to Project 832 and continue development.  Will transition advanced cold chain technologies, trauma tiered medical bag, hoist aeromedical evacuation litter, and quad fold litter to Project 832 and continue development.  Will transition ISO panel development and Force Provider soft walled module components to 832 to finalize development. Will develop prototype for Environmental Sentinel Biomonitor, which transitioned from Science &Technology. Will apply funding from Milestone Decision Authority terminated project Shock and Vibration Litter System to a SBIR Phase II product, insecticide impregnated bed net, and acquire data for EPA approval.  Will collaborate with PEO Combat Service Support on development efforts for emerging medical vehicle evacuation variants."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Develop in-house or industrial prototypes in government-managed programs to meet military and regulatory requirements for production and fielding."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater than $M individually."
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "37.279"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.540"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.622"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.622"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Clinical Research Management"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hinckley, Ohio"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.133"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Allied Technologies & Consulting LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Frederick, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.945"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Banyan BioMarkers, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alachua FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "27.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.050"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "HemCon Medical Technologies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tigard, Oregon"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.520"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development of Platelet Derived Hemostatic agent"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Fast Track Drugs & Biologics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Frederick, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aquila Alaska Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aquila Alaska"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.200"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ALL Product"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development of Freeze-dried plasma"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.400"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not Applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "26.067"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "No product\/contract costs greater than $1M individually."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater than $M individually."
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "41.747"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.273"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.066"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.066"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "No product\/contract costs greater than $1M individually."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater than $1 Million individually."
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "UCA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "28.778"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.456"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Total intravenous Anesthesia (TIVA): Clinical Trials"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Cryopreserved Platelets Critical Design Review MS-B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Freeze-Dried Plasma"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Non-invasive Multi-Analyte Monitor"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Eye Tracking System for Assessment of Concussions"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Remote Diagnostic Device Commercial Product Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS7"
                    },
                    "ProjectTitle": {
                        "val": "MEDEVAC MISSION EQUIPMENT PACKAGE (MEP) - ADV DEV"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.640"
                        },
                        "BudgetYearOne": {
                            "val": "0.465"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.465"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.562"
                        },
                        "BudgetYearThree": {
                            "val": "0.457"
                        },
                        "BudgetYearFour": {
                            "val": "0.406"
                        },
                        "BudgetYearFive": {
                            "val": "0.115"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Original models of Army Black Hawk MEDEVAC helicopters continue to play a major role in maintaining high US troop survival rates in Iraq and Afghanistan by evacuating wounded troops in less than one-hour.  In 2009 a VCSA-approved force design update increased the number of air frames in the force from 12 to 15 aircraft for 37 MEDEVAC companies to better meet operational needs.  In 2010, the AMEDD accepted life-cycle management of the MEDEVAC MEP from PEO Aviation.  In order to achieve required operational capability and enhance commonality across the MEDEVAC fleet, the MEDEVAC MEP program upgrades, retrofits, trains, and sustains the 256 MEDEVAC legacy helicopters to achieve the medical capability provided by the HH-60M, which is factory built for the MEDEVAC mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MEDEVAC Mission Sensor Foward Looking Infrared (FLIR)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort in the advanced development of critical components in MEDEVAC MEP."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.575"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "MEDEVAC Mission Sensor (MMS) FLIR for UH-60 aircraft. One of the requirements for the UH-60A\/L MEDEVAC is a sensor system that will assist the pilots in locating patient pick-up points and assist them in maintaining situational awareness in night and adverse weather conditions. The MMS is currently being qualified for use on the HH-60M aircraft. This system will be installed on UH-60 aircraft using the proven Sponson-Mount FLIR system, which is currently being used in OEF for the MEDEVAC mission. The funds will develop and test a Medical Mission Sensor FLIR prototype on the UH-60A\/L."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Control System for MEDEVAC aircraft"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.509"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The HH-60A\/L\/M has an environmental control system to assist in regulating the cabin temperature. This system will help prevent injury and loss of life to patients due to heat stress or hypothermia during transport. The system will also provide improved crew comfort in extreme environmental conditions, particularly high temperatures. The system will utilize the component-qualified 2-Pallet ECS developed for the HH-60M and develop and test a prototype installation for the UH-60A\/L."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Telemedicine for MEDEVAC aircraft"
                                    },
                                    "Description": {
                                        "val": "Effort is focused on requirement to provide enroute patient data to treatment facilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.556"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Telemedicine is an ongoing requirement for US Army MEDEVAC, to allow the patient care-giver at point of injury or during transport to access the knowledge and expertise of a more qualified care-giver at a remote location, and to provide patient data to the receiving facility prior to patient arrival, allowing the facility more time to prepare for intensive care patients. The program develops, installs, and tests a telemedicine system for the UH-60A\/L family of aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.465"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.465"
                                            },
                                            "Text": {
                                                "val": "Will continue design, develop, and test telemedicine systems in order to provide medics with state of the art capability to monitor and communicate patient data to ground crews at forward treatment facility"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Develop in-house or industrial prototypes in government-managed programs to meet military MEDEVAC and regulatory requirements for production and fielding."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater than $1 Million individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APM MEDEVAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.201"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.037"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.037"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.238"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater than $1Million individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APM MEDEVAC \nPEO  Aviation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.140"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.428"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.428"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.568"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater thatn $1Million individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APM MEDEVAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.100"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "No product\/contract costs greater than $1Million individually"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APM MEDEVAC\nPEO Aviation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.199"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.199"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "MEDEVAC Mission Sensor (MMS) FLIR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Environmental Control System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Telemedicine Research and Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}