{
    "id": "d76d369f59db9aa7d103f5a1913fc01d2ade2dd0",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA6_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605702A"
        },
        "ProgramElementTitle": {
            "val": "Meteorological Support to RDT&E Activities"
        },
        "R1LineItemNumber": {
            "val": "147"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.983"
            },
            "CurrentYear": {
                "val": "7.171"
            },
            "BudgetYearOne": {
                "val": "7.402"
            },
            "BudgetYearOneBase": {
                "val": "7.402"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "7.325"
            },
            "BudgetYearThree": {
                "val": "7.216"
            },
            "BudgetYearFour": {
                "val": "7.206"
            },
            "BudgetYearFive": {
                "val": "7.243"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "All functions and resources in this Program Element (PE) are managed by the U.S. Army Test and Evaluation Command (ATEC).  Meteorological support to research, development, test, and evaluation (RDT&E) activities provides standard and specialized weather forecasts and data for test reports to satisfy Army\/Department of Defense RDT&E test requirements for modern weaponry, e.g., (1) unique atmospheric analysis and sampling to include atmospheric transmittance, extinction, optical scintillation, infrared temperature, aerosol\/smoke cloud dispersion characteristics, ballistic meteorological measurements, snow characterization and crystal structure; (2) test event forecasting to include prediction of sound propagation for ballistic firing tests, specialized prediction of light levels and target to background measurements, and predictions for electro-optical testing and ballistic artillery\/mortar firing; and (3) advisory and warning products such as go\/no-go test recommendations for ballistic and atmospheric probe missiles, smoke\/obscurant tests, hazard predictions for chemical agent munitions disposal, monitoring dispersion of simulant clouds for chemical\/biological detector tests, simulated nuclear blasts, and weather warnings for test range safety.  Provides technical support to Army Program Executive Officers (PEOs), Project Managers (PMs), and the Army test ranges and sites at:  White Sands Missile Range (WSMR), New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; Dugway Proving Ground (DPG), Utah; Aberdeen Test Center (ATC), Aberdeen  Proving Ground, Maryland; Redstone Test Center (RTC), Redstone Arsenal, Alabama;  Yuma Proving Ground (YPG), Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, AK); Fort Belvoir, Virginia; and Fort A.P. Hill, Virginia.  This program develops methodologies and acquires instrumentation and systems that allow meteorological teams to support current and future Army\/DoD RDT&E requirements.  It finances indirect meteorological support operating costs not billable to customers and replacement\/upgrade of meteorological instrumentation and support systems.  Direct costs for meteorological support services are not funded by this PE, but are borne by the customer (i.e., materiel\/weapons developers and project\/product managers) in accordance with DoD Directive 7000.14R, October 1999.  This program is essential to the accomplishment of the Army's developmental test mission in that precise weather modeling and measurements directly influence test item performance and quantify test item weather dependencies and vulnerabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.185"
                },
                "CurrentYear": {
                    "val": "7.182"
                },
                "BudgetYearOne": {
                    "val": "7.366"
                },
                "BudgetYearOneBase": {
                    "val": "7.366"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.983"
                },
                "CurrentYear": {
                    "val": "7.171"
                },
                "BudgetYearOne": {
                    "val": "7.402"
                },
                "BudgetYearOneBase": {
                    "val": "7.402"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.202"
                },
                "CurrentYear": {
                    "val": "-0.011"
                },
                "BudgetYearOne": {
                    "val": "0.036"
                },
                "BudgetYearOneBase": {
                    "val": "0.036"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.113"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.036"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.036"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.089"
                                },
                                "CurrentYear": {
                                    "val": "-0.011"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "128"
                    },
                    "ProjectTitle": {
                        "val": "Meteorological Support to RDT&E Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.983"
                        },
                        "CurrentYear": {
                            "val": "7.171"
                        },
                        "BudgetYearOne": {
                            "val": "7.402"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.402"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.325"
                        },
                        "BudgetYearThree": {
                            "val": "7.216"
                        },
                        "BudgetYearFour": {
                            "val": "7.206"
                        },
                        "BudgetYearFive": {
                            "val": "7.243"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides meteorological support to research, development, test, and evaluation (RDT&E) activities and provides standard and specialized weather forecasts and data for test reports to satisfy Army\/Department of Defense RDT&E test requirements for modern weaponry, e.g., (1) unique atmospheric analysis and sampling to include atmospheric transmittance, extinction, optical scintillation, infrared temperature, aerosol\/smoke cloud dispersion characteristics, ballistic meteorological measurements, snow characterization and crystal structure; (2) test event forecasting to include prediction of sound propagation for ballistic firing tests, specialized prediction of light levels and target to background measurements, and predictions for electro-optical testing and ballistic artillery\/mortar firing; and (3) advisory and warning products such as go\/no-go test recommendations for ballistic and atmospheric probe missiles, smoke\/obscurant tests, hazard predictions for chemical agent munitions disposal, monitoring dispersion of simulant clouds for chemical\/biological detector tests, simulated nuclear blasts, and weather warnings for test range safety.  Provides technical support to Army Program Executive Officers (PEOs), Project Managers (PMs), and the Army test ranges and sites at:  White Sands Missile Range (WSMR), New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; Dugway Proving Ground (DPG), Utah; Aberdeen Test Center (ATC), Aberdeen  Proving Ground, Maryland; Redstone Test Center (RTC), Redstone Arsenal, Alabama;  Yuma Proving Ground (YPG), Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, AK); Fort Belvoir, Virginia; and Fort A.P. Hill, Virginia.  This program develops methodologies and acquires instrumentation and systems that allow meteorological teams to support current and future Army\/DoD RDT&E requirements.  It finances indirect meteorological support operating costs not billable to customers and replacement\/upgrade of meteorological instrumentation and support systems.  Direct costs for meteorological support services are not funded by this PE, but are borne by the customer (i.e., materiel\/weapons developers and project\/product managers) in accordance with DoD Directive 7000.14R, October 1999.  This program is essential to the accomplishment of the Army's developmental test mission in that precise weather modeling and measurements directly influence test item performance and quantify test item weather dependencies and vulnerabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Pay and Support Costs"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.346"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided indirect costs (personnel salaries) for generating weather forecasts, severe weather warnings and advisories; staff meteorological services; and atmospheric measurements in support of Army\/DoD tests and projects at nine Army sites\/test ranges, and alternate test sites as required.  Provided program management for meteorological support to the Army research, development, test and evaluation community and technical review\/assistance to ranges and meteorological support teams. Includes collaboration between Army meteorologists and the National Center for Atmospheric Research (NCAR) toward improvements to the Four-Dimensional Weather (4DWX) System."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.680"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provides indirect costs (personnel salaries) for generating weather forecasts, severe weather warnings and advisories; staff meteorological services; and atmospheric measurements in support of Army\/DoD tests and projects at nine Army sites\/test ranges, and alternate test sites as required.  Provides program management for meteorological support to the Army research, development, test and evaluation community and technical review\/assistance to ranges and meteorological support teams.  Includes collaboration between Army meteorologists and the National Center for Atmospheric Research (NCAR) toward improvements to the Four-Dimensional Weather (4DWX) System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.534"
                                            },
                                            "Text": {
                                                "val": "Will provide indirect costs (personnel salaries) for generating weather forecasts, severe weather warnings and advisories; staff meteorological services; and atmospheric measurements in support of Army\/DoD tests and projects at nine Army sites\/test ranges, and alternate test sites as required.  Will provide program management for meteorological support to the Army research, development, test and evaluation community and technical review\/assistance to ranges and meteorological support teams.  Includes collaboration between Army meteorologists and the National Center for Atmospheric Research (NCAR) toward improvements to the Four-Dimensional Weather (4DWX) System."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Four Dimensional Weather System (4DWX) and Instrumentation"
                                    },
                                    "Description": {
                                        "val": "Provides funding for meteorological instrumentation and technology to support RDT&E activities at Army test ranges.  Includes funding for development and enhancement of the 4DWX system, an advanced meteorological support system that provides high-resolution weather forecasts and analyses.  The 4DWX analyses and forecasts of the 3-dimensional structure of the atmosphere over time (4th dimension) are used in test planning, conduct, and forensic analyses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued 4DWX system enhancements and modernization in development of ensemble modeling, improved parameterizations of wind flow over mountains and other complex terrain features to improve forecast accuracy; and development of new 4DWX-based techniques to generate weather data in vertical profiles, to reduce the need for some weather balloon launches.  Instrumentation funding was used to continue a multiyear effort to replace\/upgrade obsolete instrumentation, including upper-air sounding systems, upgrades to weather stations, renovation of radar wind profilers, replacement of Doppler acoustic sounders (wind profile measurements), and relocation of sodar systems (equipment to measure vertical weather profiles) between ranges to maximize use of equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.491"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue 4DWX system enhancements and modernization to improve forecast accuracy in support of Army RDT&E mission requirements, including selection of probabilistic modeling approach, development of parameterizations of wind flow over mountains and other complex terrain features, improved data assimilation procedures, and configuration of 4DWX for each test range to optimize accuracy; and development of a Verification, Validation and Accreditation (VV&A) system for 4DWX. Instrumentation funding will be used to continue a multiyear effort to replace\/upgrade obsolete instrumentation, including upper-air sounding systems, upgrades to weather stations, renovation of radar wind profilers, replacement of Doppler acoustic sounders (wind profile measurements), and relocation of sodar systems (equipment to measure vertical weather profiles) between ranges to maximize use of equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.868"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.868"
                                            },
                                            "Text": {
                                                "val": "Will continue 4DWX system enhancements and modernization to improve forecast accuracy in support of Army RDT&E mission requirements, including development of probabilistic modeling, use of improved parameterizations of wind flow over complex terrain features, improved data assimilation procedures, and configuration of 4DWX for each test range to optimize accuracy; and development and implementation of a VV&A system for 4DWX. Instrumentation funding will be used to continue a multiyear effort to replace\/upgrade obsolete instrumentation, including upper-air sounding systems, upgrades to weather stations, renovation of radar wind profilers, replacement of Doppler acoustic sounders (wind profile measurements), and relocation of sodar systems (equipment to measure vertical weather profiles) between ranges to maximize use of equipment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}