{
    "id": "dca26cd778700b1332484673de6a55266575d6db",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603716D8Z"
        },
        "ProgramElementTitle": {
            "val": "Strategic Environmental Research and Development Program (SERDP)"
        },
        "R1LineItemNumber": {
            "val": "49"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "59.152"
            },
            "CurrentYear": {
                "val": "64.565"
            },
            "BudgetYearOne": {
                "val": "65.282"
            },
            "BudgetYearOneBase": {
                "val": "65.282"
            },
            "BudgetYearTwo": {
                "val": "66.552"
            },
            "BudgetYearThree": {
                "val": "68.197"
            },
            "BudgetYearFour": {
                "val": "70.133"
            },
            "BudgetYearFive": {
                "val": "71.405"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Congress established the Strategic Environmental Research and Development Program (SERDP) in 1990 (10 U.S.C. Section 2901-2904) to address Department of Defense (DoD) and Department of Energy (DOE) environmental concerns.  It is conducted as a DoD program, jointly planned and executed by the DoD, DOE, and the Environmental Protection Agency (EPA), with strong participation by other Federal agencies, industry, and academia.  SERDP`s objective is to improve DoD mission readiness and environmental performance by providing new scientific knowledge and cost-effective technologies in the areas of Environmental Restoration, Munitions Response, Resource Conservation and Climate Change, and Weapons Systems and Platforms.  SERDP does this by addressing high priority DoD environmental technology requirements.  SERDP enhances military operations, improves military systems` effectiveness, enhances military training\/readiness, sustains DoD’s training and test ranges and installation infrastructure, and helps ensure the safety and welfare of military personnel and their dependents by eliminating or reducing the generation of pollution and use of hazardous materials and reducing the cost of remedial actions and compliance with environmental laws and regulations.  As a secondary benefit, SERDP helps solve significant national and international environmental problems.  The keys to a growing list of SERDP technological successes are the ability to respond aggressively and proactively to priority defense environmental needs; the pursuit of world-class technical excellence; and an emphasis on constant technology transfer."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "68.021"
                },
                "CurrentYear": {
                    "val": "66.409"
                },
                "BudgetYearOne": {
                    "val": "67.119"
                },
                "BudgetYearOneBase": {
                    "val": "67.119"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.152"
                },
                "CurrentYear": {
                    "val": "64.565"
                },
                "BudgetYearOne": {
                    "val": "65.282"
                },
                "BudgetYearOneBase": {
                    "val": "65.282"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.869"
                },
                "CurrentYear": {
                    "val": "-1.844"
                },
                "BudgetYearOne": {
                    "val": "-1.837"
                },
                "BudgetYearOneBase": {
                    "val": "-1.837"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.920"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Efficiency - RSBC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.039"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Defense Efficiency - Contractor Support Staff"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.446"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.325"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.139"
                                },
                                "CurrentYear": {
                                    "val": "-1.844"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.837"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.837"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P470"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Environmental Research and Development Program (SERDP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.152"
                        },
                        "CurrentYear": {
                            "val": "64.565"
                        },
                        "BudgetYearOne": {
                            "val": "65.282"
                        },
                        "BudgetYearOneBase": {
                            "val": "65.282"
                        },
                        "BudgetYearTwo": {
                            "val": "66.552"
                        },
                        "BudgetYearThree": {
                            "val": "68.197"
                        },
                        "BudgetYearFour": {
                            "val": "70.133"
                        },
                        "BudgetYearFive": {
                            "val": "71.405"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congress established the Strategic Environmental Research and Development Program (SERDP) in 1990 (10 U.S.C. Section 2901-2904) to address Department of Defense (DoD) and Department of Energy (DOE) environmental concerns.  It is conducted as a DoD program, jointly planned and executed by the DoD, DOE, and the Environmental Protection Agency (EPA), with strong participation by other Federal agencies, industry, and academia.  SERDP`s objective is to improve DoD mission readiness and environmental performance by providing new scientific knowledge and cost-effective technologies in the areas of Environmental Restoration, Munitions Response, Resource Conservation and Climate Change, and Weapons Systems and Platforms.  SERDP does this by addressing high-priority DoD environmental technology requirements.  Technologies developed by SERDP enhance military operations, improve military systems’ effectiveness, enhance military training\/readiness, sustain DoD’s training and test ranges and installation infrastructure, and help ensure the safety and welfare of military personnel and their dependents by eliminating or reducing the generation of pollution and use of hazardous materials and by reducing the cost of remedial actions and compliance with environmental laws and regulations.  As a secondary benefit, SERDP helps solve significant national and international environmental problems.  The keys to a growing list of SERDP technological successes are the ability to respond aggressively and proactively to priority defense environmental needs; the pursuit of world-class technical excellence; and an emphasis on constant technology transfer."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Restoration"
                                    },
                                    "Description": {
                                        "val": "Environmental Restoration (ER) reduces DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.392"
                                            },
                                            "Text": {
                                                "val": "New research initiatives focused on assessing the environmental impacts of munitions compounds in the marine environment, in situ remediation of perfluoroalkyl contaminated groundwater, improving the understanding of impacts to groundwater quality post-remediation, and improved assessments of munitions constituent source terms on operational ranges.  A description of all ER projects funded in FY 2011 can be found at www.serdp-estcp.org."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.068"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to reduce DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water.  Specific Statements of Need were released and proposals are being selected that will address the development of sustainable wastewater treatment processes for forward operating bases and assessing the environmental fate and impacts of insensitive munitions compounds.  Details are available at www.serdp-estcp.org."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.967"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to reduce DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Response (MR)"
                                    },
                                    "Description": {
                                        "val": "Munitions Response (MR) develops detection, discrimination, and remediation technologies for Unexploded Ordnance (UXO) to address the significant DoD liability in the Military Munitions Response Program.  Investments are also made to improve active range clearance and to reduce generation of UXO during live fire testing and training operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.688"
                                            },
                                            "Text": {
                                                "val": "New research initiatives focused on advancements in underwater UXO detection and discrimination, advanced sensors, signal processing, supporting technologies, and protocols to support informed decisions and reduce the costs associated with detecting and remediating UXO.  A description of all MR projects funded in FY 2011 can be found at www.serdp-estcp.org."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.496"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements in underwater UXO detection and discrimination, advanced sensors, signal processing, supporting technologies, and protocols to reduce the costs associated with detecting and remediating UXO on land and underwater.  Statements of Need were released and proposals are being selected to address these issues.  Details are available at www.serdp-estcp.org."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.396"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.396"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements in underwater UXO detection and discrimination, advanced sensors, signal processing, supporting technologies, and protocols to reduce the costs associated with detecting and remediating UXO on land and underwater."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resource Conservation and Climate Change (RC)"
                                    },
                                    "Description": {
                                        "val": "Resource Conservation and Climate Change (RC) develops the science and technologies required to sustain training and testing ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.698"
                                            },
                                            "Text": {
                                                "val": "New research initiated in FY 2011 included assessing the impacts of climate change on Alaskan ecological systems; improving the understanding of the behavioral ecology of cetaceans; developing fundamental and applied science required to manage and restore forested ecosystems on Department of Defense (DoD) lands; and improving our understanding of source-sink dynamics for populations of species of relevance to DoD resource managers.  A description of all RC projects funded in FY 2011 can be found at www.serdp-estcp.org."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.890"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop the science and technologies required to sustain training and testing ranges and respond to requirements in the 2010 QDR, including the assessment of climate change impacts to DoD installations.  Specific Statements of Need were released and proposals are being selected for funding to address these issues.  Details are available at www.serdp-estcp.org."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.839"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.839"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop the science and technologies required to sustain training and testing ranges and respond to requirements in the 2010 QDR, including the assessment of climate change impacts to DoD installations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapons Systems and Platforms (WP)"
                                    },
                                    "Description": {
                                        "val": "Weapons Systems and Platforms (WP) develops technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.374"
                                            },
                                            "Text": {
                                                "val": "New initiatives included the development of alternatives to copper-  and aluminum-beryllium alloys for military applications; environmentally benign, insensitive, castable, high-performance, minimum-smoke rocket propellants; understanding the corrosion protection requirements for adhesive bond primers; combustion science to predict emissions from military platforms burning alternative fuels; and environmentally benign removal process for low-observable weapons systems. A description of all WP projects funded in FY 2011 can be found at www.serdp-estcp.org."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.111"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts.  Specific Statements of Need were released to address the development of chemical agent resistant powder topcoats; scale-up and formulation of green insensitive secondary explosives; waste-to-energy converters for overseas contingency operations; and assessing the reliability of tin-whisker-mitigating conformal coatings.  Details are available at www.serdp-estcp.org."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.080"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.080"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance in this program is monitored at two levels.  At the lowest level, each of the more than 160 individual projects is measured against both technical and financial milestones on a quarterly and annual basis.  At a program-wide level, progress is measured against DoD's environmental requirements and the development of technologies that address these requirements as well as the transition of these technologies to either to demonstration and validation programs or to direct use in the field."
                        }
                    }
                }
            ]
        }
    }
}