{
    "id": "e20759a392e2a39bffb72cd427c6ae37f26a1b9b",
    "meta": {
        "filename": "dod-2013_RDTE_2013_ARMY_BA3_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603002A"
        },
        "ProgramElementTitle": {
            "val": "MEDICAL ADVANCED TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "30"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "114.036"
            },
            "CurrentYear": {
                "val": "102.810"
            },
            "BudgetYearOne": {
                "val": "69.580"
            },
            "BudgetYearOneBase": {
                "val": "69.580"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "70.759"
            },
            "BudgetYearThree": {
                "val": "74.388"
            },
            "BudgetYearFour": {
                "val": "74.563"
            },
            "BudgetYearFive": {
                "val": "75.561"
            }
        },
        "ProgramElementNote": {
            "val": "FY11 and FY12 increases are due to congressional adds."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) maturates and demonstrates advanced medical technologies including drugs, vaccines, medical devices, and diagnostics and developing medical practices and procedures to effectively protect and improve the survivability of US Forces across the entire spectrum of military operations.  Tri-Service coordination and cooperative efforts are focused in four principal medical areas: Combat Casualty Care, Military Operational Medicine, Militarily Relevant Infectious Diseases, and Clinical and Rehabilitative Medicine. \n \nPromising medical technologies are refined and validated through extensive testing, which is closely monitored by the U.S. Food and Drug Administration (FDA) and Environmental Protection Agency (EPA), as part of their processes for licensing new medical products.  The FDA requires medical products to undergo extensive preclinical testing in animals and\/or other models to obtain preliminary efficacy and toxicity information before they can be tested in humans (clinical trials).  Clinical trials are conducted in three phases to prove the safety of a drug, vaccine, or device for the targeted disease or medical condition, starting in Phase 1 with a small number of healthy volunteers.  Each successive phase includes larger numbers of human subjects and requires FDA cognizance prior to proceeding.  Work conducted in this PE primarily focuses on late stages of technology maturation activities required to conduct Phase 2 human expanded safety and efficacy clinical trials. Some high risk technologies may require additional maturation with FDA guidance prior to initiating these clinical trials.  Such things as proof of product stability and purity are necessary to meet FDA standards before entering later stages of testing and prior to transitioning into a formal acquisition program and conducting Phase 3 trials for licensure.  Activities in the PE may include completion of preclinical animal studies and Phase 1 and 2 clinical studies involving human volunteers according to the FDA and EPA requirements.  Promising medical technologies that are not regulated by the FDA are modeled, prototyped, and tested in relevant environments.\n\nBlast research efforts in this PE are fully coordinated with the United States Army Natick Soldier Research, Development and Engineering Center.  This coordination enables improved body armor design and rations for Soldiers.  Additionally, the activities funded in this PE are externally peer reviewed and fully coordinated with all Services as well as other agencies through the Joint Technology Coordinating Groups of the Armed Services Biomedical Research Evaluation and Management (ASBREM) Committee.  The ASBREM Committee serves to facilitate coordination and prevent unnecessary duplication of effort within DoD?s biomedical research and development community, as well as their associated enabling research areas.\n\nProject 810 matures and demonstrates US Food and Drug Administration (FDA) regulated medical countermeasures such as drugs, vaccines, and diagnostic systems to naturally occurring infectious diseases and wound infections of military importance, as identified by worldwide medical surveillance and military threat analysis.  The project also supports testing of personal protective measures such as repellents and insecticides regulated by the U. S. Environmental Protection Agency (EPA). This project is being coordinated with the Defense Health Program.\nProject 840 validates studies on safety and effectiveness of drugs, biologics (products derived from living organisms), medical devices and medical procedures intended to minimize immediate and long-term effects from battlefield injuries; advanced technology development and clinical studies for treatment of ocular and visual system traumatic injury; and restoration of function and appearance by regenerating skin, muscle, and bone tissue in battle-injured casualties.  Additionally, this project develops and realistically tests improved occupant protection systems through medical research to characterize mechanisms of injuries sustained by occupants of ground-combat vehicles subjected to underbody blast events, determine human tolerance limits to underbody blast forces, and develop tools to predict injuries to ground-combat vehicle occupants exposed to underbody blast forces.\nProject FH4 matures, validates, and supports enhanced Force Health Protection of Soldiers against threats in military operations and training.  Health-monitoring tools are matured to rapidly identify deployment stressors that affect the health of Joint Forces.  These databases and systems enhance the Department of Defense's (DoD's) ability to monitor and protect against adverse changes in health, especially mental health effects caused by changes in brain function.  Force Health Protection work is conducted in close coordination with the Department of Veterans Affairs.  The program is maturing the development of global health monitoring (e."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "71.510"
                },
                "CurrentYear": {
                    "val": "68.171"
                },
                "BudgetYearOne": {
                    "val": "65.647"
                },
                "BudgetYearOneBase": {
                    "val": "65.647"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "114.036"
                },
                "CurrentYear": {
                    "val": "102.810"
                },
                "BudgetYearOne": {
                    "val": "69.580"
                },
                "BudgetYearOneBase": {
                    "val": "69.580"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "42.526"
                },
                "CurrentYear": {
                    "val": "34.639"
                },
                "BudgetYearOne": {
                    "val": "3.933"
                },
                "BudgetYearOneBase": {
                    "val": "3.933"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "44.000"
                    },
                    "CurrentYear": {
                        "val": "34.639"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.193"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.933"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.933"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "1.719"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "810"
                    },
                    "ProjectTitle": {
                        "val": "IND BASE ID VACC&DRUG"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.290"
                        },
                        "CurrentYear": {
                            "val": "18.617"
                        },
                        "BudgetYearOne": {
                            "val": "19.574"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.574"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "20.739"
                        },
                        "BudgetYearThree": {
                            "val": "20.483"
                        },
                        "BudgetYearFour": {
                            "val": "19.774"
                        },
                        "BudgetYearFive": {
                            "val": "19.935"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates U.S. Food and Drug Administration (FDA) regulated medical countermeasures such as drugs, vaccines, and diagnostic systems to naturally occurring infectious diseases that are threats to U.S. military deployed forces.  The focus of the program is on prevention, diagnosis, and treatment of diseases that can adversely impact military mobilization, deployment, and operational effectiveness.  Prior to licensure of a new drug or vaccine to treat or prevent disease, the FDA requires testing in human subjects.  Studies are conducted stepwise: first to prove the product is safe in humans, second to demonstrate the desired effectiveness and optimal dosage in a small study, and third to demonstrate effectiveness in large, diverse human populations.  All test results are submitted to the FDA for evaluation to ultimately obtain approval (licensure) for medical use.  This project supports studies for safety and effectiveness testing on small study groups after which they transition to the next phase of development for completion of studies in larger populations.  The project also supports testing of personal protective measures that can reduce disease transmission from biting insects and other vectors to include products such as repellents and insecticides which are regulated by the U.S. Environmental Protection Agency (EPA). \n \nResearch conducted in this project focuses on the following five areas: \n(1) Drugs to Prevent\/Treat Parasitic (symbiotic relationship between two organisms) Diseases\n(2) Vaccines for Preventing Malaria\n(3) Bacterial Threats\n(4) Viral Threats\n(5) Diagnostics and Disease Transmission Control \n \nResearch is conducted in compliance with FDA regulations for medical products for human use and EPA regulations for insect control products that impact humans or the environment (e.g., repellents and insecticides).\n\nWork is managed by the Walter Reed Institute of Research (WRAIR), U.S. Army Medical Institute of Infectious Disease (USAMRIID), and coordinated with Naval Medical Research Center (NMRC).  The Army is responsible for programming and funding all DoD naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.    \n\nPromising medical countermeasures identified in this project are further matured under PE 0603807A, project 808.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.    \n  \nWork in this project is performed by the Walter Reed Army Institute of Research, Silver Spring, MD, and its overseas laboratories; the U.S. Army Medical Research Institute of Infectious Diseases, Fort Detrick, MD; and the Naval Medical Research Center, Silver Spring, MD, and its overseas laboratories. \n\nEfforts in this project support the Soldier Portfolio and the principle area of Military Relevant Infectious Diseases."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Drugs to Prevent\/Treat Parasitic Diseases"
                                    },
                                    "Description": {
                                        "val": "This effort selects promising malaria and leishmaniasis (a disease transmitted by sand flies) drug candidates for testing in humans, and prepare data packages required for FDA approval of testing in humans and conduct testing. Studies have shown that the malaria parasite can become resistant to existing drugs, which makes it necessary to continually research new and more effective treatments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.366"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Based on selection of promising candidates in previous year, expanded testing in humans of treatment options for malaria and leishmaniasis; worked with commercial manufacturer to change the dosing and subsequent labeling of Malarone for other malaria treatment indications"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.335"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate safety and effectiveness studies in human volunteers on the most promising candidate identified from preclinical studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.932"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.932"
                                            },
                                            "Text": {
                                                "val": "Will evaluate effectiveness of new anti-parasitic drugs through testing in human populations exposed to malaria and leishmania infections."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vaccines for Prevention of Malaria"
                                    },
                                    "Description": {
                                        "val": "This effort selects candidate vaccines for various types of malaria, including the severe form of malaria (Plasmodium falciparum) and the less severe but relapsing form (Plasmodium vivax), and prepares technical data packages required for FDA approval of testing in humans. Conduct testing of promising malaria vaccine candidates in humans. A malaria vaccine would minimize the progression and impact of drug resistance and poor Warfighter compliance with taking preventive anti-malarial drugs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted studies to determine optimal dosing schedule of new Plasmodium falciparum malaria vaccine candidate, and planned for safety and effectiveness tests in larger populations in endemic areas; down-selected best and most effective vaccine candidates, for further development; assessed effectiveness of Plasmodium vivax malaria candidate vaccines in humans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.905"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Formulate new candidate vaccines against Plasmodium falciparum and Plasmodium vivax malaria as well as test them in uninfected adults for safety, immunogenicity (ability to produce an immune response), and effectiveness; further test the most promising vaccine candidates in adults and children in larger test populations where malaria occurs naturally; transfer vaccine candidate to the advanced development program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.556"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.556"
                                            },
                                            "Text": {
                                                "val": "Will conduct clinical trials of multiple types of vaccines in human populations using laboratory-based human challenge model.  Then, for promising candidates, optimize administration for testing in human populations naturally exposed to malaria.  If a successful candidate is identified, it will transition to advanced development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Threats"
                                    },
                                    "Description": {
                                        "val": "This effort selects promising candidate vaccines against each of the three main bacterial causes of diarrhea (E. coli, Campylobacter, and Shigella; a significant threat during initial deployments), and meningococcal vaccine candidates (a threat to trainees, deployed troops, and military families) for testing in human subjects.  Data packages are prepared, as required for FDA approval, and testing is conducted in human subjects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.398"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued safety and effectiveness trials of Invaplex and live attenuated Shigella vaccine; continued safety and effectiveness trial to establish most promising E. coli vaccine; undertook a safety study in humans of the meningococcal Group B multicomponent vaccine."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.594"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct human trials of live attenuated Shigella vaccine and E. coli vaccine to determine their effectiveness;, complete transfer of meningococcal vaccine technology to commercial partner."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.508"
                                            },
                                            "Text": {
                                                "val": "Will conduct second human clinical trial for E. coli vaccines to determine the best candidate vaccine, route of administration, and dosage; conduct additional human clinical trials on best Shigella vaccine based on FY 2012 human trial results; evaluate results of Campylobacter clinical trial conducted in FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Threats Research"
                                    },
                                    "Description": {
                                        "val": "This effort selects the most promising vaccine candidates for evaluation in human subjects against Human Immunodeficiency Virus (HIV), dengue fever (a severe debilitating disease caused by a virus and transmitted by a mosquito) and hantavirus (severe viral infection that causes internal bleeding and is contracted from close contact with rodents). Conduct FDA-required nonclinical safety and protection testing (laboratory-based) in animals, prepare FDA investigational new drug technical data packages, and conduct clinical testing of candidate vaccines in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.362"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Further developed the hantavirus vaccine with support of a commercial partner; conducted testing in humans for safety and effectiveness of the final dengue vaccine candidate."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.825"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Further develop the hantavirus vaccine with support of a commercial partner to include evaluation of vaccine delivery methods to improve effectiveness and safety; transition to advanced development program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.359"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.359"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate the concept of a prime-boost dengue virus (DENV) vaccine strategy, which stimulates different parts of the immune system and enhances the body's overall immune response, to improve current vaccine and reduce developmental risk; conduct further clinical testing of dengue vaccine candidates; further develop the hantavirus vaccine with support of a commercial partner to include evaluation of vaccine delivery methods to improve effectiveness and safety; transition to advanced development, will prepare and conduct safety studies in human volunteers with new HIV vaccine candidates at multiple sites worldwide."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostics and Disease Transmission Control"
                                    },
                                    "Description": {
                                        "val": "This effort conducts human subject testing of FDA-regulated field medical diagnostic devices and EPA-approved measures to control insect-borne pathogens and diseases such as Q fever (sand fly fever), Japanese encephalitis, Rickettsial disease (carried by ticks, fleas, and lice), and other pathogens transmitted by arthropods (animals without a backbone with segmented bodies and jointed limbs, such as a scorpion, crab, or centipede)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.064"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Transitioned new repellent to advanced development; evaluated a field device to detect the dengue virus in mosquitoes in conjunction with commercial partner; assisted commercial partners in fielding of FDA-approved point-of-care tests for dengue fever and leishmaniasis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.958"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete the evaluation of repellent products; Assist the commercial partners in fielding FDA-approved rapid human diagnostics (point-of-care tests) for Q-fever; evaluate a field detection device to detect Japanese encephalitis and other pathogens transmitted by arthropods (animals without a backbone with segmented bodies and jointed limbs, such as a scorpion, crab, or centipede) in collaboration with commercial partner."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.219"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.219"
                                            },
                                            "Text": {
                                                "val": "Will complete field evaluation of passive arthropod (animals without a backbone with segmented bodies and jointed limbs, such as a scorpion, crab, or centipede) repellent systems that do not require application of chemicals to skin or clothing; complete field evaluations on prototype rapid diagnostic kits developed for the detection of selected vector-borne pathogens (pathogens transmitted by insects such as malaria, Leishmania, and dengue virus); complete the development of the enteric JBAIDS assay to transition the assay to advanced development; complete field evaluations and FDA-required 510K clearance on the Dengue Rapid Diagnostic Device (DRDD)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "814"
                    },
                    "ProjectTitle": {
                        "val": "NEUROFIBROMATOSIS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.430"
                        },
                        "CurrentYear": {
                            "val": "12.780"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Neurofibromatosis research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Neurofibromatosis (NF) Research Program"
                                    },
                                    "Description": {
                                        "val": "This congressionally directed project conducted research on Neurofibromatosis (NF)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This congressionally directed project conducted research on Neurofibromatosis (NF)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.780"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This congressionally directed project conducted research on Neurofibromatosis (NF)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "840"
                    },
                    "ProjectTitle": {
                        "val": "COMBAT INJURY MGMT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "42.441"
                        },
                        "CurrentYear": {
                            "val": "38.598"
                        },
                        "BudgetYearOne": {
                            "val": "37.396"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.396"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "36.516"
                        },
                        "BudgetYearThree": {
                            "val": "37.715"
                        },
                        "BudgetYearFour": {
                            "val": "38.125"
                        },
                        "BudgetYearFive": {
                            "val": "38.758"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, demonstrates, and validates promising medical technologies and methods to include control of severe bleeding, treatment for traumatic brain injury (TBI), revival and stabilization of trauma patients, and prognostics and diagnostics for life support systems.  Post-evacuation medical research focuses on continued care and rehabilitative medicine for extremity (arms and legs), facial\/maxillary (jaw bone), and ocular (eye) trauma and leveraging recent innovations in regenerative medicine and tissue engineering techniques.  \n\nResearch conducted in this project focuses on the following six areas:\n\n(1) Damage Control Resuscitation\n(2) Combat Trauma Therapies\n(3) Traumatic Brain Injury \n(4) Combat Critical Care Engineering\n(5) Clinical and Rehabilitative Medicine \n(6) Underbody Blast Injury Assessment\n \nAll research is conducted in compliance with U.S. Food and Drug Administration (FDA) requirements for licensure of medical products for human use.   \n\nPromising efforts identified through applied research conducted under PE 0602787A, project 874, are further matured under this project.  Promising results identified under this project 840 are further matured under PE 0603807A, project 836.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the U.S. Army Dental Trauma Research Detachment (USADTRD) and the U.S. Army Institute of Surgical Research (USAISR), Fort Sam Houston, TX; the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; and the Armed Forces Institute of Regenerative Medicine (AFIRM), Fort Detrick, MD. \n\nEfforts in this project support the Soldier Portfolio and the principle areas of Combat Casualty Care and Military Operational Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort supports work required to validate safety and effectiveness of drugs and medical procedures to maintain metabolism and minimize harmful inflammation after major trauma. Efforts focus on blocking complement activation (a series of disease fighting proteins and their reactions in the body) from damaging healthy cells of the body and preventing or minimizing secondary organ failure (including brain and spinal cord injury)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.223"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began human evaluation of blood substitutes and noninvasive interventions for internal bleeding; evaluated guidelines for combined use of plasma, clotting factors and complement inhibitors (CIs) (normal physiological responses to trauma)  using a representative, large animal model to potentially change clinical resuscitation guidelines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate limited clinical studies of coagulation factor and platelet function in burn patients; conduct studies of acute coagulopathy (clotting or bleeding disorder) of traumatic shock; evaluate currently available blood products in a large animal (pig) model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.722"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.722"
                                            },
                                            "Text": {
                                                "val": "Will continue coagulation (blood clotting) factor and platelet function studies of ways to stop bleeding; study the use of compounds to reduce inflammation as a therapy for bleeding due to trauma."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on work required to validate safety and effectiveness of drugs, biologics (products derived from living organisms), and medical procedures intended to minimize immediate and long-term effects from battlefield injuries. This effort includes neuroprotective research - funding in this area is transitioned to Traumatic Brain Injury in FY 2012."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began the next study of the candidate neuroprotective drug for FDA approval (effectiveness); began animal studies of an anti-seizure mixture of multiple drugs in combination and studies of silent brain seizures after traumatic brain injury (TBI); developed a mandibular (jaw) defect model; continued evaluation of pain management regimens to improve long-term outcomes; used a small animal model to down-select therapeutics for blast-induced TBI; continued in-house human clinical trials of promising treatments and therapies for battlefield trauma."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.558"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue studies in wound healing, as well as skin, muscle, and bone repair. Transition skin and muscle work to more relevant animal models and continue in-house human trials. In FY 2012, work in neuroprotection research is transitioned to Traumatic Brain Injury."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.658"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.658"
                                            },
                                            "Text": {
                                                "val": "Will conduct small scale clinical trials for most promising therapies for loss of large volumes of muscle and wound healing agents."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports work required to validate safety and effectiveness of drugs, biologics (products derived from living organisms), and medical procedures intended to minimize immediate and long-term effects from penetrating brain injuries. This research area starts in FY 2012."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Will complete the FDA effectiveness study of the candidate neuroprotective drug for treatment of TBI and will complete the pivotal trial for a bench-top assay for use in hospitals using candidate biomarkers for the detection of TBI; will transition to advanced development; Will continue development of a smaller, deployable diagnostic device for brain trauma as well as a hand held version; will evaluate progesterone (steroid hormone) and nitrite as therapeutic interventions for blast injury."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.255"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.255"
                                            },
                                            "Text": {
                                                "val": "Will identify combination theraputics for advanced development\/clinical trials for TBI that substantially mitigate for reduce TBI-induced non-convulsive seisures and brain damage."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort supports diagnostic and therapeutic medical devices, algorithms, software, and data-processing systems for resuscitation, stabilization, and life support; this research area started in FY 2010."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.287"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed evidence-based decision support development for early indicators of reduction in blood volume, the need for intervention, and closed loop care during casualty transport. Continued to support simulation development to reduce reliance on live tissues in training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.056"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin collection of continuous waveform data (output from vital signs monitors) in burn and trauma patients with blood loss to refine algorithm; evaluate commercially-viable measurement systems and novel remote triage devices (both wear-and-forget and stand-off devices) for effectiveness and specificity to blood loss."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.973"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.973"
                                            },
                                            "Text": {
                                                "val": "Will initiate clinical trials of machine-learning monitoring, using algorithms based on sensor data in multiple applications (early-onset of blood loss, blood loss volume, and risk for cardiovascular collapse); transition vital signs technology to advance development for further test and evaluation, FDA licensure, and for fielding."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort supports clinical studies of treatment of ocular and visual system traumatic injury, as well as restoration of function and appearance by regenerating skin, muscle, and bone tissue in battle-injured casualties. Areas of interest for regenerative medicine include healing without scarring, repair of compartment syndrome (muscle and nerve damage following reduced blood flow due to swelling), replacement skin, and facial reconstruction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.181"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted studies using relevant large animals to evaluate the most promising treatments for repairing traumatic eye injuries; concluded FY 2010 clinical trials; began studies of skin cells or tissue from patient engineered and transplanted back into the patient as a replacement for burned tissue."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct preclinical studies on novel drug delivery, diagnostic and\/or tissue repair strategies for eye injury, as well as initial clinical studies of vision rehabilitation strategies; conduct preclinical and initial clinical studies of strategies for maxillofacial reconstruction, including wound healing control and tissue engineering\/regeneration techniques, to restore facial features; begin a pilot clinical trial of a drug that reduces the spread of burn damage; finish preclinical research on engineered implants; start a pilot clinical trial on bone regeneration using scaffold and stem cell technologies; and continue an ongoing clinical trial in muscle regeneration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.588"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.588"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop drug delivery and diagnostic and tissue repair strategies, including stem cell therapies for traumatic eye injury; continue development and standardization of animal models to assess soft and hard tissue regeneration technologies; continue studies of burn, scar less wound, soft tissue, and bone repair strategies; continue development and testing of stem cell therapies and scaffolds (tissue-engineered grafts) in animal models; continue the evaluation of candidate strategies for maxillofacial (head, neck, face, and jaw) reconstruction, including wound-healing control and tissue engineering\/regeneration techniques to restore facial features."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Under Body Blast Injury Assessment"
                                    },
                                    "Description": {
                                        "val": "This one-year effort supports research to enable the Live-Fire Test and Evaluation (LFT&E) community to conduct realistic survivability testing of ground-combat vehicles subjected to underbody blast (UBB) threats, with a primary emphasis on assessing potential occupant casualties, as well as to enable the development and testing of improved occupant protection systems.  UBB creates injurious forces on occupants of ground-combat vehicles that are more violent and that act in directions not normally encountered in civilian automotive accidents.  Injury prediction tools that were developed to assess occupant safety in automobile crashes are not adequate for assessing occupant survivability in ground-combat vehicles exposed to UBB threats.  Accurately predicting the spectrum of injuries caused by UBB forces in live-fire tests of ground-combat vehicles presents a unique challenge for the DoD.  A UBB medical research program is being initiated to understand the human tolerance limits and injury mechanisms needed to accurately predict injuries to ground-combat vehicle occupants caused by UBB events."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.325"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate research to develop biomedically-valid UBB human tolerance limits and injury prediction tools for supporting the development of DoD blast injury prevention standards for survivability assessments and protection systems development; accelerate development and integration of human tolerance limits and injury prediction tools to enhance the LFT&E community?s ability to accurately assess ground-combat vehicle occupant survivability in UBB events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Administrative Activities for Prior Year Clinical Trials"
                                    },
                                    "Description": {
                                        "val": "Contract law requires the government to fulfill its responsibilities for the life of the Congressional Special Interest (CSI) award as stated in the terms and conditions.  Each award may have an execution and award management tail of up to five years post-award, which usually occurs 18 months after the start of the fiscal year."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "Funding for scientific expertise, legal, contracting, research protections, regulatory affairs, and resource support personnel to manage 627 active projects in FY 2012 to be closed out over the POM."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "945"
                    },
                    "ProjectTitle": {
                        "val": "BREAST CANCER STAMP PROCEEDS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.878"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project receives funds as proceeds from the sale of Breast Cancer Stamps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Breast Cancer Stamp Proceeds"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.878"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Breast Cancer Stamp Proceeds"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "97T"
                    },
                    "ProjectTitle": {
                        "val": "NEUROTOXIN EXPOSURE TREATMENT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.288"
                        },
                        "CurrentYear": {
                            "val": "15.975"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Neurotoxin Exposure Treatment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Peer-Reviewed Neurotoxin Exposure Treatment Parkinsons Research Program"
                                    },
                                    "Description": {
                                        "val": "This congressionally directed project conducts research for the Neurotoxin Exposure Treatment Parkinsons Research Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.288"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted research for the Neurotoxin Exposure Treatment Parkinsons Research Program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.975"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research for the Neurotoxin Exposure Treatment Parkinsons Research Program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FH4"
                    },
                    "ProjectTitle": {
                        "val": "FORCE HEALTH PROTECTION - ADV TECH DEV"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.904"
                        },
                        "CurrentYear": {
                            "val": "1.540"
                        },
                        "BudgetYearOne": {
                            "val": "1.690"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.690"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.781"
                        },
                        "BudgetYearThree": {
                            "val": "1.797"
                        },
                        "BudgetYearFour": {
                            "val": "1.828"
                        },
                        "BudgetYearFive": {
                            "val": "1.859"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, demonstrates, and supports enhanced force health protection of Soldiers against threats in military operations and training.  Health-monitoring tools are matured to rapidly identify deployment stressors that affect the health of Joint Forces.  These databases and systems enhance the Department of Defense's (DoD's) ability to monitor and protect against adverse changes in health, especially mental health effects caused by changes in brain function.  Force Health Protection work is conducted in close coordination with the Department of Veterans Affairs.  The program is maturing the development of global health monitoring (e.g., development of neuropsychological evaluation methodologies), and validating clinical signs and symptoms correlating to medical records, diagnosed diseases, and mortality rates.  The key databases supporting this program are the Millennium Cohort Study and the Total Army Injury and Health Outcomes Database.  These databases allow for the examination of interactions of psychological stress and other deployment and occupational stressors that affect Warfighter health behaviors.  \n\nThis project contains no duplication with any effort within the Military Departments and includes direct participation by other Services. The cited work is fully coordinated with Natick Soldier Research Development Engineering Command (NSRDEC), Natick, MA.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy. \n\nWork in this project is performed by the U.S. Army Center for Environmental Health Research (USACEHR), Fort Detrick, MD; the U.S. Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; and the Naval Health Research Center (NHRC), San Diego, CA. \n\nEfforts in this project support the Soldier Portfolio and the principle areas of Combat Casualty Care and Military Operational Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Health Research"
                                    },
                                    "Description": {
                                        "val": "This effort supports validation of interventions developed from the Millennium Cohort study (a prospective health project in military service members designed to evaluate the long-term health effects of military service, including deployments), validation of biomarkers of exposure, methods to detect environmental contamination and toxic exposure, and validation of thoracic injury prediction models of blast exposure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.904"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Transitioned thoracic blast injury models and an integrated software version for combined blunt trauma and toxic gas inhalation to Army Research Laboratory Survivability, Lethality Assessment Division (Soldier Survivability Assessment Program) and to the Public Health Command (Health Hazard Assessment Program); conducted a systematic validation of prospective data to correlate relationships in PTSD and depression with suicide."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.540"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate potential intervention strategies for reduction of mental health symptoms and factors associated with suicide, with a goal to reduce the suicide rate; validate sensor components to include whole-body acceleration (tertiary blast injury) and headform acceleration (traumatic brain injury)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.690"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.690"
                                            },
                                            "Text": {
                                                "val": "Will mature strategic findings from studies that support policy formation and guide further research to promote the longer-term physical and mental health of the Force.  This will lead to a greater appreciation of the post-traumatic stress disorder for the senior military leadership and will help mitigate the physical and psychological effects of military service, protecting the Warfighter from potentially devastating consequences."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM2"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL ADVANCE TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.715"
                        },
                        "CurrentYear": {
                            "val": "5.991"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Medical Advanced Technology Initiatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Military Burn Trauma Research Program."
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.715"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Military Burn Trauma Research Program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.991"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Military Burn Trauma Research Program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM3"
                    },
                    "ProjectTitle": {
                        "val": "WARFIGHTER MEDICAL PROTECTION & PERFORMANCE STDS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.090"
                        },
                        "CurrentYear": {
                            "val": "9.309"
                        },
                        "BudgetYearOne": {
                            "val": "10.920"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.920"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.723"
                        },
                        "BudgetYearThree": {
                            "val": "14.393"
                        },
                        "BudgetYearFour": {
                            "val": "14.836"
                        },
                        "BudgetYearFive": {
                            "val": "15.009"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the Medical and Survivability technology areas of the future force with laboratory validation studies and field demonstrations of biomedical products designed to protect, sustain, and enhance Soldier performance in the face of a myriad of environmental, physiological stressors, and materiel hazards encountered in training and operational environments.  This effort focuses on demonstrating and transitioning technologies as well as validated tools associated with biomechanical-based health risks, injury assessment and prediction, Soldier survivability, and performance during continuous operations.  The three main thrust areas are (1) Physiological Health and Environmental Protection, (2) Injury Prevention and Reduction, and (3) Psychological Health and Resilience.\n\nThis project contains no duplication with any effort within the Military Departments and includes direct participation by other Services. The cited work is fully coordinated with Natick Soldier Research Development Engineering Command (NSRDEC), Natick, MA. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by the U.S. Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; and the U.S. Army Aeromedical Research Laboratory (USAARL), Fort Rucker, AL. \n\nEfforts in this project support the Soldier Portfolio and the principle areas of Combat Casualty Care and Military Operational Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological Health and Environmental Protection (Sleep Research\/Environmental Monitoring)"
                                    },
                                    "Description": {
                                        "val": "This effort developments laboratory products, interventions, and decision aids for the validation of physiological status and prediction of Soldier performance in extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.096"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated the next generation of individual physiological sensors for the prediction of heat injuries in training environments; performed advanced evaluations of a computational model for predicting performance affected by chronic sleep restriction in the operational environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete field studies of the heat strain decision-aid with the U.S. Army Ranger School to reduce the risk of heat injuries during training; validate a computational model for predicting performance affected by chronic sleep restriction in the operational environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.597"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.597"
                                            },
                                            "Text": {
                                                "val": "Will evaluate real-time 'thermal strain monitoring and management' system in Brigade Modernization exercise or similar operationally-relevant field environment; identify model factors accounting for individual differences in vulnerability to sleep loss and model stimulant countermeasure effects.  These results will serve to manage thermal strain and sleep loss in real-time."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection - Physiological Awareness Tools and Warrior Sustainment in Extreme Environments"
                                    },
                                    "Description": {
                                        "val": "This effort developments non-invasive technologies, decision-aid tools, and models to enhance Warrior protection and sustainment across the operational spectrum."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.544"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Will validate and transition non-invasive hydration assessment sensors to the advanced development program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.726"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.726"
                                            },
                                            "Text": {
                                                "val": "Will refine novel hydration sensor technologies with a goal of achieving high (80-95%) diagnostic accuracy.  This will serve to reduce the incidence of electrolyte-related injury among Warfighters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction (Physical Performance Enhancement)"
                                    },
                                    "Description": {
                                        "val": "This effort validates injury prediction tools for brain, spine, and thoracic injury from blast, blunt, and ballistic impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.644"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated safe, rapid assessment criteria for spinal injury risk prediction; completed validation of facial fracture dose-response models and injury risk functions using an instrumented headform; transitioned integrated software version for combined blunt trauma and toxic gas inhalation; refined analysis tools which can use non- or minimally-invasive techniques to detect bone injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate software that accounts for the effects of clothing and body armor on the body following blast; validate software to estimate lung, heart, and rib injury from blunt trauma due to debris impact (secondary blast injury); validate the effectiveness of selected elements of neurosensory performance assessment batteries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.392"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.392"
                                            },
                                            "Text": {
                                                "val": "Will validate the feasibility of using physiologically based injury models to interpret sensors and will develop real-time exposure and response algorithms of injury risk and performance status following blast and blunt force thoracic trauma, including penetration wounding, and pulmonary injuries from blast and blunt trauma caused by ballistic impact."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health and Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort validates neurocognitive assessment and brain injury detection methods, and validate tools and preclinical methods to treat post-traumatic stress disorder in a military population."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.350"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated utility of neurocognitive measures for tracking and monitoring recovery rate after concussion; (validated rodent Post-Traumatic Stress Disorder model using current treatment methods)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.565"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determine effectiveness of various treatment modalities (e.g., occupational therapy, counseling, etc.); validate screening\/scoring guidelines for revisions to the Post-Deployment Health Assessment and the Post-Deployment Health Reassessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.205"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.205"
                                            },
                                            "Text": {
                                                "val": "Will develop guidance on pharmacological interventions to improve psychological and neurophysiological functioning post-concussion; conduct studies to develop and validate reliable metrics for identification, time course, and prospective neurocognitive\/neurological effects of mild Traumatic Brain Injury (mTBI); convene working group panels to develop and execute strategic findings from studies that support policy formation.  Additionally, the panels will design a strategic research approach to promote the longer-term physical and mental health of the Force."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}