{
    "id": "ee565bfff86b0e8d65067f4a845ef41ec5f8b4f6",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603828D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Experimentation"
        },
        "R1LineItemNumber": {
            "val": "61"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "87.800"
            },
            "CurrentYear": {
                "val": "38.112"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
        },
        "ProgramElementMissionDescription": {
            "val": "Consistent with strategic guidance, the Joint Experimentation (JE) Program Element targets DoD’s highest priority experimental needs, defined by combatant commands and Services, and synchronizes development of relevant and actionable Doctrine, Organizational, Training, Materiel, Leadership, Personnel, Facilities, and Policy (DOTMLPF-P) solutions to enable trained, ready and adaptable joint and coalition forces and improve capabilities of current and future Joint Force Commanders.  The program is governed through the JCD&E Executive Council, which is composed of generals, admirals, and members of the Senior Executive Service representing the combatant commands and Services.  The JE program is the key synchronizing program for a diverse portfolio of concept development and solution evaluation and validation focused on combatant command and Service problems defined in Integrated Priority Lists (IPL), Joint Urgent Operational Needs (JUON), and Warfighter Challenges (WFC).  In addition to defining the problems, the combatant commands and Services prioritize the JE program of work and are active partners in the execution, oversight, and governance of the efforts.  Partners also include a broad range of civilian agency, multinational, academic, and private sector partners.  When appropriate, state and local governments participate in the development of solutions.  Projects typically confirm critical joint mission capability gaps; identify potential remedies; explore a range of DOTMLPF-P solutions; and establish the best path to solving security challenges.   The JE program is the Department’s primary program to explore the connecting ideas and processes that cannot be solved by buying a new tool or creating a new acquisition program.  Experiments span a spectrum from early efforts to develop new joint operational concepts, to refinement of joint doctrine, to scenario-based examination of science and technology-based solutions, to validation of non-material solutions such as organization structure, new processes, improved training and education, and recommended policy changes.  By defining emergent shortfalls and exploring force enhancement options, JE serves as an early risk mitigation tool that precedes implementation of doctrine changes, capability demonstrations, acquisition investment decisions, and policy changes.  JE supports the development of projected mission critical capabilities through rigorous, objective assessment of enabling processes and technologies, identification of capability\/system requirements and innovative employment of existing capabilities in the context of scenarios depicting current and projected Defense operations.  Combatant commanders and Services are the primary customers of projects funded by the JE Program, but through a whole of government approach, projects also provide collateral benefits to a wider Defense Experimentation Enterprise including Agencies and the Office of the Secretary of Defense (OSD), intra-government, international and Non-Government Organization (NGO) partners.  The experiments funded by this program establish the path to resolve current joint warfighting deficiencies and lay the foundation for trained, ready and adaptive joint and coalition forces.  The Assistant Secretary of Defense, Research & Engineering (ASD(R&E)) within the Office of the Secretary of Defense (OSD) provides oversight to ensure alignment with strategic guidance and emphasizes disciplined design and cost control of individual projects with meaningful results that can be assessed with metrics based on incremental force improvements.   The experimentation efforts in this program align directly to the Key Mission Areas (KMA) outlined in the February 2010 Quadrennial Defense Review (QDR), the National Military Strategy, and the Secretary of Defense’s Efficiency Initiatives.  Flexibility will be maintained in the JE Program to address emergent requirements identified by combatant commanders and Services and will be prioritized by the JCD&E Executive Council.  The Joint Staff J7 executes the JE program and leads the JCD&E Enterprise.  The Joint Staff J7 works with the Assistant Secretary of Defense, Research & Engineering (ASD(R&E)) to provide responsive support to customers and partners.\n\nThe JE Program Element provides funding for the Department’s Joint Experimentation (JE) effort, carried out by the JCD&E Enterprise, governed by an Executive Board composed of admirals, generals and Senior Executive Service members, and led by a JCD&E Executive Agent.  The JCD&E Enterprise includes the combatant commands, the military services, the National Guard Bureau, the Joint Staff, the Office of the Secretary of Defense (OSD), and several Defense agencies.  Intra-government agencies and coalition partners often participate in JCD&E processes and projects.  The JE program element focuses on producing validated concepts and solutions to combatant command and Service defined problems.  Important collateral benefits accrue to other members and partners in the extended experimentation community; much of the joint content in military \"Title 10\" wargames can be traced to coordination within the JCD&E Enterprise.  To ensure the program focuses on needs of the warfighters, joint experiments originate from an annual call for nominations from combatant commands and Services, and from assessment of combatant command identified critical warfighting capability gaps articulated in combatant command Integrated Priority Lists and Joint Urgent Needs documents submitted, to the Chairman of the Joint Chiefs of Staff (CJCS).  JE nominations undergo preliminary analysis by the JCD&E Enterprise to confirm suitability for experimentation, alignment to strategic guidance and, where feasible, to associate closely related subjects for economy of effort. The resultant list is termed Warfighter Challenges (WFCs), and constitutes experimentation efforts eligible for design and execution. These efforts are prioritized and approved by the combatant command and Service members of the Executive Council.  Experimentation plans are developed in consultation with JE partners, and consolidated into an annual program of joint experimentation, known as the JCD&E Campaign Plan.  The Executive Council meets regularly to review and approve the progress of the efforts in the campaign plan.  The JCD&E Campaign Plan allows the Department to synchronize experimentation efforts over multiple years to avoid duplication of effort and to create synergy among the defense experimentation entities.    \n  \nJE experiments and activities examine potential solutions for combatant command operational needs through targeted DOTMLPF-P improvements.  JE tackles joint concept and capability issues demanding sophisticated analysis, innovative design and complex execution.  JE addresses topics that would prove difficult for individual combatant commands and Services to capture in the context of their immediate operational and force generation responsibilities.  Experiments and efforts produce a range of outcomes inclusive of fundamental joint doctrine, inputs to major policy documents such as the Quadrennial Defense Review and the Defense Planning and Programming Guidance (DPPG). In partnership with the combatant commands and Services, JE mitigates operational risk by establishing procedural models to conduct emergent concepts like Irregular Warfare, Integrated Financial Operations and Joint Operational Access that are not yet instantiated in conventional force generation.  The results are briefed to Functional Capability Boards who integrate solutions into their functional investment plans.\n\nJE examines joint concepts and develops exploratory concepts to describe how the Joint Force Commander will meet current and future security challenges, and explores joint capabilities required to execute those concepts.  To support the continued transformation of the joint force even while it is engaged in operations around the world, joint concept development applies historical precedents, lessons learned from current operations, and Defense planning scenarios, then studies the projected joint operational environment to lay the conceptual foundation for the future force.  After the current adjustment, a relatively stable investment projection for the JE Program drives aggressive efforts to derive greater return on investment for the DOD in the face of increasing demand for projects from combatant commands and joint experimentation partners.\n\nJoint and Service experimentation are complementary efforts and require a unified approach.  Joint experimentation focuses on the needs of the Joint Force Commander, while Service experimentation enables the components the Joint Force Commander will employ.  Complementing the efforts undertaken by the JCD&E Executive Agent (USJFCOM and\/or successor organization), other combatant commands conduct Limited Objective Experiments (LOEs) to address operational capability gaps and support identification of potential solutions for theater specific and functional joint warfighter needs, as part of the overall JCD&E campaign.  Within the process, the JCD&E enterprise leverages Service wargame\/experimentation to address joint challenges.   Experimentation activities are coordinated within the JCD&E enterprise to cover gaps and pursue efficiency, and the results are shared throughout the enterprise.  The collaborative planning effort of the JCD&E enterprise is intended to ensure coherent and transparent application of JE funds, joint context, and concepts capabilities are integrated into Service experimentation as appropriate.  \n\nA biennial report captures activities across the Defense Experimentation enterprise activities to inform Congress of program execution and project accomplishments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "111.946"
                },
                "CurrentYear": {
                    "val": "58.130"
                },
                "BudgetYearOne": {
                    "val": "52.045"
                },
                "BudgetYearOneBase": {
                    "val": "52.045"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "87.800"
                },
                "CurrentYear": {
                    "val": "38.112"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-24.146"
                },
                "CurrentYear": {
                    "val": "-20.018"
                },
                "BudgetYearOne": {
                    "val": "-52.045"
                },
                "BudgetYearOneBase": {
                    "val": "-52.045"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.653"
                    },
                    "CurrentYear": {
                        "val": "-0.757"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.735"
                                },
                                "BudgetYearOne": {
                                    "val": "-52.045"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-52.045"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.336"
                                },
                                "CurrentYear": {
                                    "val": "-0.261"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.467"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-19.955"
                                },
                                "CurrentYear": {
                                    "val": "-19.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P808"
                    },
                    "ProjectTitle": {
                        "val": "Joint Experimentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "87.800"
                        },
                        "CurrentYear": {
                            "val": "38.112"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
                        },
                        "ProjectMissionDescription": {
                            "val": "Consistent with strategic guidance, the Joint Experimentation (JE) Program Element targets DOD’s highest priority experimental needs, defined by combatant commands and Services, and synchronizes development of relevant and actionable Doctrine, Organizational, Training, Materiel, Leadership, Personnel, Facilities, and Policy (DOTMLPF-P) solutions to enable trained, ready and adaptable joint and coalition forces and improve capabilities of current and future Joint Force Commanders.  The program is governed through the JCD&E Executive Council, which is composed of generals, admirals, and members of the Senior Executive Service representing the combatant commands Services.  The JE program is the key synchronizing program for a diverse portfolio of concept development and solution evaluation and validation focused on combatant command and Service problems defined in Integrated Priority Lists (IPL), Joint Urgent Operational Needs (JUON), and Warfighter Challenges (WFC).  In addition to defining the problems, the combatant commands and Services prioritize the JE program of work and are active partners in the execution, oversight, and governance of the efforts.  Partners also include a broad range of civilian agency, multinational, academic, and private sector partners.  When appropriate, state and local governments participate in the development of solutions.  Projects typically confirm critical joint mission capability gaps; identify potential remedies; explore a range of DOTMLPF-P solutions; and establish the best path to solving security challenges.   The JE program is the Department’s primary program to explore the connecting ideas and processes that cannot be solved by buying a new tool or creating a new acquisition program.  Experiments span a spectrum from early efforts to develop new joint operational concepts, to refinement of joint doctrine, to scenario-based examination of science and technology-based solutions, to validation of non-material solutions such as organization structure, new processes, improved training and education, and recommended policy changes.  By defining emergent shortfalls and exploring force enhancement options, JE serves as an early risk mitigation tool that precedes implementation of doctrine changes, capability demonstrations, acquisition investment decisions, and policy changes.  JE supports the development of projected mission critical capabilities through rigorous, objective assessment of enabling processes and technologies, identification of capability\/system requirements and innovative employment of existing capabilities in the context of scenarios depicting current and projected Defense operations.  Combatant commanders and Services are the primary customers of projects funded by the JE Program, but through a whole of government approach, projects also provide collateral benefits to a wider Defense Experimentation Enterprise including Agencies and the Office of the Secretary of Defense (OSD), intra-government, international and Non-Government Organization (NGO) partners.  The experiments funded by this program establish the path to resolve current joint warfighting deficiencies and lay the foundation for trained, ready and adaptive joint and coalition forces.  The Assistant Secretary of Defense, Research & Engineering (ASD(R&E)) within the Office of the Secretary of Defense (OSD) provides oversight to ensure alignment with strategic guidance and emphasizes disciplined design and cost control of individual projects with meaningful results that can be assessed with metrics based on incremental force improvements.   The experimentation efforts in this program align directly to the Key Mission Areas (KMA) outlined in the February 2010 Quadrennial Defense Review (QDR), the National Military Strategy, and the Secretary of Defense’s Efficiency Initiatives.  Flexibility will be maintained in the JE Program to address emergent requirements identified by combatant commanders and Services and will be prioritized by the JCD&E Executive Council.  The Joint Staff J7 executes the JE program and leads the JCD&E Enterprise.  The Joint Staff J7 works with the Assistant Secretary of Defense, Research & Engineering (ASD(R&E)) to provide responsive support to customers and partners.\n\nThe JE Program Element provides funding for the Department’s Joint Experimentation (JE) effort, carried out by the JCD&E Enterprise, governed by an Executive Board composed of admirals, generals and Senior Executive Service members, and led by a JCD&E Executive Agent.  The JCD&E Enterprise includes the combatant commands, the military services, the National Guard Bureau, the Joint Staff, the Office of the Secretary of Defense (OSD), and several Defense agencies.  Intra-government agencies and coalition partners often participate in JCD&E processes and projects.  The JE program element focuses on producing validated concepts and solutions to combatant command and Service defined problems.  Important collateral benefits accrue to other members and partners in the extended experimentation community; much of the joint content in military \"Title 10\" wargames can be traced to coordination within the JCD&E Enterprise.  To ensure the program focuses on needs of the warfighters, joint experiments originate from an annual call for nominations from combatant commands and Services, and from assessment of combatant command identified critical warfighting capability gaps articulated in combatant command Integrated Priority Lists and Joint Urgent Needs documents submitted, to the Chairman of the Joint Chiefs of Staff (CJCS).  JE nominations undergo preliminary analysis by the JCD&E Enterprise to confirm suitability for experimentation, alignment to strategic guidance and, where feasible, to associate closely related subjects for economy of effort. The resultant list is termed Warfighter Challenges (WFCs), and constitutes experimentation efforts eligible for design and execution. These efforts are prioritized and approved by the combatant command and Service members of the Executive Council.  Experimentation plans are developed in consultation with JE partners, and consolidated into an annual program of joint experimentation, known as the JCD&E Campaign Plan.  The Executive Council meets regularly to review and approve the progress of the efforts in the campaign plan.  The JCD&E Campaign Plan allows the Department to synchronize experimentation efforts over multiple years to avoid duplication of effort and to create synergy among the defense experimentation entities.    \n  \nJE experiments and activities examine potential solutions for combatant command operational needs through targeted DOTMLPF-P improvements.  JE tackles joint concept and capability issues demanding sophisticated analysis, innovative design and complex execution.  JE addresses topics that would prove difficult for individual combatant commands and Services to capture in the context of their immediate operational and force generation responsibilities.  Experiments and efforts produce a range of outcomes inclusive of fundamental joint doctrine, inputs to major policy documents such as the Quadrennial Defense Review and the Defense Planning and Programming Guidance (DPPG). In partnership with the combatant commands and Services, JE mitigates operational risk by establishing procedural models to conduct emergent concepts like Irregular Warfare, Integrated Financial Operations and Joint Operational Access that are not yet instantiated in conventional force generation.  The results are briefed to Functional Capability Boards who integrate solutions into their functional investment plans.\n\nJE examines joint concepts and develops exploratory concepts to describe how the Joint Force Commander will meet current and future security challenges, and explores joint capabilities required to execute those concepts.  To support the continued transformation of the joint force even while it is engaged in operations around the world, joint concept development applies historical precedents, lessons learned from current operations, and Defense planning scenarios, then studies the projected joint operational environment to lay the conceptual foundation for the future force.  After the current adjustment, a relatively stable investment projection for the JE Program drives aggressive efforts to derive greater return on investment for the DOD in the face of increasing demand for projects from combatant commands and joint experimentation partners.\n\nJoint and Service experimentation are complementary efforts and require a unified approach.  Joint experimentation focuses on the needs of the Joint Force Commander, while Service experimentation enables the components the Joint Force Commander will employ.  Complementing the efforts undertaken by the JCD&E Executive Agent (USJFCOM and\/or successor organization), other combatant commands conduct Limited Objective Experiments (LOEs) to address operational capability gaps and support identification of potential solutions for theater specific and functional joint warfighter needs, as part of the overall JCD&E campaign.  Within the process, the JCD&E enterprise leverages Service wargame\/experimentation to address joint challenges.  Experimentation activities are coordinated within the JCD&E enterprise to cover gaps and pursue efficiency, and the results are shared throughout the enterprise.  The collaborative planning effort of the JCD&E enterprise is intended to ensure coherent and transparent application of JE funds, joint context, and concepts capabilities are integrated into Service experimentation as appropriate.  \n\nA biennial report captures activities across the Defense Experimentation enterprise activities to inform Congress of program execution and project accomplishments.\n\nDescription (JE Program):  The JE Program delivers relevant, sufficient, and necessary DOTMLPF-P comprehensive solutions responding to specific needs of Joint Force Commander articulated Warfighter Challenges.  Warfighter Challenges are DOD’s most important security challenges now and in the future; inform and are informed by strategic guidance; and address issues from the tactical to strategic levels of war.   From the perspective of OSD engagement and oversight, emphasis will be focused on the following refinements to influence the JE business model.\n\nRefinements to the JE Business Model.\nThe JE program is executed through a global business model that is governed by a 2-Star Executive Council, operates on a 1 year cycle, supported by integrating technologies to close geographic gaps, standardized through systems engineering discipline, and progresses through formal enterprise decision making.  Lean principals are applied to enterprise, technical, and supporting processes to maximize program efficiency. The JE program continues to evolve with solution spirals included in experimentation efforts to drive affordable speed to capability.\n   \nThe JCD&E Enterprise strives to:\n•\tTrace JE efforts to discriminate changes to joint capabilities.\n•\tTie JE closer to DoD operational analysis & Defense Planning Scenarios.\n•\tProvide specific input to joint training and joint capability development to ensure adaptable joint forces.\n•\tPosition joint experimentation in a larger scheme of overarching capability development that begins with lessons learned and critical analysis, enjoins experimentation tools, and progresses through demonstration, acquisition, and training.\n•\tDesign experiments for more responsive deliverables through quicker starts, event-driven \"go\/no go\" reviews, and incremental designs permitting faster \"do-learn-decide\" cycles for continued investment.\n\nAnalytical Rigor.\nIncreased emphasis has been placed on adherence to standards of analytical rigor in design, conduct, and exploitation of experiments.  Typical of this rigor is aligning the experimentation concepts to the Key Mission Areas specified in the Quadrennial Defense Review.  FY 2011-2012 experimentation efforts seek to provide innovative joint solutions and joint interoperability standards to address capability shortfalls identified by Warfighter Challenges conforming to the DoD Joint Capability Areas (JCAs) employed by the Department to validate joint needs.  The FY 2012 Warfighter Challenges mapped to six JCAs:  Building Partnerships, Battlespace Awareness, Command and Control, Force Application, Logistics, and Net-Centric.  No FY 2012 WFCs were submitted by the COCOMs or Services in the JCAs.  The JE enterprise is capable and prepared to accept Warfighter Challenges from all nine JCA’s and accepts emergent requirements throughout the year.     \n\nInitiatives.\n- Solution spin offs (spirals), are included in experiment design to identify affordable capability deliveries and increase speed to capability.\n- Lean six sigma principals have been implemented for metrics based efficiency assessments. Achieved 46 percent improvement in contracting process, 26 percent cycle time or 17 percent cost reduction in enterprise process, and 31 percent reduction in experimentation conduct. - Integrated framework for Joint Experimentation.  Transparent decision-making, systems engineering thinking, and application of Lean management principles have been integrated into a technical framework for lifecycle management of the joint experimentation program. JCD&E Enterprise members now submit WFCs with supporting technical information that promotes accelerated starts, spiral development and reduced costs and schedules for experimentation and concept development.\n- Improvements to Networked Coordination.  Upgrade of the Virtual Operations Center (VOC) has enhanced Enterprise-wide participation during project planning and execution, decreasing travel associated with customer service and enterprise-wide coordination.  Increasing use of distributed experimentation design will allow geographically separated groups to join experimental projects from their home bases, again saving travel funds and increasing the potential partner base.  \n- Increased integration with the S&T community to address the science and technology element COCOM S&T Integrated Priority Lists in JE, and to both include Joint Capability Technology Demonstrations (JCTD) in, and inform JCTD efforts through, experimentation to Increase speed to capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Building Partnerships (BP)"
                                    },
                                    "Description": {
                                        "val": "The evolving nature of joint operations creates a corresponding need to integrate operations with international, governmental and non-governmental partners to address a wide variety of security challenges using a comprehensive approach."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.029"
                                            },
                                            "Text": {
                                                "val": "•  Delivered a prototype system to allow real-time information sharing and collaboration with interagency and multi-national partners in support of a whole of government approach to steady-state operations.  The prototype technical architecture and capability was validated through experimentation in USAFRICOM and USEUCOM with multiple mission partners and provided a residual capability to allow the continued development of habitual relations.  Partners included a broad range of DOD, applicable non-DOD\/ USG agency, multi-national, multi-lateral, and private sector mission partners.  Additionally, enhanced information sharing capability between partner states will contribute to increased cooperation in counter-insurgency, stability and counter-terrorism operations.\n•  Created a Service force generation model\/architecture that will improve national capability to synchronize integrated General Purpose Forces and Special Operations Forces (GPF\/SOF) Security Force Assistance (SFA) activities.  Effort will improve geographic combatant commands and US embassy country teams to satisfy SFA demand signals.  Project improved understanding of Service force generation models and resource application\/prioritization.  Experimentation was used to compare solutions for identification of specific roles and responsibilities, prioritization and integration of planning and execution of SFA activity.   Products are: SFA Operating Concept\/Framework, organizational construct, decision support and planning tools, recommendations for SFA lead roles and responsibilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.223"
                                            },
                                            "Text": {
                                                "val": "•  The FY 2012 JCD&E program of work in the Building Partnerships Joint Capability Area (JCA) will address the key mission areas identified in the Quadrennial Defense Review and highlighted in the Defense Planning and Programming Guidance.  The FY 2012 campaign will address projected mission critical capabilities and concepts required to build security capacity of partner states.  The scope of the work will include: security and engagement activities per the Capstone Concepts for Joint Operations (CCJO) and experimentation to identify and evaluate enabling technologies to increase US capability to increase the security capacity of partner states.  The specific focus areas identified for FY 2012 include:\n•  Strengthen and institutionalize General Purpose Force capabilities in conducting security force assistance missions. \n•  Increase socio-cultural\/ human terrain awareness of the force.\n•  Increase information sharing capacity between US and partner states and within partner states.\n•  Develop collaborative planning and assessment tools to support of security force operations.  \n•  Improve effective and efficient methods to provision logistical support to partner states.\n•  Five Warfighter Challenges (14 percent of total submissions) were submitted by the JCD&E Enterprise identifying deficiencies in the BP JCA to be addressed through joint experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Awareness (BA)"
                                    },
                                    "Description": {
                                        "val": "The evolving nature of joint operations creates a corresponding need to understand complex and dynamic environments through collection, synchronization and visualization of information across all domains, and sharing with interagency and multinational partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.203"
                                            },
                                            "Text": {
                                                "val": "•  Delivered an experimentally validated assessment prototype for Deterrence Operations (DO) course of action assessments.  Prototype capability will enable the Joint Force Commander to assess results and implications of whole of government pre-crisis deterrence actions before and after actions are taken.  Products are: DO Assessment Guide, Preliminary Decision Support Tool (DST) Evaluation & Recommendations, Process map, Operational architecture, DST(s) Evaluation and Recommendations, Joint Capability Technology Demonstration (JCTD) input, and Prototype capability package."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.888"
                                            },
                                            "Text": {
                                                "val": "•  The FY 2012 JCD&E program of work in the Battlespace Awareness JCA will address the key mission areas identified in the Quadrennial Defense Review and highlighted in the Defense Planning and Programming Guidance.  The FY 2012 campaign will address projected mission critical capabilities and concepts required to succeed in preventing proliferation and countering weapons of mass destruction.   \n•  The scope of the work may include experimentation to identify and evaluate enabling technologies that lengthen detection ranges and strengthen Intelligence, Surveillance, and Reconnaissance (ISR) and communications ties between special and general purpose forces.\n•  Five Warfighter Challenges (14 percent of total submissions) were submitted by the JCD&E Enterprise identifying deficiencies in the BA JCA to be addressed through joint experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control (C2)"
                                    },
                                    "Description": {
                                        "val": "Joint Force Commander requires secure, robust and reliable networks to provide responsive command and control in complex, chaotic and degraded information environments to integrate and share information with a full range of partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.738"
                                            },
                                            "Text": {
                                                "val": "•  In collaboration with interagency and multi-national partners, delivered complementary concepts and capabilities to deter, prevent and respond to a disruption or a denial of access to Global Commons.  Concepts and capabilities were validated through joint and multi-national experimentation.  This effort will mitigate risk of disruption and denial of access to and use of the maritime, air, space and cyber space domains by state and non-state actors.  Denial of access would limit United States and coalition ability to conduct commercial and military operations.  \n•  Developed C2 architectures that support readiness reporting, sustainment of forces, and operations in C2 denied and degraded environments.  These architectures were validated through joint experimentation and will support the JFC’s ability to assess, respond to, and incrementally restore C2 in a denied and degraded communications environment.  Products are:  JFC C2 continuity processes and technologies, C2 templates and architectures, Multi-Service Tactics, Techniques, and Procedures (TTPs), Concept of Operations (CONOPS), and Command, Control, Communications, and Computers (C4) training recommendations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.550"
                                            },
                                            "Text": {
                                                "val": "•  The FY 2012 JCD&E program of work in the Command and Control JCA will address the key mission areas identified in the Quadrennial Defense Review and highlighted in the Defense Planning and Programming Guidance.  The FY 2012 campaign will address projected mission critical capabilities and concepts required to succeed in operating effectively in cyberspace.  \n•  The scope of work may include experimentation to identify and evaluate enabling technologies that support command and control for battle management in cyberspace.\n•  Nine Warfighter Challenges (26 percent of total submissions) were submitted by the JCD&E Enterprise identifying deficiencies in the C2 JCA to be addressed through joint experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Application (FA)"
                                    },
                                    "Description": {
                                        "val": "Joint Force Commander requires improved kinetic or non-kinetic capabilities to maneuver and engage adversaries from political, strategic, operational, and tactical perspectives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.991"
                                            },
                                            "Text": {
                                                "val": "•  Developed network attack\/exploit concept of operations, organizational construct, processes and enabling authorities\/policies to strengthen ability to attack and exploit adversary critical infrastructure.  This effort will validate concept of operations, processes and tools through experimentation and M&S.  Products will include Critical Infrastructure Computer Network Attack\/Exploitation concept of operations and decision support tool\/methodology that provides visibility of adversary critical infrastructure (networks and systems).\n•  Developed a concept that describes how the Joint Force Commander will gain and maintain access by defeating anti-access capabilities in the hands of state and non-state actors, in order to project power and influence.  This effort will integrate joint experimentation with Title 10 experiments and other Service products and studies (for example: Navy Senior Steering Group (SSG), Army-Marine Staff Talks, and Air Force-Navy Air Sea Battle Concept, Training and Doctrine Command (TRADOC) Joint Forcible Entry Operations(JFEO) Study) to explore and develop a joint concept.  Aggressive red teaming was used to explore the concept and validate the experimentation results.  Products  include a summary of vulnerabilities and recommended capabilities, CJCS Red Team report, input to the Status & Recommendations Report, and a final concept approved\/signed by CJCS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.239"
                                            },
                                            "Text": {
                                                "val": "•  The FY 2012 JCD&E program of work in the Force Application JCA will address the key mission areas identified in the Quadrennial Defense Review and highlighted in the Defense Planning and Programming Guidance.  The FY 2012 campaign will address projected mission critical capabilities and concepts required to deter and defeat aggression in an anti-access environment.  \n•  The scope of work may include experimentation to identify and evaluate enabling technologies that focus on electronic warfare, long range strike, and undersea superiority.\n•  Seven Warfighter Challenges (20 percent of total submissions) were submitted by the JCD&E Enterprise identifying deficiencies in the FA JCA to be addressed through joint experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logistics (Log)"
                                    },
                                    "Description": {
                                        "val": "Joint Force Commander requires responsive, agile logistics support to project force, sustain operations and ensure freedom of action wherever the force engages and in whatever form the engagement takes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.389"
                                            },
                                            "Text": {
                                                "val": "•  Assessed sufficiency of the Joint Logistics Concept (JLC) to integrate, synchronize and optimize the logistics enterprise to support joint operations in a wide variety of anticipated challenges in the future operating environment.  Through joint experimentation, the following aspects of the JLC were assessed:  integration and synchronization of end-to-end logistics processes; delivering, positioning and sustaining joint forces to and from any location; and networking of the joint logistics enterprise in a real-time global information system.  Results of this experimentation will be used by the Joint Staff to inform investment decisions.  Products include:  Capability Gap Analysis Report; Logistics Enterprise Solution Evaluation; DOTMLPF-P Recommendations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.933"
                                            },
                                            "Text": {
                                                "val": "•  The FY 2012 JCD&E program of work in the Logistics JCA will address the key mission areas identified in the Quadrennial Defense Review and highlighted in the Defense Planning and Programming Guidance.  The FY 2012 campaign will address projected mission critical capabilities and concepts required to build the security capacity of partner states.  \n•  The scope of work may include experimentation to identify and evaluate enabling technologies that create mechanisms to facilitate more rapid transfer of critical materiel.\n•  Five Warfighter Challenges (14 percent of total submissions) were submitted by the JCD&E Enterprise identifying deficiencies in the Log JCA to be addressed through joint experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Protection (P)"
                                    },
                                    "Description": {
                                        "val": "Joint Force Commander lacks sufficient ability to detect, prevent and mitigate adverse effects of attacks on personnel (combatant\/non-combatant) and physical assets of the United States, allies and friends."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.263"
                                            },
                                            "Text": {
                                                "val": "•  Developed a Ballistic Missile Defense (BMD) C2 architecture and prototype to reduce gaps and disconnects within Geographic Combatant Commands (GCCs) and between GCCs, allies and partners.  The C2 architecture and prototype was be evaluated through experimentation, M&S and real world exercise events.  Products are: Global C2 BMD Integration Guide, prototype C2 architecture\/structure and DOTMLPF-P recommendations.\n•  Developed an implementation guide and decision\/planning tools that support implementation of a phased adaptive approach to ballistic missile defense (PAA BMD) in defense against threats to the homeland, allies, partners and US forces abroad.  In coordination with the Missile Defense Agency and Joint Integrated Air and Missile Defense Organization (JIAMDO), experimentation contrasted current and programmed PAA BMD capabilities using M&S to conduct an analytical wargame in order to determine and validate allocation, prioritization, deployment, employment, risk and burden-sharing recommendations.  In addition, this effort  identified PAA force development and operational implications to mitigate future risks.  Products are: decision\/planning tools (risk assumption, burden-sharing, force allocation, prioritization and deployment), PAA Implementation Guide Book and DOTMLPF-P recommendations.\n•  Developed and provided an experimentally validated Countering Precision Guided Munitions (CPGM) Concept and concept of operation.  This effort will improve joint force ability to plan, execute, and employ friendly capabilities in operations against irregular adversaries with access to significant numbers of precision guided munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "•  Based on work accomplished in FY 2010 and FY 2011, and absence of specific Protection JCA FY 2012 joint experimentation requirements from COCOMs, it is expected that FY 2012 accomplishments in this JCA will be generated as byproducts from work in other areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Net Centric (NC)"
                                    },
                                    "Description": {
                                        "val": "Joint Force Commander requires the ability to provide a framework for full human and technical connectivity and interoperability that allows all DOD users and mission partners to understand and act on with confidence, and protects information from those who should not have it."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.937"
                                            },
                                            "Text": {
                                                "val": "•  Developed Computer Network Defense (CND) concept of operations, organizational construct, procedures, and enabling authorities\/policies to strengthen the defense of critical infrastructure.  This effort validated the concept of operation and procedures through experimentation and Modeling and Simulation.  Products include Critical Infrastructure CND concept of operations and CND decision support tool\/methodology focused on situational awareness and defense of critical infrastructure (networks and systems)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.279"
                                            },
                                            "Text": {
                                                "val": "•  The FY 2012 JCD&E program of work in the Force Application JCA will address the key mission areas identified in the Quadrennial Defense Review and highlighted in the Defense Planning and Programming Guidance.  The FY 2012 campaign will address projected mission critical capabilities and concepts required to deter and defeat aggression in anti-access environments.  \n•  The scope of work may include experimentation to identify and evaluate enabling technologies that focus assuring access to space and use of space-based assets.\n•  Four Warfighter Challenges (12 percent of total submissions) were submitted by the JCD&E Enterprise identifying deficiencies in the BP JCA to be addressed through joint experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Command, Service Experimentation Support (CCSES)"
                                    },
                                    "Description": {
                                        "val": "Combatant command, Service Experimentation Support enables the combatant commands and Services to conduct experimentation within the joint context in order to build enterprise capacity and to integrate solutions across DOD.  This leads to collaborative development, participation and support that inform the warfighter challenges and joint concepts.  It provides joint context to Service experimentation through collaborative design, analysis, planning and execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.038"
                                            },
                                            "Text": {
                                                "val": "Combatant Command Experimentation\n•  Supported USSOCOM with joint analysis to complete the Final Report on Global Scout 11.\n•  Supported USPACOM with laboratory capacity to conduct Cyber Experimentation.\n•  Supported USEUCOM with joint analytical capacity to conduct Socio-Cultural Analysis.\n•  Provided program and analytical support to USEUCOM to transition Point-Of-Need Delivery (POND).\n•  Enabled distributed, combatant command-led experimentation in the following areas:\n•  Cyberspace Joint Operational Concept Experimentation (USSTRATCOM)\n•  Building Partnership Capacity – Mexico Experimentation (USNORTHCOM)\n•  Cyber Warfare Experimentation (USPACOM)\n•  Electronic Warfare Experimentation (USPACOM)\n•  Joint Anti-Submarine Warfare Experimentation (USPACOM)\n•  Countering Anti-Access Technologies Experimentation (USPACOM)\n•  Support emergent, time-sensitive combatant command requirements as funding and priorities permit.\n\nJoint Service Experimentation\n•  Army – Unified Quest 11: Supported the Army’s Training and Doctrine Command with joint analysis for the Unified Quest 11 campaign of learning.  \n•  Navy – Global 11: Supported the U.S. Naval War College with joint analysis to prepare the final report on Navy’s Global 11 war game.\n•  Air Force – Unified Engagement 11: Supported the Air Force with joint analysis perspective in development of the final report on Unified Engagement 11.\n•  Marine Corps – Expeditionary Warrior 11: Provided joint context and analysis support to the Marine Corps Warfighting Laboratory in development of the final report on Expeditionary Warrior 11."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Urban Operation (JUO) \/ Joint Irregular Warfare Center (JIWC)"
                                    },
                                    "Description": {
                                        "val": "Joint Urban Operations (JUO) – To ensure DOD is prepared to dominate future threats and deny sanctuary to our adversaries in urban areas, the Secretary of Defense assigned Commander, U.S. Joint Forces Command (USJFCOM) as the DOD Executive Agent (EA) for Joint Urban Operations (JUO). JUO Lines of Joint Experimentation (LOJX) projects will provide the Joint Force Commander with the ability to lead, coordinate, and integrate the urban operations doctrine, organization, training, and equipment activities of the DOD Components and improve and transform the capabilities of joint forces in conducting urban operations over the full range of urban contingencies. To execute the mission, USJFCOM established the DOD JUO Program.  In 2008, the JUO program and the DOD EA for JUO mission were subsumed into the USJFCOM Joint Irregular Warfare Center (JIWC), led by the JIWC Director who was assigned to execute JUO Executive Agent responsibilities for Commander, USJFCOM."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "•  Continued development, articulation and refinement of DOD Joint Urban Operations Master Plan, as a comprehensive document describing DOD’s approach to lead, coordinate, and integrate urban operations doctrine, organization, training, and equipment that transform the capability to conduct urban operations.  \n•  Conducted analysis of emerging urban materiel solutions to address prioritized urban gaps areas to include capability review\/technology assessment of relevant efforts within battlespace awareness, force application or protection.\n•  Assessed the urban environment test solutions of the Joint Urban Test Capability (JUTC) Program to determine progress in mitigating gaps identified in the Urban Environment Test Capability (UETC) Report and DOD’s ability to replicate, simulate and emulate the urban environment for test and evaluation (T&E).\n•  Led and coordinated efforts to identify and expand M&S capabilities related to the small unit training simulations and urban environment to optimize service programs and ensure immersive training capabilities\/technologies are provided for ground units within Close Combat Infantry Immersive Training.\n•  Led and coordinated efforts to identify gaps\/shortfalls, assess potential solutions, and make prioritized recommendations to ensure integration of IW and JUO capability development activities across the Joint Capability Integration Development System, Defense Acquisition System, and the Planning, Programming, and Budget Execution and other DOTMLPF-P process. \n•  Continued established discovery seminar wargames to build on work optimizing joint and coalition force activities in complex environments. Extended network of multi-national, interagency, and academic partners to advance understanding of how to positively influence relevant populations, when required, defeat adversaries embedded and diffused within urban areas. (Joint Irregular Warfare ten concepts carrying into FY 2011 and US-Israel Hybrid Threat Seminar).\n•  Planned and conducted the Joint Urban Wargame 2011 in order to determine the capability and capacity to systematically assess the critical functions, processes, and structures of an urban system and its embedded adversaries.  This includes identifying critical functions, processes and structures of an urban system and its embedded adversaries that must be understood to enable integrated planning and execution of military and non-military actions in an urban operational environment, and identify measures of success for military and non-military actions in an urban environment.\n•  Partnered with NATO to wargame the “Military Support to Countering Hybrid Threats” concept in order to gain the NATO Military Committee’s endorsement of the concept and tasking to accomplish future work."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Futures Group"
                                    },
                                    "Description": {
                                        "val": "The Joint Futures Group (JFG) is a unique DoD team specifically focused on identifying the next big challenges or opportunities for the joint force and Combatant Commanders that are not being addressed elsewhere in DoD.  It is a unique entity within DoD that utilize analytic and research processes integrates doctoral level future thinking and extrapolates likely future operational environments within which innovative ideas about challenges and military implications for the Department of Defense are generated.  The JFG integrates the results of its “futures” research into downstream processes for concept and development, experimentation scenarios, capabilities definition, doctrine, and inclusion in the majority of professional military education (PME).  Their unclassified professionally developed products are globally disseminated and inform every Service, Combatant Command and all of our multinational partners.  \"We must focus concept development on the specific problems identified in the Joint Operating Environment or on identified gaps in doctrine…\" – General Mattis\n\nThe objective of the JFG is to provide a vision of the future and support identification and articulation of joint force implications, through collection, analysis, synthesis, dissemination of the world's strategic and international relations futures.  The current means of articulation is the Joint Operating Environment (JOE) report. Unlike other classified DIA or JCS “future focused” documents the unclassified JOE provides the foundational problem statement for the CJCS’s Capstone Concept for Joint Operations (CCJO), and is intended to inform the development of Joint Operating Concepts and Joint Integrating Concepts, as well as to provide a framework for Combatant Command and Service LOEs and experiments through its vision of the future. The JOE has been downloaded globally well over two  million times in the past two years and is a key Combatant Command, Service and CJCS reference document on future challenges and opportunities.  Support to the DoD analytical agenda consists of improving and refining the classified Integrated Security Contexts (ISCs).  This dedicated analytical support ensures that the ISCs reflect a balanced and plausible set of future warfare challenges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.112"
                                            },
                                            "Text": {
                                                "val": "•  Supported the Chairman’s Capstone Concept for Joint Operations (CCJO) review and all Combatant Command concept and doctrine development, Limited Objective Experiments (LOEs) and experimentation program through research and publishing of the 2011 JOE.  Based on doctoral level Subject Matter Expertise (SME) future focused input, JFG will research, review and produce detailed research papers with emphasis on the future trends, conditions, challenges, and opportunities to be faced by future joint warfighters.  Set the “context” for the future fight.\n•  Provided detailed input to support the development of products, papers and classified studies that support the DoD Analytical Agenda as it transitions to Support to Strategic Analysis.  Senior analyst  reviewed and refined OSD’s Integrated Security Contexts (ISCs) and Foundational Activities (FA) scenarios and participation in the Support to Strategic Analysis process; provided input to the Comprehensive Joint Assessment (CJA) and other policy and strategy “future focused” documents.\n•  Researched, analyze, synthesized and promoted a vision of the future that includes critical analysis of battlefield innovation of disruptive technologies through partnership with Defense Intelligence Agency (DIA), command and service intelligence, information dominance and national defense intelligence agencies. To this end, planned, coordinated, and executed international conferences focused as follows and provided DoD, JCS, Combatant Command, Service and Multinational attendee actionable white papers on:\n•  Ideological Conflict over Global Networks “Winning the Global War of Ideas”\n•  The Rise and Fragmentation of Great Powers: China\n•  The Rise and Fragmentation of Great Powers: India\n•  Specific and measurable outcomes include:\n•  A clear statement of the future challenges and implications for the joint force that allows concepts to be developed to prepare for these challenges.\n•  A set of alternative futures scenarios to guide focused scenario development for joint exercises and Combatant Command and Service LOEs and experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transferred to Joint Staff Accounts"
                                    },
                                    "Description": {
                                        "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2013, funds will be transferred to Joint Staff Accounts dependant on the Secretary of Defense approval of the governance plan.  The governance plan is still under review in the Department.  Once the governance plan is approved, this document will be updated with any changes to the Joint Experimentation Program plan for FY 2013, and beyond.  The department will make the appropriate notifications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance of Joint Experimentation efforts is measured by successful development of:\n(1) objective assessment and validation of enhanced capabilities enabling the joint force commander to perform joint missions. \n(2) delivery of relevant, intellectually rigorous joint concepts to enhance or change Joint Doctrine. \n(3) confirmed transition of capability\/products from experimentation to force implementation through the DOTMLPF-P Change Recommendations (DCR) process.\n(4) identification of innovative integrated solutions and joint interoperability standards for Service and Agency capability developers to pursue through demonstration, acquisition and\/or employment. \n(5) resolution of specific joint concept and capability shortfalls delineated through the JCD&E experimentation campaign plan development process."
                        }
                    }
                }
            ]
        }
    }
}