{
    "id": "f1de8d14c5ae1db74db2cf8748f81a8b5ee73298",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603942D8Z"
        },
        "ProgramElementTitle": {
            "val": "Technology Transfer and Transition"
        },
        "R1LineItemNumber": {
            "val": "67"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.842"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Change from FY 2011 to FY 2012 reflects reallocation of funds from Technology Transfer P942 to Department of the Air Force PE 0604317F and reallocation of Technology Transition Initiative P949 to higher priority DoD requirements."
        },
        "ProgramElementMissionDescription": {
            "val": "The Technology Transfer and Transition (TT&T) program element has two sub-elements: Technology Transfer (P942), and Technology Transition Initiative (P949).\n\nDefense Technology Transfer's three-fold mission is (1) integration of advanced commercial-sector technologies into Department of Defense (DoD) systems, particularly from nontraditional defense contractors; (2) spinoff of DoD-developed technologies to industry for product development and to make these technologies available for military acquisition; and (3) establishment of collaborative Research and Development (R&D) projects with the private sector for cost-sharing of new dual-use technology development. \n\nThe Technology Transition Initiative (TTI), authorized by Title 10 and Section 242 of the FY 2003 Defense Authorization Act, facilitates the rapid transition of new technologies from the DoD science and technology (S&T) base into DoD acquisition programs.  The program addresses the funding gaps that exist between the time a mature technology is demonstrated and the time it can be funded and procured for use in an intended weapons system or operational capability for the warfighter. Since the TTI (P949) program inception in FY 2003, 78 projects have been initiated and 50 have completed. Of the 50 completed projects, 35 (70%) successfully transitioned to DoD Acquisition Programs of Record or procurement contracts for operational use and subsequent fielding."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.310"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.842"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.468"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.900"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.212"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.088"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.063"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.005"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Change from FY 2011 to FY 2012 reflects: 1) reallocation of funds from Technology Transfer P942 to Department of the Air Force PE 0604317F and 2) reallocation of funds from Technology Transition Initiative P949 to higher priority DoD requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P942"
                    },
                    "ProjectTitle": {
                        "val": "Technology  Transfer"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.970"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY 2012 change from FY 2011 reflects reallocation of funds from Technology Transfer P942 to Department of the Air Force PE 0604317F."
                        },
                        "ProjectMissionDescription": {
                            "val": "Defense Technology Transfer's three-fold mission is (1) integration of advanced commercial-sector technologies into Department of Defense (DoD) systems, particularly from nontraditional defense contractors; (2) spin-off of DoD developed technologies to industry to make these technologies available for military acquisition; and (3) establishment of collaborative Research & Development (R&D) projects with the private sector for cost-sharing of new dual-use technology development.\n\nDefense Technology Transfer has been successful at helping the Department transfer its technologies to U.S. companies, and first responders making these technologies available for both military and commercial applications. Technology Transfer currently accounts for 50 percent of all DoD patent license agreements (PLA) and has brokered over 650 Patent License Agreements (PLAs), Cooperative Research and Development Agreements (CRADAs) and other R&D partnerships involving innovative companies new to DoD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Marketing of DoD technologies"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.713"
                                            },
                                            "Text": {
                                                "val": "Continued active marketing of DoD-developed technologies to U.S. companies to establish PLAs to commercialize these technologies for both civilian and military applications. The objectives of this technology marketing activity were to (1) accelerate the transition of DoD-developed technologies to the warfighter; (2) lower the cost of DoD technology acquisition by developing a larger commercial market for dual-use technologies; (3) provide a return of revenue to DoD labs from commercial spin-off of defense technologies; and (4) fulfill DoD's Congressionally mandated technology transfer directives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dual Use Technology Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.817"
                                            },
                                            "Text": {
                                                "val": "Actively promoted and brokered Cooperative Research and Development Agreements (CRADAs) between DoD labs and industry for development of technology with both commercial and military applications. This activity particularly focused on nontraditional defense contractors and was intended (1) to help lower the expense of new defense-related technology development through cost-sharing with industry, and (2) to help DoD benefit from private-sector technology investments and innovations.\n\nAs an example, TechLink facilitated a CRADA and a PLA between the Army Edgewood Chemical Biological Center (ECBC) and BVS, Inc. of Missoula, Montana for an advanced integrated virus screening detection system. This system can rapidly screen for a wide variety of viruses that affect humans, wildlife, and livestock such as avian influenza in chickens. The CRADA provides for BVS to contribute the development of a comprehensive viral database at ECBC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spin-In of Advanced Commercial-Sector Technologies"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.440"
                                            },
                                            "Text": {
                                                "val": "Actively promoted DoD Small Business Innovation Research (SBIR) (focus on Phase III contracts) and Independent Research and Development (IR&D) programs to companies throughout the United States in order to identify, fund, acquire, and integrate private-sector innovations and advanced commercial technologies into DoD systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P949"
                    },
                    "ProjectTitle": {
                        "val": "Technology Transition Initiative"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.872"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY 2012 changes from FY 2011 reflect reallocation of funds from Technology Transition Initiative to higher priority DoD requirements."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Technology Transition Initiative (TTI), authorized by Title 10 and Section 242 of the FY 2003 Defense Authorization Act, facilitates the rapid transition of new technologies from the Department of Defense (DoD) science and technology (S&T) base into DoD acquisition programs. The program addresses the funding gaps that exist between the time a mature technology is demonstrated and the time it can be funded and procured for use in an intended weapons system or operational capability for the warfighter.\n\nSince the program inception in FY 2003, 78 projects were initiated and 50 completed. Of the 50 completed projects, 35 (70%) successfully transitioned to DoD Acquisition Programs of Record or procurement contracts for operational use and subsequent fielding; exceeding the objective of 30% for demonstration programs (Strategic Objective 4-3, Office of the Under Secretary of Defense, Acquisition, Technology & Logistics (OUSD(AT&L))."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Image Intensifier for Pilotage (Army)"
                                    },
                                    "Description": {
                                        "val": "This project integrates Electronic Image Intensifier (EI2) technology into a lightweight sensor for the Apache Modernized-Pilot's Night Vision System (M-PNVS). Four form-fit, function and flight ready EI2 prototypes will be engineered, built, and delivered to PM Apache for aircraft qualification and users evaluation flights.  The EI2 camera will provide performance that is equal to or greater than the current aviator's night vision goggles and at the same time allow for image fusion with the second generation Forward Looking Infrared (FLIR) on the Apache helicopter.\n\nProgram Outputs and Efficiencies: meet pilotage requirements for dynamic motion, resolution, and contrast through improved readout electronics and high definition format (1920 x 1080); exit criteria to be met include Aviator's Night Vision Imaging System (ANVIS) performance and $35 thousand per camera cost; four pre-production prototype cameras delivered for operational flight testing in FY 2011. TTI funding accelerates the transition of this capability by two to three years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "- Integrated prototype into Apache aircraft; completed aircraft qualification, operational flight testing and initiated procurement activities.\n- Successfully conducted two ground-based demos of the camera on an Apache in Yuma in March and May 2011.\n- Tested prototype in M-PNVS with integrated helmet and display sight system (IHADSS).\n- Delivered 4 pre-production prototypes.\n- Awarded Phase 3 contract to Intevac (February 2011).\n- Demonstrated operational prototype to PM Apache in an M-PNVS on an Apache helicopter (March and May 2011).\n- Evaluated camera performance at Army Night Vision & Electronic Sensors Directorate (NVESD) (February-March 2011).\n- Submitted all environmental qualification plans\/procedures to Aviation Engineering Directorate (AED) (April-May 2011).\n- Received approval from AED on environmental qual test plans."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Cartridge Improvements using Micro Electro-Mechanical Systems and Direct Write Explosive Ink"
                                    },
                                    "Description": {
                                        "val": "40 millimeter (mm) high-explosive, dual-purpose (HEDP) M433 and M430 cartridges have been in service since the 1950's and 1970's respectively, and are used with the M203 low-velocity grenade launcher and the MK-19 grenade machine gun by all services.  Both cartridges use point detonating fuzes with mechanical safe and arm (S&A) devices which do not reliably detonate on soft impact targets or high graze angles.  The objective of this effort is to improve the reliability of these cartridges through a Micro-Electro-Mechanical (MEMS) fuzing system that incorporates electronic initiation, improved target sensing using paired MEMS impact sensors, self-destruct capability, command arm enable, more accurate arming distance, and automated explosive ink loading.  In addition to improved reliability, these design enhancements will reduce volume and cost.\n\nOutputs and efficiencies: Incorporate impact sensors that will sense initial impact and electronically send a signal to initiate the explosive train for improved lethality and improved reliability on soft targets (from 50 percent current performance to 90 percent), and also significantly reduce the number of duds on the battlefield and training ranges.  The 40mm MEMS Fuze also will require less volume providing room for improvements in lethality or other future alternate applications.  TTI accelerates transition of this technology from the Army Armament Research, Development and Engineering Center (ARDEC) to Project-Manager Soldier Weapons (PM-SW) in approximately three years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "- Redesigned power source with a 36% volume reduction, and verified in high velocity ballistic firing.\n- Completed update of fuze circuit. \n- Completed S&A modification and verification. \n- EDF-11 explosive ink qualified for tri-service use.    \n- Initiated automation of S&A build under ATK contract. Onyx platform performing all required operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Fires Image (PFI) Software Suite Handheld Capability (Navy)"
                                    },
                                    "Description": {
                                        "val": "Currently Overseas Contingency Operations (OCO) missions are planned using traditional means and require dismounted operators, (conventional and Special Operations Forces (SOF)), who do not carry laptop computers.  The mission set is currently supported by paper.  The objective of this project is to integrate Battlespace Awareness (Mission Planning, Force Protection, Direct Action, etc.) capability on a Windows CE\/mobile handheld computer by building upon already proven and deployed technology.  The availability of these software tools on a handheld computer will immediately advance warfighter capabilities by enhancing situational awareness, precision targeting, and rapid employment at the tactical level. \n\nProgram Outputs and Efficiencies:  This project will generate and transition a software suite that provides image, video, and geographical capabilities on the Army's Pocket Sized Forward Entry Devices (PFED) and compatible Special Operations Forces Windows CE\/mobile handheld computers.  These forward operating Battlespace Awareness applications will be built around the previously transitioned and deployed Precision Fires Image (PFI), which is a National Geospatial-Intelligence Agency (NGA) validated, Central Command (CENTCOM) approved, image based targeting tool for coordinate seeking weapons.  Integration to the handheld computer will be advantageous in achieving advanced mission capability with less weight, space, and provide shorter operational readiness delays. The TTI funding will accelerate the acquisition and integration of this handheld software capability by two to three years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "- PFI software is currently used operationally by United States Conventional and Special Forces.\n- Australia and the United Kingdom completed foreign military sales cases with the United States for PFI technology.\n- OSD (DARPA) resourced a \"port\" of the TTI PFI into a android operating system.\n- The U.S.  Army sent Mobile Training Teams (MTT) into Afghanistan to instruct PFI to support Precision Guided Mortars.\n- Successfully transitioned into the US Army Pocket-Size Forward Entry Device (PFED) Program of Record.\n- Evaluated by the USMC for tactical air platforms that do not have moving maps (i.e. AH-1 Cobra, AV-8 Harrier, F\/A-18 Hornet)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hellfire Height of Burst (HOB) Sensor (Army)"
                                    },
                                    "Description": {
                                        "val": "The HOB Sensor is a miniaturized radio frequency (RF) target detection device that will be integrated into the new Electronic Safe and Arm Device (ESAD) being incorporated into the next generation Hellfire missile (Hellfire R).  The HOB sensor provides for improved lethality against targets in the open by detonating the warhead at a height above ground optimized for these targets.  This TTI project funds the final design and engineering of the HOB sensor optimized for Hellfire, provides component and system level environmental and hardware-in-the-loop testing, and allows two flight tests of HOB sensor equipped missiles.\n\nProgram Outputs and Efficiencies:  The HOB sensor will be integrated into the Hellfire missile and undergo hardware-in-the-loop (HWIL), environmental, and flight testing.  The final outcome will be two missile flights incorporating the HOB sensor.  The first flight will replace the warhead with a telemetry package to record the missile flight data as well as the point at which the HOB sensor triggers the warhead.  The second flight will incorporate both the HOB sensor and the Hellfire warhead. Lethality data will be collected to validate the modeled performance against targets in the open.  Simulation has shown that the HOB sensor will significantly increase the lethality when fired from platforms that allow a steep angle of impact.  TTI accelerates the transition of this capability by two years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Completed the following:\n- First HOB prototype demonstrations and tests at Redstone Arsenal (Rocket-on-a-Rope);\n- L3 and Lockheed Martin preliminary designs;\n- L3 HOB Sensor Component-Level preliminary design review (PBR);\n- Lockheed Martin System-Level PDR;\n- L3 HOB Sensor electrical detailed design;\n- L3 HOB Sensor software and firmware detailed designs;\n- Lockheed Martin ESAF electrical detailed design modifications to support HOB Sensor integration;\n- Lockheed Martin ESAF software and firmware detailed design modifications to support HOB Sensor integration; and\n- Lockheed Martin ESAF software and firmware code and initial testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hellfire Next Generation Captive Carry Health Monitor (NG-CCHM)"
                                    },
                                    "Description": {
                                        "val": "The Hellfire NG-CCHM is a missile health monitoring device that measures and records operational and environmental stresses tailored to the most recent Hellfire missile design, the AGM-114R model.  The unit will be a self-powered, low-cost autonomous system capable of measuring and recording key health status parameters.  The unit will be an electronic data acquisition device embedded into each missile and will be optimized for long life to automatically monitor temperature exposure, drop shock events and record vibration levels that can cause degradation to the missile over time.\n\nProgram Outputs and Efficiencies:  The primary outputs and efficiencies to be demonstrated in the project are: (1) reduced costs and maintenance burden to Warfighter; (2) increased reliability; (3) enhanced system safety; and (4) increased readiness.  TTI accelerates the transition of this capability by two years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.650"
                                            },
                                            "Text": {
                                                "val": "Completed the following: detailed electrical design; detailed packaging design; fabrication and assembly of health monitor unit (HMU) CCAs; CCA board-level testing; Test Box design, fabrication, and assembly; detailed software design; software code and unit test; and graphical user interface (GUI) test software to support integration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Service General Purpose Mask (JSGPM) Filter End-of-Service-Life Indicator"
                                    },
                                    "Description": {
                                        "val": "An end-of-service-life indicator (ESLI) has been developed for chemical, biological radiological, nuclear (CBRN) protective mask filters that will alert the user to exchange the filter following exposure to acid gas chemical warfare agents (CWAs).  The technology to be transitioned consists of thin colorimetric indicator films coated with pondus hydrogenii (pH) sensitive dyes and reagents that target common functional groups and chemical properties of the major classes of blood agents and select Toxic Industrial Chemicals (TICs).  The approach is to place the ESLI along the inside wall of the filter in contact with the carbon bed so it can react with the passing agent wave front to produce a color change, thereby alerting the user to replace the filter well before its gas-life capacity is depleted. \n\nProgram Outputs and Efficiencies:  The Joint Service General Purpose Mask (JSGPM) CBRN filter housing will be equipped with a transparent plastic window to view the indicator response.  The ESLI will be designed to provide a visual signal when approximately 20 to 60 percent of the filter's service life capacity is expired, depending on the target agent.  The ESLI technology will be transitioned to the M50 JSGPM acquisition program as a spiral upgrade (product improvement) to the current primary CBRN filter.  TTI funding accelerates this transition by two years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "- Indicator Performance: Subcontractor completed improvements to both indicators\/ Sensitivity of improved indicators equivalent to original.\n- Indicator Robustness: Subcontractor completed required improvements for both the 1-16 and 1-35B indicators.\n- Indicator Position Selected: Preliminary testing shows indication prior to agent breakthrough and very close to target."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Information Management System (IIMS) Transition (Air Force)"
                                    },
                                    "Description": {
                                        "val": "The Integrated Information Management System (IIMS) is a collaborative situational awareness tool which aids in the management of conventional and Chemical, Biological, Radiological, and Nuclear (CBRN) events at fixed, expeditionary and incident response sites.  IIMS includes detector\/ warning networks, access to CBRN models, and information exchange with civil sector and coalition partner organizations.  IIMS is in the base defense component of the AF Theater Battle Management Core System – Unit Level\/Unit Command and Control (TBMCS-UL\/UC2).  It addresses both conventional and CBRN incidents.  It is replacing the Survival Recovery Center (SRC).  It improves decision making and battle management activities in the event of a conventional or CBRN incident.\n\nThe objective of this effort is to transition IIMS into TBMCS-UL\/UC2 Increment Two, and subsequently into the final TBMCS-UC2.  The additional IIMS capabilities will augment the fielded TBMC-UL\/UC2 to extend original capabilities, provide a stand-alone capability, and to incorporate joint CBRN tools.  A successful transition of IIMS to TBMCS-UC2 through this spiral development process will significantly increase the base defense\/response capabilities available to the warfighter.  \n\nProgram outputs and efficiencies:  TTI funding accelerates the SRC replacement with planned upgrades to IIMS that more efficiently identify and respond to issues preventing the flying mission by 1-2 years.  The transition of IIMS into the TBMCS-UC2 N-tier Service Oriented Architecture enables transition of new capabilities into TBMCS-UC2 through the IIMS framework and the adjudication of any Priority I or Priority II software trouble reports at the time of transition.  The software will adhere to general quality and reliability standards and include standard software product sets upon delivery (i.e. source code, executable code, documentation, test results). TTI funding accelerates upgrades to integrate sensor\/detector networks and improve communications with off-base agencies by 4+ years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.900"
                                            },
                                            "Text": {
                                                "val": "- UL\/UC2 Increment 1 with IIMS received fielding message in March 11.\n- UL\/UC2 with IIMS selected for AF wide fielding to address critical deficiency in Installation Command and Control.\n- IIMS integration\/transition to UL\/UC2 Increment 2 on schedule for formal 4Q FY11 DT\/OT testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Surfactant System for Surface CB Agent Removal"
                                    },
                                    "Description": {
                                        "val": "Mature a multi-purpose surfactant technology to accelerate its transition to the Decontamination Family of Systems (DFoS).  There is an immediate and unmet requirement for a cargo aircraft decontaminant.  The primary means to decontaminate aircraft is ineffective in decontaminating most Chemical and Biological (CB) hazards and material compatibility issues exist with currently fielded decontaminants and aircraft exteriors.  Current decontaminants are single purpose items and carry a significant logistics burden.  The surfactant technology will provide the Warfighter with a multi-use, advanced formulation for mitigating CB hazards to operational (threshold) or thorough (objective) levels.  MIL-PRF-87937D testing will be conducted to qualify the surfactant system as an aerospace cleaning compound and enable it to be inserted on the Qualified Products List (QPL).  The surfactant technology can be used as a routine cleaning compound as well as an aircraft-cleaning compound.  TTI accelerates transition by more than two years.\n\nOutputs and efficiencies:  a) Validate chemical efficacy (via contact and vapor testing) on priority painted materials; b) demonstrate biological efficacy; c) MIL-PRF-87937D qualified product (physical, chemical, toxicological properties, environmental impact)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.355"
                                            },
                                            "Text": {
                                                "val": "- Live agent tests were conducted to compare SuperSoap to Aircraft Cleaners qualified by MIL-PRF-87937D; SuperSoap decontaminates statistically better on Aircraft Topcoat and other materials.\n- Concept of Operations for SuperSoap (dilution ratio, optimized spraying conditions, etc.) were established.\n- Lab-scale sprayers were delivered to Edgewood Chemical and Biological Center and the Naval Surface Warfare Center – Dahlgren for chemical and biological efficacy testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerated Interlocking Mortar Increment Container Technology (Army)"
                                    },
                                    "Description": {
                                        "val": "The objective of this program is accelerate the transition of interlocking mortar increment container (MIC) design and fabrication technology to ensure uniform propellant ignition and reduce differential pressures which will eliminate a noted safety critical mechanism and reduce the possibility of critical short rounds <80% of intended range) due to shearing of fin blades and asymmetrical burn.  The interlocking MIC design eliminates the potential alignment of the open ends of the propelling charges and will greatly reduce the chances of more propellant being on one side of the mortar fin boom.  This eliminates the imbalance of the energetics and associated potential problematic pressure differential within the mortar tube.  The warfighter will have no chance of a sheared fin failure due to unexpected alignment of propelling charges which, in turn, will reduce the possibility of a critically short flight 120mm rounds in theater. Accelerating the maturation, transition, and insertion of this interlocking \"high hat\" mortar increment container technology into the 120mm mortar ammo program of record (PoR) will improve safety and accuracy for our light and dismounted ground forces. It also will lay the foundation for potential subsequent application to 60mm and 81mm mortar ammo if warranted .  \n\nProgram Outputs and Efficiencies: Provides the warfighter with safer mortar ammunition; further prevents the possibility of unexpected short flight of 120mm mortar rounds in theater; improves soldier safety during training. TTI accelerates the deployment of this capability by 18 months."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.638"
                                            },
                                            "Text": {
                                                "val": "- Generated drawings, specifications, and implemented engineering change proposal into current 120mm Mortar Propelling Charge Contract.\n- Charged establishment and uniformity; Esterline produced inert and live parts.\n- Initial sequential testing completed.\n- Hot leg of sequential safety retest (per test plan).\n- Ballistics testing completed.\n- Esterline facilitization contract modification completed.\n- Contract modification of improved packaging protector. Completed delivery of inert parts to Picatinny. Parts will be taken to the user and LAP facilities for familiarization with the new part. Delivery of live parts to Picatinny and American Ordnance for familiarization of new part completed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transition Initiatives"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.479"
                                            },
                                            "Text": {
                                                "val": "Addressed the funding gaps that exist between the time a mature technology is demonstrated and the time it can be funded and procured for use in an intended weapons system or operational capability for the warfighter."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}