{
    "id": "f5302bdf295940ed8fe9f9c4e4cb2ebea5f3d166",
    "meta": {
        "filename": "dod-2013_RDTE_2013_OSD_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.zzz_unzipped_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605017D8Z"
        },
        "ProgramElementTitle": {
            "val": "Reduction of Total Ownership Cost (RTOC)"
        },
        "R1LineItemNumber": {
            "val": "112"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.349"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "19.349"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Under Secretary of Defense (Acquisition, Technology & Logistics) defined the mission for the Reduction in Total Ownership Cost (R-TOC) program as the reduction of ownership costs for defense systems.  The R-TOC program funded activities and initiatives that:\n\n1. Increased the reliability, maintainability, and supportability; thereby increasing readiness of new or existing defense systems.\n2. Reduced logistics footprint.\n3. Generated future cost reductions in total ownership cost.\n\nIndividual Service Projects are complete efforts within themselves that yield complete developments\/redesigns which the Services are committed to put into production and operation.  The initiatives optimized cost avoidance, which ultimately reduce the operating and support costs for systems.  Each project was evaluated against a rigorous set of criteria to assess its viability and probability of success.  Individual projects addressed specific Service needs and high Operations and Support (O&S) cost areas.\n\nThe Department set a FY 2010 R-TOC goal of reducing the total defense systems inflation increase in O&S cost by 30 percent between FY 2004 and FY 2010.  This PE provided a major portion of the program funding to achieve this goal.  The successful demonstration of the R-TOC program initiatives stimulated additional initiatives by the Services to achieve even greater cost avoidance.  In FY 2012 the program devolves to the Services.\n\nIndividual R-TOC Project Management will continue to rest with the Services and their Project Managers after being devolved.  Each Service has an active R-TOC Point of Contact (POC) for the initial interface between the Office of the Secretary of Defense (OSD) and the R-TOC Project Managers.\n\nThe average Return on Investment (ROI) for FY 2010 projects (based on discounted cash flow calculations) is approximately 80:1 with $1.333 billion in cost avoidance across the life cycle of the affected systems.  The average ROI for the FY 2011 projects (based on discounted cash flow calculations) is approximately 53:1 with $2.049 billion in cost avoidance across the life cycle of the affected systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.310"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.349"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.961"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.366"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.417"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.075"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.103"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "017"
                    },
                    "ProjectTitle": {
                        "val": "RTOC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.349"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.349"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Under Secretary of Defense, Acquisition, Technology & Logistics (USD(AT&L)), defined the mission for the Reduction in Total Ownership Cost (R-TOC) program as the reduction of ownership costs for defense systems.  The R-TOC program funded activities and initiatives that:\n\n1.  Increased the reliability, maintainability, and supportability, thereby, increasing readiness of new or existing defense systems.\n2.  Reduced logistics footprint.\n3.  Generated future cost reductions in total ownership cost.\n \nThese individual initiatives were complete efforts within themselves that yield complete redesigns which the Services were committed to put into production and operation.  The initiatives optimize cost avoidance, which ultimately reduce the operating and support (O&S) costs for systems.\n \nThe Department set an FY 2010 R-TOC goal of reducing the total defense systems inflation increase in operations and support cost by 30 percent between FY 2004 (baseline) and FY 2010.  In FY 2011, the Office of the Secretary of Defense (OSD) will transition the program to the Services.  OSD will only fund those projects that will be completed during FY 2011.  There will be no R-TOC PE funded carry-over projects into FY 2012.  The Services will assume responsibility for the program in FY 2012.\n \nThe average Return on Investment (ROI) for FY 2009 projects (based on discounted cash flow calculations) is approximately 45:1 with $1.174 billion in cost avoidances across the life cycle of the affected systems.  The average ROI for the FY 2010 projects (based on discounted cash flow calculations) is approximately 80:1 with $1.333 billion in cost avoidances across the life cycle of the affected systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Reduction of Total Ownership Cost Efforts"
                                    },
                                    "Description": {
                                        "val": "In FY 2010, the Services completed all FY2009 projects and started eighteen new projects. Cost avoidances established for the projects listed below are based on engineering estimates of the benefits provided by project implementations. Sources of cost avoidances are defined as part of the project submittal and come from any O&S cost source (fewer spares, lower maintenance hours, faster turnaround times, reduced scheduled maintenance, reliability\/maintainability\/supportability problems, etc.)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.349"
                                            },
                                            "Text": {
                                                "val": "In FY 2011, OSD transitioned the program to the Services.  OSD will only fund those projects that are completed during FY 2011.  No R-TOC funded carry-over projects into FY 2012.  The Services assume responsibility for the program in FY 2012.\n\nThe primary objective of the projects listed below continued to be the reduction of O&S costs for the affected systems. \n\nArmy Projects: \n- The Army continued six FY 2010 projects and completed these projects in FY 2011.  The HH-60 Forward Looking Infrared (FLIR) work continued to redesign the HH-60 FLIR turret to prevent damage during hovering and landings by reducing the size of the turret.  \n- The Special Operations Forces (SOF) Common Avionics Architecture System (CAAS) continued work to demonstrate a common interface for the CAAS software.  The goal was to integrate the CAAS interface solution into existing and future virtual flight training simulators significantly reducing the costs to modify, recompile, and port training simulation software.  \n- The UH-72A project continued to evaluate and implement a coating process to improve the reliability of the UH-72A main rotor blade in harsh environments.  \n- The need for the Hellfire Warhead missile to carry multiple warhead models adds unnecessary operational burden.  The Army proposed to develop a new combined warhead to accept three different warhead configurations into a single package for the Hellfire missile replacing the current three variants. \n\nNavy Projects:  The Navy continued one FY 2010 project and started and completed ten new projects in FY 2011.  The primary themes for FY 2011 were power conservation, better corrosion control through improved surface coatings, and maintenance cost reductions through streamlining.  \n- General illumination standards employed the use of fluorescent and incandescent lighting fixtures that had a short service life and were energy inefficient.  One of the conservation projects included the replacement of legacy fluorescent lighting with LED lighting on test ship (USS PEARL HARBOR) to lower maintenance and energy costs.  \n- LHA-1 and LHD-1 Class Ships have directional stability issues.  Tests with other types of ships have shown that appendages installed to eliminate these maneuvering issues reduced total energy costs by improving the steering.  \n- The Navy proposed to reduce weight and maintenance costs by eliminating some current Electronic Cooling Water systems on DDG 51 and CG 47 Class Surface Combatants to reduce weight and chill water system load requirements.  These systems used the ship’s chilled water instead of demineralized electronic cooling water.  \n- To control corrosion O&S costs the Navy proposed the use of prototype cameras in shipboard tank voids to analyze condition and structural degradation eliminating the need to open tank.  The Navy also proposed to test alternative corrosion coatings on shipboard crash-cranes to reduce excessive corrosion related maintenance costs.  \n- The Navy proposed to redesign the night vision goggles used in tactical aircraft because ½ AA batteries are very expensive compared to AA alkaline batteries and are not readily available aboard ship or while forward deployed.  The deliverable was redesigned AN\/AVS-9 mounts that were capable of using AA alkaline batteries, which resulted in increased durability and better electromagnetic performance.  \n- Naval Seas Systems Command (NAVSEA) introduced the use of conditioned based maintenance practices in the new LCS class ships and mission modules to help control O&S costs. \n- NAVSEA proposed upgrading high-maintenance components in shipboard munitions transporters to reduce maintenance requirements.  This project extended the periodic maintenance to a 5-year minimum and extended the service life of current assets to 25 years.  \n- Naval Air Systems Command proposed to establish common procedures and practices for Airborne ForceNet (Afn) network maintenance, troubleshooting, and updates.   This was applied immediately to EP-3 and P-3AIP platforms and will extend to P-8A and Broad Area Maritime Surveillance (BAMS).  \n- The Next Gen Navy Cash project leveraged the industry electronic banking advances to streamline shipboard banking and expenditure transactions for Sailors at sea.  The potential savings were equivalent to 31 percent of existing program costs.\n\nAir Force Projects: The USAF continued eleven projects started in FY 2010 and completed the projects in FY 2011.  Nine projects were applicable across multiple systems to leverage investment funding.  The projects included improving maintenance of the F-119 jet engine Integrally Bladed Rotor; eight projects focused on improving mid-level and depot level processes; and an effort to identify and qualify laser based alternatives to Metal Inert Gas (MIG), Tungsten Inert Gas (TIG), and electron beam (EB) manual welding processes for repairing F-15 and F-16."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "There was an annual USD(AT&L) call for proposed project plans in October.  Projects are submitted by the Services annually in January.  The project plan format was provided with the call for submission of Service projects.  Each project plan contained:\n1. Problem statement\n2. Impact statement\n3. Technical description\n4. Risk analysis\n5. Proposed phases\n6. Expected deliverables and results or outcomes\n7. Program management\n8. Cost\/benefit analysis\n9. Schedule\n10. Implementation plan\n \nThe project evaluation criteria were also provided as part of the call for use by the Services in arriving at their prioritized project list.  \n\nIn FY 2012 the Services will be responsible for implementing procedures for selecting projects and funding the R-TOC program."
                        },
                        "PerformanceMetrics": {
                            "val": "Not applicable."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "RTOC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "44.757"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "16.104"
                                                    },
                                                    "TotalCost": {
                                                        "val": "60.861"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}