{
    "id": "85a7a84c709eb3ce1e35bcc50508e91de933752b",
    "meta": {
        "filename": "dod-2013_PROCUREMENT_2013_NAVY_OTHER_BA2_JustificationBook_Navy_PB_2013.zzz_unzipped_JustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "2960"
        },
        "LineItemTitle": {
            "val": "Integ Combat System Test Facility"
        },
        "P1LineItemNumber": {
            "val": "76"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Shore Electronic Equipment"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "26.495"
                },
                "PriorYear": {
                    "val": "4.421"
                },
                "CurrentYear": {
                    "val": "4.441"
                },
                "BudgetYearOneBase": {
                    "val": "4.495"
                },
                "BudgetYearOne": {
                    "val": "4.495"
                },
                "BudgetYearTwo": {
                    "val": "4.534"
                },
                "BudgetYearThree": {
                    "val": "4.581"
                },
                "BudgetYearFour": {
                    "val": "4.658"
                },
                "BudgetYearFive": {
                    "val": "4.739"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "58.364"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "26.495"
                },
                "PriorYear": {
                    "val": "4.421"
                },
                "CurrentYear": {
                    "val": "4.441"
                },
                "BudgetYearOneBase": {
                    "val": "4.495"
                },
                "BudgetYearOne": {
                    "val": "4.495"
                },
                "BudgetYearTwo": {
                    "val": "4.534"
                },
                "BudgetYearThree": {
                    "val": "4.581"
                },
                "BudgetYearFour": {
                    "val": "4.658"
                },
                "BudgetYearFive": {
                    "val": "4.739"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "58.364"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "26.495"
                },
                "PriorYear": {
                    "val": "4.421"
                },
                "CurrentYear": {
                    "val": "4.441"
                },
                "BudgetYearOneBase": {
                    "val": "4.495"
                },
                "BudgetYearOne": {
                    "val": "4.495"
                },
                "BudgetYearTwo": {
                    "val": "4.534"
                },
                "BudgetYearThree": {
                    "val": "4.581"
                },
                "BudgetYearFour": {
                    "val": "4.658"
                },
                "BudgetYearFive": {
                    "val": "4.739"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "58.364"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "1.6"
                },
                "CurrentYear": {
                    "val": "1.61"
                },
                "BudgetYearOneBase": {
                    "val": "1.625"
                },
                "BudgetYearOne": {
                    "val": "1.625"
                },
                "BudgetYearTwo": {
                    "val": "1.565"
                },
                "BudgetYearThree": {
                    "val": "1.63"
                },
                "BudgetYearFour": {
                    "val": "1.559"
                },
                "BudgetYearFive": {
                    "val": "1.563"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This program supports various Navy Integrated Combat System Test Facility (ICSTF) sites as required to support the conduct of integration and interoperability testing.  Sites include, but are not limited to: Naval Surface Warfare Center (NSWC) Dahlgren, Surface Combat System Center (SCSC) Wallops Island, and NSWC Dam Neck.\n\nThe United States Navy has a requirement to fully test and certify computer programs for maturity and operational performance prior to delivery to the Fleet.  Aegis and Non-Aegis ships are certified through Combat System Integration Testing (CSIT) formally known as Warfare System Integration & Interoperability Test (WSI2T).  Commander, U.S. Fleet Forces Command (CFFC) provided specific direction to develop a unified modernization process, and certify all combat system baselines for integration and interoperability as an integral step in the CNO Fleet Response Plan (FRP).  Various Navy facilities, serving as ICSTF, conduct the required testing in support of CVN, DDG, CG, LHD, LHA, LPD17 and LSD class ships. These sites also comprise the Navy's Distributed Engineering Plant (DEP) alliance, which performs Interoperability Assessments and Systems Engineering Events (SEEs) for deploying Strike Groups.\nThese facilities also provide combat system in-service support to respond to emergent Fleet problems.  This capability tests and certifies new combat system baseline in a lab based environment, which has significantly reduced the cost of corrective action and shifted the burden of problem discovery away from the operator at sea.\n\nAs existing systems experience parts obsolescence, combat systems are continually updated through planned technical refresh.  As these new Commercial Off the Shelf (COTS) systems are introduced, ICSTF must maintain test beds in order to accurately replicate Command, Control, Communications, Computer, Combat Systems, and Intelligence (C5I) configurations that are destined for the Fleet.  In addition, new combat systems architectures are under development for new ship classes such as LCS, CVN78, DDG1000, as well as new Open Architecture (OA) variants of legacy suites.  Procurement of production representative systems of these OA combat systems being delivered to operational Fleet units is critical to ensure that testing and subsequent certification of both current and newly installed combat systems in accordance with NAVSEAINST 9410.2 Naval Warfare Systems Certification Policy (NWSCP) and the FRP.\n                  \nThe basic procurement program outlined herein is directed at expanding various facilities capability to support CSIT.  Procurement requirements are directly tied to the CSIT testing schedule and establish independence between test beds allowing for parallel certification efforts.  Procurements are required to build the necessary test beds and for laboratory support equipment.  This budget procures lab support equipment ensuring that various facilities are able to support the new tactical subsystems that use COTS equipment.\n     \nIn addition, the basic program provides for equipment\/upgrades for the Navy's Distributed Engineering Plant (DEP) needed to conduct Interoperability Assessment testing.  The DEP consists of 9 land based sites networked to certify computer programs prior to their delivery to the Fleet.  Interoperability Assessment testing is required for all deploying Strike Groups per the Joint Fleet Instruction.\n\n[P40A \/ M8100 - Combat System Equipment]: M8100 - COMBAT SYSTEM INTEGRATION TESTING EQUIPMENT (CSIT)\nPREVIOUSLY KNOWN AS COMBAT SYSTEM EQUIPMENT\nProcure hardware necessary for successful Combat System Integration Testing (CSIT) execution as scheduled in the NAVSEA Warfare Systems Certification Events schedule, including the following:  1) Hardware that makes up the tactical baseline to accurately replicate the ship configuration for integration and interoperability testing; 2) Hardware necessary to support integration and interoperability testing; 3) Simulation hardware, test tools, and laboratory equipment; and 4) Software and support for the modification of existing simulation software required for conduct of integration and interoperability testing.\n\n[P40A \/ M8200 - Support Equipment]: M8200 - SUPPORT EQUIPMENT\nProcures hardware necessary to support integration and interoperability testing.  Equipment includes simulation hardware, test tools and laboratory equipment.\n\n[P40A \/ M8300 - CS Simulation]: M8300 - COMBAT SYSTEM (CS) SIMULATION\nProcure software and support for the modification of existing simulation software required for conduct of integration and interoperability testing.\n\n[P40A \/ M8400 - SESEF Elec Equipment]: M8400 - SHIPBOARD ELECTRONIC SYSTEMS EVALUATION FACILITIES (SESEF) ELECTRONIC EQUIPMENT\nThe Shipboard Electronic Systems Evaluation Facilities (SESEF) are Navy-owned and operated test sites.  The SESEF Program mission is to provide electromagnetic system test and \nevaluation services to afloat and shore commands for the development of new or upgraded systems, to validate system performance following new construction and overhaul\/availability, \nand to provide real-time assessment of material readiness in an operational environment.  Providing program procurement management for test systems support for Tactical Control and Navigation (TACAN), Automated Information Management System (AIMS) MK XII Identification Friend or Foe (IFF), LINK 4A\/11\/16, OUTBOARD\/COMBAT DF\/RDF, search and fire control radars, and communication systems including secure voice.  SESEFs have been used effectively to detect and isolate shipboard system deficiencies leading to maintenance action to increase ship's material readiness at the completion of construction, availabilities, during routine ship operations, and prior to deployment.\n\n[P40A \/ M8500 - Interoperability Assessment Equipment]: M8500 - INTEROPERABILITY ASSESSMENT EQUIPMENT\nPREVIOUSLY KNOWN AS DISTRIBUTED ENGINEERING PLANT (DEP)\nProcures upgrades to support the 9 sites that comprise the Navy's DEP.  Procures hardware that provides the DEP Network Operations Center (NOC) with the capability to remotely monitor, configure, and update the DEP network equipment in case the network is down or there is an equipment hang-up.  Funds are also allocated for future network upgrades, to allow the DEP networks to take advantages of all of the advanced routing protocols offered, and allow the DEP to interface with other non-DEP communities using external advanced routing protocols.\n\n[P40A \/ M86IN - Non-FMP Installation]: M86IN - EQUIPMENT INSTALLATION (NON FMP)\nProcures engineering and installation support for the above OP,N budget.  Support includes performing test bed staging, installation, connection, switching, repair, and removal services of upgraded\/tech refresh tactical, simulation and support systems in direct support of NAVSEA requirements.  Provide engineering services for rapid reconfiguration to \nnew\/upgraded installations to meet requirements."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "ICSTF Program"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) M8100 - Combat System Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) OA Combat System Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "9.079"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) Legacy Combat System Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "7.193"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.3) CSIT Prior Combat Support Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "PriorYear": {
                                                        "val": "2.733"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.9"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.907"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.907"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) M8200 - Support Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Support Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.762"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.295"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.3"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.311"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.311"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) M8300 - CS Simulation"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) CS Simulation"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.861"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.145"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.146"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.155"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.155"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) M8400 - SESEF Elec Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) SESEF Elect Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "5.427"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.945"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.2) SESEF Electronic Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "CurrentYear": {
                                                        "val": "0.945"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.943"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.943"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) M8500 - Interoperability Assessment Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.1) Interoperability Assessment Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.9"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.145"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.6"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.625"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.625"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "6) M86IN - Non-FMP Installation"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "6.1) M86IN - Non-FMP Installation"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.273"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.158"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.55"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.554"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.554"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}