{
    "id": "877107cb2724207f267054c56e0f0f4b4c79debd",
    "meta": {
        "filename": "dod-2013_PROCUREMENT_2013_ARMY_WTCV_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2033A",
        "appropriation_name": "Procurement of W&TCV, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "GC0050"
        },
        "LineItemTitle": {
            "val": "Production Base Support (WOCV-WTCV)"
        },
        "P1LineItemNumber": {
            "val": "39"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2033A"
        },
        "AppropriationTitle": {
            "val": "Procurement of W&TCV, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Weapons and Other Combat Vehicles"
        },
        "BudgetSubActivityNumber": {
            "val": "30"
        },
        "BudgetSubActivityTitle": {
            "val": "Support Equipment & Facilities"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "383.147"
                },
                "PriorYear": {
                    "val": "7.824"
                },
                "CurrentYear": {
                    "val": "10.08"
                },
                "BudgetYearOneBase": {
                    "val": "10.115"
                },
                "BudgetYearOne": {
                    "val": "10.115"
                },
                "BudgetYearTwo": {
                    "val": "10.108"
                },
                "BudgetYearThree": {
                    "val": "10.204"
                },
                "BudgetYearFour": {
                    "val": "10.387"
                },
                "BudgetYearFive": {
                    "val": "10.562"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "383.147"
                },
                "PriorYear": {
                    "val": "7.824"
                },
                "CurrentYear": {
                    "val": "10.08"
                },
                "BudgetYearOneBase": {
                    "val": "10.115"
                },
                "BudgetYearOne": {
                    "val": "10.115"
                },
                "BudgetYearTwo": {
                    "val": "10.108"
                },
                "BudgetYearThree": {
                    "val": "10.204"
                },
                "BudgetYearFour": {
                    "val": "10.387"
                },
                "BudgetYearFive": {
                    "val": "10.562"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "383.147"
                },
                "PriorYear": {
                    "val": "7.824"
                },
                "CurrentYear": {
                    "val": "10.08"
                },
                "BudgetYearOneBase": {
                    "val": "10.115"
                },
                "BudgetYearOne": {
                    "val": "10.115"
                },
                "BudgetYearTwo": {
                    "val": "10.108"
                },
                "BudgetYearThree": {
                    "val": "10.204"
                },
                "BudgetYearFour": {
                    "val": "10.387"
                },
                "BudgetYearFive": {
                    "val": "10.562"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "ComponentSplit": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "PriorYear": {
                                "TotalCost": {
                                    "val": "7.824"
                                }
                            },
                            "CurrentYear": {
                                "TotalCost": {
                                    "val": "10.08"
                                }
                            },
                            "BudgetYearOneBase": {
                                "TotalCost": {
                                    "val": "10.115"
                                }
                            },
                            "BudgetYearOne": {
                                "TotalCost": {
                                    "val": "10.115"
                                }
                            },
                            "BudgetYearTwo": {
                                "TotalCost": {
                                    "val": "10.108"
                                }
                            },
                            "BudgetYearThree": {
                                "TotalCost": {
                                    "val": "10.204"
                                }
                            },
                            "BudgetYearFour": {
                                "TotalCost": {
                                    "val": "10.387"
                                }
                            },
                            "BudgetYearFive": {
                                "TotalCost": {
                                    "val": "10.562"
                                }
                            }
                        }
                    }
                ]
            }
        },
        "Description": {
            "val": "This program provides funding to establish, modernize, expand or replace Army-owned industrial facilities and equipment used in production and production testing of Weapons and Tracked Combat Vehicles and their components.  The program also provides for the preserving, storing and disposing of facilities and equipment that are either not required for current active production or are not needed by the Army.  Provisioning of Industrial Facilities (PIF) occurs at Aberdeen Test Center, MD; White Sands Missile Range, NM; Yuma Proving Grounds, AZ; Rock Island Arsenal, IL; Watervliet Arsenal, NY;  and General Dynamics-Armaments and Technical Products, Saco, ME.  The Layaway of Industrial Facilities (LIF) funding support necessary or unique equipment at arsenals.  This program also provides funding for the Arsenal Support Program Initiative (ASPI)."
        },
        "Justification": {
            "val": "FY13 Base procurement dollars in the amount of $10.115 million support the PIF and LIF programs.  The PIF funds support upgrade and replacement of technically or economically obsolete production test instrumentation to ensure that complete and accurate test data is collected and that safety and environmental hazards are minimized.  Benefits of this effort include increased test efficiencies and decreased costs and risks to Army program managers.  The PIF funding will also support the repair, upgrade or replacement of government-owned equipment used in the production of gun barrels for small caliber weapons such as the MK19 Grenade Machine Gun, the M2 Machine Gun and the M242 Bushmaster Chain Gun. PIF projects are essential in fulfilling current and projected Army requirements.  Based on a five-year plan, the upgrade and modernization of facilities and equipment at Rock Island Arsenal is critical for the Army to meet both small and medium caliber weapon requirements supporting current and future peacetime requirments.  Benefits of this effort include the ability to maintain lower unit costs for production items and the manufacture of lightweight, high-wear components.  The Layaway of Industrial Facilities effort at all facilities preserves the Army's abilities to respond to increases in production capabilities while keeping active production costs down.  The effort allows the Army to excess equipment that is no longer needed.  Economies are derived from this effort that benefit the entire Army.  \nPIF funds directly support production of small caliber weapons systems, large caliber weapons systems and combat service support equipment at Rock Island Arsenal with modernization and upgrade requests supporting current and new manufacturing capabilities such as small arms spare parts and gages (e.g. 50-caliber M2 Machine Gun, MK19 40mm Machine Gun, M249 Light Machine Gun, M240 Series Machine Gun, M14 EBR, M4\/16 Rifle), larger manufacturing capabilities (Add-on Armor upgrades for HMMWV, MRAP, and Stryker series vehicles; towed artillery spares and gun carriages; Forward Repair System vehicles; and Shop Equipment Contact Maintenance vehicles) and the introduction of new technologies (Friction Stir Welding) and testing capabilities to produce and fabricate new materials and alloys such as titanium (Titanium Investment Casting) and composites (Add on Armor, Individual PPE).  At Rock Island Arsenal (RIA) efforts are being made to support the Army's movement toward reducing the load placed upon the Warfighter by participating in ongoing initiatives to reduce the overall weight of major weapons systems through utilization of our Titanium Investment Casting facility to cast major components of the weapons systems.  Efforts are also underway to implement new technologies at RIA such as Friction Stir Welding that will allow RIA the capability to not only support Department of the Army, as well as other services, new initiatives but also to support other Department of Defense requirements and leverage partnership programs in support of private industry to manufacture unique products with limited suppliers worldwide.  Significant advancements in the realm of composites have resulted in RIA's Composite Armor Center being capable of supporting the needs of the Warfighter in the ongoing battle to defeat rapidly evolving insurgent devices and the subsequent need for armor advancements needed to do so.  RIA's capability to utilize sophisticated software for reverse engineering coupled with rapid response manufacturing offers significant savings in time and money.  In an effort to constantly improve the efficiency at which RIA is able to operate, RIA is improving productivity through an increased use of robotics and automation systems, material handling equipment and materials storage and retrieval systems, and machining centers capable of seven(7)-axis articulation to significantly reduce machining time requirements.  Rock Island Arsenal continues to maintain technologies such as a full service foundry, not available elsewhere throughout the Department of the Army, to support Department of the Army requirements and to complement the capabilities of local private industry corporations through partnership programs.  Advantages subsequent to maintaining and upgrading this unique capability will ensure no disruptions for critical spare or repair parts by offering this capability as an organic asset, resulting in sizeable cost savings for the Department of the Army.  Replacing older equipment and continually investing in new technologies will result in not only a more efficient and productive manufacturing facility but also a more profitable facility as the Department of Defense, Department of the Army, and private industry would be able to leverage the unique manufacturing capabilities available at Rock Island Arsenal.  \nAt Watervliet Arsenal (WVA), efforts will be made to replace aging or obsolete machining equipment to obtain new st"
        },
        "FacilityList": {
            "ProductionSupportFacility": [
                {
                    "Name": {
                        "val": "GDLS"
                    },
                    "Location": {
                        "val": "Saco, ME"
                    },
                    "Type": {
                        "val": "GOGO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "@projectCategoryName": "Production Support",
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "0.324"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "0.012"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0.029"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "0.029"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "U7668"
                                },
                                "Title": {
                                    "val": "Hot & Cold Forge emergency repairs and maintenance."
                                },
                                "CostElementList": {
                                    "Equipment": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.224"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "0.01"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0.02"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "0.02"
                                            }
                                        }
                                    },
                                    "EquipmentInstallation": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.1"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "0.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0.009"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "0.009"
                                            }
                                        }
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Hot and cold forge emergency repairs and maintenance to prevent failure and excessive down time of unique forges."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Rock Island Arsenal - JMTC"
                    },
                    "Location": {
                        "val": "Rock Island, IL"
                    },
                    "Type": {
                        "val": "GOGO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "@projectCategoryName": "Production Support",
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "1.779"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "2.375"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "2.37"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "2.37"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "U7669"
                                },
                                "Title": {
                                    "val": "Large Capacity Mills (Small Arms) and laboratory relocation"
                                },
                                "CostElementList": {
                                    "Equipment": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "1.5"
                                            }
                                        }
                                    },
                                    "EquipmentInstallation": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.779"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "0.875"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0.87"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "0.87"
                                            }
                                        }
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Machinery equipment and laboratory move for health, safety and environmental reasons."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Watervliet Arsenal"
                    },
                    "Location": {
                        "val": "Watervliet, NY"
                    },
                    "Type": {
                        "val": "COCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "@projectCategoryName": "Production Support",
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "1.738"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "2.375"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "2.37"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "2.37"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "U7670"
                                },
                                "Title": {
                                    "val": "Machine Equipment installation with site preparation."
                                },
                                "CostElementList": {
                                    "Equipment": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.3"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "1.5"
                                            }
                                        }
                                    },
                                    "EquipmentInstallation": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.438"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "0.875"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0.87"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "0.87"
                                            }
                                        }
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Machine equipment installation with associated site preparation activities."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "ATEC Test Range Instrumentation"
                    },
                    "Location": {
                        "val": "Yuma, AZ; Aberdeen, MD; White Sands, NM"
                    },
                    "Type": {
                        "val": "GOGO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "@projectCategoryName": "Production Support",
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "3.449"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "4.763"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "4.769"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "4.769"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "GC2001"
                                },
                                "Title": {
                                    "val": "Instrumentation for production testing of WTCV systems."
                                },
                                "EndItemSupportedModel": {
                                    "val": "All WTCV Systems"
                                },
                                "CostElementList": {
                                    "Equipment": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "3.449"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "4.763"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "4.769"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "4.769"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2012-10"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2013-03"
                                    },
                                    "EquipmentInstallationComplete": {
                                        "val": "2013-10"
                                    },
                                    "ProveOutBegins": {
                                        "val": "2013-10"
                                    },
                                    "ProveOutComplete": {
                                        "val": "2013-12"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Funds will be used to upgrade or replace production test instrumentation and equipment at Aberdeen Test Center (ATC), Aberdeen Proving Ground, MD; White Sands Test Center (WSTC), White Sands Missile Range, NM and Yuma Test Center (YTC), Yuma Proving Ground, AZ.   At ATC, procures software programs, ruggedized laptops, instrumentation, and hardware that can be utilized to capture and analyze Reliability, Availability and Maintainability (RAM) data; vehicle data communication interfaces and advanced sensors for automotive performance and endurance testing; replacement\/upgrade of video cameras, video recorders, digital video tracking systems and telemetry systems used to assess fire control system performance; upgrade of mobile dynamometer control systems used for powertrain, winch and fuel consumption testing; and instrumentation for laboratory testing of vehicle engines, powertrains and power storage devices.  At WSTC, procures badly needed upgrades to aged Nuclear Effects, Directed Energy, High Power Electromagnetic Pulse and Lightning effects simulators used to test weapon system survivability.  At YTC, procures a high speed digital imaging camera for vehicle fire control testing that will follow a direct fire projectile flight path in lieu of using many cameras lined along the flight path; on-board data acquisition and recording equipment for collecting vehicle performance data in harsh desert environments and upgrade of worn out Global Positioning System based surveying equipment used for test site location.  The majority of the instrumentation being upgraded or replaced is obsolete and has met or exceeded its economic life.  This instrumentation, required to ensure complete and accurate test data, is collected and safety and environmental hazards are minimized."
                                }
                            }
                        ]
                    }
                }
            ],
            "LayawayFacility": [
                {
                    "Name": {
                        "val": "Watervliet"
                    },
                    "Location": {
                        "val": "Watervliet,  Arsenal Watervliet, New York"
                    },
                    "Type": {
                        "val": "GOGO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "0.534"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "0.555"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0.577"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "0.577"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "U7667"
                                },
                                "Title": {
                                    "val": "Layaway of Industrial Facilities (LIF)"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}