{
    "id": "0640d6fffd6d41bb4baa2adeec7d733418bbe424",
    "meta": {
        "filename": "dod-2017_PROCUREMENT_2017_ARMY_OTHER_2_U_PROCUREMENT_JustificationBook_Army_PB_2017.zzz_unzipped_U_PROCUREMENT_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "BD3955"
        },
        "LineItemTitle": {
            "val": "Life Cycle Software Support (LCSS)"
        },
        "P1LineNumber": {
            "val": "94"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "89"
        },
        "BudgetSubActivityTitle": {
            "val": "Elect Equip - Tactical C2 Systems"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "94.754"
                },
                "PriorYear": {
                    "val": "2.508"
                },
                "CurrentYear": {
                    "val": "5.85"
                },
                "BudgetYearOneBase": {
                    "val": "4.718"
                },
                "BudgetYearOne": {
                    "val": "4.718"
                },
                "BudgetYearTwo": {
                    "val": "3.985"
                },
                "BudgetYearThree": {
                    "val": "4.003"
                },
                "BudgetYearFour": {
                    "val": "4"
                },
                "BudgetYearFive": {
                    "val": "3.971"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "94.754"
                },
                "PriorYear": {
                    "val": "2.508"
                },
                "CurrentYear": {
                    "val": "5.85"
                },
                "BudgetYearOneBase": {
                    "val": "4.718"
                },
                "BudgetYearOne": {
                    "val": "4.718"
                },
                "BudgetYearTwo": {
                    "val": "3.985"
                },
                "BudgetYearThree": {
                    "val": "4.003"
                },
                "BudgetYearFour": {
                    "val": "4"
                },
                "BudgetYearFive": {
                    "val": "3.971"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "94.754"
                },
                "PriorYear": {
                    "val": "2.508"
                },
                "CurrentYear": {
                    "val": "5.85"
                },
                "BudgetYearOneBase": {
                    "val": "4.718"
                },
                "BudgetYearOne": {
                    "val": "4.718"
                },
                "BudgetYearTwo": {
                    "val": "3.985"
                },
                "BudgetYearThree": {
                    "val": "4.003"
                },
                "BudgetYearFour": {
                    "val": "4"
                },
                "BudgetYearFive": {
                    "val": "3.971"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "2.508"
                                },
                                "CurrentYear": {
                                    "val": "5.85"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.718"
                                },
                                "BudgetYearOne": {
                                    "val": "4.718"
                                },
                                "BudgetYearTwo": {
                                    "val": "3.985"
                                },
                                "BudgetYearThree": {
                                    "val": "4.003"
                                },
                                "BudgetYearFour": {
                                    "val": "4"
                                },
                                "BudgetYearFive": {
                                    "val": "3.971"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "2.508"
                    },
                    "CurrentYear": {
                        "val": "5.85"
                    },
                    "BudgetYearOneBase": {
                        "val": "4.718"
                    },
                    "BudgetYearOne": {
                        "val": "4.718"
                    },
                    "BudgetYearTwo": {
                        "val": "3.985"
                    },
                    "BudgetYearThree": {
                        "val": "4.003"
                    },
                    "BudgetYearFour": {
                        "val": "4"
                    },
                    "BudgetYearFive": {
                        "val": "3.971"
                    }
                }
            }
        },
        "Description": {
            "val": "Life Cycle Software Engineering (LCSE) support, by the Software Engineering Center (SEC), provides the essential equipment needed to maintain Communications-Electronics Life Cycle Management Command (C-E LCMC) managed fielded Battlefield Automated Systems (BAS) in a state of operational readiness.  Approximately 100 BASs in Post Production Software Support (PPSS) directly depend on LCSE support to maintain a posture of mission critical readiness.  LCSE system support and services are essential to maintain BASs in the state of operational readiness.  Policy for Post Production Software Support (PPSS) requires that system managers provide initial host capabilities for new systems and that the Life Cycle Software Engineering Centers (LCSEC) provide upgrades and replacement of obsolete equipment.  Significant portions of host and network equipment are no longer economically repairable and\/or are reaching obsolescence.  There is a requirement to respond to emergency requests from the field for Software Engineering support, in order to maintain operational readiness of deployed BASs.  With host computers and peripherals having a life span of approximately five years and SEC performing its mission over a continuous period of time beyond five years, equipment must be replaced and\/or upgraded regularly to deal with obsolescence and take advantage of the continual improvements in technology that are indigenous to high-technology based weapon systems and their software support environments.  SEC must purchase these items to meet systems mission requirements."
        },
        "Justification": {
            "val": "FY 2017 Base Procurement dollars in the amount of $4.718 million procures the following Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) lab equipments:\n\n1) Computer Equipment: (1) E-J Band RF channel with 5-port Direction-of-Arrival (DoA) capability, (1) K-L Band RF channel (mmW) with 5-port Direction-of-Arrival (DoA) capability,  RF Simulator Spare Parts Package (a. AC-to-DC Power Supplies, b. Various circuit card assemblies (CCAs); i.e. FiberOptic Interface, Digital Pulse Generation Modules, Digital-to-RF Interface, etc., c. Various RF discrete components; i.e. Frequency Locked Oscillators(FLO) C thru L bands, RF Amplifiers (C thru L bands), RF Attenuators (C thru L bands) and  a 5-port Direction-of-Arrival (DoA) Modules (C thru L bands), Quad-Phase Modulators (C thru L bands), RF Pulse Modulation Switch (C thru L bands), etc).\n\nRequirement Description: The RF simulator will be supporting the increase of Radio Frequency (RF) simulation requirements due to the complexity of threats to Force Protection systems such as Counter Radio-Controlled Improvised Explosive Device (RCIED) Electronic Warfare (CREW)  Duke, Radar Warning receivers APR-39A(V)1, APR-39B(V)2, and APR-48 Radio Frequency Interferometer(RFIS) and future systems.  Failure to provide effective support for threat simulation using the most effective simulator covering all threat Radio Frequency (RF) bands can cause unreliable mission software for CREW and all Aircraft Survivability Equipment (ASE) systems supported by SEC.  In addition, the current RF simulators being used are well beyond their expected Operational Life Cycle, and are likely to become inoperable within the next 6-18 months\n\n2) Computer Equipment: NetApp F2240A-4-24X2TB-CL-10G-R5 (FAS2240-4,CL,HA,24x2TB,10GbE,Dual CTL), (2) Dell Blade computer (8 blades - 6 1\/10gb switches ), (2) Dell EqualLogic storage for blade computer (24 TB), (45) Surrogate computers - HP Compaq 6300 Microtower  (Core i5, 250GB HDD, 4GB RAM, 1 DVD RW), 18 ServSwitch Octet Basic User Station(KV1711A-R2), 20 ServSwitch Octet KVM Switch, 4 Users x 16 Servers (KV1703A0, 50 Updated monitors for Surrogate computers - 22\" and 144  ServSwitch Octet Server Access Module (SAMs) for USB\n\nRequirement Description: The majority of existing Force XXI Battle Command, Brigade and Below (FBCB2) software integration and test hardware is 8-10 years old and is no longer supported by the vendor. In the case of the Blue Force Tracking Network Operations Center (BGN), the test bed hardware is not a representative of the deployed equipment and thus limits SEC's ability to truly replicate, troubleshoot, and assess performance and operational behavior on the fielded target hardware. The BFT\/NOC hardware is 2 generations of hardware behind the deployed configuration. In addition, test bed network equipment, such as switching equipment, requires replacement due to obsolescence and lack of vendor support.  Failure to fund the hardware upgrade and allow the test bed become partially and\/or completely inoperable due to equipment obsolescence and vendor support, this will render SEC incapable of performing the FBCB2 PPSS mission.  \n\n3) Computer Equipment: Qty 5 Dell PowerEdge R910 - 4-2.4Ghz 10C processor, 1 TB memory, Esxi 5 OS, 8-300 15K SAS drives, 2 Intel X520Da 10GB Dual port SFP+ , Integrated Nexuss 5548P Layer 3 License with daughter card, Vmware View 5 Premier Add on for Lab consolidation\n\nRequirement Description: The Ft. Sill server farm for the Fires programs under sustainment are reaching their end of life. These machines serve up compilers and provide a data repository for all source code, and documentation at Ft. Sill. Today we have roughly 20 machines that are about 3-5 years old. This purchase would replace them with 5 more powerful machines utilizing VMWare to virtualize the environment reducing the needed for as many machines. The new machines will increase the server reliability and assist in consolidation. Loss of one machine will begin to impact the Compilation schedules for all Fires program under sustainment at Ft. Sill. Loss of more will increase that effect. These machines are roughly 3-5 years old on average and are approaching end of life, which will soon render them unserviceable.\n\nThe FY 2017 funding request was reduced for $.046 million to account for the availability of prior year execution balances."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}