{
    "id": "8c940623a1a8510eeb398f1d7c3181dd76dfc090",
    "meta": {
        "filename": "dod-2017_PROCUREMENT_2017_AIRFORCE_OTHER_U_PROCUREMENT_JustificationBook_Air_Force_PB_2017.zzz_unzipped_U_PROCUREMENT_JustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "835080"
        },
        "LineItemTitle": {
            "val": "AFNET"
        },
        "P1LineNumber": {
            "val": "40"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Air Force Communications"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "90.487"
                },
                "CurrentYear": {
                    "val": "98.518"
                },
                "BudgetYearOneBase": {
                    "val": "146.897"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "146.897"
                },
                "BudgetYearTwo": {
                    "val": "226.174"
                },
                "BudgetYearThree": {
                    "val": "186.761"
                },
                "BudgetYearFour": {
                    "val": "128.38"
                },
                "BudgetYearFive": {
                    "val": "128.238"
                },
                "Total": {
                    "val": "1005.455"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "90.487"
                },
                "CurrentYear": {
                    "val": "98.518"
                },
                "BudgetYearOneBase": {
                    "val": "146.897"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "146.897"
                },
                "BudgetYearTwo": {
                    "val": "226.174"
                },
                "BudgetYearThree": {
                    "val": "186.761"
                },
                "BudgetYearFour": {
                    "val": "128.38"
                },
                "BudgetYearFive": {
                    "val": "128.238"
                },
                "Total": {
                    "val": "1005.455"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "90.487"
                },
                "CurrentYear": {
                    "val": "98.518"
                },
                "BudgetYearOneBase": {
                    "val": "146.897"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "146.897"
                },
                "BudgetYearTwo": {
                    "val": "226.174"
                },
                "BudgetYearThree": {
                    "val": "186.761"
                },
                "BudgetYearFour": {
                    "val": "128.38"
                },
                "BudgetYearFive": {
                    "val": "128.238"
                },
                "Total": {
                    "val": "1005.455"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0208088F"
                },
                {
                    "val": "0303089F"
                },
                {
                    "val": "0303112F"
                }
            ]
        },
        "Description": {
            "val": "No efforts within this exhibit are new starts. \n\nThe AFNet exhibit includes both weapon system and non-weapon system requirements. In FY16, all AFNet weapon systems began a transition into new PEs. AFNet Weapon Systems in this exhibit are defined as follows: (1) Air Force Cyberspace Defense (ACD),(2) Cyberspace Security and Control System (CSCS), and (3) Air Force Intranet Control (AFINC). Requirements for ACD are transitioning to PE 0208088F and CSCS & AFINC are transitioning to 0303089F. \n\nAFNet provides Commercial Off-The-Shelf (COTS) solutions to implement, deliver and upgrade installation processing nodes and boundaries, AF Gateways, enterprise network security, network situational awareness and C2 capabilities, and allows for the interface with and assured movement of information from terrestrial, air and space-based networks, thus enabling Air Force Information Operations (AFINOps). All funds used for AFNet Systems support the continued establishment and transformation of the AFINOps construct toward the standards and specifications of the DoD Joint Information Environment (JIE). The procurement efforts in this program budget line includes, but are not limited to, equipment purchase, engineering\/integration, certification and accreditation, deployment, training equipment\/systems, associated training and interim contractor support. Procurements implement technology and capabilities within the AFNet in accordance with the DoD IT Road map, AF Information Dominance Flight Plan, AF Cyber blueprint and the AF Network Action Plan. All activities may incorporate support to other program elements across the Air Force Information Enterprise in accordance with SAF\/A6 CIO direction, the Federal Data Center Consolidation Initiative (FDCCI) and the Joint Information Environment (JIE) strategy.\n\nPE 0207425F, AF NETWORK OPS AND COMMAND COMM \n\nThis PE was an FY16 single year PE placeholder specifically set up to execute AFNet requirements until transition to Weapon System PEs 0208088F & 0303089F in FY17.\n\nPE 0208088F, AF DEFENSIVE CYBERSPACE OPERATIONS (ACD) WEAPON SYSTEM\nThis PE is not a new start. Requirements for ACD have been funded previously in 0303112F and 0207425F as part of the AFNet 835080 P-Doc. Funds may be used for other AFNet requirements if required.\n\nProcures and installs active defensive counter cyberspace operations and situational awareness capabilities in a Defensive Cyberspace Operations role to achieve cyberspace superiority for assigned missions. ACD procurements allow for 24\/7\/365 monitoring and defense of US Air Force and US Central Command, and Third Party SIPR\/NIPR computer networks against hostile attacks as well as intrusion detection, network traffic analysis, network forensics analysis, countermeasure development and execution, and incident response. ACD provides indication and warning, correlation, logging, vulnerability remediation, assessment, process management, blocking, vulnerability identification, investigation and containment. In addition, the ACD provides CNDSP (Computer Network Defense Service Provider) service system upgrades to the AFNet and several third party entities including Joint Strike Fighter, USTRANSCOM, and others. Efforts include, but are not limited to: \n\nHost Based Security System upgrades, Next Generation Firewall and Full Packet Capture and Data Analytics Enterprise.\n\nPE 0301400F, SPACE SUPERIORITY INTELLIGENCE\n\nThis PE executes requirements for SSI. Funds may be used for other AFNet requirements if required.\n\nCyber Situational Awareness Weapon System (CSAWS): Procures and installs equipment to connect 24th AF unfiltered traffic flow to 25th AF for PAD (Processing, Analysis and Distribution) enabling the first AF Cyber ISR collection and processing capability. Provides ISR based adversary cyber activity Indications and Warnings (I&W) for Situational Awareness (SA). The effort procures a dedicated AF Cyber ISR platform (Remote Data Collector and Remote Data Processor) array that connects to the highest level at the network gateway locations to obtain unfiltered net-flow and packet capture (PCAP). This data is moved via long-haul to the 25th AF El Dorado PAD systems for analysis. The fusion of all source intelligence and net flow analysis provides actionable CTA (Cyber Threat Advisories) reports to cyber operators for the appropriate and proactive actions.\n\nPE 0303089F, CYBERSPACE OPERATIONS SYSTEMS\n\nThis PE executes requirements for both AFINC and CSCS weapon systems. Funds may be used for other AFNet requirements if required.\n\n(1) AFINC: Procures and installs equipment for network operations, network defense and overall management of the AF NIPRNet Gateways as well as the Air Force discrete requirements associated with the Joint Regional Security Stacks (JRSS). Efforts include, but are not limited to:\nAFNet NIPR Gateways (MAC-1 system) and SIPR Gateways (GW), which deliver critical network defense capabilities for the AF enterprise with over 800k users directly supporting flying, maintenance, space and cyber operations across the full range of military operations. GWs prevent and detect unauthorized network infiltration attempts, automatically initiating network defense countermeasures eliminating adversary ability to gain access to the enterprise which would diminish the AF information defense posture. GWs directly support cyber operations worldwide enabling war-fighting missions. Funding enables modification and equipment replacement for the system and its sub-components to respond to growing mission requirements and evolving cyber threats. Includes recapitalization of the Integrated Management System (IMS), which provides for real-time centralized management of network devices, and unifies the management\/defense of AF networks and assets, as well as procures equipment upgrades that directly relate to the migration of AF traffic and technology transition from the AFNet NIPR Gateways to the Joint Regional Security Stacks (JRSS). \n\n(2) CSCS: Procures and installs capabilities contributing to cyber mission assurance, including proactive defense and persistent network operations for the Air Force and the Air Force-provisioned portions of the DoD Information Network (DoDIN) and the Air Force Information Network (AFIN). CSCS modifications support the following activities: fault resolution activities to maintain operational capabilities; lead-in coordinating activities at base-level Network Control Centers for necessary network security actions; monitoring of AF network services; managing of boundary protection devices and the Air Force network infrastructure; and continuous network situational awareness. Efforts include, but are not limited to: \n\nData Center Consolidation and migration to the Joint Information Environment (JIE); upgrade to the Core Services and the Air Force Vulnerability Management (AFVM) and Network Management.\n\nPE 0303112F, AIR FORCE COMMUNICATION (AIRCOM)\n\nIn FY17, funding in this PE will reallocate to the CSCS, ACD, and AFINC weapon system PEs to fund their block mods. As part of the transition of AFNet to the three weapon systems, AF will realign funding into the weapon system PEs in a future budget cycle.\n\nFunding for this exhibit contained in PEs 0204725F, 0208088F, 0301400F, 0303089F, 0303112F."
        },
        "Justification": {
            "val": "FY17 AFNET (835080) funding provides for, but is not limited to, procurement & modification of the installed and supported critical classified and unclassified information equipment capabilities for the Air Force Network (AFNet) Systems and modification efforts within all three major weapon system components (ACD, AFINC & CSCS).\n\nPE 0207425F, AF NETWORK OPS AND COMMAND COMM\n\nProcures and installs AFNet\/Weapon System requirements in FY16.  No budget year (FY17) funding requested.\n\nPE 0208088F, AF DEFENSIVE CYBERSPACE OPERATIONS (ACD) WEAPON SYSTEM\n\nProcures and installs active defensive counter cyberspace systems and situational awareness capabilities.\n\nPE 0301400F, SPACE SUPERIORITY INTELLIGENCE\n\nCyber Situational Awareness Weapon System (CSAWS): Procures and installs equipment to connect 24th AF unfiltered traffic flow to 25th AF for PAD (Processing, Analysis and Distribution) enabling the first AF Cyber ISR collection and processing capability. Provides ISR based adversary cyber activity Indications and Warnings (I&W) for Situational Awareness (SA). \n\nPE 0303089F, CYBERSPACE OPERATIONS SYSTEMS\n\n(1) AFINC: Procures and installs equipment for network operations, network defense and overall management of the AF NIPRNet Gateways as well as the Air Force discrete requirements associated with the Joint Regional Security Stacks (JRSS). \n\n(2) CSCS: Procures and installs capabilities contributing to cyber mission assurance, including proactive defense and persistent network operations for the Air Force and the Air Force-provisioned portions of the DoD Information Network (DoDIN) and the Air Force Information Network (AFIN). \n\nPE 0303112F, AIR FORCE COMMUNICATION (AIRCOM)\n\nIn FY17, funding in this PE will reallocate to the CSCS, ACD, and AFINC weapon system PEs to fund their block mods. As part of the transition of AFNet to the three weapon systems, AF will realign funding into the weapon system PEs in a future budget cycle."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "AF Network Ops and Command Comms"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "AFNET Ops and Command Comms"
                                            },
                                            "ItemNumber": {
                                                "val": "AFNET Ops and Command Comms"
                                            },
                                            "ModificationType": {
                                                "val": "Reliability & Maintainability"
                                            },
                                            "ModelsAffectedList": {
                                                "ModelAffected": [
                                                    {
                                                        "val": "ACD-AFINC-CSCS"
                                                    }
                                                ]
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "49.049"
                                                    },
                                                    "Total": {
                                                        "val": "49.049"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "49.049"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "49.049"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "49.049"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "49.049"
                            }
                        }
                    },
                    "ModificationItemsIndicator": {
                        "val": "true"
                    }
                },
                {
                    "Name": {
                        "val": "Joint Information Environment (JIE)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Prime Contractor"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "JIE Prime Contractor Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearTwo": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "1"
                                                    },
                                                    "Total": {
                                                        "val": "4"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "33.647"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "15.966"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "11.114"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "9.396"
                                                    },
                                                    "ToComplete": {
                                                        "val": "0"
                                                    },
                                                    "Total": {
                                                        "val": "70.123"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearTwo": {
                                                        "val": "33.647"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "15.966"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "11.114"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "9.396"
                                                    },
                                                    "Total": {
                                                        "val": "17.531"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "33.647"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.966"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.114"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.396"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "70.123"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "33.647"
                            },
                            "BudgetYearThree": {
                                "val": "15.966"
                            },
                            "BudgetYearFour": {
                                "val": "11.114"
                            },
                            "BudgetYearFive": {
                                "val": "9.396"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "70.123"
                            }
                        }
                    }
                }
            ],
            "P3AModificationItemGroup": [
                {
                    "ModificationTitle": {
                        "val": "ACD WS 0208088F"
                    },
                    "ModificationNumber": {
                        "val": "1"
                    },
                    "ModificationType": {
                        "val": "Reliability & Maintainability"
                    },
                    "ModelsAffectedList": {
                        "ModelAffected": [
                            {
                                "val": "ACD"
                            }
                        ]
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.736"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.736"
                            },
                            "BudgetYearTwo": {
                                "val": "21.533"
                            },
                            "BudgetYearThree": {
                                "val": "21.931"
                            },
                            "BudgetYearFour": {
                                "val": "22.33"
                            },
                            "BudgetYearFive": {
                                "val": "22.731"
                            },
                            "Total": {
                                "val": "96.261"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.736"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.736"
                            },
                            "BudgetYearTwo": {
                                "val": "21.533"
                            },
                            "BudgetYearThree": {
                                "val": "21.931"
                            },
                            "BudgetYearFour": {
                                "val": "22.33"
                            },
                            "BudgetYearFive": {
                                "val": "22.731"
                            },
                            "Total": {
                                "val": "96.261"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.736"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.736"
                            },
                            "BudgetYearTwo": {
                                "val": "21.533"
                            },
                            "BudgetYearThree": {
                                "val": "21.931"
                            },
                            "BudgetYearFour": {
                                "val": "22.33"
                            },
                            "BudgetYearFive": {
                                "val": "22.731"
                            },
                            "Total": {
                                "val": "96.261"
                            }
                        }
                    },
                    "RelatedProgramElementList": {
                        "ProgramElementNumber": [
                            {
                                "val": "0303112F"
                            }
                        ]
                    },
                    "SupportCost": {
                        "CostElementList": {
                            "CostElement": [
                                {
                                    "Name": {
                                        "val": "PMA - Contractor Services"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "0.734"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.734"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "2.045"
                                            },
                                            "BudgetYearThree": {
                                                "val": "2.083"
                                            },
                                            "BudgetYearFour": {
                                                "val": "2.121"
                                            },
                                            "BudgetYearFive": {
                                                "val": "2.159"
                                            },
                                            "Total": {
                                                "val": "9.142"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "PMA - Other Gov't Costs"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "0.626"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.626"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "1.744"
                                            },
                                            "BudgetYearThree": {
                                                "val": "1.776"
                                            },
                                            "BudgetYearFour": {
                                                "val": "1.808"
                                            },
                                            "BudgetYearFive": {
                                                "val": "1.841"
                                            },
                                            "Total": {
                                                "val": "7.795"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "CategorySubtotal": {
                            "TotalCost": {
                                "BudgetYearOneBase": {
                                    "val": "1.36"
                                },
                                "BudgetYearOne": {
                                    "val": "1.36"
                                },
                                "BudgetYearTwo": {
                                    "val": "3.789"
                                },
                                "BudgetYearThree": {
                                    "val": "3.859"
                                },
                                "BudgetYearFour": {
                                    "val": "3.929"
                                },
                                "BudgetYearFive": {
                                    "val": "4"
                                },
                                "Total": {
                                    "val": "16.937"
                                }
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "ACD MODs"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "val": "ACD MODs:EQUIPMENT Group B (Active)"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearTwo": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearThree": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearFour": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearFive": {
                                                                    "val": "1"
                                                                },
                                                                "Total": {
                                                                    "val": "5"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "6.376"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "6.376"
                                                                },
                                                                "BudgetYearTwo": {
                                                                    "val": "17.744"
                                                                },
                                                                "BudgetYearThree": {
                                                                    "val": "18.072"
                                                                },
                                                                "BudgetYearFour": {
                                                                    "val": "18.401"
                                                                },
                                                                "BudgetYearFive": {
                                                                    "val": "18.731"
                                                                },
                                                                "Total": {
                                                                    "val": "79.324"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "6.376"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6.376"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "17.744"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "18.072"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "18.401"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "18.731"
                                                    },
                                                    "Total": {
                                                        "val": "79.324"
                                                    }
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "Multiple"
                                                },
                                                "Location": {
                                                    "val": "Various"
                                                },
                                                "ContractDates": {
                                                    "BudgetYearOne": {
                                                        "val": "2017-05"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "2018-05"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "2019-05"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "2020-05"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "2021-05"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "BudgetYearOne": {
                                                        "val": "2018-05"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "2019-05"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "2020-05"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "2021-05"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "2022-05"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "0"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "12"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "6.376"
                                            },
                                            "BudgetYearOne": {
                                                "val": "6.376"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "17.744"
                                            },
                                            "BudgetYearThree": {
                                                "val": "18.072"
                                            },
                                            "BudgetYearFour": {
                                                "val": "18.401"
                                            },
                                            "BudgetYearFive": {
                                                "val": "18.731"
                                            },
                                            "Total": {
                                                "val": "79.324"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "OrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "Org\/Intermediate"
                                                    },
                                                    "InstallationQuantity": {
                                                        "val": "5"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "6.376"
                            },
                            "BudgetYearOne": {
                                "val": "6.376"
                            },
                            "BudgetYearTwo": {
                                "val": "17.744"
                            },
                            "BudgetYearThree": {
                                "val": "18.072"
                            },
                            "BudgetYearFour": {
                                "val": "18.401"
                            },
                            "BudgetYearFive": {
                                "val": "18.731"
                            },
                            "Total": {
                                "val": "79.324"
                            }
                        }
                    },
                    "Description": {
                        "val": "This PE is not a new start.\n\nThe AFNet exhibit includes both weapon system and non-weapon system requirements.\n\nPE 0208088F, AF DEFENSIVE CYBERSPACE OPERATIONS (ACD) WEAPON SYSTEM\n\nRequirements for ACD have been funded previously in 0303112F and 0207425F as part of the AFNet 835080 P-Doc. Funds may be used for other AFNet requirements if required.\n\nProcures and installs active defensive counter cyberspace operations and situational awareness capabilities in a NetD role to achieve cyberspace superiority for assigned missions. ACD procurements allow for 24\/7\/365 monitoring and defense of US Air Force and US Central Command, and Third Party SIPR\/NIPR computer networks against hostile attacks as well as intrusion detection, network traffic analysis, network forensics analysis, countermeasure development and execution, and incident response. ACD provides indication and warning, correlation, logging, vulnerability remediation, assessment, process management, blocking, vulnerability identification, investigation and containment. In addition, the ACD provides CNDSP (Computer Network Defense Service Provider) service systems upgrades to the AFNet and several third party entities including Joint Strike Fighter, USTRANSCOM, and others. Efforts include, but are not limited to: \nHost Based Security System upgrades, Next Generation Firewall and Full Packet Capture and Data Analytics Enterprise.\n\nFY17 funds will procure updates via 1067s requiest for ACD which includes, but is not limited to, Host Based Security System upgrades and Data Analytics.\n\nMilestone\/Development Status\n\nSustainment"
                    }
                },
                {
                    "ModificationTitle": {
                        "val": "AFINC\/CSCS WS 0303089"
                    },
                    "ModificationNumber": {
                        "val": "1"
                    },
                    "ModificationType": {
                        "val": "Reliability & Maintainability"
                    },
                    "ModelsAffectedList": {
                        "ModelAffected": [
                            {
                                "val": "AFINC-CSCS-WS"
                            }
                        ]
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "17.684"
                            },
                            "BudgetYearOneBase": {
                                "val": "105.586"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "105.586"
                            },
                            "BudgetYearTwo": {
                                "val": "120.753"
                            },
                            "BudgetYearThree": {
                                "val": "99.385"
                            },
                            "BudgetYearFour": {
                                "val": "77.331"
                            },
                            "BudgetYearFive": {
                                "val": "78.65"
                            },
                            "Total": {
                                "val": "499.389"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "17.684"
                            },
                            "BudgetYearOneBase": {
                                "val": "105.586"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "105.586"
                            },
                            "BudgetYearTwo": {
                                "val": "120.753"
                            },
                            "BudgetYearThree": {
                                "val": "99.385"
                            },
                            "BudgetYearFour": {
                                "val": "77.331"
                            },
                            "BudgetYearFive": {
                                "val": "78.65"
                            },
                            "Total": {
                                "val": "499.389"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "17.684"
                            },
                            "BudgetYearOneBase": {
                                "val": "105.586"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "105.586"
                            },
                            "BudgetYearTwo": {
                                "val": "120.753"
                            },
                            "BudgetYearThree": {
                                "val": "99.385"
                            },
                            "BudgetYearFour": {
                                "val": "77.331"
                            },
                            "BudgetYearFive": {
                                "val": "78.65"
                            },
                            "Total": {
                                "val": "499.389"
                            }
                        }
                    },
                    "RelatedProgramElementList": {
                        "ProgramElementNumber": [
                            {
                                "val": "0303112F"
                            }
                        ]
                    },
                    "SupportCost": {
                        "CostElementList": {
                            "CostElement": [
                                {
                                    "Name": {
                                        "val": "PMA - Contractor Services"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "CurrentYear": {
                                                "val": "1.679"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "10.03"
                                            },
                                            "BudgetYearOne": {
                                                "val": "10.03"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "11.471"
                                            },
                                            "BudgetYearThree": {
                                                "val": "9.441"
                                            },
                                            "BudgetYearFour": {
                                                "val": "7.346"
                                            },
                                            "BudgetYearFive": {
                                                "val": "7.471"
                                            },
                                            "Total": {
                                                "val": "47.438"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "PMA - Other Gov't Costs"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "CurrentYear": {
                                                "val": "1.432"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "8.552"
                                            },
                                            "BudgetYearOne": {
                                                "val": "8.552"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "9.78"
                                            },
                                            "BudgetYearThree": {
                                                "val": "8.05"
                                            },
                                            "BudgetYearFour": {
                                                "val": "6.263"
                                            },
                                            "BudgetYearFive": {
                                                "val": "6.37"
                                            },
                                            "Total": {
                                                "val": "40.447"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "CategorySubtotal": {
                            "TotalCost": {
                                "CurrentYear": {
                                    "val": "3.111"
                                },
                                "BudgetYearOneBase": {
                                    "val": "18.582"
                                },
                                "BudgetYearOne": {
                                    "val": "18.582"
                                },
                                "BudgetYearTwo": {
                                    "val": "21.251"
                                },
                                "BudgetYearThree": {
                                    "val": "17.491"
                                },
                                "BudgetYearFour": {
                                    "val": "13.609"
                                },
                                "BudgetYearFive": {
                                    "val": "13.841"
                                },
                                "Total": {
                                    "val": "87.885"
                                }
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "AFINC\/CSCS WS MODs"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "val": "AFINC\/CSCS WS MODs:EQUIPMENT Group B (Active)"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "CurrentYear": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearTwo": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearThree": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearFour": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearFive": {
                                                                    "val": "1"
                                                                },
                                                                "Total": {
                                                                    "val": "6"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "CurrentYear": {
                                                                    "val": "14.573"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "87.004"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "87.004"
                                                                },
                                                                "BudgetYearTwo": {
                                                                    "val": "99.502"
                                                                },
                                                                "BudgetYearThree": {
                                                                    "val": "81.894"
                                                                },
                                                                "BudgetYearFour": {
                                                                    "val": "63.722"
                                                                },
                                                                "BudgetYearFive": {
                                                                    "val": "64.809"
                                                                },
                                                                "Total": {
                                                                    "val": "411.504"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "14.573"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "87.004"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "87.004"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "99.502"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "81.894"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "63.722"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "64.809"
                                                    },
                                                    "Total": {
                                                        "val": "411.504"
                                                    }
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "Multiple"
                                                },
                                                "Location": {
                                                    "val": "Various"
                                                },
                                                "ContractDates": {
                                                    "CurrentYear": {
                                                        "val": "2016-05"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2017-05"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "2018-05"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "2019-05"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "2020-05"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "2021-05"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "CurrentYear": {
                                                        "val": "2017-05"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-05"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "2019-05"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "2020-05"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "2021-05"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "2022-05"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "0"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "12"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "CurrentYear": {
                                                "val": "14.573"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "87.004"
                                            },
                                            "BudgetYearOne": {
                                                "val": "87.004"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "99.502"
                                            },
                                            "BudgetYearThree": {
                                                "val": "81.894"
                                            },
                                            "BudgetYearFour": {
                                                "val": "63.722"
                                            },
                                            "BudgetYearFive": {
                                                "val": "64.809"
                                            },
                                            "Total": {
                                                "val": "411.504"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "OrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "Org\/Intermediate"
                                                    },
                                                    "InstallationQuantity": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "CurrentYear": {
                                "val": "14.573"
                            },
                            "BudgetYearOneBase": {
                                "val": "87.004"
                            },
                            "BudgetYearOne": {
                                "val": "87.004"
                            },
                            "BudgetYearTwo": {
                                "val": "99.502"
                            },
                            "BudgetYearThree": {
                                "val": "81.894"
                            },
                            "BudgetYearFour": {
                                "val": "63.722"
                            },
                            "BudgetYearFive": {
                                "val": "64.809"
                            },
                            "Total": {
                                "val": "411.504"
                            }
                        }
                    },
                    "Description": {
                        "val": "No efforts within this exhibit are new starts. \n\nThe AFNet exhibit includes both weapon system and non-weapon system requirements. \n\nThis PE executes requirements for both CSCS and AFINC weapon systems. Funds may be used for other AFNet requirements if required.\n\n(1) AFINC: Procures and installs equipment for network operations, network defense and overall management of the AF NIPRNet Gateways as well as the Air Force discrete requirements associated with the Joint Regional Security Stacks (JRSS). Efforts include, but are not limited to:\nAFNet NIPR Gateways (MAC-1 system) and SIPR Gateways (GW), which deliver critical network defense capabilities for the AF enterprise with over 800k users directly supporting flying, maintenance, space and cyber operations across the full range of military operations. GWs prevent and detect unauthorized network infiltration attempts, automatically initiating network defense countermeasures eliminating adversary ability to gain access to the enterprise which would diminish the AF information defense posture. GWs directly support cyber operations worldwide enabling war-fighting missions. Funding enables modification and equipment replacement for the system and its sub-components to respond to growing mission requirements and evolving cyber threats. Includes recapitalization of the Integrated Management System (IMS), which provides for real-time centralized management of network devices, and unifies the management\/defense of AF networks and assets, as well as procures equipment upgrades that directly relate to the migration of AF traffic and technology transition from the AFNet NIPR Gateways to the Joint Regional Security Stacks (JRSS). Includes recapitalization of the Integrated Management System (IMS), which provides for real-time centralized management of network devices, and unifies the management\/defense of AF networks and assets.\n\n(2) CSCS: Procures and installs capabilities contributing to cyber mission assurance, including proactive defense and persistent network operations for the Air Force and the Air Force-provisioned portions of the DoD Information Network (DoDIN) and the Air Force Information Network (AFIN). CSCS modifications support the following activities: fault resolution activities to maintain operational capabilities; lead-in coordinating activities at base-level Network Control Centers for necessary network security actions; monitoring of AF network services; managing of boundary protection devices and the Air Force network infrastructure; and continuous network situational awareness. Efforts include, but are not limited to: \nData Center Consolidation and migration to the Joint Information Environment (JIE); upgrades to Core Services and Air Force Vulnerability Management (AFVM) and Network Management.\n\nFY17 will procure upgrades for CSCS and AFINC base on 1067 requests. CSCS includes, but is not limited to, ACAS upgrades, Area Processing Center and Regional Data Center Consolidations, and Installation Processing Note (IPN) Boundary Effort modification. AFINC includes, but is not limited to, Gateway e-mail security\/DNS upgrades.\n\nMilestone\/Development Status\n\nSustainment"
                    }
                },
                {
                    "ModificationTitle": {
                        "val": "AFNET"
                    },
                    "ModificationNumber": {
                        "val": "1"
                    },
                    "ModificationType": {
                        "val": "Reliability & Maintainability"
                    },
                    "ModelsAffectedList": {
                        "ModelAffected": [
                            {
                                "val": "AFNET"
                            }
                        ]
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "90.487"
                            },
                            "CurrentYear": {
                                "val": "29.448"
                            },
                            "BudgetYearOneBase": {
                                "val": "28.465"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "28.465"
                            },
                            "BudgetYearTwo": {
                                "val": "38.905"
                            },
                            "BudgetYearThree": {
                                "val": "40.192"
                            },
                            "BudgetYearFour": {
                                "val": "8.125"
                            },
                            "BudgetYearFive": {
                                "val": "7.81"
                            },
                            "Total": {
                                "val": "243.432"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "90.487"
                            },
                            "CurrentYear": {
                                "val": "29.448"
                            },
                            "BudgetYearOneBase": {
                                "val": "28.465"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "28.465"
                            },
                            "BudgetYearTwo": {
                                "val": "38.905"
                            },
                            "BudgetYearThree": {
                                "val": "40.192"
                            },
                            "BudgetYearFour": {
                                "val": "8.125"
                            },
                            "BudgetYearFive": {
                                "val": "7.81"
                            },
                            "Total": {
                                "val": "243.432"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "90.487"
                            },
                            "CurrentYear": {
                                "val": "29.448"
                            },
                            "BudgetYearOneBase": {
                                "val": "28.465"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "28.465"
                            },
                            "BudgetYearTwo": {
                                "val": "38.905"
                            },
                            "BudgetYearThree": {
                                "val": "40.192"
                            },
                            "BudgetYearFour": {
                                "val": "8.125"
                            },
                            "BudgetYearFive": {
                                "val": "7.81"
                            },
                            "Total": {
                                "val": "243.432"
                            }
                        }
                    },
                    "RelatedProgramElementList": {
                        "ProgramElementNumber": [
                            {
                                "val": "0208088F"
                            },
                            {
                                "val": "0303089F"
                            }
                        ]
                    },
                    "SupportCost": {
                        "CostElementList": {
                            "CostElement": [
                                {
                                    "Name": {
                                        "val": "PMA - Contractor Services"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "8.602"
                                            },
                                            "CurrentYear": {
                                                "val": "2.797"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.704"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.704"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "3.695"
                                            },
                                            "BudgetYearThree": {
                                                "val": "3.818"
                                            },
                                            "BudgetYearFour": {
                                                "val": "0.771"
                                            },
                                            "BudgetYearFive": {
                                                "val": "0.741"
                                            },
                                            "Total": {
                                                "val": "23.128"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "PMA - Other Gov't Costs"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "7.406"
                                            },
                                            "CurrentYear": {
                                                "val": "2.385"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.305"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.305"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "3.151"
                                            },
                                            "BudgetYearThree": {
                                                "val": "3.255"
                                            },
                                            "BudgetYearFour": {
                                                "val": "0.658"
                                            },
                                            "BudgetYearFive": {
                                                "val": "0.632"
                                            },
                                            "Total": {
                                                "val": "19.792"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "CategorySubtotal": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "16.008"
                                },
                                "CurrentYear": {
                                    "val": "5.182"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.009"
                                },
                                "BudgetYearOne": {
                                    "val": "5.009"
                                },
                                "BudgetYearTwo": {
                                    "val": "6.846"
                                },
                                "BudgetYearThree": {
                                    "val": "7.073"
                                },
                                "BudgetYearFour": {
                                    "val": "1.429"
                                },
                                "BudgetYearFive": {
                                    "val": "1.373"
                                },
                                "Total": {
                                    "val": "42.92"
                                }
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "AFNET Mod"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "val": "AFNET Mod:EQUIPMENT Group B (Active)"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "PriorYear": {
                                                                    "val": "1"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearTwo": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearThree": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearFour": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearFive": {
                                                                    "val": "1"
                                                                },
                                                                "Total": {
                                                                    "val": "7"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "PriorYear": {
                                                                    "val": "74.479"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "24.266"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "23.456"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "23.456"
                                                                },
                                                                "BudgetYearTwo": {
                                                                    "val": "32.059"
                                                                },
                                                                "BudgetYearThree": {
                                                                    "val": "33.119"
                                                                },
                                                                "BudgetYearFour": {
                                                                    "val": "6.696"
                                                                },
                                                                "BudgetYearFive": {
                                                                    "val": "6.437"
                                                                },
                                                                "Total": {
                                                                    "val": "200.512"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "74.479"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "24.266"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "23.456"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "23.456"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "32.059"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "33.119"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "6.696"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "6.437"
                                                    },
                                                    "Total": {
                                                        "val": "200.512"
                                                    }
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "Multiple"
                                                },
                                                "Location": {
                                                    "val": "N\/A"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2015-05"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2016-05"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2017-05"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "2018-05"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "2019-05"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "2020-05"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "2021-05"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2016-05"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2017-05"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-05"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "2019-05"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "2020-05"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "2021-05"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "2022-05"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "0"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "12"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "74.479"
                                            },
                                            "CurrentYear": {
                                                "val": "24.266"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "23.456"
                                            },
                                            "BudgetYearOne": {
                                                "val": "23.456"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "32.059"
                                            },
                                            "BudgetYearThree": {
                                                "val": "33.119"
                                            },
                                            "BudgetYearFour": {
                                                "val": "6.696"
                                            },
                                            "BudgetYearFive": {
                                                "val": "6.437"
                                            },
                                            "Total": {
                                                "val": "200.512"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "OrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "Org\/Intermediate"
                                                    },
                                                    "InstallationQuantity": {
                                                        "val": "2"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "74.479"
                            },
                            "CurrentYear": {
                                "val": "24.266"
                            },
                            "BudgetYearOneBase": {
                                "val": "23.456"
                            },
                            "BudgetYearOne": {
                                "val": "23.456"
                            },
                            "BudgetYearTwo": {
                                "val": "32.059"
                            },
                            "BudgetYearThree": {
                                "val": "33.119"
                            },
                            "BudgetYearFour": {
                                "val": "6.696"
                            },
                            "BudgetYearFive": {
                                "val": "6.437"
                            },
                            "Total": {
                                "val": "200.512"
                            }
                        }
                    },
                    "Description": {
                        "val": "FY17 will procure updates for AFNet via 1067 requests which includes, but is not limited to, Host Based Security System upgrades, Enclave Control Nodes, AFNet Infrastructure, AFNet Gateways, AF Vulnerability Management, and Data Center Consolidation.\n\nMilestone\/Development Status\n\nSustainment"
                    }
                }
            ],
            "P5Item": [
                {
                    "Name": {
                        "val": "Space Superiority Intelligence"
                    },
                    "ItemNumber": [],
                    "IdCode": {
                        "val": "A"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "2.337"
                            },
                            "BudgetYearOneBase": {
                                "val": "5.11"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "5.11"
                            },
                            "BudgetYearTwo": {
                                "val": "11.336"
                            },
                            "BudgetYearThree": {
                                "val": "9.287"
                            },
                            "BudgetYearFour": {
                                "val": "9.48"
                            },
                            "BudgetYearFive": {
                                "val": "9.651"
                            },
                            "Total": {
                                "val": "47.201"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "2.337"
                            },
                            "BudgetYearOneBase": {
                                "val": "5.11"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "5.11"
                            },
                            "BudgetYearTwo": {
                                "val": "11.336"
                            },
                            "BudgetYearThree": {
                                "val": "9.287"
                            },
                            "BudgetYearFour": {
                                "val": "9.48"
                            },
                            "BudgetYearFive": {
                                "val": "9.651"
                            },
                            "Total": {
                                "val": "47.201"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "2.337"
                            },
                            "BudgetYearOneBase": {
                                "val": "5.11"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "5.11"
                            },
                            "BudgetYearTwo": {
                                "val": "11.336"
                            },
                            "BudgetYearThree": {
                                "val": "9.287"
                            },
                            "BudgetYearFour": {
                                "val": "9.48"
                            },
                            "BudgetYearFive": {
                                "val": "9.651"
                            },
                            "Total": {
                                "val": "47.201"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "AF Cyber ISR Platform"
                                },
                                "NonRecurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Prime Contractor"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "CurrentYear": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "1"
                                                        },
                                                        "Total": {
                                                            "val": "6"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.469"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "4.235"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "4.235"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "10.316"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "8.452"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "8.627"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "8.783"
                                                        },
                                                        "ToComplete": {
                                                            "val": "0"
                                                        },
                                                        "Total": {
                                                            "val": "41.882"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "CurrentYear": {
                                                            "val": "1.469"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "4.235"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "4.235"
                                                        },
                                                        "BudgetYearTwo": {
                                                            "val": "10.316"
                                                        },
                                                        "BudgetYearThree": {
                                                            "val": "8.452"
                                                        },
                                                        "BudgetYearFour": {
                                                            "val": "8.627"
                                                        },
                                                        "BudgetYearFive": {
                                                            "val": "8.783"
                                                        },
                                                        "Total": {
                                                            "val": "6.98"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "0"
                                            },
                                            "CurrentYear": {
                                                "val": "1.469"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "4.235"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "4.235"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "10.316"
                                            },
                                            "BudgetYearThree": {
                                                "val": "8.452"
                                            },
                                            "BudgetYearFour": {
                                                "val": "8.627"
                                            },
                                            "BudgetYearFive": {
                                                "val": "8.783"
                                            },
                                            "ToComplete": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "41.882"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "1.469"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.235"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.235"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.316"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.452"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.627"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.783"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "41.882"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "PMA Contractor Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.868"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.875"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.875"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "1.02"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "0.835"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "0.853"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "0.868"
                                                    },
                                                    "ToComplete": {
                                                        "val": "0"
                                                    },
                                                    "Total": {
                                                        "val": "5.319"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "CurrentYear": {
                                            "val": "0.868"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.875"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.875"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.02"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.835"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.853"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.868"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "5.319"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "AF Cyber ISR Platform"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}