{
    "id": "a769a68f3706f9189dd195f8bb70908c6beefae9",
    "meta": {
        "filename": "dod-2017_PROCUREMENT_2017_AIRFORCE_OTHER_U_PROCUREMENT_JustificationBook_Air_Force_PB_2017.zzz_unzipped_U_PROCUREMENT_JustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "834430"
        },
        "LineItemTitle": {
            "val": "GCSS-AF Fos"
        },
        "P1LineNumber": {
            "val": "34"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "9.398"
                },
                "PriorYear": {
                    "val": "3.67"
                },
                "CurrentYear": {
                    "val": "15.015"
                },
                "BudgetYearOneBase": {
                    "val": "1.743"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "1.743"
                },
                "BudgetYearTwo": {
                    "val": "7.193"
                },
                "BudgetYearThree": {
                    "val": "7.246"
                },
                "BudgetYearFour": {
                    "val": "11.341"
                },
                "BudgetYearFive": {
                    "val": "13.222"
                },
                "Total": {
                    "val": "68.828"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "9.398"
                },
                "PriorYear": {
                    "val": "3.67"
                },
                "CurrentYear": {
                    "val": "15.015"
                },
                "BudgetYearOneBase": {
                    "val": "1.743"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "1.743"
                },
                "BudgetYearTwo": {
                    "val": "7.193"
                },
                "BudgetYearThree": {
                    "val": "7.246"
                },
                "BudgetYearFour": {
                    "val": "11.341"
                },
                "BudgetYearFive": {
                    "val": "13.222"
                },
                "Total": {
                    "val": "68.828"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "9.398"
                },
                "PriorYear": {
                    "val": "3.67"
                },
                "CurrentYear": {
                    "val": "15.015"
                },
                "BudgetYearOneBase": {
                    "val": "1.743"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "1.743"
                },
                "BudgetYearTwo": {
                    "val": "7.193"
                },
                "BudgetYearThree": {
                    "val": "7.246"
                },
                "BudgetYearFour": {
                    "val": "11.341"
                },
                "BudgetYearFive": {
                    "val": "13.222"
                },
                "Total": {
                    "val": "68.828"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0708012F"
                },
                {
                    "val": "0708610F"
                }
            ]
        },
        "Description": {
            "val": "Global Combat Support System (GCSS) is a family of information technology systems that provide integration and interoperability between combat support functions and command and control to support the operational needs of the warfighter.  It directly supports Command, Control, Communication, Computers, and Information (C4I) for the warfighter and Chairman Joint Chiefs of Staff (CJCS) Joint Vision 2020.  The GCSS-Air Force Family of Systems (FOS) includes standard base-level combat support applications which provide warfighters with a \"one update-one time\" processing environment.  The following systems provide the key support foundation for the Air Force's global engagement strategy and evolution to DoD Joint Information Environment (JIE) leveraging Core Data Centers (CDCs) and DISA-brokered cloud capabilities through GCSS-AF.\n\nPE 0303141F GLOBAL COMBAT SUPPORT SYSTEM\n\nGLOBAL COMBAT SUPPORT SYSTEM-AIR FORCE (GCSS-AF):  This program element encompasses GCSS-AF's Integration Framework and its presentation layer for operational users.  This infrastructure and provided Air Force enterprise common services are a critical basis for the target common computing environment (CCE) effort which Air Force Guidance Memorandum has directed for all new and modernizing IT applications.  This effort is the Air Force evolution to DoD Joint Information Environment (JIE) leveraging Core Data Centers (CDCs) and DISA-brokered cloud capabilities in compliance with the Air Force Information Technology (AF IT) baselines.  This framework is a set of baseline-driven platform and infrastructure services in both physical and virtual hosting environments.  It is comprised of development tools, an initial set of enterprise services, and governance processes critical to JIE management.  As the customer interfaces on GCSS-AF, the presentation layer provides the worldwide standard security and single sign-on for accessing a variety of functional systems. The framework uses additional security features of Public Key Infrastructure (PKI) and AF Directory Services, negating duplication of security features in each of the functional systems being modernized within the GCSS-AF Family of Systems (FoS). This effort procures application, security, web, and proxy servers, software and associated licenses, and engineering support. \n\nFunding for this exhibit contained in PE 0303141F. \n\nPE 0708012F LOGISTICS SUPPORT ACTIVITY\n\nCARGO MOVEMENT OPERATIONS SYSTEM (CMOS): CMOS supports base-level and theater distribution management.   More than 235 Air Force, Marine Corps, Navy, Army, NSA, and DCMA activities employ CMOS through its web-based and deployable configurations. CMOS continues to provide effective traffic management support to the warfighter for both peacetime and contingency operations. CMOS prepares and manages all movement documentation, electronically interfaces with shippers, commercial carriers, and receiving activities, and provides bar code\/radio frequency identification (RFID) capability.  It provides in-transit visibility to DOD and commercial carriers, aids planning and managing force deployment, and supports the deployed Air and Space Expeditionary Force (AEF) warfighter through deployable and standard CMOS architectures.\n\nFunding for this exhibit contained in PE 0708012F.\n\nPE 0708610F LOGISTICS INFORMATION TECHNOLOGY (LOGIT)\n\nThe Air Force logistics enterprise is comprised of multiple overarching functional areas, to include maintenance, repair and overhaul, end-to-end supply chain support, base supply inventories, and predictive analysis and forecasting. Enterprise Logistics Systems deliver integrated logistics information driving war winning decisions by shaping, acquiring, and sustaining warfighting IT capabilities and mission support. OPAF funding will be used for capital equipment replacement to include servers and will also be used to purchase multi-year software licenses. \n\nSystems contained in these business areas include, but are not limited to, the Air Force Equipment Management System (AFEMS), Integrated Maintenance Data System (IMDS), Reliability and Maintainability Information System (REMIS), Combat Ammunitions System (CAS), Enhanced Maintenance Operations Center (EMOC), Aircraft Structural Integrity Management Information System (ASIMIS), Integrated Logistics System-Supply (ILS-S), Cargo Movement Operations System (CMOS), Stock Control System (SCS), Purchase Request Process System (PRPS), Automated Logistics Management Support System (ALMSS), Depot Maintenance Accounting and Production System (DMAPS), Enhanced Technical Information Management System (ETIMS), and Weapon System Management Information System (WSMIS).\n\nFunding for this exhibit contained in PE 0708610F.\n\nPE 0901538 FINANCIAL MGMT INFO SYS DEVELOPMENT\n\nDEFENSE ENTERPRISE ACCOUNTING AND MANAGEMENT SYSTEM (DEAMS) Increment 1: To enhance transparency, DEAMS Other Procurement Air Force (OPAF) funding in Weapon System Code (WSC) 834430, Global Combat Support System - Air Force Family of Systems (GCSS-AF FOS) will end in FY 2014. Starting in FY 2015, DEAMS OPAF funding requests will be shown in WSC 834470, DEAMS.\n\nDEAMS Inc 1 is a commercial-off-the-shelf (COTS) Oracle based software implementation effort that will provide an auditable modern accounting and finance system. DEAMS is a Joint AF and United States\nTransportation Command (USTRANSCOM) Enterprise Resource Planning (ERP) Program that will replace existing accounting and finance legacy systems and will provide core funds execution management\nfunctions consistent with financial management laws, regulations and policy, general ledger, funds management, payments, receivables, cost and revenues, and fiduciary reporting. DEAMS is compliant with the\nClinger-Cohen Act, Business Enterprise Architecture (BEA), and integrates into Global Combat Support System-Air Force (GCSS-AF).\n\nIn 2014, DEAMS Inc 2 activities were incorporated into DEAMS Inc 1 to expedite deployment to operational locations and users.\n\nDEAMS Inc 1 capability is currently deployed to 14 locations and being used by ~3,000 users.  In FY 2015-2017, DEAMS Inc 1 capability will continue to be deployed to additional locations and users. \n\nFunding for this exhibit contained in PE 0901538F."
        },
        "Justification": {
            "val": "PE 0303141F GLOBAL COMBAT SUPPORT SYSTEM\n\nNo FY16 funding requested.\n\nPE 0708012F LOGISTICS SUPPORT ACTIVITY\n\nCARGO MOVEMENT OPERATIONS SYSTEM (CMOS): CMOS supports base-level and theater distribution management.   More than 235 Air Force, Marine Corps, Navy, Army, NSA, and DCMA activities employ CMOS through its web-based and deployable configurations. CMOS continues to provide effective traffic management support to the warfighter for both peacetime and contingency operations. CMOS prepares and manages all movement documentation, electronically interfaces with shippers, commercial carriers, and receiving activities, and provides bar code\/radio frequency identification (RFID) capability.  It provides in-transit visibility to DOD and commercial carriers, aids planning and managing force deployment, and supports the deployed Air and Space Expeditionary Force (AEF) warfighter through deployable and standard CMOS architectures.\n\nPE 0708012F LOGISTICS SUPPORT ACTIVITY\n\nCARGO MOVEMENT OPERATIONS SYSTEM: FY16 procurement dollars procure different types\/amounts of hardware in support of installation and unit mission requirements for Joint personnel. These funds replace hardware and updates software and licensing to support the sustainment posture for contingency operations, and buy various mixes of hardware, software, and licensing for 60 new sites. Hardware replacement mitigates increased capability demands on older platforms and supports deployable CMOS hardware and associated Automatic Identification Technology (AIT). \n\nPE 0708610F LOGISTICS INFORMATION TECHNOLOGY (LOGIT)\n\nThe Air Force logistics enterprise is comprised of multiple overarching functional areas, to include maintenance, repair and overhaul, end-to-end supply chain support, base supply inventories, and predictive analysis and forecasting. Enterprise Logistics Systems deliver integrated logistics information driving war winning decisions by shaping, acquiring, and sustaining warfighting IT capabilities and mission support. OPAF funding will be used for capital equipment replacement to include servers and will also be used to purchase multi-year software licenses. \n \nPE 0901538F FINANCIAL MANAGEMENT INFORMATION SYSTEMS DEVELOPMENT\n\nNo FY 16 funding requested."
        },
        "MDAPCode": {
            "val": "221"
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Global Combat Support System"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "GLOBAL COMBAT SUPPORT SYSTEM"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.038"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.038"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "3.038"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "3.038"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Logistics Support Activities"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "CARGO MOVEMENT OPERATIONS SYSTEM - Hand Held Terminals (HHTS) with peripheral devices"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "347"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "398"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "273"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "273"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.696"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.796"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.819"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.819"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.002"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.002"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.003"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.003"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0.696"
                                        },
                                        "CurrentYear": {
                                            "val": "0.796"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.819"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.819"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0.696"
                            },
                            "CurrentYear": {
                                "val": "0.796"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.819"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0.819"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Logistics Information Technology (LOGIT)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Logistics Information Technology (LOGIT)- Servers and related multi-year software licenses"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "6"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "28"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "2.974"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "14.219"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.924"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.924"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.496"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.508"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.462"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.462"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "2.974"
                                        },
                                        "CurrentYear": {
                                            "val": "14.219"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.924"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.924"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "2.974"
                            },
                            "CurrentYear": {
                                "val": "14.219"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.924"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0.924"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Financial Management Information Systems Development"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "FINANCIAL MANAGEMENT INFORMATION SYSTEM"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.36"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "6.36"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "6.36"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}