{
    "id": "e959868f04473c310a12b9bf8af09a4424d675d0",
    "meta": {
        "filename": "dod-2017_PROCUREMENT_2017_AIRFORCE_OTHER_U_PROCUREMENT_JustificationBook_Air_Force_PB_2017.zzz_unzipped_U_PROCUREMENT_JustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "834520"
        },
        "LineItemTitle": {
            "val": "Theater Battle Mgt C2 System"
        },
        "P1LineNumber": {
            "val": "36"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "9.493"
                },
                "CurrentYear": {
                    "val": "7.473"
                },
                "BudgetYearOneBase": {
                    "val": "9.659"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "9.659"
                },
                "BudgetYearTwo": {
                    "val": "9.555"
                },
                "BudgetYearThree": {
                    "val": "9.189"
                },
                "BudgetYearFour": {
                    "val": "9.353"
                },
                "BudgetYearFive": {
                    "val": "9.523"
                },
                "Total": {
                    "val": "64.245"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "9.493"
                },
                "CurrentYear": {
                    "val": "7.473"
                },
                "BudgetYearOneBase": {
                    "val": "9.659"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "9.659"
                },
                "BudgetYearTwo": {
                    "val": "9.555"
                },
                "BudgetYearThree": {
                    "val": "9.189"
                },
                "BudgetYearFour": {
                    "val": "9.353"
                },
                "BudgetYearFive": {
                    "val": "9.523"
                },
                "Total": {
                    "val": "64.245"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "9.493"
                },
                "CurrentYear": {
                    "val": "7.473"
                },
                "BudgetYearOneBase": {
                    "val": "9.659"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "9.659"
                },
                "BudgetYearTwo": {
                    "val": "9.555"
                },
                "BudgetYearThree": {
                    "val": "9.189"
                },
                "BudgetYearFour": {
                    "val": "9.353"
                },
                "BudgetYearFive": {
                    "val": "9.523"
                },
                "Total": {
                    "val": "64.245"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0207410F"
                }
            ]
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0207410F"
                }
            ]
        },
        "Description": {
            "val": "Theater Battle Management Core Systems (TBMCS) is an integrated battle management system used to plan, execute, and assess an air campaign.  It provides automated planning tools enabling consistent, coordinated battle management at entities ranging from the force level (Air Operations Centers [AOC]) to the unit level (wings\/squadrons) for operations and intelligence functions.  TBMCS is a United States Air Force system with Joint interest responsible for generation and dissemination of the air tasking order and interoperates with allied units. \n\nUnit Command and Control (UC2): Provides the wing and base commanders, and their battle staffs with timely and accurate information for effective decision making.  UC2 also provides secure, automated, deployable, and distributed wing-level command and control system with connectivity to TBMCS - Force Level (TBMCS FL) systems. \n\nPersonnel Recovery Command and Control (PRC2): Provides PRC2 services supporting all Combatant Commands, Joint Services and other government agencies.  Capabilities include web-based access to isolated personnel reports for all Department of Defense (DoD) personnel, C2 tools for performing command and control of recovery efforts for downed airmen\/isolated ground troops, and rapid identification of personnel in distress.  PRC2 is used within AOC\/Areas Of Responsibility (AOR), Joint Personnel Recovery Centers, and Rescue Coordination Centers to provide the capabilities and services for planning and executing recovery of isolated personnel, and rapidly collaborate, disseminate, and store time-sensitive personnel recovery information. \n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities. \n\nFunding for this exhibit contained in PE 0207410F."
        },
        "Justification": {
            "val": "1.  TBMCS - FORCE LEVEL (TBMCS FL): Provides the Joint and Combined Air Component Commander with the automated tools necessary to effectively and efficiently plan, monitor, and execute the air campaign.  This includes planning and issuing the Air Tasking and Airspace Control Orders that ensure the theater commander's intent is supported through the application of airpower using the latest intelligence.  FY17 funding will continue fielding TBMCS FL to include security patches, vendor update patches, operating system upgrades, and DoD mandated policy updates.  TBMCS FL will also continue capitol equipment replacements to the systems to maintain security posture and field updates to 40 locations (28 AD\/7 ANG\/5 AFR).\n\n     a.  TBMCS FL PROGRAM MANAGEMENT ADMINISTRATION (PMA): FY17 funding includes provisions for government contract oversight, technical expertise, and program office support associated with the fielding of TBMCS FL.  \n\n     b.  TBMCS FL TRAINING & FIELDING: FY17 funding will continue to support Type 1 training & fielding.  As contractors field the TBMCS FL upgrades, they will provide specialized training at each location.\n\n     c-e.  TBMCS FL: FY17 funds will continue to be used to procure hardware and associated software licenses for fielding to various sites.\n\n2.  UNIT COMMAND AND CONTROL (UC2): Provides the wing and base commanders and their battle staffs with timely and accurate information for effective decision making.  UC2 also provides secure, automated, deployable, and distributed wing-level command and control system with connectivity to TBMCS FL systems.  Enhanced unit-level operations capabilities will be provided through the UC2 project.  FY17 funding will continue to support fielding Capital Equipment Replacement (CER) cycle for UC2 at 40 active duty locations.\n\n     a.  UC2 HARDWARE AND COMMERCIAL-OFF-THE-SHELF (COTS) SOFTWARE: FY17 funds will continue to replace clients, servers, miscellaneous hardware, and associated software licenses for UC2 sites.\n\n     b.  UC2 PMA: FY17 funding includes provisions for government contract oversight, technical expertise, and program office support associated with the fielding of UC2.\n\n3.  PERSONNEL RECOVERY COMMAND AND CONTROL (PRC2): Provides PRC2 services supporting all Combatant Commands, Joint Services and other government agencies.  Capabilities include web-based access to isolated personnel reports for all DoD personnel, C2 tools for performing command and control of recovery efforts for downed airmen\/isolated ground troops, and rapid identification of personnel in distress.  PRC2 is used within AOC\/AOR, Joint Personnel Recovery Centers, and Rescue Coordination Centers to provide the capabilities and services for planning and executing recovery of isolated personnel, and rapidly collaborate, disseminate, and store time-sensitive personnel recovery information.  FY17 funding will continue to support PRC2 operations.\n\n     a.  PRC2 HARDWARE AND COTS SOFTWARE: FY17 funding will continue procure various hardware pieces and associated software licenses for fielding to various sites.\n\n     b.  PRC2 PMA: FY17 funding will provide for government contract oversight, technical expertise, and program office support associated with the fielding of PRC2."
        },
        "ModsOutYearDelta": {
            "Cost": {
                "BudgetYearTwo": {
                    "val": "4.929"
                },
                "BudgetYearThree": {
                    "val": "4.482"
                },
                "BudgetYearFour": {
                    "val": "4.561"
                },
                "BudgetYearFive": {
                    "val": "4.644"
                },
                "Total": {
                    "val": "31.542"
                }
            }
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "TBMC2"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "TBMCS FL"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "4.673"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.139"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5.114"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.114"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "4.673"
                                        },
                                        "CurrentYear": {
                                            "val": "3.139"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.114"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.114"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "4.673"
                            },
                            "CurrentYear": {
                                "val": "3.139"
                            },
                            "BudgetYearOneBase": {
                                "val": "5.114"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "5.114"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "TBMC2 Mods"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "PRC2"
                                            },
                                            "ItemNumber": {
                                                "val": "PRC2"
                                            },
                                            "ModificationType": {
                                                "val": "Capability Improvement"
                                            },
                                            "ModelsAffectedList": {
                                                "ModelAffected": [
                                                    {
                                                        "val": "PRC2"
                                                    }
                                                ]
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.995"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.255"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.252"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.252"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "1.274"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "1.297"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "1.32"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "1.344"
                                                    },
                                                    "Total": {
                                                        "val": "8.737"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "UC2"
                                            },
                                            "ItemNumber": {
                                                "val": "UC2"
                                            },
                                            "ModificationType": {
                                                "val": "Capability Improvement"
                                            },
                                            "ModelsAffectedList": {
                                                "ModelAffected": [
                                                    {
                                                        "val": "UC2"
                                                    }
                                                ]
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "3.825"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.079"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.293"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.293"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "3.352"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "3.41"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "3.472"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "3.535"
                                                    },
                                                    "Total": {
                                                        "val": "23.966"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "4.82"
                                        },
                                        "CurrentYear": {
                                            "val": "4.334"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.545"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.545"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.626"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.707"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.792"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.879"
                                        },
                                        "ToComplete": {
                                            "val": "0"
                                        },
                                        "Total": {
                                            "val": "32.703"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "4.82"
                            },
                            "CurrentYear": {
                                "val": "4.334"
                            },
                            "BudgetYearOneBase": {
                                "val": "4.545"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "4.545"
                            },
                            "BudgetYearTwo": {
                                "val": "4.626"
                            },
                            "BudgetYearThree": {
                                "val": "4.707"
                            },
                            "BudgetYearFour": {
                                "val": "4.792"
                            },
                            "BudgetYearFive": {
                                "val": "4.879"
                            },
                            "ToComplete": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "32.703"
                            }
                        }
                    },
                    "ModificationItemsIndicator": {
                        "val": "true"
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}