{
    "id": "f6f5465abaca23a7f069f1147a8a5d6f0afb42f7",
    "meta": {
        "filename": "dod-2017_PROCUREMENT_2017_ARMY_OTHER_3-4_U_PROCUREMENT_JustificationBook_Army_PB_2017.zzz_unzipped_U_PROCUREMENT_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "MB7000"
        },
        "LineItemTitle": {
            "val": "Base Level Common Equipment"
        },
        "P1LineNumber": {
            "val": "172"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "90"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "544.97"
                },
                "PriorYear": {
                    "val": "1.008"
                },
                "CurrentYear": {
                    "val": "1.568"
                },
                "BudgetYearOneBase": {
                    "val": "2.168"
                },
                "BudgetYearOne": {
                    "val": "2.168"
                },
                "BudgetYearTwo": {
                    "val": "1.376"
                },
                "BudgetYearThree": {
                    "val": "1.716"
                },
                "BudgetYearFour": {
                    "val": "4.517"
                },
                "BudgetYearFive": {
                    "val": "4.607"
                },
                "Total": {
                    "val": "561.93"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "544.97"
                },
                "PriorYear": {
                    "val": "1.008"
                },
                "CurrentYear": {
                    "val": "1.568"
                },
                "BudgetYearOneBase": {
                    "val": "2.168"
                },
                "BudgetYearOne": {
                    "val": "2.168"
                },
                "BudgetYearTwo": {
                    "val": "1.376"
                },
                "BudgetYearThree": {
                    "val": "1.716"
                },
                "BudgetYearFour": {
                    "val": "4.517"
                },
                "BudgetYearFive": {
                    "val": "4.607"
                },
                "Total": {
                    "val": "561.93"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "544.97"
                },
                "PriorYear": {
                    "val": "1.008"
                },
                "CurrentYear": {
                    "val": "1.568"
                },
                "BudgetYearOneBase": {
                    "val": "2.168"
                },
                "BudgetYearOne": {
                    "val": "2.168"
                },
                "BudgetYearTwo": {
                    "val": "1.376"
                },
                "BudgetYearThree": {
                    "val": "1.716"
                },
                "BudgetYearFour": {
                    "val": "4.517"
                },
                "BudgetYearFive": {
                    "val": "4.607"
                },
                "Total": {
                    "val": "561.93"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "1.008"
                                },
                                "CurrentYear": {
                                    "val": "1.568"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.168"
                                },
                                "BudgetYearOne": {
                                    "val": "2.168"
                                },
                                "BudgetYearTwo": {
                                    "val": "1.376"
                                },
                                "BudgetYearThree": {
                                    "val": "1.716"
                                },
                                "BudgetYearFour": {
                                    "val": "4.517"
                                },
                                "BudgetYearFive": {
                                    "val": "4.607"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "1.008"
                    },
                    "CurrentYear": {
                        "val": "1.568"
                    },
                    "BudgetYearOneBase": {
                        "val": "2.168"
                    },
                    "BudgetYearOne": {
                        "val": "2.168"
                    },
                    "BudgetYearTwo": {
                        "val": "1.376"
                    },
                    "BudgetYearThree": {
                        "val": "1.716"
                    },
                    "BudgetYearFour": {
                        "val": "4.517"
                    },
                    "BudgetYearFive": {
                        "val": "4.607"
                    }
                }
            }
        },
        "Description": {
            "val": "Funds are required to purchase two replacement ROUGH TERRAIN FORKLIFTS for use at the Arrival\/Departure Airfield Control Group (A\/DACG).  The two current pieces assigned to the A\/DACG are DEADLINED and are ready to be turned in for disposal. The A\/DACG is currently borrowing two of these vehicles from the Rail section on a temporary basis to continue their mission. The average annual number of short tons shipped using these forklifts is 1,215.05 for 64 aircraft.\n\nFunds a 50,000 pound Military Cargo Loader.  The loader will handle five, 463L pallets in the 88” bias or 4ea pallets in the 108” bias. The loader will facilitate loading of all aircraft cargo holds with the full loader capacity of 50,000lb to 19 feet (main-deck height of B-747), which is the highest cargo deck height in the industry.  It will also handle airdrop platforms and rolling stock.  Additional features include powered rear rotation and side shift of pallets, cargo pallet locks and a telescoping vertical aluminum boarding ladder for personnel access to elevated loads.  The Military Cargo Loader is air transportable aboard C-130, C-5, C-17, A400M and IL-76 air frames.\n\nThis program procures Base-level commercially available equipment from a list authorized by the Table of Distribution and Allowances (TDA) for Army activities but is not Army centrally managed or purchased. Equipment unit cost must meet the currently approved Expense-Investment threshold of $250,000.00. The equipment supports recurring and generic activities typically performed by garrisons, such as material and cargo handling, engineering and public works, port and terminal operations support. Procures new investment items or replacements for existing equipment that is over-aged, obsolete, or beyond economical repair.\n\nFY17 funding will procure a Scanning Electron Microscope (SEM) as part of a life-cycle replacement in support of forensic evidence analysis utilized for numerous case types to include homicides, sexual assault cases, and other various crimes against the Army and its personnel. The instrument's ability to locate and identify the elemental composition of microscopic material (on the order of particles 100x smaller than a human hair) makes the SEM\/EDS vital to the success of analyzing forensic evidence."
        },
        "Justification": {
            "val": "FY 17 Procurement funding in the amount of $2.168 million procures the following:\n\nMaterial Handling Equipment (MHE) ($.860million) is a critical requirement and without operational equipment ADACG personnel cannot support the workload requirements at Robert Gray Army Airfield. The rough terrain forklifts currently assigned have exceeded their Mission Essential Level (MEL). Transportation Division’s A\/DACG uses these ROUGH TERRAIN Forklifts for loading aircraft for deployment\/redeployment operations and cannot be substituted by any other type due to the height restrictions of the supported aircraft. These pieces enable loading of cargo aircraft and are mission critical. If not funded, the A\/DACG will continue to borrow the two pieces from the Rail as able, but the mission capability of both sections is reduced.\n\nThe Logistics Readiness Center (LRC) Riley deployment operations are at potential mission failure due to aircraft departure delays caused by out-dated (over 30 year old) aircraft K-Loaders ($.402million).  Delay induced by K-loader break-down on airfields can cause further delay on subsequent missions for the aircraft, by disruption of in-flight scheduled refueling, and induce issues with crew rest schedules.  The LRC Riley K-Loader fleet consists of three 40K loaders, two 25K loaders and two 56K loaders, which are no longer reliable, safe to operate and are no longer repairable due to lack of commercial repair parts available for these aged machines.  The most recent example of the impact of their unreliability occurred on 11 Nov 2014.  While employed at Forbes Field, Topeka, Kansas, aircraft delay was experienced due to the erratic operation of load handling controls on one of the operational K-loaders.  The K-loader’s load shifted and lurched forward, narrowly missing the aircraft’s structure and avoiding damage to the aircraft by inches.  The platforms of these K-loaders are no longer stable and movement is not precise, largely due to the wear in critical major components with over 30 years of use, which increases risk of aircraft damage and injuring personnel involved in the transfer of cargo to and from the aircraft.  Attempts to obtain inspections and technical advice on correcting issues on these aged commercial K-loaders resulted in resistance by commercial firms to guarantee any repair actions or overhaul on machines as old as these, even at an extremely high estimated cost.  Overhaul or refurbishment is not economically feasible and will not likely result in acceptable reliability for use on active airfield cargo operations.  Three of the seven K-Loaders are condition code H (unserviceable) and awaiting disposal.  Three of the remaining four K-Loaders are inoperative and undergoing classification inspections.  Only a single K-loader is currently operational with limitations.\n\nFY17 Base procurement funding in the amount of $.705 million procures new equipment critical to military operations and readiness to provide garrison support to Major and Combatant Commands. Equipment is critical to maintaining installation roads and training areas needed by tactical units to maintain proficiency and combat readiness. Equipment supports maintaining road networks within the training areas; drop zones for airborne operations, landing zones for airmobile operations and ranges; and excavations supporting new range facilities, hard stands and emplacements. The equipment maintains road and parking drainage systems, and is also used for Force Protection operations to emplace concrete blocks and containers. Equipment replaces over-aged equipment with high utilization\/increased deadline rates and uneconomical maintenance and repair costs. Equipment supports garrison requirements to correct environmental deficiencies and violations by excavating and transporting clean earth to environmental clean-up sites. Material handling, cargo handling and port operations equipment improves capabilities to mobilize, demobilize and out-load warfighting units.\n\nFY17 funding of $.201 million replaces the aging CID microscope. If the current microscope is not replaced, the aging instrument could fail or result in evidence pertaining to homicides and sexual assault cases not being analyzed in a timely manner due to outdated software and incompatibility with Army Networks.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Base Level Common Equipment"
                    },
                    "ItemNumber": {
                        "val": "MB7000"
                    },
                    "SecondaryDistribution": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "1.008"
                                            },
                                            "CurrentYear": {
                                                "val": "1.568"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.168"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.168"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "544.97"
                            },
                            "PriorYear": {
                                "val": "1.008"
                            },
                            "CurrentYear": {
                                "val": "1.568"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.168"
                            },
                            "BudgetYearOne": {
                                "val": "2.168"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "544.97"
                            },
                            "PriorYear": {
                                "val": "1.008"
                            },
                            "CurrentYear": {
                                "val": "1.568"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.168"
                            },
                            "BudgetYearOne": {
                                "val": "2.168"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "544.97"
                            },
                            "PriorYear": {
                                "val": "1.008"
                            },
                            "CurrentYear": {
                                "val": "1.568"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.168"
                            },
                            "BudgetYearOne": {
                                "val": "2.168"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Ammunition Cranes"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "AllPriorYears": {
                                                            "val": "2"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "19.5"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "AllPriorYears": {
                                                            "val": "9750"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Rough Terrain Forklifts"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "2"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.86"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.86"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "430"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "430"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Loader Transport"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.402"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.402"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "402"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "402"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "BCE Equipment"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "525.47"
                                                        },
                                                        "PriorYear": {
                                                            "val": "1.008"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.568"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Crane Truck Mounted"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "2"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.705"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.705"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "352.5"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "352.5"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CID Microscope"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.201"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.201"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "201"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "201"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "544.97"
                                            },
                                            "PriorYear": {
                                                "val": "1.008"
                                            },
                                            "CurrentYear": {
                                                "val": "1.568"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.168"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.168"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "544.97"
                                        },
                                        "PriorYear": {
                                            "val": "1.008"
                                        },
                                        "CurrentYear": {
                                            "val": "1.568"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.168"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.168"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}