{
    "id": "f9a2c0ba63850ce2c949806a6ccea37febacc06f",
    "meta": {
        "filename": "dod-2017_PROCUREMENT_2017_ARMY_OTHER_3-4_U_PROCUREMENT_JustificationBook_Army_PB_2017.zzz_unzipped_U_PROCUREMENT_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "G01001"
        },
        "LineItemTitle": {
            "val": "AMC Critical Items OPA3"
        },
        "P1LineNumber": {
            "val": "176"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "90"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "253.595"
                },
                "PriorYear": {
                    "val": "7.785"
                },
                "Total": {
                    "val": "261.38"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "253.595"
                },
                "PriorYear": {
                    "val": "7.785"
                },
                "Total": {
                    "val": "261.38"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "253.595"
                },
                "PriorYear": {
                    "val": "7.785"
                },
                "Total": {
                    "val": "261.38"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "1.4"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army National Guard"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "4.542"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "1.843"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "7.785"
                    }
                }
            }
        },
        "Description": {
            "val": "The Army Materiel Command (AMC) identifies Table of Organizational Equipment (TOE) items with identifiable Line Item Numbers (LINs) that have valid unit requirements and support Army force generation requirements.  These LINs include:  The Shop Equipment, Small Arms Set (LIN: W51499) provides the necessary components for small arms field maintenance.  Includes torque multiplier, impact wrench set, storage cabinet, hydraulic hand jack, a variety of hand and power tools, cabinets worktables, stools, etc.  The Spare Part Storage Cabinet Set (LIN: T36305) toolset provides the components to accomplish direct and general support for maintenance functions on combat vehicle fire control systems.  The Tool Kit, Engineer Rigging & Wire Rope Repair Tool kit (LIN: W50266) contains components required for engineer rigging activities as well as repair components needed in wire rope repairs.  The ISO Shelter (LIN: S01359) is a rigid-wall shelter two-sided expansion.  Power requirements are 60 amps\/100 amps.  The ISO provides a mobile, environmentally-controlled working\/living space used by the Chemical, Biological, Radiological, Nuclear and High Yield Explosive (CBRNE) Consequence Management Reaction Force (CCMRF) and provides medical facilities; i.e. operating rooms, Dentist Office, Pharmacy.  ISO shelter is also used for Command Centers, Classroom, and operator's system control station.  The ISO, Non-expandable Shelter (LIN: S00860) is a rigid-wall non-expandable shelter.  Power requirements are 60 amps\/100 amps.  The ISO provides a mobile, environmentally-controlled working\/living space and supports Military Intelligence Combat Electronic Warfare Intelligence (CEWI) units.  The Individual Swimmer Support Set (LIN: D49154) is comprised of multiple components that support Special Operations infiltration\/exfiltration missions.  The 40K Water Storage and Distribution System (LIN: W55968) consists of 1 each 350 Gallons Per Minute (GPM) Pumps; 1 each 400 GPM Hypo-chlorination Units; 3 each 20K Water Storage Tanks; 2 EA Chests Tank Storage and 2 EA Equipment Shelters.  This system supports Divisions, Brigades, and Hospital Units.  The Tank and Pump Unit (TPU) (LIN: V12141) is used by units to provide fuel to their vehicles and equipment.  This system  includes two 525 gallon (Lo-Profile) tanks, two hose reels, one electric motor driven (EMD), and 50 GPM pumping assembly.  It is mounted on a 5 ton truck or Family of Medium Tactical Vehicles.  The Lo-Profile 525 gallon tank has recessed top loading, lateral and longitudinal baffling and a dry break bottom loading capability.  It meets all environmental and human safety concerns.  The Tank Unit Liquid Dispensing (TULD) (LIN: V19950) consists of two 525 gallon tanks (Lo-Profile) and two 600 gallon tanks (Hi-Profile), tie down kit, storage boxes and ancillary equipment.  It is mounted on a M106A1 trailer (not included).  The TULD is used by units to provide fuel to their vehicles and equipment.  The Demolition Set (LIN: F91490) provides the capability to create and remove obstructions, obstacles, and terrain features that will affect friendly and enemy movement.  The set contains expendable and non-expendable, non-explosive materials necessary to support electrical and non-electrical initiated standard military explosives as well as Modernized Demolition Initiator (MDI) items.  Also includes items that will allow users to assemble and transport initiation systems and charges during field operations, items that will evaluate minimum safe distance requirements, and equipment to computerize charge calculation and placement."
        },
        "Justification": {
            "val": "No FY17 funding request."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}