{
    "id": "c8bddcf0640778bc663bf751547ef2985baa8f1e",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_AIRFORCE_MISSILE_PROCUREMENT_JustificationBook_Air_Force_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3020F",
        "appropriation_name": "Missile Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "MSEELC"
        },
        "LineItemTitle": {
            "val": "Space Expendable Launch Capability"
        },
        "P1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3020F"
        },
        "AppropriationTitle": {
            "val": "Missile Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "Other Support"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Space Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "631.551"
                },
                "CurrentYear": {
                    "val": "559.413"
                },
                "BudgetYearOneBase": {
                    "val": "750.143"
                },
                "BudgetYearOne": {
                    "val": "750.143"
                },
                "BudgetYearTwo": {
                    "val": "739.424"
                },
                "BudgetYearThree": {
                    "val": "777.579"
                },
                "BudgetYearFour": {
                    "val": "763.395"
                },
                "BudgetYearFive": {
                    "val": "515.875"
                },
                "ToComplete": {
                    "val": "11235.814"
                },
                "Total": {
                    "val": "15973.194"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "631.551"
                },
                "CurrentYear": {
                    "val": "559.413"
                },
                "BudgetYearOneBase": {
                    "val": "750.143"
                },
                "BudgetYearOne": {
                    "val": "750.143"
                },
                "BudgetYearTwo": {
                    "val": "739.424"
                },
                "BudgetYearThree": {
                    "val": "777.579"
                },
                "BudgetYearFour": {
                    "val": "763.395"
                },
                "BudgetYearFive": {
                    "val": "515.875"
                },
                "ToComplete": {
                    "val": "11235.814"
                },
                "Total": {
                    "val": "15973.194"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "PriorYear": {
                    "val": "631.551"
                },
                "CurrentYear": {
                    "val": "559.413"
                },
                "BudgetYearOneBase": {
                    "val": "750.143"
                },
                "BudgetYearOne": {
                    "val": "750.143"
                },
                "BudgetYearTwo": {
                    "val": "739.424"
                },
                "BudgetYearThree": {
                    "val": "777.579"
                },
                "BudgetYearFour": {
                    "val": "763.395"
                },
                "BudgetYearFive": {
                    "val": "515.875"
                },
                "ToComplete": {
                    "val": "11235.814"
                },
                "Total": {
                    "val": "15973.194"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Effective with the FY15PB submission, in accordance with the direction in the Consolidated and Further Continuing Appropriations Act 2013, the Air Force requests funding for the Evolved Expendable Launch Vehicle (EELV) program in 2 separate P-1 line items. Launch services will be executed from the Evolved Expendable Launch Veh (Space) P-1 line item.  Launch capability will be executed from the Space Expendable Launch Capability (SELC) P-1 line item. Both the EELV and SELC line items are necessary to achieve successful placement of National Security Space (NSS) space vehicles (SVs) on-orbit. Funding for this exhibit is contained in PE 0305953F. Related RDT&E, AF funding is contained in PE 0604853F. This exhibit only provides funding for SELC.  \n\nThis program does not require and does not include advance procurement or initial spares.  Flyaway Unit Cost is not applicable and Weapon System Unit Cost are not representative due to the mix (medium through heavy) of vehicles in the program.  EELV procures launch services, and is not a weapon system.  The program provides launch capacity for the Government's National Launch Forecast (NLF) requirements, but does not take ownership of any specific launch hardware.  The requirements for EELV launch services are derived from multiple spacecraft requirements.  \"To Complete\" projections include only known requirements at this time.\n\nThe EELV program (EELV and SELC) is a Major Defense Acquisition Program (MDAP) Acquisition Category (ACAT) 1D program that acquires launch services to provide critical space support required to satisfy Department of Defense (DoD) warfighter, national security, and other Government space lift missions while fostering interagency and commercial cooperation. The EELV program provides satellite delivery to specific orbits through certified launch vehicle providers. To maintain maximum flexibility to meet NSS requirements, Air Force acquires launch services through a white tail concept where designating LVs to specific missions is accomplished just-in-time to meet mission integration requirements.\n  \nThe Air Force structured the EELV program with a new cost saving acquisition strategy that includes a quantity and rate commitment with the current provider and and enables competition if one or more New Entrants are certified. This strategy stabilizes the industrial base, provides predictability to maintain mission success, and reduces costs. The Air Force, National Reconnaissance Office (NRO), and the National Aeronautics and Space Administration (NASA) agreed to a coordinated strategy for certification of New Entrants to launch payloads in support of NSS and other USG requirements. The Air Force continues to actively evaluate the addition of New Entrants to reliably launch NSS requirements. Once a New Entrant demonstrates a successful launch the Air Force intends to award integration studies. The number of competitive launch opportunities from FY15-17 changed from 14 to 7 due to launch manifest changes. If competition is not viable at the time of need, missions will be awarded to the incumbent. The Air Force plans to compete all launch service procurements beginning in FY18, if there is more than one certified provider. The implementation of this new strategy enables the DoD to reliably place NSS space vehicles into earth orbit.\n\nIn 2013, the Air Force combined the Launch Services contract and Launch Capability contract into a single contract. The Launch Capability cost plus incentive fee contract line items provide launch infrastructure support which includes, but is not limited to, systems and factory engineering, program management, standard integration\/testing, launch and range activities, infrastructure, parts obsolescence mitigation, post mission analysis, and studies and analysis. The contract features a Mission Success Incentive fee which incentivizes both mission success and cost control for cost plus contract line items."
        },
        "Justification": {
            "val": "Fiscal Year 2015 Space Expendable Launch Capability (SELC) procurement funding is required to support launch and acquisition of National Security Space (NSS) launch vehicles. SELC includes but is not limited to systems and factory engineering, program management, standard integration\/testing, launch and range activities, infrastructure, parts obsolescence mitigation, post mission analysis, studies and analysis and support costs to meet mission requirements. \n\nLaunch Services (EELVA) is requested under a separate P-1 line item in accordance with the direction in the Consolidated and Further Continuing Appropriations Act 2013. \n \nA revised Memorandum of Understanding (MOU) between the Air Force and National Reconnaissance Office (NRO), dated 7 October 2011 provides a cost share agreement for the Launch Capability of 75 percent (Air Force) and 25 percent (NRO).  This PE contains only the Air Force position.  The SV is responsible for funding mission unique integration\/testing."
        },
        "MDAPCode": {
            "val": "176"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Space Expendable Launch Capability"
                    },
                    "ItemNumber": [],
                    "Remarks": {
                        "val": "A revised Memorandum of Understanding (MOU) between the Air Force and National Reconnaissance Office (NRO), dated 7 October 2011 provides a cost share agreement for the Launch Capability of 75 percent (Air Force) and 25 percent(NRO).  \n\nPrior year funding buy-down of FY14 launch capability requirements contributed to meeting FY14 Bipartisan Budget Act (BBA) objectives. FY15 request fully funds launch capability requirements without prior-year adjustments."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "631.551"
                            },
                            "CurrentYear": {
                                "val": "559.413"
                            },
                            "BudgetYearOneBase": {
                                "val": "750.143"
                            },
                            "BudgetYearOne": {
                                "val": "750.143"
                            },
                            "BudgetYearTwo": {
                                "val": "739.424"
                            },
                            "BudgetYearThree": {
                                "val": "777.579"
                            },
                            "BudgetYearFour": {
                                "val": "763.395"
                            },
                            "BudgetYearFive": {
                                "val": "515.875"
                            },
                            "ToComplete": {
                                "val": "11235.814"
                            },
                            "Total": {
                                "val": "15973.194"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "631.551"
                            },
                            "CurrentYear": {
                                "val": "559.413"
                            },
                            "BudgetYearOneBase": {
                                "val": "750.143"
                            },
                            "BudgetYearOne": {
                                "val": "750.143"
                            },
                            "BudgetYearTwo": {
                                "val": "739.424"
                            },
                            "BudgetYearThree": {
                                "val": "777.579"
                            },
                            "BudgetYearFour": {
                                "val": "763.395"
                            },
                            "BudgetYearFive": {
                                "val": "515.875"
                            },
                            "ToComplete": {
                                "val": "11235.814"
                            },
                            "Total": {
                                "val": "15973.194"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0.000"
                            },
                            "PriorYear": {
                                "val": "631.551"
                            },
                            "CurrentYear": {
                                "val": "559.413"
                            },
                            "BudgetYearOneBase": {
                                "val": "750.143"
                            },
                            "BudgetYearOne": {
                                "val": "750.143"
                            },
                            "BudgetYearTwo": {
                                "val": "739.424"
                            },
                            "BudgetYearThree": {
                                "val": "777.579"
                            },
                            "BudgetYearFour": {
                                "val": "763.395"
                            },
                            "BudgetYearFive": {
                                "val": "515.875"
                            },
                            "ToComplete": {
                                "val": "11235.814"
                            },
                            "Total": {
                                "val": "15973.194"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Launch": {
                            "Name": {
                                "val": "Launch Cost Element Category"
                            },
                            "Recurring": {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Launch Capability"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "631.551"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "554.946"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "745.183"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "745.183"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "734.126"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "772.022"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "758.05"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "510.43"
                                                    },
                                                    "ToComplete": {
                                                        "val": "11148.019"
                                                    },
                                                    "Total": {
                                                        "val": "15854.327"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "631.551"
                                        },
                                        "CurrentYear": {
                                            "val": "554.946"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "745.183"
                                        },
                                        "BudgetYearOne": {
                                            "val": "745.183"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "734.126"
                                        },
                                        "BudgetYearThree": {
                                            "val": "772.022"
                                        },
                                        "BudgetYearFour": {
                                            "val": "758.05"
                                        },
                                        "BudgetYearFive": {
                                            "val": "510.43"
                                        },
                                        "ToComplete": {
                                            "val": "11148.019"
                                        },
                                        "Total": {
                                            "val": "15854.327"
                                        }
                                    }
                                }
                            },
                            "CategorySubtotal": {
                                "TotalCost": {
                                    "PriorYear": {
                                        "val": "631.551"
                                    },
                                    "CurrentYear": {
                                        "val": "554.946"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "745.183"
                                    },
                                    "BudgetYearOne": {
                                        "val": "745.183"
                                    },
                                    "BudgetYearTwo": {
                                        "val": "734.126"
                                    },
                                    "BudgetYearThree": {
                                        "val": "772.022"
                                    },
                                    "BudgetYearFour": {
                                        "val": "758.05"
                                    },
                                    "BudgetYearFive": {
                                        "val": "510.43"
                                    },
                                    "ToComplete": {
                                        "val": "11148.019"
                                    },
                                    "Total": {
                                        "val": "15854.327"
                                    }
                                }
                            }
                        },
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Program Management Administration - Other Government Costs"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.467"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.568"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.568"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "0.555"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "0.57"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "0.594"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "0.599"
                                                    },
                                                    "ToComplete": {
                                                        "val": "7.763"
                                                    },
                                                    "Total": {
                                                        "val": "11.116"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Program Management Administration - Contract Services"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.000"
                                                    },
                                                    "ToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "Total": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Range, Certification, and Other Direct Govt Costs"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.392"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.392"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "4.743"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "4.987"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "4.751"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "4.846"
                                                    },
                                                    "ToComplete": {
                                                        "val": "80.032"
                                                    },
                                                    "Total": {
                                                        "val": "107.751"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.000"
                                        },
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "4.467"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.96"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.96"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.298"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.557"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.345"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.445"
                                        },
                                        "ToComplete": {
                                            "val": "87.795"
                                        },
                                        "Total": {
                                            "val": "118.867"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Support Cost Element Category"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}