{
    "id": "d1bbdae4b14470e8cfe43257214c98ba4faff8b6",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_DEFENSE_DISA_PROCUREMENT_JustificationBook_Defense_Information_Systems_Agency_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Defense_Information_Systems_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "8"
        },
        "LineItemTitle": {
            "val": "Drug Interdiction Support"
        },
        "P1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, DISA"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "2.076"
                },
                "PriorYear": {
                    "val": "0.153"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "2.076"
                },
                "PriorYear": {
                    "val": "0.153"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "2.076"
                },
                "PriorYear": {
                    "val": "0.153"
                }
            }
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0201182K"
                }
            ]
        },
        "Description": {
            "val": "This is a transfer fund appropriated to Defense Information Systems Agency (DISA) in the year of execution.  As funded and directed by the Deputy Assistant Secretary of Defense for Counternarcotics and Global Threats, the Anti-Drug (ADNET) program builds and enables command, control, communication, computer and intelligence (C4I) capabilities to help Defense and civil agencies detect, monitor and interdict activities related to narcotics trafficking and narco-terrorism.  ADNET’s core services are centered on four information technology (IT) service offerings:  IT Infrastructure and Operations Support, Engineering, Information Assurance, and Customer Support (i.e.  telecommunications, software development, security engineering, accreditation, training, service desk, network operations).  ADNET provides collaboration and information sharing through unclassified and classified portals as well as detection and monitoring through the counterdrug Common Operational Picture (COP).  The unclassified information sharing portal technology systems supports Combatant Commanders, federal, state, local, tribal and foreign governments doing intelligence preparation of the battlefield, joint operations, operational evaluations, and interdictions.  The secret portal enables the sharing of foreign drug seizures, air reconnaissance, imagery, stolen aircraft, and intelligence data.  ADNET currently manages seven architectures (production, COOP, test, user acceptance, development) and over 1,000 devices (workstations, routers, switches, firewalls, storage area networks, and servers) at 45 core sites in the SECRET and Unclassified environments.  ADNET is the primary secure link among a community of interest (COI) made up of DoD, the Office of National Drug Control Policy, Federal Communications Commission, Homeland Security, National Guard (High Intensity Drug Trafficking Areas), and Justice."
        },
        "Justification": {
            "val": "FY 2013: ($0.153) FY 2013 funds procured hardware and software for the ADNET Classified and Sensitive But Unclassified (SBU) devices and architectures. All planned procurements were procured and delivered within the requested delivery dates. These procurements also provided support to the Transnational Criminal Organizations Strategy and the Deputy Assistant Secretary of Defense for Counternarcotics and Global Threats goal of providing intelligence and technology support to U.S. partner nation forces designated to dismantle narcotics, trafficking, and international terrorist organizations benefiting from the drug trade.\n\nPerformance Metrics:  \n1.    In FY 2013, procured 100% of ADNET software and hardware.  Executed within 5% of planned schedule and spend plan.  Program achieved its 99% availability goal by completing planned hardware and software refresh, expansions and mandated DoD Security Enhancements to the ADNET Secret and SBU architectures."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "CategoryList": {
                        "Category": [
                            {
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Counter Drug"
                                            },
                                            "ItemNumber": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "2"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.075"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.153"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.038"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.153"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.076"
                                        },
                                        "PriorYear": {
                                            "val": "0.153"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "2.076"
                            },
                            "PriorYear": {
                                "val": "0.153"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}