{
    "id": "e3cae3c1acb7dcdc0f802ea247cb383a63143dad",
    "meta": {
        "filename": "dod-2015_PROCUREMENT_2015_ARMY_OTHER_3-4_PROCUREMENT_JustificationBook_Army_PB_2015.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "M82700"
        },
        "LineItemTitle": {
            "val": "LAUNDRIES, SHOWERS AND LATRINES"
        },
        "P1LineNumber": {
            "val": "129"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "25"
        },
        "BudgetSubActivityTitle": {
            "val": "Combat Service Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "10.435"
                },
                "CurrentYear": {
                    "val": "0.2"
                },
                "Total": {
                    "val": "10.635"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "10.435"
                },
                "CurrentYear": {
                    "val": "0.2"
                },
                "Total": {
                    "val": "10.635"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "10.435"
                },
                "CurrentYear": {
                    "val": "0.2"
                },
                "Total": {
                    "val": "10.635"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "CurrentYear": {
                                    "val": "0.2"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "CurrentYear": {
                        "val": "0.2"
                    }
                }
            }
        },
        "Description": {
            "val": "Provides unit and field service equipment to enhance soldier efficiency, effectiveness, and sustainability. Items include laundries, latrines, showers and clothing repair which directly affect combat readiness and sustain combat power by promoting wellness and preventing disease. These efforts are in accordance with the standards determined by the Surgeon General. This program procures and fields a critical capability that supports the Army's transformation and maintains readiness through fielding and integrating new equipment. Products produced reduce sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) lift demands, the overall combat zone footprint, and logistical support costs.\n\nThe Laundry Advanced System (LADS) is the Army's water-based, mobile field laundry system, with one LADS replacing up to four of the current M85 laundries. It consists of laundry-processing and water recycling equipment mounted on an International Standards Organization (ISO) certified frame, a 30 kilowatt (KW) Tactical Quiet Generator, all mounted on a 40 foot M871 trailer and towed by a 5-ton tractor. Each LADS will wash laundry for 500 soldiers per day using a dry-to-dry process (dirty clothes are placed in the drum and removed clean and dry at the end of the one-hour cycle). The LADS will recycle approximately 97 percent of the water used in the laundry process, reducing water consumption to under 500 gallons per day compared to over 20,000 gallons for four M85s (with only 20 gallons of waste water produced). The system is run by two operators per 10-hour shift; two shifts per day result in a 75 percent manpower reduction compared to the four-M85 laundry operation. This program procures and fields a critical capability that supports the Army's transformation by maintaining readiness through fielding and integrating new equipment and by reducing sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, combat zone footprint, and costs for logistical support. \n\nThe Battlefield 12-head Shower enhances the mission support capability of the Field Service Company as this unit provides tactical field services (shower, laundry, and clothing renovation) to soldiers in forward areas.  The primary mission of the Battlefield 12-head Shower is to provide hot showers for soldiers in the field.  This shower will replace the antiquated 8 and 9-head showers that are no longer supportable.  The system comes complete with a shelter, water heater, pumps and ancillary equipment and has a requirement to move once every 3 days in the field.  The Army Acquisition Objective (AAO) for the 12-head Shower is 247.\n\nThe Clothing Repair Shop (CRS) provides the field Service Company's capability to perform its clothing renovation mission. It consists of commercial sewing, darning, button and heat sealing machines and associated items and work stations transported on a M105 trailer. Current equipment is no longer supportable and there is a severe shortage of assets.  \n\nThe Army Acquisition Objective (AAO) for the CRS is 200."
        },
        "Justification": {
            "val": "There are no FY15 Base dollars for Laundries, Showers and Latrines."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Containerized Batch Laundry"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Containerized Batch Laundry"
                                            },
                                            "ItemNumber": {
                                                "val": "M82708"
                                            },
                                            "SecondaryDistribution": {
                                                "ComponentList": {
                                                    "Component": [
                                                        {
                                                            "Name": {
                                                                "val": "Army Active"
                                                            },
                                                            "Cost": {
                                                                "TotalCost": {
                                                                    "CurrentYear": {
                                                                        "val": "0.2"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    ]
                                                }
                                            },
                                            "ModificationType": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "49"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "10.435"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.2"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "212.959"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "Quantity": [],
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "10.435"
                                        },
                                        "CurrentYear": {
                                            "val": "0.2"
                                        }
                                    },
                                    "UnitCost": []
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "10.435"
                            },
                            "CurrentYear": {
                                "val": "0.2"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}