{
    "id": "279dc96d6985cd26ba84e4ce1bc4a0bd6f0d36cf",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_NAVY_OTHER_BA4_PROCUREMENT_JustificationBook_Navy_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "5660"
        },
        "LineItemTitle": {
            "val": "Surface Training Device Mods"
        },
        "P1LineNumber": {
            "val": "132"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Ordnance Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "7"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Expendable Ordnance"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "133.165"
                },
                "PriorYear": {
                    "val": "43.213"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "176.378"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "133.165"
                },
                "PriorYear": {
                    "val": "43.213"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "176.378"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "133.165"
                },
                "PriorYear": {
                    "val": "43.213"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "176.378"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.128"
                },
                "Total": {
                    "val": "0.128"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This line provides funds to procure, modify and upgrade trainers to include Aegis Ashore, LCS, DDG 1000 and surface shore-based navigation, Hull, Mechanical and Electrical (HM&E) combat systems, engineering, damage control and amphibious warfare individual and team Technical Training Equipment, Training Devices, Training Unique Equipment and Training systems. Funds ensure alignment between Surface Learning Centers and Fleet Concentration Area training systems and fleet training requirements as dictated by Surface and Expeditionary Warfare Training Plan. Additionally, funds support ship on-board training curriculum for the purpose of maintaining perishable operator and maintenance skills.\n\n[P5 \/ TS004 Surface Training Device Mods]: TS004 Surface Training Device Mods]: TS004- SURFACE MINOR MODS\nModifications are required to meet safety standards, keep training systems compatible with equivalent changes made to fleet operational equipment, and to enhance training capabilities.\nThese modifications support the 300+ fielded Surface training systems.\n\nThis program has moved to 5662, N95, N96 and N97, PE 0804731N.\n\n[P5 \/ SURFACE MINOR MODS]: Funds modifications of 10 systems and sustainment of 145 surface and expeditionary training systems in accordance with the results of CNO directed and OPNAV and Fleet sponsored studies from 2009 through 2013. Specific studies of surface training systems include: Fleet Review Panel of Surface Force Readiness, Aegis Weapon System\/SPY Radar Readiness Task Force, LPD 17 Class Wholeness Task Force,\nMCM Readiness Task Force, Navigation Wholeness Study, OPNAV-sponsored Surface Engineering Training Wholeness Review, Fleet Integrated Air and Missile Defense and Anti-Submarine Warfare Improvement Programs, Aegis Ashore, Naval Integrated Fire Control-Counter Air (NIFC-CA) and C5I training requirements documents, LCS Front End Analysis (FEA), DDG 1000 wholeness review, LHD 8\/ LHA 6 Training Requirements Planning and Programming (TRPPM), CNSF manpower initiatives impact on readiness, and the Navy IG report on Computer Based Training (CBT). The extensive inventory of training systems to support 16 classes of ships requires continual modifications to ensure alignment with fleet systems while addressing technology obsolescence issues. Funding is budgeted to modify the following 10 systems:\n1. Anti-Submarine Tactical Air Controller (ASTAC) Simulation Upgrade\n2. Damage Control Wet Trainer Upgrades\/Refresh\n3. DDG 51 Machinery Control System Maintenance Trainer\n4. Multi-Mission Team Trainer Upgrades\/Lab Refresh\n5. Electrical Maintenance Training\n6. Air Conditioning and Refrigeration (AC&R) Maintenance Training\n7. Deck System Equipment Training\n8. Marine Sanitation Devices\n9. LCAC Team Trainer Overhaul\/Upgrades\n10. Amphibious Boat Control Team Trainer\n\n[P5 \/ CSCS Modernization\/AEGIS Capability Build (ACB) Training Systems]: The Aegis Weapon System\/SPY Radar Readiness Task Force, OPNAV-sponsored Fleet Integrated Air and Missile Defense and Anti-Submarine Warfare Improvement Programs, Aegis Ashore, Naval Integrated Fire Control-Counter Air (NIFC-CA) and C5I training requirements documents training shortfall for procurement and installation of ACB TTE Simulation\/Stimulation at the ATRC Learning Site. The current ATRC training systems utilize expensive and maintenance-intensive ruggedized shipboard equipment which is obsolete and unsupportable.  Without this funding, existing training labs at ATRC will not be upgraded or maintained to provide accurate training and the required training lab for ACB Program of Record will not be modified.  Aegis operators and maintainers will not be trained on accurate systems which will directly impact fleet readiness.\n\n[P5 \/ COMBINED IAMD\/ASW TRAINER (CIAT)]: Combined IAMD\/ASW Trainer (CIAT). From the Aegis Weapon System\/SPY Radar Readiness Task Force, OPNAV-sponsored Fleet Integrated Air and Missile Defense and Anti-Submarine Warfare Improvement Programs, Aegis Ashore, Naval Integrated Fire Control-Counter Air (NIFC-CA) and C5I training requirements documents, one of the areas identified for long term investment was the requirement for a high fidelity integrated air and missile defense and anti-submarine warfare training capability. Due to the cost prohibitive realities associated with modifications of ship high fidelity training systems, which currently meet only 60% of the CNO requirement for ship training systems to be commensurate with tactical system capability, this shore capability is being modified. The CIAT will field in the Fleet Concentration Areas of San Diego, Yokosuka, Pearl Harbor, and Norfolk in support of program of record advanced warfare training.  Without funding  the  installation and procurement of the trainers will be impacted resulting in delaying accurate and required training for integrated air and anti-submarine warfare weapon system operators.\n\n[P5 \/ NAVY TRAINING SYSTEM PLAN (NTSP TTE\/TD MODS)]: Funds are for modifications for 16 surface and expeditionary training systems in multiple school houses in accordance with the results of CNO directed and OPNAV and Fleet sponsored studies, NTSP updates, and Technical Training Audits from 2009 through 2013. One of the key items identified in the Fleet Review Panel of Surface Force Readiness, LPD 17 Class Wholeness Task Force, MCM Readiness Task Force, Navigation Wholeness Study, OPNAV-sponsored Surface Engineering Training Wholeness Review, LCS Front End Analysis (FEA), DDG 1000 wholeness review, and LHD 8\/ LHA 6 Training Requirements Planning and Programming (TRPPM) analysis done by the Surface Warfare Enterprise was the outdated or lack of training equipment in the schoolhouses.  The analysis identified approximately 80 Navy Training System Plan updates and 35 Technical Training Course Audits.  This investment will be for the procurement and installation of Training Equipment at Learning Centers to keep training courses in alignment with current configuration of equipment in the fleet. Investment ensures Surface Warfare Training Continuums are capable of meeting training requirements directly supporting readiness for the following systems\/courses:\n1. Collection, Holding and Transfer (CHT)\n2. Controllable Pitch Propeller\n3. LPD 17 Class Smoke Ejection\n4. Damage Control\n5. Firefighting\n6. Fuel Oil Systems\n7. Anchoring, Mooring and Towing\n8. Amphibious Assault Vehicle Handling, Stowage and Support\n9. Handling and Stowing Boats and Small Craft\n10. Hull Equipment\n11. Shipboard Crane Systems\n12. Underway Replenishment Systems\n13. CIN A-651-0064 Engineering Principles and Practices\n14. CIN A-651-0069 Controls, Governors, and Regulator Maintenance\n15. CIN A-651-0110 Senior Prop Engineering Course\n16. CIN A-4H-0157 Advanced Steam Course"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "TS004 Surface Training Device Mods"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "DODIC": {
                        "val": "TS004"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "133.165"
                            },
                            "PriorYear": {
                                "val": "43.213"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "133.165"
                            },
                            "PriorYear": {
                                "val": "43.213"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "133.165"
                            },
                            "PriorYear": {
                                "val": "43.213"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            }
                        },
                        "InitialSpares": {
                            "PriorYear": {
                                "val": "0.128"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "Trainers Cost"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "SURFACE MINOR MODS - Modifications are required to meet safety standards, keep training systems compatible with equivalent changes made to fleet operational equipment, and to enhance training capabilities. These modifications support the 300+ fielded Surface training systems.",
                                                    "val": "1.1.1) SURFACE MINOR MODS"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "97.55"
                                                        },
                                                        "PriorYear": {
                                                            "val": "6.656"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "NIFC-CA Trainer - Funds are for the procurment and integration of models to allow for NIFC-CA and Engage on Remote training at ATRC Labs.",
                                                    "val": "1.1.2) Navy Integrated Fire Control-Counter Air (NIFC-CA) Trainer"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "1.5"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "FCA TRAINERS - Funds are provided for upgrades to shore based trainers (Combat System, HM&E) in Fleet Concentration Areas.",
                                                    "val": "1.1.4) FCA TRAINERS"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "5.287"
                                                        },
                                                        "PriorYear": {
                                                            "val": "2.465"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "FFT\/SLEP\/MODULAR TRAINER- Funds are provided for the Service Life Extension Program (SLEP) Firefighter Trainer (FFT).",
                                                    "val": "1.1.5) FFT\/SLEP\/MODULAR TRAINER"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "9.673"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.922"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "NAVIGATION TRAINING SUPPORT - Funds are provided for modifications\/upgrades to Navigation Shore Based Trainers.",
                                                    "val": "1.1.6) NAVIGATION TRAINING SUPPORT"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "1.055"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.6"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "AEGIS ASHORE TRAINER\/C4I\/5.0CU\/Tech Refresh -Funds modifications, delivery, installation and life-cycle maintenance support of a high fidelity Aegis Ashore Team Trainer in support of the land-based Aegis Ashore Training Continuum. Funds also provide for the integration of a C4I component, 5.0 Capability Upgrade (CU) and tech refresh.",
                                                    "val": "1.1.7) AEGIS ASHORE TRAINER\/C4I\/5.0CU\/Tech Refresh"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "19.6"
                                                        },
                                                        "PriorYear": {
                                                            "val": "23.9"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "COMBINED IAMD\/ASW TRAINER (CIAT) -Funds are provided to procure and install hardware for a Shore Based IAMD and ASW Trainer.",
                                                    "val": "1.1.8) COMBINED IAMD\/ASW TRAINER (CIAT)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "3.57"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "Funds are provided for the procurement and installation of training equipment and associated logistic support package as outlined in the NTSPs.",
                                                    "val": "1.1.9) NAVY TRAINING SYSTEM PLAN (NTSP TTE\/TD MODS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "3.6"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "133.165"
                                            },
                                            "PriorYear": {
                                                "val": "43.213"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "133.165"
                                        },
                                        "PriorYear": {
                                            "val": "43.213"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}