{
    "id": "f64f8c5aba37f6580922fd4d37ba2c010ecd893b",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_ARMY_OTHER_3-4_PROCUREMENT_JustificationBook_Army_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "M11101"
        },
        "LineItemTitle": {
            "val": "Army Watercraft Esp"
        },
        "P1LineNumber": {
            "val": "154"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "55"
        },
        "BudgetSubActivityTitle": {
            "val": "Rail Float Containerization Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "CurrentYear": {
                    "val": "3.509"
                },
                "BudgetYearOneBase": {
                    "val": "39.772"
                },
                "BudgetYearOne": {
                    "val": "39.772"
                },
                "BudgetYearTwo": {
                    "val": "32.215"
                },
                "BudgetYearThree": {
                    "val": "40.665"
                },
                "BudgetYearFour": {
                    "val": "40.825"
                },
                "BudgetYearFive": {
                    "val": "41.601"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "CurrentYear": {
                    "val": "3.509"
                },
                "BudgetYearOneBase": {
                    "val": "39.772"
                },
                "BudgetYearOne": {
                    "val": "39.772"
                },
                "BudgetYearTwo": {
                    "val": "32.215"
                },
                "BudgetYearThree": {
                    "val": "40.665"
                },
                "BudgetYearFour": {
                    "val": "40.825"
                },
                "BudgetYearFive": {
                    "val": "41.601"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "CurrentYear": {
                    "val": "3.509"
                },
                "BudgetYearOneBase": {
                    "val": "39.772"
                },
                "BudgetYearOne": {
                    "val": "39.772"
                },
                "BudgetYearTwo": {
                    "val": "32.215"
                },
                "BudgetYearThree": {
                    "val": "40.665"
                },
                "BudgetYearFour": {
                    "val": "40.825"
                },
                "BudgetYearFive": {
                    "val": "41.601"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "CurrentYear": {
                                    "val": "3.509"
                                },
                                "BudgetYearOneBase": {
                                    "val": "19.886"
                                },
                                "BudgetYearOne": {
                                    "val": "19.886"
                                },
                                "BudgetYearTwo": {
                                    "val": "16.108"
                                },
                                "BudgetYearThree": {
                                    "val": "40.665"
                                },
                                "BudgetYearFour": {
                                    "val": "29.161"
                                },
                                "BudgetYearFive": {
                                    "val": "29.715"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "BudgetYearOneBase": {
                                    "val": "19.886"
                                },
                                "BudgetYearOne": {
                                    "val": "19.886"
                                },
                                "BudgetYearTwo": {
                                    "val": "16.107"
                                },
                                "BudgetYearFour": {
                                    "val": "11.664"
                                },
                                "BudgetYearFive": {
                                    "val": "11.886"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "CurrentYear": {
                        "val": "3.509"
                    },
                    "BudgetYearOneBase": {
                        "val": "39.772"
                    },
                    "BudgetYearOne": {
                        "val": "39.772"
                    },
                    "BudgetYearTwo": {
                        "val": "32.215"
                    },
                    "BudgetYearThree": {
                        "val": "40.665"
                    },
                    "BudgetYearFour": {
                        "val": "40.825"
                    },
                    "BudgetYearFive": {
                        "val": "41.601"
                    }
                }
            }
        },
        "Description": {
            "val": "The Army Watercraft ESP budget line funds the Service Life Extension Program (SLEP) across the Army Watercraft Systems portfolio.  In FY 2015 - FY 2022 specifically, the Army Watercraft ESP budget line will fund across the Army LCU-2000 inventory, a globally dispersed fleet of 34 vessels, and will extend current Economic Useful Life (EUL) of this platform by 10 years that will bridge the gap to procurement of a replacement vessel.  While no new capability is being added, some capabilities will be improved through new technology insertion, such as Engine Repower.  The Army Watercraft ESP budget line will also support the start of SLEP for the Modular Causeway System (MCS), specifically the Modular Warping Tug (MWT), one of four end items of the MCS.  For the MCS, the focus is repower as well as new electrical system\/components.\n\nThe US Army Watercraft Service Life Extension Program (SLEP) in prior fiscal years has been funded by MA4500, Modification of In-Service Equipment.  As of FY 2014, the SLEP requirement moved to M11101 Army Watercraft Extended Service Program (ESP). \n\nLanding Craft Utility 2000 (LCU-2000) provides intra-theater movement of combat vehicles, equipment, and sustainment cargo, to include containerized, break-bulk, and roll-on roll-off (RO\/RO) cargo, to improved and\/or degraded ports, bare and austere beaches, and inland water terminals.  The vessel is ideally suited for the discharge and back load of sea lift; the shallow draft, bow ramp, and associated systems providing for beaching and extraction.  The vessel supports Joint Logistics Over the Shore (JLOTS), seaport opening, and delivers combat-configured elements or sustainment cargo during all phases of the campaign.\n\nArmy Watercraft Systems are categorized under Landing Craft, Towing and Terminal Operations, Ship-to-Shore Enablers and Watercraft Operations Support.  Landing Craft consist of 8 Logistic Support Vessels (LSV), 34 Landing Craft Utility (LCU-2000), and 30 Landing Craft Mechanized (LCM-8) MOD 1.  Towing and Terminal Operations consist of 6 Large Tugs (LT 800), 16 Small Tugs (ST 900), and 4 Barge Derrick Cranes (BD-115).  Ship-to-Shore Enablers consist of 3 Modular Causeway Systems (MCS) [each MCS includes 2 Roll-On\/Roll-Off Discharge Facilities (RRDF), 5 Modular Warping Tugs (MWT), 1 Causeway Ferry (CF), 1 Floating Causeway (FC)].  Landing Craft discharge combat equipment or troops to austere beaches, undeveloped coastlines and operate in a non-permissive environment.  Towing and Terminal Operations and Ship-to-Shore Enablers support ocean and port\/harbor towing\/salvage operations.  Both are critical in denied\/degraded ports, Joint Logistics Over-the-Shore (JLOTS) operations, and operations throughout the littorals.  Watercraft Operations Support includes 6 LCM-8 MOD 2.\n\nFirst fielded in 1988, the Logistics Support Vessel (LSV) is globally self deployable, and provides worldwide and intra-theater movement and line haul of large quantities of combat vehicles, equipment, and sustainment cargo, to include containerized, break-bulk, and Roll-on Roll-off (RO\/RO) cargo, to improved and\/or degraded ports, bare and austere beaches, and inland water terminals.  With 10,500 square feet of cargo space and a payload capacity of 2,000 tons, the LSV can carry 24 combat loaded M1A1 Main Battle Tanks or the equivalent.  The vessel supports JLOTS, seaport opening and coastal\/inland waterway distribution, anti-access theater opening, and can deliver combat-configured elements or sustainment cargo during all phases of the campaign.\n\nFirst fielded in 1990, the Landing Craft Utility (LCU-2000) provides intra-theater movement of combat vehicles, equipment, and sustainment cargo, to include containerized, break-bulk, and RO\/RO cargo to improved and\/or degraded ports, bare and austere beaches, and inland water terminals.  The vessel is ideally suited for the discharge and back load of sea lift, the shallow draft, bow ramp, and associated systems providing capability for beaching and beach extraction.  The vessel supports JLOTS, seaport opening and coastal\/inland waterway distribution, anti-access theater opening, and can deliver combat-configured elements or sustainment during all phases of the campaign.\n\nFirst fielded in 1967, the Landing Craft Mechanized (LCM-8) transports combat equipped personnel and equipment, and sustainment cargo, from ship to shore and\/or within coastal areas including inland waterways.  The vessel is also capable of providing medical evacuations, command and control (C2) afloat and light harbor salvage support.  The size of the vessel facilitates operation within restricted areas, access to shallow areas to include bare beaches, and extensively throughout inland waterways.\n\nFirst fielded in 1994, the Large Tug 800 (LT 800) performs transoceanic and coastal towing operations, docking and undocking of large ships, salvage and recovery operations for disabled or damaged watercraft at sea and along the coastal main supply routes, clearance of degraded, damaged, and denied access waterways and port facilities, and provides both ship to ship and ship to shore firefighting capability to include in support of ammunition upload\/download operations.\n\nFirst fielded in 1998, the Small Tug 900 (ST 900) provides movement of cargo barges and lighterage of various types within a harbor, port, or Logistics Over the Shore (LOTS) or Joint LOTS (JLOTS) operations.  It also assists larger tugs with utility work such as docking\/undocking of ships of all sizes, movement of floating cranes, and line-handling duties.\n\nFirst fielded in 1999, the Barge Derrick, 115 ton (BD-115) provides heavy lift to load and discharge cargo that exceeds the lift capacity of ship's gear in theater-wide missions\/operations.  The BD-115 is capable of lifting the M1A1 main battle tank from the centerline of a non-self sustaining ship, and is world-wide deployable via the LT-800.  The BD-115 also provides heavy clearance and salvage capabilities within degraded, damaged, and denied access waterways and port facilities.\n\nFirst fielded in 1996, the Modular Causeway System (MCS) provides floating platforms for the loading, discharge, and transport of combat vehicles, equipment, and sustainment cargo to and from improved or austere ports, inland water terminals, and during bare beach operations.  A modular and highly transportable system, the MCS consists of both powered and non-powered systems to include the Roll-on Roll-off Discharge Facility (RRDF), Causeway Ferry (CF), Floating Causeway (FC), and Warping Tug (WT), and serves as a key enabler for both LOTS and JLOTS operations."
        },
        "Justification": {
            "val": "The FY 2016 Base procurement dollars in the amount of $39.772 million supports the Service Life Extension Program (SLEP) Phase I contract award to extend the Economic Useful Life (EUL) 10 years of two of the 34 LCU 2000s.  The $39.800 million amount represents the minimal FY 2016 investment necessary via SLEP in order to retain this vital operational capability. The LCU-2000 was fielded from 1990-1993 and was designed and built specifically to the objective of a 25 year EUL, currently expiring by 2015.  The SLEP modification package will make improvements including 13 select Engineering Change Proposals (ECPs) through technology insertion, specifically targeting improvements in energy efficiency; which are not covered under the Mod Line.  Major focus areas of LCU SLEP are the main propulsion system, shipboard electrical generation, distribution system, logistics products, bow thruster system, auxiliary machinery systems, force protection, engine trainers for the US Army Transportation School, and a Technical Data Package (TDP) that will be used for Phase 2 of the LCU-2000 SLEP."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Army Watercraft Esp"
                    },
                    "ItemNumber": {
                        "val": "M11101"
                    },
                    "SecondaryDistribution": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "CurrentYear": {
                                                "val": "3.509"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "19.886"
                                            },
                                            "BudgetYearOne": {
                                                "val": "19.886"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Army Reserve"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "19.886"
                                            },
                                            "BudgetYearOne": {
                                                "val": "19.886"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "CurrentYear": {
                                "val": "3.509"
                            },
                            "BudgetYearOneBase": {
                                "val": "39.772"
                            },
                            "BudgetYearOne": {
                                "val": "39.772"
                            }
                        },
                        "NetProcurementP1": {
                            "CurrentYear": {
                                "val": "3.509"
                            },
                            "BudgetYearOneBase": {
                                "val": "39.772"
                            },
                            "BudgetYearOne": {
                                "val": "39.772"
                            }
                        },
                        "TotalObligationAuthority": {
                            "CurrentYear": {
                                "val": "3.509"
                            },
                            "BudgetYearOneBase": {
                                "val": "39.772"
                            },
                            "BudgetYearOne": {
                                "val": "39.772"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "SLEP Vessels"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "2"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "25.751"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "25.751"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "12875.5"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "12875.5"
                                                        }
                                                    }
                                                },
                                                "ManufacturerList": {
                                                    "Manufacturer": [
                                                        {
                                                            "Name": {
                                                                "val": "TBD 1"
                                                            },
                                                            "Location": {
                                                                "val": "TBD"
                                                            },
                                                            "MinimumSustainingRate": {
                                                                "val": "1"
                                                            },
                                                            "MaximumProductionRate": {
                                                                "val": "1"
                                                            },
                                                            "Rate185": {
                                                                "val": "1"
                                                            },
                                                            "InitialQuantity": {
                                                                "AdminLeadTimeBeforeOct1InMonths": {
                                                                    "val": "0"
                                                                },
                                                                "AdminLeadTimeAfterOct1InMonths": {
                                                                    "val": "6"
                                                                },
                                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                                    "val": "9"
                                                                },
                                                                "TotalLeadTimeAfterOct1InMonths": {
                                                                    "val": "15"
                                                                }
                                                            },
                                                            "ReorderQuantity": {
                                                                "AdminLeadTimeBeforeOct1InMonths": {
                                                                    "val": "0"
                                                                },
                                                                "AdminLeadTimeAfterOct1InMonths": {
                                                                    "val": "6"
                                                                },
                                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                                    "val": "9"
                                                                },
                                                                "TotalLeadTimeAfterOct1InMonths": {
                                                                    "val": "15"
                                                                }
                                                            },
                                                            "HistoryPlanningList": {
                                                                "HistoryPlanning": [
                                                                    {
                                                                        "FiscalYear": {
                                                                            "val": "2016"
                                                                        },
                                                                        "PCOLocation": {
                                                                            "val": "WARREN, MI"
                                                                        },
                                                                        "AwardDate": {
                                                                            "val": "2016-03"
                                                                        },
                                                                        "FirstDeliveryDate": {
                                                                            "val": "2016-12"
                                                                        },
                                                                        "Quantity": {
                                                                            "val": "2"
                                                                        },
                                                                        "UnitCost": {
                                                                            "val": "12875.500"
                                                                        },
                                                                        "SpecsAvailableNow": {
                                                                            "val": "false"
                                                                        },
                                                                        "RFPIssueDate": {
                                                                            "val": "2015-06"
                                                                        },
                                                                        "ContractMethod": {
                                                                            "val": "C"
                                                                        },
                                                                        "ContractType": {
                                                                            "val": "FFP"
                                                                        },
                                                                        "MonthlyDeliveryScheduleList": {
                                                                            "MonthlyDeliverySchedule": [
                                                                                {
                                                                                    "ServiceAgencyName": {
                                                                                        "val": "Army"
                                                                                    },
                                                                                    "ProcQuantity": {
                                                                                        "val": "2"
                                                                                    },
                                                                                    "MonthlyDeliveryList": {
                                                                                        "MonthlyDelivery": [
                                                                                            {
                                                                                                "Month": {
                                                                                                    "val": "2016-12"
                                                                                                },
                                                                                                "Amount": {
                                                                                                    "val": "1.000"
                                                                                                }
                                                                                            },
                                                                                            {
                                                                                                "Month": {
                                                                                                    "val": "2017-03"
                                                                                                },
                                                                                                "Amount": {
                                                                                                    "val": "1.000"
                                                                                                }
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                }
                                                                            ]
                                                                        }
                                                                    }
                                                                ]
                                                            }
                                                        }
                                                    ]
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "New Equipment Training (NET)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.515"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.515"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Manuals"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "10.13"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "10.13"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SLEP Program Management\/Matrix Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "3.509"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.176"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.176"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Training Assets"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1.2"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.2"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "CurrentYear": {
                                                "val": "3.509"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "39.772"
                                            },
                                            "BudgetYearOne": {
                                                "val": "39.772"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "CurrentYear": {
                                            "val": "3.509"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "39.772"
                                        },
                                        "BudgetYearOne": {
                                            "val": "39.772"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "OverallHistoryPlanningRemarks": {
                        "val": "The Landing Craft Utility (LCU-2000) Service Life Extension Program (SLEP) is planned in two phases. The first phase (Phase I) will consist of up to 2 Low Rate Initial Production (LRIP) vessels, and 2 option vessels. This LRIP during FY 2016-2018 will be used for SLEP, ECP, TDP, NET Development, Test, Evaluation, Technical Manual (TM) Validation, and TM Verification. The second phase (Phase II) will consist of Full Rate Production (FRP) of LCU-2000 vessels in FY 2018-2022. The SLEP activities will update Main Propulsion, Bow Thruster, and Ships Service Generator diesel engines; upgrade Force Protection Equipment (new gun mounts and ballistic protection), and upgrade engineering systems (e.g. Air Conditioning System). Preparation for a full and open competitive contract is in process. Lead times are based on previous SLEP contracts.\n\nThe SLEP requirement moved to M11101 Army Watercraft Extended Service Program (ESP) line in FY 2014. The US Army Watercraft SLEP in prior fiscal years has been funded by MA4500."
                    },
                    "OverallDeliveryScheduleRemarks": {
                        "val": "Service Life Extension Program (SLEP) modifications are completed at commercial shipyards. The SLEP efforts for each vessel average nine months for completion."
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}