{
    "id": "520f1db44dd8e07e46f46c1e0bc21487df7e66b1",
    "meta": {
        "filename": "dod-2014_PROCUREMENT_2014_NAVY_MARINECORPS_PROCUREMENT_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_PROCUREMENT_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6518"
        },
        "LineItemTitle": {
            "val": "Amphibious Support Equipment"
        },
        "P1LineNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Engineer And Other Equipment"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "144.557"
                },
                "PriorYear": {
                    "val": "5.533"
                },
                "CurrentYear": {
                    "val": "13.089"
                },
                "BudgetYearOneBase": {
                    "val": "4.827"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.827"
                },
                "BudgetYearTwo": {
                    "val": "7.897"
                },
                "BudgetYearThree": {
                    "val": "5.749"
                },
                "BudgetYearFour": {
                    "val": "5.36"
                },
                "BudgetYearFive": {
                    "val": "5.453"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "144.557"
                },
                "PriorYear": {
                    "val": "5.533"
                },
                "CurrentYear": {
                    "val": "13.089"
                },
                "BudgetYearOneBase": {
                    "val": "4.827"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.827"
                },
                "BudgetYearTwo": {
                    "val": "7.897"
                },
                "BudgetYearThree": {
                    "val": "5.749"
                },
                "BudgetYearFour": {
                    "val": "5.36"
                },
                "BudgetYearFive": {
                    "val": "5.453"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "144.557"
                },
                "PriorYear": {
                    "val": "5.533"
                },
                "CurrentYear": {
                    "val": "13.089"
                },
                "BudgetYearOneBase": {
                    "val": "4.827"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.827"
                },
                "BudgetYearTwo": {
                    "val": "7.897"
                },
                "BudgetYearThree": {
                    "val": "5.749"
                },
                "BudgetYearFour": {
                    "val": "5.36"
                },
                "BudgetYearFive": {
                    "val": "5.453"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206623M"
                }
            ]
        },
        "ComponentSplit": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Navy Active"
                        },
                        "Cost": {
                            "PriorYear": {
                                "TotalCost": {
                                    "val": "5.533"
                                }
                            },
                            "CurrentYear": {
                                "TotalCost": {
                                    "val": "13.089"
                                }
                            },
                            "BudgetYearOneBase": {
                                "TotalCost": {
                                    "val": "3.929"
                                }
                            },
                            "BudgetYearOne": {
                                "TotalCost": {
                                    "val": "3.929"
                                }
                            },
                            "BudgetYearTwo": {
                                "TotalCost": {
                                    "val": "7.697"
                                }
                            },
                            "BudgetYearThree": {
                                "TotalCost": {
                                    "val": "5.549"
                                }
                            },
                            "BudgetYearFour": {
                                "TotalCost": {
                                    "val": "5.16"
                                }
                            },
                            "BudgetYearFive": {
                                "TotalCost": {
                                    "val": "5.253"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Navy Reserve"
                        },
                        "Cost": {
                            "BudgetYearOneBase": {
                                "TotalCost": {
                                    "val": "0.898"
                                }
                            },
                            "BudgetYearOne": {
                                "TotalCost": {
                                    "val": "0.898"
                                }
                            },
                            "BudgetYearTwo": {
                                "TotalCost": {
                                    "val": "0.2"
                                }
                            },
                            "BudgetYearThree": {
                                "TotalCost": {
                                    "val": "0.2"
                                }
                            },
                            "BudgetYearFour": {
                                "TotalCost": {
                                    "val": "0.2"
                                }
                            },
                            "BudgetYearFive": {
                                "TotalCost": {
                                    "val": "0.2"
                                }
                            }
                        }
                    }
                ]
            }
        },
        "Description": {
            "val": "Amphibious Support Equipment supports multiple capabilities, enhancements, life cycle replacements and personnel equipment shortfalls when required and as needed by reconnaissance units throughout operating forces for airborne\/parachuting programs, specialized reconnaissance programs and underwater reconnaissance capability programs.  This includes: (1) the Family of Raid\/Recon Equipment (FRRE) program, a roll-up line with multiple specialized raid projects encompassing the close quarter battle ensemble used in various Marine units and parachuting equipment used for reconnaissance in support of Marine Air Ground Task Force (MAGTF) operations; (2) the Joint Precision Air Drop System (JPADS) program which provides capability for increased air carrier survivability, ground accuracy, standoff delivery, and improved effectiveness and assessment feedback for airdrop missions with procurement of parachute delivery systems consisting of a decelerator (parachute) guided by an Autonomous Guidance Unit attached to a Container Delivery System that interfaces with cargo aircraft for autonomous delivery of airborne cargo from high altitudes and lateral separation to predetermined small drop zones; and (3) the Underwater Reconnaissance Capability (URC) program, an overarching Family of Systems which sustains\/enhances\/supports capabilities of current and future combatant diving systems and small craft as needed and when required by the fleet to include Combat Rubber Reconnaissance Craft (CRRC), Underwater Breathing Apparatus (UBA), Combatant Diver Full Face Mask (CDFFM), Waterproof Bag System (WBS), Expeditionary Hyperbaric Chamber System (EHCS), Non-gasoline Burning Outboard Engine (NBOE), and the Tactical Hydrographic Survey Equipment (THSE) in support of MAGTF expeditionary operations."
        },
        "Justification": {
            "val": "FY2012 Base Appropriation Request:  $5.533M\n\nFamily of Raid\/Recon Equipment (FRRE) $3.253M - Funding procured various equipment to include kits, component sets, ancillary equipment and support to enhance means to systemize equipment and increase combat multipliers, survivability, durability and functionality over that of the current inventory items.  FY12 efforts included Tandem Offset Resupply Delivery Systems (TORDS) components to replace reserve canopies going out of service; a safety upgrade to the reserve canopy deployment method; a safer military tethered bundle system; and low-cost deployment bags for use in converting personnel canopies into low cost cargo canopies for use in humanitarian relief and Marine Air Ground Task Force (MAGTF) operations.\n\nJoint Precision Air Drop System (JPADS)  $0.693M - Funding procured the JPADS Family of Systems consisting of end items, component pieces and support for variants based on gross rigged weight to interface with cargo aircraft for autonomous delivery of airborne cargo.  FY12 funding procured JPADS 10,000 pound variant (JPADS 10K) Systems.\n\nUnderwater Reconnaissance Capability (URC)  $1.587M - Funding procured URC Family of Systems equipment to sustain, enhance, and support capabilities of current and future combatant diving systems and small craft.  FY12 efforts included procurement of Tactical Hydrographic Survey Equipment (THSE) production representative articles leading to FY13 procurement and small craft trailers for transport, launch, recovery and storage of USMC Open Water Safety Craft.\n\nFY2013 Base Appropriation Request:  $13.089M\n\nFamily of Raid\/Recon Equipment (FRRE)  $3.288M - Funding procures various equipment to include kits, component sets, ancillary equipment and support to enhance means to systemize equipment and increase combat multipliers, survivability, durability and functionality over that of the current inventory items.  FY13 efforts include procurement of Parachuting and Special Purpose Equipment Authorized Acquisition Objective (AAO) increases for Multi-Mission Parachute Systems (MMPS) and MC-7 Parachute Systems.   \n\nUnderwater Reconnaissance Capability (URC) $9.801M - Funding procures URC Family of Systems equipment to sustain, enhance, and support capabilities of current and future combatant diving systems and small craft.  Increase to funding profile for FY13 is for procurement of THSE which provides electronic subsurface hydrographic charting of landing beach approach lanes, and procurement of additional CRRC life cycle replacements.\n\nFY2014 Base Appropriation Request:  $4.827M\n\nFamily of Raid\/Recon Equipment (FRRE)  $2.767M - Funding will procure various equipment to include kits, component sets, ancillary equipment and support to enhance means to systemize equipment and increase combat multipliers, survivability, durability and functionality over that of the current inventory items.  FY14 efforts will include AAO increases for TORDS and life cycle replacements for Cybernetic Parachute Release System (CYPRES) Automatic Activation Devices for Military Free-Fall Parachutes.  CYPRES 1 will be replaced by CYPRES 2; a more durable system with decreased maintenance requirements and enhanced safety of high altitude\/high opening and high altitude\/low opening operational parachute missions for the Marine Corps Military Free-Fall community.  \n\nUnderwater Reconnaissance Capability (URC) $2.060M - Funding will procure URC Family of Systems equipment to sustain, enhance, and support capabilities of current and future combatant diving systems and small craft.  Decrease in FY14 funding profile reflects reduced THSE procurements."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Amphibious Support Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "@footnote": "Line includes various quantities for multiple parachute and special purpose equipment kits, component sets, ancillary equipment and support as needed to sustain\/enhance Marine Corps unique Airborne, Close Quarters Battle Equipment, and Helicopter Support Equipment capabilities.   ",
                                    "val": "1) FAMILY OF RAID RECONNAISSANCE EQUIPMENT (FRRE)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) FAMILY OF RAID RECONNAISSANCE EQUIPMENT (FRRE)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "31.864"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.253"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.288"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.567"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.567"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) FRRE Reserves"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.2"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "Family of Systems line consisting of various quantities of kits and components for several variants of parachute delivery systems.   ",
                                    "val": "2) JOINT PRECISION AIR DROP SYSTEM (JPADS)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) JOINT PRECISION AIR DROP SYSTEM (JPADS)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "18.845"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.693"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "Overarching Family of Systems line includes various quantities of multiple dive and boat systems, components, ancillary equipment and support as needed to sustain\/enhance amphibious capability.   ",
                                    "val": "3) UNDERWATER RECONNAISSANCE CAPABILITY"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Underwater Reconnaissance Capability (FY 13) includes funding for procurement of Tactical Hydrographic Survey Equipment.",
                                                "val": "3.1) UNDERWATER RECONNAISSANCE CAPABILITY"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "15.073"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.587"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "9.801"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.362"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.362"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.2) URC Reserves"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.698"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.698"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) Other Prior Year"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) Other Prior Year"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "78.775"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            },
            "suppressP40As": {
                "val": "false"
            }
        }
    }
}