{
    "id": "5cf101de4fee819ee5c40d45cb8ff6fe3bb8ea93",
    "meta": {
        "filename": "dod-2014_PROCUREMENT_2014_NAVY_MARINECORPS_PROCUREMENT_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_PROCUREMENT_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "2208"
        },
        "LineItemTitle": {
            "val": "Weapons Enhancement Program"
        },
        "P1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Weapons and combat vehicles"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "77.707"
                },
                "PriorYear": {
                    "val": "13.795"
                },
                "CurrentYear": {
                    "val": "4.537"
                },
                "BudgetYearOneBase": {
                    "val": "4.734"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.734"
                },
                "BudgetYearTwo": {
                    "val": "31.811"
                },
                "BudgetYearThree": {
                    "val": "18.99"
                },
                "BudgetYearFour": {
                    "val": "19.175"
                },
                "BudgetYearFive": {
                    "val": "19.518"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "77.707"
                },
                "PriorYear": {
                    "val": "13.795"
                },
                "CurrentYear": {
                    "val": "4.537"
                },
                "BudgetYearOneBase": {
                    "val": "4.734"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.734"
                },
                "BudgetYearTwo": {
                    "val": "31.811"
                },
                "BudgetYearThree": {
                    "val": "18.99"
                },
                "BudgetYearFour": {
                    "val": "19.175"
                },
                "BudgetYearFive": {
                    "val": "19.518"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "77.707"
                },
                "PriorYear": {
                    "val": "13.795"
                },
                "CurrentYear": {
                    "val": "4.537"
                },
                "BudgetYearOneBase": {
                    "val": "4.734"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.734"
                },
                "BudgetYearTwo": {
                    "val": "31.811"
                },
                "BudgetYearThree": {
                    "val": "18.99"
                },
                "BudgetYearFour": {
                    "val": "19.175"
                },
                "BudgetYearFive": {
                    "val": "19.518"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206623M"
                }
            ]
        },
        "ComponentSplit": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Navy Active"
                        },
                        "Cost": {
                            "PriorYear": {
                                "TotalCost": {
                                    "val": "13.795"
                                }
                            },
                            "CurrentYear": {
                                "TotalCost": {
                                    "val": "4.537"
                                }
                            },
                            "BudgetYearOneBase": {
                                "TotalCost": {
                                    "val": "4.734"
                                }
                            },
                            "BudgetYearOne": {
                                "TotalCost": {
                                    "val": "4.734"
                                }
                            },
                            "BudgetYearTwo": {
                                "TotalCost": {
                                    "val": "22.816"
                                }
                            },
                            "BudgetYearThree": {
                                "TotalCost": {
                                    "val": "18.99"
                                }
                            },
                            "BudgetYearFour": {
                                "TotalCost": {
                                    "val": "14.226"
                                }
                            },
                            "BudgetYearFive": {
                                "TotalCost": {
                                    "val": "14.463"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Navy Reserve"
                        },
                        "Cost": {
                            "BudgetYearTwo": {
                                "TotalCost": {
                                    "val": "8.995"
                                }
                            },
                            "BudgetYearFour": {
                                "TotalCost": {
                                    "val": "4.949"
                                }
                            },
                            "BudgetYearFive": {
                                "TotalCost": {
                                    "val": "5.055"
                                }
                            }
                        }
                    }
                ]
            }
        },
        "Description": {
            "val": "The Weapons Enhancement Program provides funding for various force protection items and weapon upgrades. The program funds urgently required commercially available equipment and non-developmental items (NDI) that can be rapidly fielded to support the Operating Forces such as the Family of Ballistic Protection Systems which includes Full Spectrum Battlefield Equipment (FSBE), Marine Enhancement Program (MEP), Escalation of Force - Equipment (EoF-E) and Ocular Interruption (OI).  FSBE is used to address the needs of Marines performing Special Operations Capable missions in Maritime Special Purpose Force (MSPF) (i.e. MSPF detachment and helicopter Assault Company).  Less weight, increased positive buoyancy, spare air source, and a cutaway system are all desired quality changes under this program.  MEP is a Congressionally initiated program that provides an avenue for obtaining equipment and end items that would otherwise be considered low visibility, low cost. The MEP Program funding focuses on equipment that will benefit the individual Marine by reducing load, increasing survivability, enhancing safety, and improving combat effectiveness.  Ocular Interruption (OI) is the replacement of the 'Dazzling Laser' program for the LA-9\/P and the Glare Mount 532P-M (Mini Green) laser.  OI is a \"Non-damaging\" dazzling system that will be used in Escalation of Force Missions to provide a non-lethal, force protection capability to warn and visually suppress targeted personnel at ranges from 10 to 500 meters.  Escalation of Force Equipment (EoF-E) is a mod (level-of-effort) funding line to support\/sustain all fielded Escalation of Force (EoF) equipment and capabilities.  Additionally, EoF-E supports type-classification, testing and procurement of new advancements and technologies to provide an increased capability over existing or outdated equipment currently or associated in the Escalation of Force Mission Modules (EoF-MMs)."
        },
        "Justification": {
            "val": "FY 2012 Base Appropriation Request:  $13.795M\n\n$9.157M Family of Ballistic Protection Systems includes Full Spectrum Battlefield Equipment (FSBE). FSBE is used to address the needs of Marines performing Special Operations Capable missions in Maritime Special Purpose Force (MSPF) (i.e. MSPF detachment and helicopter Assault Company). Less weight, increased positive buoyancy, spare air source, and a cutaway system are all desired quality changes. The FSBE has 2 variants (Individual & Platoon), both of which have 4 configurations (A, B, C & D). Each configuration contains up to 43 components purchased from 6 different vendors with various unit prices and different production schedules.  Funding used to procure Type II (MICH) fragmentation Helmets and hardware Kits as part of FSBE.\n\n$3.266M Marine Enhancement Program (MEP) is a Congressionally initiated program that provides an avenue for obtaining equipment and end items that would otherwise be considered low visibility, low cost. Funding used for product verification testing and training for squad level\/combat load effectiveness in OEF simulated environment. \n\n$1.372M Escalation of Force - Equipment (EoF-E) funding used to support the acquisition, logistics and lifecycle support for all Marine Escalation of Force - Mission Modules (EoF-MM's), LA-9\/P Lasers, Mini-Green Lasers, and Non-Lethal\/Tube Launched Munitions System (NL\/TLMS) capabilities.  \n\nFY 2013 Base Appropriation Request: $4.537M\n\n$2.876M Marine Enhancement Program (MEP) is a Congressionally initiated program that provides an avenue for obtaining equipment and end items that would otherwise be considered low visibility, low cost items.  This program is coordinated with the Army's Soldier Enhancement Program and the Special Operations Command.  Funding procures Small Arms Collimators.  \n\n$1.661M Escalation of Force - Equipment (EoF-E) funding will continue to support the acquisition, logistics and lifecycle support of all legacy Non-Lethal and Force Protection capabilities while procuring new technologies in order to maintain the Marine Corps ability to execute EoF missions effectively and while continuing to reduce civilian casualties. \n\nFY 2014 Base Appropriation Request: $4.734M\n\n$1.313M Marine Enhancement Program (MEP) is a Congressionally initiated program that provides an avenue for obtaining equipment and end items that would otherwise be considered low visibility, low cost. This program is coordinated with the Army's Soldier Enhancement Program and the Special Operations Command.  Based on the mission and the nature of the MEP as an accelerated acquisition process the future MEP candidate submissions\/selections will determine the projected projects we may fund for FY14 which are yet to be determined.\n\n$1.119M Escalation of Force-Equipment (EoF-E) funding will be used to apply modifications to the existing EoF-MM systems in order to ensure that the latest technology is being used in the operating forces.  Specifically new technologies such as solar power, two way translation devices, upgraded mounting brackets for Magnetic Acoustic Devices, and explosion detection sets will be evaluated and procured to ensure the Warfighter has the latest and best gear to accomplish their mission.\n\n$2.302M Ocular Interruption (OI) is the replacement of the 'Dazzling Laser' program for the LA-9\/P and the Glare Mount 532P-M (Mini Green) laser.  FY14 funding will be used to support procurement of a \"Non-damaging\" dazzling system that will be used in Escalation of Force Missions to provide a non-lethal, force protection capability to warn and visually suppress targeted personnel at ranges from 10 to 500 meters."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Weapons Enhancement Program"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Full Spectrum Battlefield Equipment (FSBE)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Individual Kit (Configuration A)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "36.774"
                                                    },
                                                    "PriorYear": {
                                                        "val": "9.152"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) Engineering Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.005"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.005"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) Marine Enhancement Program (MEP)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) MEP"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "21.675"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.266"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.876"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.313"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.313"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) Escalation of Force-Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) Escalation of Force-Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "19.253"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.372"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.661"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.119"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.119"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) Ocular Interruption"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) Ocular Interruption"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.2) Ocular Interruption Acq\/Log CEOSS Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.35"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.35"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.3) Ocular Interruption Engineering Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.952"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.952"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.4) Ocular Interruption Fielding Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) Mission Payload Module"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.1) Mission payload Module"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "5.2) Mission Payload Module-Acq\/Log CEOSS Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "5.3) Mission Payload Module-Engineering Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "5.4) Mission Payload Module-Training Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "5.5) Mission Payload Module-Fielding Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "6) Mission Payload Module - Reserves"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "6.1) MPM - Reserves"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "6.2) MPM - Reserves Fielding Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "7) Disable Point Target"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "7.1) Disable Point Target"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            },
            "suppressP40As": {
                "val": "false"
            }
        }
    }
}