{
    "id": "963ab57ad8d138f67fcade4a8d254cac1a917bbf",
    "meta": {
        "filename": "dod-2014_PROCUREMENT_2014_ARMY_AIRCRAFT_PROCUREMENT_JustificationBook_Army_PB_2014.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2031A",
        "appropriation_name": "Aircraft Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "AA0050"
        },
        "LineItemTitle": {
            "val": "Air Traffic Control"
        },
        "P1LineNumber": {
            "val": "33"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2031A"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Support Equipment and Facilities"
        },
        "BudgetSubActivityNumber": {
            "val": "30"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support"
        },
        "ResourceSummary": {
            "Quantity": {
                "CurrentYear": {
                    "val": "4"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "993.663"
                },
                "PriorYear": {
                    "val": "114.844"
                },
                "CurrentYear": {
                    "val": "47.235"
                },
                "BudgetYearOneBase": {
                    "val": "79.692"
                },
                "BudgetYearOne": {
                    "val": "79.692"
                },
                "BudgetYearTwo": {
                    "val": "116.026"
                },
                "BudgetYearThree": {
                    "val": "100.999"
                },
                "BudgetYearFour": {
                    "val": "101.629"
                },
                "BudgetYearFive": {
                    "val": "114.227"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "GrossWeaponSystemUnitCost": {
                "CurrentYear": {
                    "val": "11808.75"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "993.663"
                },
                "PriorYear": {
                    "val": "114.844"
                },
                "CurrentYear": {
                    "val": "47.235"
                },
                "BudgetYearOneBase": {
                    "val": "79.692"
                },
                "BudgetYearOne": {
                    "val": "79.692"
                },
                "BudgetYearTwo": {
                    "val": "116.026"
                },
                "BudgetYearThree": {
                    "val": "100.999"
                },
                "BudgetYearFour": {
                    "val": "101.629"
                },
                "BudgetYearFive": {
                    "val": "114.227"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "993.663"
                },
                "PriorYear": {
                    "val": "114.844"
                },
                "CurrentYear": {
                    "val": "47.235"
                },
                "BudgetYearOneBase": {
                    "val": "79.692"
                },
                "BudgetYearOne": {
                    "val": "79.692"
                },
                "BudgetYearTwo": {
                    "val": "116.026"
                },
                "BudgetYearThree": {
                    "val": "100.999"
                },
                "BudgetYearFour": {
                    "val": "101.629"
                },
                "BudgetYearFive": {
                    "val": "114.227"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0604633A"
                }
            ]
        },
        "ComponentSplit": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "PriorYear": {
                                "TotalCost": {
                                    "val": "114.844"
                                }
                            },
                            "CurrentYear": {
                                "Quantity": {
                                    "val": "4"
                                },
                                "TotalCost": {
                                    "val": "47.235"
                                }
                            },
                            "BudgetYearOneBase": {
                                "TotalCost": {
                                    "val": "79.692"
                                }
                            },
                            "BudgetYearOne": {
                                "TotalCost": {
                                    "val": "79.692"
                                }
                            },
                            "BudgetYearTwo": {
                                "TotalCost": {
                                    "val": "116.026"
                                }
                            },
                            "BudgetYearThree": {
                                "TotalCost": {
                                    "val": "100.999"
                                }
                            },
                            "BudgetYearFour": {
                                "TotalCost": {
                                    "val": "101.629"
                                }
                            },
                            "BudgetYearFive": {
                                "TotalCost": {
                                    "val": "114.227"
                                }
                            }
                        }
                    }
                ]
            }
        },
        "Description": {
            "val": "Tactical Air Traffic Control (ATC) equipment includes Air Traffic Navigation Integration and Coordination System (ATNAVICS), Tactical Airspace Integration System (TAIS) to include TAIS Airspace Workstation (AWS), Tactical Terminal Control System (TTCS), and Mobile Tower System (MOTS). ATNAVICS provides all weather instrument flight capabilities to include terminal, radar precision approach and landing services to all Army, Joint, and allied aircraft. ATNAVICS preplanned product improvements (P3I) include Mode 5\/S (friend\/foe identification), improved radio communications, ATNAVICS\/TAIS Air Picture Integration to improve commander situational awareness, Information Assurance and computer and hardware upgrades. TAIS, a digitized battlefield automated system of the Army Mission Command System, performs enroute Air Traffic Services (ATS) and Airspace Command and Control (AC2) at brigade to theater commands. TAIS P3I includes Friendly Force Tracker (FFT) and Link 16\/Tactical Digital Information Link (TADIL-J) upgrades that improve the reliability and usability of the air picture. FFT provides a fused air picture from multiple sensors. Link 16\/TADIL-J upgrades ensure that TAIS remains compatible with the Department of Defense (DOD) standards for these data links and continues to receive joint air track data from the Link 16 network for situational awareness. TAIS AWS provides for AC2 planning and execution at the Brigade Combat Team (BCT) and above. It is the Army's link to the Theater Battle Management Core System for Joint Airspace Management. TAIS and TAIS AWS provide an automated AC2 and ATS capability for current requirements and Battle Command interfaces. TTCS provides enhanced ATS communications support to aviation assets conducting reconnaissance, maneuver, medical evacuation, logistics, intelligence operations across the battlefield and remote capability up to 1 kilometer. MOTS provides positive air traffic control and aircraft separation for both air and ground operations at tactical or remote landing sites. Its capabilities include weather information, secure and anti-jam communications across all required frequency bands and ranges, and precision location. ATNAVICS, TAIS, and MOTS serve as effective air traffic risk management tools for aviation safety during night, inclement weather, and combat operations. ATC Common Tactical Simulator can simulate a start to finish ATC scenario, meaning simulation at the airfield for take-off\/landing under Visual Flight Rules, radar simulation for surveillance and precision approach, and flight following and airspace deconfliction. This will address the three primary tactical ATC systems (TAIS, ATNAVICS, MOTS). Fixed Base ATC requirements will be met through a vast array of new technology solutions resulting in highly reliable and safe ATC systems in accordance with the Joint DoD\/Federal Aviation Administration (FAA) program to modernize the National Airspace System (NAS) and the FAA Next Gen program. This includes upgrading and automating the complete infrastructure by systematically replacing antiquated analog systems with installation of state of the art digital technology. These systems include DoD Advanced Automation System (DAAS), Digital Airport Surveillance Radar (DASR), Voice Recorder Replacement Program (VRRP), Army Airfield Automation System (AAAS), and Radio and Antenna replacement program. The Fixed Base Precision Approach Radar (FBPAR) is the Army's primary ground controlled precision approach capability to provide recovery operations for aircraft to fixed base airfields during adverse weather conditions. FBPAR P3I includes upgrading the computer capabilities, installing coolant upgrades and resolving obsolescence issues."
        },
        "Justification": {
            "val": "FY 2014 Base procurement dollars in the amount of $79.692 million provide for the acquisition of MOTS units, and support tactical and fixed base ATC systems and P3I to these systems.  Funds for tactical ATC systems provide for upgrades, modifications, to TAIS, ATNAVICS, TTCS, and MOTS. ATNAVICS upgrades will address joint interoperability and networking capabilities, as well as Information Assurance requirements, improved radio communications, and integrating the TPX-57 to interrogate Mode 5\/S equipped aircraft. These modifications will allow the ATNAVICS to transmit critical air picture information to TAIS. TAIS airspace management functions will be modified as web services that will be available throughout the tactical network via a common server to properly credentialed users.  TAIS airspace management web services will support ATS and Airspace Integration Improvement Initiatives with expanded interfaces and collaboration capabilities. TTCS will integrate remote capability in accordance with the Operational Requirements Document specifications for force protection. TTCS funding will also support development of logistics products (Modification Work Orders, Technical Manuals, and drawing packages). These modifications to tactical ATC systems ensure Army ATC and Army airspace command and control systems are capable of supporting the path ahead to the Future Force. Funds will provide interim contractor support, engineering services and P3I for the procured MOTS units. Funds for the ATC Common Tactical Simulator will provide an ATC simulator for ATC training and continued operator proficiency.  The simulator provides the capability to respond to voice commands and allows for capture and analysis of controller errors, and provides corrective actions to the operator. Navigational Control Aids include the AAAS and Radio\/Antenna systems. These funds also procure radio and antenna systems, P3I for DAAS, AAAS installs, modifications of FBPAR systems, and fund the Army joint service capability required for the DoD\/FAA modernization and upgrade of the NAS via the Next Gen program. These systems will save significant Operational and Support costs by replacing old, obsolete analog radars, and automation systems with highly reliable modern and compliant ATC systems in towers and approach control facilities. Radios will meet current and emerging spectrum management requirements. Equipment quantity and configuration is tailored to meet specific site requirements, resulting in varying unit costs. Funding ensures compliance and interoperability between the Army, Joint, and FAA systems.\n\nAll COMPO 1 Active\n\nNOTE:  FY13 quantity should be ZERO.\n\nIn accordance with section 1815 of the FY 2008 National Defense Authorization Act  P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses and providing military support to civil authorities."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Air Traffic Control"
                    },
                    "ItemNumber": {
                        "val": "AA0050"
                    },
                    "ComponentSplit": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "114.844"
                                            }
                                        },
                                        "CurrentYear": {
                                            "Quantity": {
                                                "val": "4"
                                            },
                                            "TotalCost": {
                                                "val": "47.235"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "79.692"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "79.692"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "Quantity": {
                            "CurrentYear": {
                                "val": "4"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        },
                        "GrossWeaponSystemCost": {
                            "AllPriorYears": {
                                "val": "993.663"
                            },
                            "PriorYear": {
                                "val": "114.844"
                            },
                            "CurrentYear": {
                                "val": "47.235"
                            },
                            "BudgetYearOneBase": {
                                "val": "79.692"
                            },
                            "BudgetYearOne": {
                                "val": "79.692"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        },
                        "GrossWeaponSystemUnitCost": {
                            "CurrentYear": {
                                "val": "11808.75"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "993.663"
                            },
                            "PriorYear": {
                                "val": "114.844"
                            },
                            "CurrentYear": {
                                "val": "47.235"
                            },
                            "BudgetYearOneBase": {
                                "val": "79.692"
                            },
                            "BudgetYearOne": {
                                "val": "79.692"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "993.663"
                            },
                            "PriorYear": {
                                "val": "114.844"
                            },
                            "CurrentYear": {
                                "val": "47.235"
                            },
                            "BudgetYearOneBase": {
                                "val": "79.692"
                            },
                            "BudgetYearOne": {
                                "val": "79.692"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Fixed Base Precision Approach Radar"
                                                },
                                                "Cost": {
                                                    "AllPriorYears": {
                                                        "TotalCost": {
                                                            "val": "90.291"
                                                        }
                                                    },
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "2.12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "0.584"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "1.792"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "1.792"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DoD Advanced Automation System (DAAS)"
                                                },
                                                "Cost": {
                                                    "AllPriorYears": {
                                                        "TotalCost": {
                                                            "val": "79.003"
                                                        }
                                                    },
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "10.381"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "5.322"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "3.165"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "3.165"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Digital Airport Surveillance Radar(DASR)"
                                                },
                                                "Cost": {
                                                    "AllPriorYears": {
                                                        "TotalCost": {
                                                            "val": "83.706"
                                                        }
                                                    },
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "1.032"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "1.389"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tactical Airspace Integration Sys (TAIS)"
                                                },
                                                "Cost": {
                                                    "AllPriorYears": {
                                                        "TotalCost": {
                                                            "val": "312.573"
                                                        }
                                                    },
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "26.063"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "13.819"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "13.811"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "13.811"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Air Traffic Navigation and Integration"
                                                },
                                                "Cost": {
                                                    "AllPriorYears": {
                                                        "TotalCost": {
                                                            "val": "342.012"
                                                        }
                                                    },
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "21.613"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "14.476"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "12.403"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "12.403"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Navigational Control Aids"
                                                },
                                                "Cost": {
                                                    "AllPriorYears": {
                                                        "TotalCost": {
                                                            "val": "14.285"
                                                        }
                                                    },
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "10.861"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "1.877"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "1.384"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "1.384"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tactical Terminal Control System (TTCS)"
                                                },
                                                "Cost": {
                                                    "AllPriorYears": {
                                                        "TotalCost": {
                                                            "val": "40.247"
                                                        }
                                                    },
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "2.295"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "1.225"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "5.43"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "5.43"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Mobile Tower System (MOTS)"
                                                },
                                                "Cost": {
                                                    "AllPriorYears": {
                                                        "TotalCost": {
                                                            "val": "31.546"
                                                        }
                                                    },
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "39.374"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "7.655"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "40.886"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "40.886"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Common Tactical Simulator"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "1.105"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "0.888"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "0.821"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "0.821"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": []
    }
}