{
    "id": "315a453c6a4530e8db41685948cda6bafbb32fb4",
    "meta": {
        "filename": "dod-2014_RDTE_2014_NAVY_BA1_3_RDTE_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602236N"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Sustainment Applied Res"
        },
        "R1LineItemNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "97.107"
            },
            "CurrentYear": {
                "val": "44.127"
            },
            "BudgetYearOne": {
                "val": "49.689"
            },
            "BudgetYearOneBase": {
                "val": "49.689"
            },
            "BudgetYearTwo": {
                "val": "48.950"
            },
            "BudgetYearThree": {
                "val": "49.104"
            },
            "BudgetYearFour": {
                "val": "49.041"
            },
            "BudgetYearFive": {
                "val": "49.920"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Applied Research (PE 0602750N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.2 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE supports innovation-based efforts that will provide technology options for future Navy and Marine Corps capabilities.  Efforts focus on advanced Naval materials; biocentric technologies; environmental quality; human factors and organizational design; medical technologies; and Naval training technologies. Within the Naval Transformation Roadmap, this investment maps to future transformational capabilities and the FORCEnet pillar of the Chief of Naval Operations and the Commandant of the Marine Corps vision for the future -- Naval Power 21. \n\nThe ONRG International Science Program mission is to search the globe for emerging scientific research and advanced technologies to enable the Office of Naval Research (ONR) and the NRE to address effectively the current needs of the Fleet\/Forces, and investigate and assess revolutionary, high-payoff technologies for future Naval missions and capabilities. Within this Global mission, funding for the Naval Science Advisor Program ensures the Fleet\/Force (F\/F) helps shape the Department of the Navy (DoN) investment in Science and Technology (S&T), develops teaming\nrelationships to rapidly demonstrate and transition technology, supports development of technology-based capability options for naval forces, and enables warfighting innovations based on technical and conceptual possibilities. Science Advisors provide insight into issues associated with Naval Warfighting Capabilities that influence S&T program decision making. The program develops leaders among civilian scientists and engineers in the Naval Research Enterprise (NRE). Upon completion of their tours, Science Advisors return to the NRE with first hand knowledge of the F\/F, warfighting issues, and strategic decision making. The Office of Naval Research (ONR) Science Advisor program enables continuous communication and collaboration between the warfighters, the technical community, and strategic development commands. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "101.072"
                },
                "CurrentYear": {
                    "val": "44.127"
                },
                "BudgetYearOne": {
                    "val": "45.420"
                },
                "BudgetYearOneBase": {
                    "val": "45.420"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "97.107"
                },
                "CurrentYear": {
                    "val": "44.127"
                },
                "BudgetYearOne": {
                    "val": "49.689"
                },
                "BudgetYearOneBase": {
                    "val": "49.689"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.965"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.269"
                },
                "BudgetYearOneBase": {
                    "val": "4.269"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.727"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.238"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.269"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.269"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Sustainment Applied Res"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "97.107"
                        },
                        "CurrentYear": {
                            "val": "44.127"
                        },
                        "BudgetYearOne": {
                            "val": "49.689"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.689"
                        },
                        "BudgetYearTwo": {
                            "val": "48.950"
                        },
                        "BudgetYearThree": {
                            "val": "49.104"
                        },
                        "BudgetYearFour": {
                            "val": "49.041"
                        },
                        "BudgetYearFive": {
                            "val": "49.920"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE supports the FNCs of Littoral Combat\/Power Projection, Capable Manpower, Force Health Protection Future Capability, Enterprise and Platform Enablers (EPE) FNC; and innovation-based efforts that will provide technology options for future Navy and Marine Corps capabilities. Efforts focus on manpower and personnel; Naval systems training and education; human systems integration; littoral combat and power projection capabilities; advanced naval materials; medical technologies; environmental quality; biocentric technologies; high speed sealift; cost reduction technologies; and Sea Basing technologies. Within the Naval Transformation Roadmap, this investment supports eight transformational capabilities within the \"Sea Strike\", \"Sea Shield\", and \"Sea Basing\" operational concepts; the critical human\nsystem, \"Sea Warrior\"; and Naval business efficiencies within \"Sea Enterprise.\"\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ADVANCED NAVAL MATERIALS"
                                    },
                                    "Description": {
                                        "val": "Advanced Naval Materials efforts include: developing advanced, high-performance materials; developing processes to reduce weight and cost; and developing enhanced sonar transducers.\n\nThe Office of Naval Research Global (ONRG) has a presence overseas, and a mission to search the globe for promising, emerging scientific research and advanced technologies to enable the Office of Naval Research to effectively address current needs of the Fleet and Force. This includes discovering the best science, such as innovative fundamental research which could help shape future naval investments and strategies, and leveraging great minds globally with positive engagement to support the Sailors & Marines of today and tomorrow. \n \nThe decrease of funding from FY 2013 to FY 2014 is due to the consolidation of international research efforts into a new R2 activity within this PE entitled ONR Global.  This new R2 activity provides greater visibility for Naval international collaboration and research efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.212"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued multi-laser-processing technique development for the fabrication of ultra hard materials for wear resistance applications. \n- Continued development of advanced, cost-efficient joining of titanium for >25% weight reduction of large seaborne structures. \n- Continued development of advanced composites and polymers with fire resistance for ship structures. \n- Continued development of nanotube reinforced composite materials for next generation air and naval platforms. \n- Continued development of acceptance testing methodologies for advanced transducer, single-crystal, high-strain materials and definition of standardized materials properties and composition ranges. \n- Continued development of compositional tuning of single-crystal, high-strain transducer materials, for specialized naval system applications. \n- Continued development of cavitation resistant ship rudder coatings based on the FY 2004 shipboard coating study. \n- Continued marine titanium alloy design and processing development, exploiting anticipated cost reductions for high performance, reduced maintenance naval applications. \n- Continued development of continuous, single wall, carbon nanotube composite materials for next generation air and naval platforms. \n- Continued stainless steel carburization study to enhance corrosion performance. \n- Continued development of surface preparation methods and characterization of corrosion performance for future naval ship materials. \n- Continued evaluation of low temperature, carburized materials for marine application. \n- Continued development of coating performance and knowledge database for Naval use. \n- Continued development of mechanistic model for stress corrosion cracking in Nickel Aluminum Bronze (NAB). \n- Continued development of innovative sonar transducers based on high-strain, high-coupling, piezoelectric single crystals. \n- Continued development of integrated structural composites with blast resistance, manufacturing technologies, and low-cost organic resins with improved fire resistance. \n- Continued development of novel processing technologies for increasing the fatigue strength and corrosion resistance of weldments for ship structures with reduced weight and maintenance requirements. \n- Continued development of materials processing methods for single crystal piezoelectrics to make strong, robust sonar transducers. \n- Continued development of models and characterization methods for dynamic loading (water slamming and blast loading) in polymer composite materials. - Continued acoustic damping coatings for ship tank application. \n- Continued development of portable, real-time, Non-Destructive Examination (NDE)\/Non-Destructive Inspection (NDI) technology for heat damage detection in composite materials. \n- Continued development of fiber-optic sensors, transducers and demodulation technology for structural health monitoring of ships and submarines. \n- Continued development of continuous based monitoring techniques of new synthetic fuels and lubricants based on electromagnetic signature analysis.\n- Continued development and application of distributed fiber optic Bragg gratings for structural health monitoring of ships and aircrafts. \n- Continued development of novel growth methods to specialized single crystal transducer materials tuned to requirements of specialized naval systems. \n- Continued assessment of the degree of sensitization potential of marine grade Al alloys. \n- Continued investigation of criteria for stable pitting of stainless steel. \n- Continued development of surface assessment technologies to measure surface profile and chlorine. \n- Continued evaluation of advanced material coating for erosion control on helicopter main rotor blade leading edges. \n- Continued development of seamless joining technologies for large, complex shaped conventional ceramic windows from small, inexpensive components using electrophoretic deposition of ceramic nanoparticles. \n- Continued development of intelligent corrosion sensor systems for intergranular corrosion cracking. \n- Continued studies on fuel cell corrosion. \n- Continued development of superhydrophobic surface modification technology. \n- Continued studies on mitigation of pitting corrosion and stress corrosion cracking in marine aluminum alloys. \n- Continued development of surface tolerant coating removal methods. \n- Continued development of processing technologies to fabricate piezoelectric single crystals into complex transducer assemblies. \n- Continued development of thermal management system(s) to arrest excessive heat fluxes and loads on amphibious ship by advanced Naval\/USMC aircraft. \n- Continued development of MEMS based sensor nodes, with energy harvesting and wireless communication capabilities, for system health management and prognosis. \n- Continued development of high-strength, high-hardness tool materials for friction-stir welding applications. \n- Continued development of the rational engineering design of Al-alloys for naval applications.\n- Continued to Iincrease emphasis on research efforts to discover innovative fundamental technologies to shape future Naval investments and strategies, leveraging the globe to support the Sailors & Marines of today and tomorrow.\n- Continued development of quantitative coasting quality assurance tools.\n- Completed friction stir welding development for control of residual stresses and elimination of distortion in naval steels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.274"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as completed above.\n- Complete development of materials processing methods for single crystal piezoelectrics to make strong, robust sonar transducers.\n- Complete development of advanced composites and polymers with fire resistance for ship structures.\n- Complete development of nanotube reinforced composite materials for next generation air and naval platforms.\n- Increase emphasis on research efforts to discover innovative fundamental technologies to shape future Naval   investments and strategies, leveraging the globe to support the Sailors & Marines of today and tomorrow."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.737"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.737"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013, less those noted as completed above. \n- Complete development of seamless joining technologies for large, complex shaped, conventional ceramic windows from small, inexpensive components using electrophoretic deposition of ceramic nanoparticles. \n- Complete developing techniques for processing of nanostructured aluminum alloys and composites which do not require use of liquid nitrogen.\n- Complete development of high-strength, high-hardness tool materials for friction-stir welding applications.\n- Complete development of MEMS based sensor nodes, with energy harvesting and wireless communication capabilities, for system health management and prognosis.\n- Complete development of portable, real-time, non-destructive examination (NDE)\/Non-destructive Inspection (NDI) technology for heat damage detection in composite materials.\n- Complete development of integrated structural composites with blast resistance, manufacturing technologies, and low-cost organic resins with improved fire resistance.\n- Complete development of continuous single wall carbon nanotube composite materials for next generation air and naval platforms.\n- Complete development of energy efficient scalable processing of low cost titanium alloys.\n- Initiate development of advanced NDE, SHM and Prognostics Technologies for improved readiness and reliability of air and naval platforms based on new and emerging electronic and photonics materials and devices.\n- Initiate development of advance structural composites with improved mechanical characteristics, blast resistance, and fire resistance, for more durable and reliable structures by optimizing the resin, the fibers and the interphases with new chemistries, additives and processes.\n- Initiate development and exploitation of new and advanced forms of carbon based nanostructures (Graphene, Nanotubes, Diamond and others) for next generation family of materials and structures with outstanding mechanical, thermal, electrical and energy applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BIOCENTRIC TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Biocentric technologies provide novel solutions for naval needs based upon the applications of bio-inspiredsensors, materials, processes and systems. Topic areas include, but are not limited to development of biologically-based signal processing for medical, surveillance and security applications; bioinspired robotics; synthetic biology to produce high-value naval materials or to develop sentinel organisms, and marine mammal diagnostics to support the Navy's Fleet Marine Mammal Systems.\n\nThe funding increase from FY 2012 to FY 2013 is due to new research on brain-inspired machine intelligent systems to enable high-level peer-to-peer interaction between warfighters and autonomous systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.084"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of innovative naval biosensors, biomaterials, and bioprocess technology.\n- Continued efforts on naval biosensor to detect brain structures and blood vessels through skull bones.\n- Continued engineering development and optimization of sea-floor sediment energy harvesting system for sustainable and autonomous powering of underwater sensor networks and AUV's.\n- Continued efforts on advanced biomimetic sensing and neural control for human-robot interaction to enable effective collaboration of warfighters and autonomous systems.\n-Continued integration of biomimetic sonar with bioinspired autonomous undersea vehicles (with high-lift propulsors) to achieve closed loop control.\n- Continued efforts in bioinspired quiet, and maneuverable self-propelled line array using high-lift propulsors based on animal wing and fin biomechanics.\n- Continued effort to develop living fluidic networks.\n- Continued development of a second set of molecular diagnostic tests for recently discovered viral, bacterial, and fungal pathogens of marine mammals.\n- Continued marine mammal diagnostics efforts, including immunobioassays for stress and infection detection.\n- Continued long duration, realistic field tests, and modeling studies of autonomous microbial fuel cell power systems for underwater sensor networks.\n- Continued efforts for bio-inspired massively parallel vision systems.\n- Continued effort to evaluate breath analysis for non-invasive diagnostics in marine mammal medicine.\n- Completed characterization of the dolphin fore-stomach microbial community, identification of probiotic immunostimulating species.\n- Initiated long duration, realistic field tests, and modeling studies of autonomous microbial fuel cell power systems for underwater sensor networks.\n- Initiated efforts to engineer plants to produce energetic materials.\n- Initiate microbe derived production of aviation fuel components from renewable wastes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.718"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Naval Biosciences\n- Continue all efforts of FY 2012, less those noted as completed above.\n- Initiate studies of microbial fuel cells for shoreside or shipboard applications.\n\nSynthetic Biology for Sensing & Energy Production\n- Initiate synthetic biology studies of engineered sentinel organisms for environmental surveillance and production of high-value naval materials (e.g., fuels, conducting polymers).\n\nLife Sciences and Bioengineering\n- Continue all efforts of FY 2012, less those noted as completed above.\n- Initiate studies to evaluate candidate probiotics in Altantic bottlenose dolphins.\n- Initiate studies of dolphin regenerative cells for treating a variety of pathologies and disease states in these animals.\n- Initiate efforts to detect, treat, and prevent diseases in dolphins, including diabetes and kidney stones.\n\nNeural, Sensory and Biomechanical Systems\n- Continue all efforts of FY 2012, less those noted as completed above.\n- Initiate studies to develop brain-based intelligent systems to support high level interaction between warfighters and autonomous systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.470"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.470"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Naval Biosciences\n- Continue all efforts of FY 2013, less those noted as completed above.\n\nSynthetic Biology for Sensing & Energy Production\n- Continue all efforts of FY 2013, less those noted as completed above.\n\nLife Sciences and Bioengineering\n- Continue all efforts of FY 2013, less those noted as completed above.\n\nNeural, Sensory and Biomechanical Systems\n- Continue all efforts of FY 2013, less those noted as completed above."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "COST REDUCTION TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Cost Reduction Technology efforts include: developing ultrareliable materials and sensors to reduce cost by enabling condition-based and zero maintenance capabilities; and airframe and ship corrosion efforts for advanced cost effective prevention and life cycle management technologies. This activity includes the Navy's share of the Versatile, Affordable, Advanced Turbine Engine (VAATE) program for materials. Investments under this activity were previously reported under Advanced Naval Materials and were broken out to provide improved clarification of the overall investment scope. \n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Enterprise and Platform Enablers.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 in the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.485"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of ceramic matrix composite turbine blades for gas turbine engines. \n- Continued development of cavitation resistant ship rudder coatings. \n- Continued development of durable alloys and materials for shipboard and aircraft gas turbine engines and spallation-resistant thermal barrier coatings for shipboard\/aircraft marine gas turbine hot sections. \n- Continued development of advanced materials and processes for high temperature marine turbine disks and combustors. \n- Continued development of oxidation and vanadium\/sulfate-resistant high temperature coatings for shipboard\/aircraft gas turbine engines. \n- Continued development of calcium magnesium aluminum-silicate (CMAS)-resistant coatings for ceramic matrix composites. \n- Continued development of high temperature organic matrix composites. \n- Continued development of low-platinum and platinum-free aluminide coatings that are phase compatible with turbine blade alloys and exhibit low oxidation rates. \n- Continued efforts to assess manufacturing issues and reliability of ceramic matrix composites for turbine engines. \n- Continued development of materials processing for future gas turbine molybdenum-based alloys. \n- Continued efforts to conduct warfighter sustainment applied research, including technology management of investments supporting the naval enterprise and naval capability pillars. \n- Continued efforts to perform technology analyses to support the development and validation of FNC technology performance metrics for enabling capabilities structured to close naval capability gaps. \n- Continued efforts to assess technology options for the development of applied FNC technologies packaged into deliverable science and technology products. \n- Continued applied research and development of improved coatings for (1) non-skid surfaces, (2) ship rudders, (3) high performance ship topsides, and (4) high performance airfield pavements. \n- Continued analytical model and reduced scale component development of shipboard compact power conversion technologies for multi-function motor drives, bi-directional power conversion modules, and power management controllers, focusing on closing technology gaps associated with Alternative Integrated Power System Architectures. \n- Continued applied research in determining lifting of hot section materials exposed to alternative synthetic fuels and petroleum-synthetic fuel blends. \n- Continued life prediction research for modeling of hot section gas turbine materials, including blades, in mixed naval environments. \n- Continued development of an Adaptive Expert System to automatically and rapidly analyze aircrew performance (1M+ flight hours annually) to detect human factors related mishap leading indicators using a new technique with anomaly detection and corroboration. \n- Continued durable environmental barrier coatings for 2700F ceramic-matrix composites. \n- Continued, developed and applied emerging technologies that support delivery of Navy approved FNC enabling capabilities structured to close operational capability gaps in warfighter sustainment. \n- Continued package emerging warfighter sustainment technologies into deliverable FNC products and ECs that can be integrated into acquisition programs within a five year period. \n- Continued and developed mature warfighter sustainment technologies that support naval requirements identified within the Naval Power 21 capability pillars. \n- Continued development of novel seawater pretreatment strategies to optimize performance of prefiltration membranes (microfiltration or ultrafiltration membranes or filters). \n- Continued further development of novel high flux and chlorine resistant reverse osmosis membranes and reverse osmosis desalination systems. \n- Continued research and development of ceramic matrix composite vanes for Naval aircraft. \n- Continued development of advanced ASGS (Active Shaft Grounding System) with integrated shaft current sensing and extremely low frequency electromagnetic (ELFE) control. \n- Continued development of novel ICCP (Impressed Current Cathodic Protection) anodes, reference cells and sensors with high Mean Time Between Failure (MTBF). \n- Continued development of dual-use ICCP and novel sensor technology for CBM and closed-loop deamping to extend hull\/ballast coating longevity and reduce recalibration frequency. \n- Continued applied research in modeling and simulation to identify key corrosion drivers and target problem areas for material modification and improved barrier dielectrics. \n- Continued development of spatial corrosion recognition and diagnostic models for hull, ballast tanks and propulsor condition.\n- Continued development of durable lift fan alloy.\n- Completed development of 1500F capable disk coatings.\n- Completed applied research on radiation barrier coatings. \n- Completed research on Nb-Cr-Si alloys for improved corrosion resistance at high temperatures. \n- Completed applied research development of Calcium Magnesium Aluminum-Silicate (CMAS)-resistant coating for molybdenum-base alloys.\n- Completed systems analysis efforts to identify and prioritize critical, relevant variable\/adaptive cycle propulsion system technologies and development plans\/approaches. The outcome of these analyses will provide essential information supporting initiation of the Variable Cycle Advanced Technology (VCAT) Program in FY 2012 (see PE 0602123N)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENVIRONMENTAL QUALITY"
                                    },
                                    "Description": {
                                        "val": "Environmental Quality technologies enable sustained world-wide Navy operations in compliance with all local, state, regional, national and international laws, regulations and agreements, and support the Navy Transformational Roadmap in the areas of Sea Basing, Sea Strike and Sea Warrior. Compliant operations enable training evolutions and exercises that are critical for maintaining readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of new, advanced, environmentally benign AF\/Anti-Corrosive (AC) costing systems for Navy platforms. \n- Continued development of advanced environmentally sound technologies for shipboard waste treatment and pollution abatement systems. \n- Continued development and modifications to shipboard oily waste treatment systems to accommodate processing of synthetic lubricants. \n- Continued field evaluation of prototype robotic Hull BUG to identify gaps needed to refine and advance the technology. \n- Continued efforts on ballast tank and system design optimization that minimize fuel discharges from compensated systems, minimize sedimentation in clean ballast and compensated ballast tanks, and maximize exchange of organisms during ballast tank exchanges. \n- Continued efforts on improved handheld, waterborne, underwater hull cleaning technologies. \n- Continued studies on oil emulsion issues and development of novel bilge water treatment systems on existing and new ships.\n- Completed efforts on solids separation\/removal from shipboard liquid waste streams."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as complete above. \n- Complete efforts on solids separation\/removal from shipboard liquid waste streams. \n- Complete development and modifications to shipboard oily waste treatment systems to accommodate processing of synthetic lubricants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.837"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.837"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013, less those noted as completed above."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN FACTORS AND ORGANIZATIONAL DESIGN"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is the achievement of FORCEnet and Sea Power 21 goals by developing human factors principles and cognitive models for human centric design, decision support systems for collaborative decision making, and adaptive command and control structures. The CNO's new Maritime Strategy and the Commander Fleet Forces Command complementary plan to revise organization of Maritime Operations Centers (MOC) place high priority on the aforementioned FORCEnet and Sea Power 21 goals. Specific objectives focus on improving small team, platform, task force, and battle group operations by developing advanced human factors technologies for incorporation into operational systems. The goals and payoffs are to enhance human performance effectiveness; improve the timeliness and quality of decision making; develop strategies to mitigate high workload and ambiguity; reduce manning; improve situational awareness and speed of command through a deeper understanding of human capabilities and limitations; and improvement of team decision making in ad-hoc, complex problem solving scenarios. The current specific objectives are:\n\na) Human Computer Interaction\/Visualization: Develop an understanding of the limitations of human perceptual and attentional systems in relation to maximizing user performance when interacting with complex Naval displays. A combination of computational cognitive modeling and psychological studies are employed to determine the capacity limitations on human performance that will undoubtedly have impact in reduced manning requirements, including information-rich weapons platforms. Develop technology for improving human interaction with autonomous systems and for improving virtual reality systems for training purposes.\n\nb) Command Decision Making (CDM): This is a new sub-project that consolidates the previous Collaboration and Knowledge Interoperability (CKI) and Organizational Design and Decision Support Systems sub-projects. The CDM sub-project is focused at the development of dynamic decision support systems that recognize and are responsive to changing mission and task demands, and adapt to present information appropriately.  This focus is explicitly intended to deliver decision support that will be more timely and responsive to rapidly evolving operational needs.  Current thrusts within the sub-project are to: 1) Conduct research on the application of theory to exploit relevant information for effective decision making; 2) Develop models that are operationally context and task sensitive; 3) Study and apply research for the effective management of highly complex & time critical decision making; 4) Develop and demonstrate decision support tools that address the timely management of risk and uncertainty.\n\n\nc) Social Network Analysis: Develop computational models and algorithms for the analysis of terrorist threats and counter-measures and strategies against terrorist threats. Develop new computational algorithms for the discovery of missing and hidden nodes in complex graphs applicable to the problem of understanding hidden information in terror networks. Develop new approaches to calculation of network completeness. Develop computational approaches to the study of factionalism in social movements using Islamist movements as exemplar data collectivities. The following are non-inclusive examples of accomplishments and plans for projects funded in this activity.\n\nThis FY 2014 activity funding moves from Program Element 0602235N: Common Picture Applied Research efforts associated with the Human Factors activity and is being transferring into this PE0602236N: Warfighter Sustainment Applied Research to provide an easily navigable overview of all Human Factors investments in a single location."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.338"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.338"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Human Computer Interaction\/Visualization:\n- Continue all efforts of FY 2013 less noted above as complete.\n- Initiate research on audio-visual cue integration for 360-degree periscope displays.  Utilize eye-tracking, sleep studies and traditional behavioral measures to characterize human performance on periscope-related tasks under a variety of physiological conditions. \n\nCommand Decision Making (CDM)\n- Continue all efforts of FY 2013 less noted above as complete.\n- Develop task management algorithms applicable to agile supervisory control of teams involving human and autonomous agents.\n- Initiate development of information infrastructure that is operational context sensitive to allow the dynamic prioritization of date based on its anticipated information value and mission criticality.\n\nSocial Network Analysis:\n- Continue all efforts of FY 2013 less noted above as complete.\n- Initiate research on socio-technical aspects of community mobilization and complex humanitarian operations, including the use of novel platforms, social networks and the impact of novel technologies on human behavior in crisis and collaborative contexts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN SYSTEMS DESIGN"
                                    },
                                    "Description": {
                                        "val": "This activity supports the warfighter by designing affordable user-centered systems that are efficient, easy to use, and provide required mission capabilities at lowest lifecycle costs. Such systems will be optimally designed for the right number and types of personnel, requiring minimum training while providing high skills retention.\n\nCongressional, DoD, and Navy policies and instructions require the Navy and Marine Corps to have a comprehensive plan for Human Systems Design (HSD) in the acquisition process to optimize total system performance, minimize total ownership costs, and ensure the system is built to accommodate the characteristics of the user population that will operate, maintain, and support the systems.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Capable Manpower.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 in the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.858"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research to develop and demonstrate automation and human interface technologies to support collaborative decision making in which multiple unmanned system operators manage groups of vehicles with optimal manning.\n- Continued research into improving the capability to fuse imaging, electronic warfare, inorganic and acoustic sensor inputs into integrated,fused, and intuitive displays that enhance the presentation and command understanding of uncertain information.\n- Continued research into the impact of incorporating environmental stressors (fatigue, motion, vibration and extreme temperatures) into systems engineering tools for the development for complex Navy systems.\n- Completed research into operational constructs, processes, methods, and software specifications to merge the full spectrum of Human Systems Engineering into the Navy's standards based, open-architecture, Integrated Product Data Environment.\n- Completed research into mission performance optimization encompassing task centered design and advanced human performance modeling for achieving the requisite manning, both in numbers and capabilities, for the complex ships and systems of the future fleet."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LITTORAL COMBAT \/ POWER PROJECTION"
                                    },
                                    "Description": {
                                        "val": "This activity provides for technologies that enhance the ability of the Navy-Marine Corps team to assure access and sustained operations in the Littorals. The FNC Program considers all the critical functions of warfighting: command, control, communications, computers, intelligence, surveillance, and reconnaissance (C4ISR); fires; strike; maneuver; sustainment; and fleet\/force protection. This activity includes technical assessments and trade studies for FNC Enabling Capabilities that transition high priority technologies to the Navy and Marine Corps in support of the Sea Strike, Sea Shield, Sea Basing, and ForceNet Naval Power 21 pillars as well as Enterprise and Platform Enabling Science and Technology requirements.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activities titled Enterprise and Platform Enablers and FNC Management.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 in the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.104"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued efforts to assess technology options for the development of applied FNC technologies packaged into deliverable S&T products.\n- Continued development of technologies to reduce the load of warfighters by 1) reducing the weight of and improving the capability of the day\/night weapon sight, 2) eliminating battery incompatibility, and 3) providing GUI-based software for tradeoff analyses bases on Military Operational Posture.\n- Continued research to develop technology to reduce fabrication and life cycle costs of SSN\/SSGN next generation photonics mast and to improve SSN surface situational awareness through faster image acquisition rates, improve range performance under adverse weather conditions and improve autonomous detection and classification.\n- Continued efforts to assess technology options for the development of applied research for FNC technologies, to include preparation of detailed technology specifications and performance metrics, packaged into deliverable S&T products for enabling capabilities structured to close naval capability gaps."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANPOWER\/PERSONNEL"
                                    },
                                    "Description": {
                                        "val": "These technologies enhance the Navy's ability to select, assign, and manage its people by responding to a variety of requirements, including: managing the force efficiently and maintaining readiness with fewer people and smaller budgets; providing warfighting capabilities optimized for low-intensity conflict and littoral warfare; and operating and maintaining increasingly sophisticated weapons systems while managing individual workload and supporting optimal manning.\n\nThis activity further supports the warfighter by providing enhanced capabilities by designing affordable user-centered systems that are efficient, easy to use, and provide required mission capabilities at lowest lifecycle costs. Such systems will be optimally designed for the right number and types of personnel, requiring minimum training while providing high skills retention.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Capable Manpower.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 in the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.105"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research into decision support tools to better enable meeting the goals of the Navy's evolving strategies for personnel and manpower management and especially to evaluate manpower alternatives.\n- Continued research into intelligent agents to empower total force members to make training and assignment choices that\nenhance their careers and meet personal goals.\n- Continued research into agent-based simulations for enhancing the effectiveness of behaviorally-based predictive models.\n- Continued research into supporting technologies for a prototype decision support system to enable community management\nprogram analysts to better forecast and assess the effects of active duty enlisted and officer behavior resulting from both proposed and current policy decisions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MEDICAL TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This program supports the development of field medical equipment, diagnostic capabilities and treatments; technologies to improve warfighter safety and to enhance personnel performance under adverse conditions; and systems to prevent occupational injury and disease in hazardous, deployment environments; including regenerative medicine technologies and therapeutic\/restorative practices for the treatment of combat-related traumatic injuries. Navy investment in these areas is essential because Navy\/USMC mission needs are not adequately addressed by the civilian sector or other Federal agencies. For example, civilian emergency medicine does not address casualty stabilization during long transit times to definitive care. The National Institutes of Health (NIH) focuses on the basic science of disease processes and not applied research related to development. Programs are coordinated with other Services through the Armed Services Biomedical Research Evaluation and Management (ASBREM) Committee, and Joint Technical Coordinating Group (JTCG) process, to prevent duplication of effort. \n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Force Health Protection.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 in the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.693"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued program to develop enhanced First Responder capabilities. \n- Continued program to develop enhanced Forward Resuscitative Surgical capabilities. \n- Continued program to develop enhanced En Route Care capabilities. \n- Continued efforts to mitigate the effects of environmental and other threats to health. \n- Continued program, with Army, in regenerative medicine (Armed Forces Institute for Regenerative Medicine (AFIRM)).\n- Continued efforts to reduce operational injuries.\n- Continued efforts to reverse NIHL. \n-Continued studies on decompression sickness (DCS) and arterial gas embolism (AGE), to include novel approaches to the prevention, detection and treatment of DCS\/AGE, particularly by nonrecompressive methods.\n- Continued efforts to develop prophylactic agents preventing hyperbaric oxygen toxicity. Prolonged exposure to hyperbaric oxygen can be toxic to lungs, nervous system and eyes.\n- Continued efforts to assess the impact of thermal (i.e., heat and cold) stress on operational performance. Underwater thermal extremes can affect diver performance and alter risk of incurring decompression sickness.\n- Continued studies related to optimization of diver performance. Operational performance in the undersea environment can be hampered by a variety of environmental stressors.\n- Continued studies related to optimization of submariner health and performance. Submarine crewmembers are exposed to a variety of unique stressors including prolonged deployments, effects of altered diurnal rhythms, non-standard breathing gases, lack of sunlight, etc that can impact health and performance.\n- Continued studies related to biomedical effects of underwater sound. Military divers must operate safely and effectively in potentially complex underwater sound fields.\n- Continued efforts for \"stress inoculation\" to mitigate the impact of exposure to stressful combat environments prior to deployment. \n- Continued efforts to develop advanced technologies to support Rapid Blood Treatment. \n- Continued efforts to develop advanced technologies to support Warfighter Restoration. \n- Continued efforts to model accelerated head and neck injuries; operational injuries. \n- Continued research to reduce noise at the source, i.e. jet engine quieting and flight deck noise reduction.\n- Continued research to study the incidence and susceptibility of Noise Induced Hearing Loss (NIHL) and tinnitus, and to evaluate mitigation strategies.\n- Continued research in prevention and treatment of NIHL and tinnitus (ringing in the ears).\n- Continued research to improve personal protective equipment technology.\n- Continued research to develop a Human Injury and Treatment (HIT) model for predicting outcomes of personnel exposure to shipboard damage.\n- Continued and develop mature force health protection technologies that support naval requirements identified within the Navy and MarineCorps.\n- Continued development of multifunctional blood substitute program.\n- Completed efforts to assess the impact of thermal (i.e., heat and cold) stress on operational performance. Underwater thermal extremes can affect diver performance and alter risk of incurring decompression sickness.\n- Initiated Jet Noise Reduction Project, Noise Induced Hearing Loss Program, to utilize analytical modeling and simultion tools anchored by experiment to develop and assess solutions enabling mitigation of jet induced noise from high performance tactical aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.109"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Medicine\n- Continue all efforts of FY 2012.\n\nRegenerative Medicine\n- Continue all efforts of FY 2012.\n\nNoise Induced Hearing Loss\n- Continue all efforts of FY 2012.\n\nNoise Induced Hearing Loss-Jet Noise\n- Continue all efforts of FY 2012."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.989"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.989"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Medicine\n- Continue all efforts of FY 2013.\n- Initiate research to explore novel pharmaceutical interventions for hyperbaric oxygen toxicity.\n\nRegenerative Medicine\n- Continue all efforts of FY 2013.\n\nNoise Induced Hearing Loss\n- Continue all efforts of FY 2013.\n\nNoise Induced Hearing Loss-Jet Noise\n- Continue all efforts of FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "THE OFFICE OF NAVAL RESEARCH GLOBAL"
                                    },
                                    "Description": {
                                        "val": "ONR has a presence overseas, with an overarching purpose to search the globe for promising, emerging scientific research and development efforts to address the current needs of the Fleet\/Forces, and investigate high-payoff technologies for future naval missions and capabilities. To accomplish this task, ONR capitalizes on global innovation and investment to solve U.S. Navy and Marine Corps science and technology (S&T) challenges, builds global S&T awareness to mitigate risk of potential technological surprise, ensures Fleet\/Forces capability needs are communicated to the Naval Research Enterprise (NRE), and facilitates delivery of Naval S&T solutions to the Fleet\/Forces.  ONR Applied Research (6.2) requirements prior to FY 2014 were funded in another R-2 activity within this PE and also in PE 0602123N and 0206568N.  Starting in FY 2014, these requirements have been consolidated into this separate R-2 activity to provide greater visibility for ONR international collaboration and research efforts."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.287"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.287"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "International Science Program\n\nThe ONR International Science Program mission is to search the globe for emerging scientific research and advanced technologies, to enable the Office of Naval Research (ONR) and the Naval Research Enterprise (NRE) to effectively address current needs of the Fleet\/Forces, and investigate and assess revolutionary, high-payoff technologies for future naval missions and capabilities.  This is accomplished through PHD-level Associate Director scientists located in Asia, Europe and South America collaborating with international organizations and researchers through grants in innovative applied research, and establishing quality, relevant connections between international science and technology (S&T) centers of excellence and DON, DOD, and other US Government organizations. The direct impact of this investment is to capitalize on international applied research during unprecedented and dynamic global interdependence, increasing the ability to solve DON S&T challenges through shared knowledge and technologies with partners. Additionally, this investment builds global S&T awareness to reduce the risk of potential technological surprise, and supports theater security cooperation goals to sustain cooperative relationships with an expanding set of international partners and to enhance global security.\n\nFleet\/Forces Science Advisors \n\nThe Naval Science Advisor (SA) Program ensures the Naval Fleet\/Forces shape the DON investment in applied research S&T, developing teaming relationships in support and development of technology-based capability options for Naval Fleet\/Forces. Funding is also dedicated to applied research efforts in support of the various Naval Fleet\/Forces operational commands.\n\nThe Science Advisors (SA) are a conduit between the Naval Fleet\/Forces, ONR, Naval Research Lab (NRL) and the entire Naval Research Enterprise (NRE). Specific Fleet\/Forces Science Advisors include the following:  \n\nSA, Navy Warfare Development Command (NWDC), provides technical support for the generation and development of advanced warfighting concepts leading to innovative new strategies to address Navy challenges and opportunities. \n\nSA, CNO Strategic Studies Group (SSG) fully partners in the generation of revolutionary warfighting concepts for the Navy of the future. Along with the Technology Fellows, the SA develops the SSG Fall Program which includes researching and inviting lecturers to address the SSG and developing engaging and mind-opening exploration travel for the CNO Fellows and mini exploration travel for all SSG members.\n\nSA, Chief of Naval Operations Code N81 (OPNAV N81) focuses on disseminating the Navy's warfighting capability\/risk analysis products to the broader S&T community resulting in an improved influence of requirements pull on S&T. The N81 \n\nSA is part of the ONR internal strategy cell membership for updating the Navy S&T Strategic Plan. \n\nSA, Naval Mine and Anti-Submarine Warfare Command (NMAWC) works with the Commander NMAWC who is the lead for the FNC ASW sub-Integrated Program Team (IPT). The SA is directly responsible to the Commander for drafting\/modifying capability gaps and enabling capabilities (EC) ideas, vetting them through the sub-IPT members, incorporating modifications, and providing the final recommendation to the Commander for presentation to the Sea Shield IPT. The SA advises Commander on Navy's Tactical ASW and MIW support and countermeasures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA BASING TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This activity includes development and advancement of technologies to support Seabasing. Areas include: advanced hull forms, propulsion, and materials to support high speed, shallow draft, and beachable connectors; innovative connector interface and transfer technologies; advanced wave and position sensors and autonomous controls to support vessel to vessel interfaces; and autonomous conveyance systems to support automated and integrated warehousing.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Sea Basing.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 in the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Sense and Respond Logistics (S&RL) research in: battlefield fuel management; decision support systems for S&RL; emergent intelligence\/intelligent agents for S&RL; and advanced sensors\/processes for S&RL. \n- Continued efforts for the development of technologies supporting automated shipboard assembly of air-delivered weapons. \n- Continued the construction of a scaled model of a Rapidly Deployable Stable Transfer Platform demonstrator. \n- Continued a second evaluation of potential Seabasing INP efforts. \n- Continued the down-selection of Sense and Respond Logistics Information Architecture prototype development. \n- Continued development of agent based decision support and logistics planning algorithms. \n- Continued development of a detailed technology demonstration plan. \n- Continued the modeling and simulation of first article prototypes of Sense and Respond demonstration systems; Logistics Common Operating Picture, Decision Support Tools, Prognostics Embedded Health Management, Macro Fuel Quantity Management, Portable Fuel Quality Analysis. \n- Continued development of the Connectors and the Sea Base Enabling Capability including Environmental Ship Motion Forecasting and Advanced Mooring System Technologies.\n- Completed T-CRAFT technology demonstration component construction.\n- Completed contract design and develop shipyard building plans for T-CRAFT prototype and component construction. \n- Completed procurement of components and material to support T-CRAFT prototype construction. \n- Completed multiple INP contracts for preliminary designs in the area of a T-CRAFT and a Rapidly Deployable Seabasing Stable Transfer Platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Training technologies enhance the Navy's ability to train effectively and affordably in classroom settings, in simulated environments, while deployed, and to operate effectively in the complex, highstress, information-rich and ambiguous environments of modern warfare such as asymmetric warfare. Technology development responds to a variety of requirements, including providing more affordable approaches to training and skill maintenance. Improved training efficiency and cost-effectiveness is achieved by applying operations research, modeling and simulation, and instructional, cognitive, and computer sciences to the development, delivery, evaluation, and execution of training.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to a new FNC R2 activity titled Capable Manpower.  Efforts in this R2 activity have been continued from FY 2012 to FY 2013 in the new R2 activity to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.589"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research and assessment of advanced gaming technology for enhanced training.\n- Continued research into game based training to more effectively enable better warfighter understanding of languages and cultures to enhance their regional expertise.\n- Continued creation and conduct of experiments to validate automated performance assessment and after action reviews.\n- Continued a systematic program of applied research addressing unanswered questions regarding effective instructional strategies in artificially intelligent tutoring.\n- Continued research on software tools to facilitate building natural language tutorial dialogs for artificially intelligent tutoring.\n- Continued task to develop multi-agent based architectures for modeling human behavior, improve techniques for human cognitive and behavioral modeling, and create highly realistic simulated teammates.\n- Continued field studies and user tests evaluating new features and job aiding tools.\n- Continued research to create computational models of human behavior in selected non-Western environments that reflect the dominant cultural, social, ethnic, and economic determinants of behaviors, attitudes, and beliefs of individuals, groups, and organizations operating in these environments, and exploit these models to forecast responses to our actions and those of others attempting to exert influence in these environments.\n- Continued research into computational neuron-models in the design of training systems.\n- Continued the integration of cognitive and neuron-computational models of human learning.\n- Continued research into intelligent tutoring systems for adaptive competency in submarine bridge team and surface ship combat information center trainers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.111"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cognitive Science of Learning\n- Continue all efforts of FY 2012, less those noted as completed\n- Initiate development of optimal training strategies for intelligent jobs on mobile devices ( e.g., IPad).\n- Initiate development of immersive environments for training interpersonal and leadership skills.\n- Initiate design and conduct experiment to assess training effectiveness of intelligent tutor for training ship handling skills.\n- Initiate development of novel psychometric approaches to assess human performance in medical\/ military simulations and simulators.\n- Initiate research in design features of medical and military simulators and simulations.\n\nEnhancing Warfighter Cognitive Capability  \n- Continue all efforts of FY 2012, less those noted as completed\n- Continue research to understand the structural relations among the latent variables of short-term memory, working memory, executive attentional control, and fluid intelligence.\n- Continue research to assess the improvement in recruit classification provided by the addition of measures of fluid intelligence and working memory.\n- Initiate research to understand the role of intrinsic motivation in facilitating the transfer of working memory training to other cognitive capabilities.\n- Initiate research to assess the efficacy of game-based brain training using hand-held (fieldable) hardware platforms.\n- Initiate research to determine the relationship between induced gains in fluid intelligence and cognitive adaptability and agility, considered from the perspective of military decision-making. \n\nComputational Models of Human Behavior\n- Continue all efforts of FY 2012, less those noted as completed\n- Research to create computational models of human behavior in selected non-Western environments that reflect the dominant cultural, social, ethnic, and economic determinates of behaviors, attitudes and beliefs of individuals, groups and organizations operating in these environments, and exploit these models to forecast responses to US actions and those of others attempting to exert influence over people in these environments.\n- Develop multi-agent based architectures for modeling human behavior, improve techniques for human cognitive and behavioral modeling, and create highly realistic simulated team mates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.031"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.031"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cognitive Science of Learning\n- Continue all efforts of FY 2013, less those noted as completed\n-Initiate research in the neuro-biology of learning including integration of the role of white matter.\n-Initiate development of games that incorporate AI techniques to teach complex warefighter skills decision-making and problem solving.\n-Initiate development of intelligent avatars to interact with learners from different cultural, linguistic backgrounds, and preferences.\n-Initiate development of scenarios generators that produce integrated training (e.g., individual and collective) training.\n\nEnhancing Warfighter Cognitive Capability  \n- Continue all efforts of FY 2013, less those noted as completed\n\nComputational Models of Human Behavior\n- Continue all efforts of FY 2013, less those noted as completed"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of varied efforts within this PE. Each effort is measured against both technical and financial milestones. Each program effort and its projects are reviewed in depth for technical and transition performance against established goals. The Program Managers conduct routine site visits to performing organizations to assess programmatic and technical progress and most projects conduct an annual or biannual review by an independent board of visitors who assess the level and quality of the Science and Technology (S&T) basis for the project."
                        }
                    }
                }
            ]
        }
    }
}