{
    "id": "31e470b06d74632bcf7dc7ed7213a981cae3c320",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0303140D8Z"
        },
        "ProgramElementTitle": {
            "val": "Information Systems Security Program"
        },
        "R1LineItemNumber": {
            "val": "207"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "11.348"
            },
            "CurrentYear": {
                "val": "11.780"
            },
            "BudgetYearOne": {
                "val": "10.673"
            },
            "BudgetYearOneBase": {
                "val": "10.673"
            },
            "BudgetYearTwo": {
                "val": "12.867"
            },
            "BudgetYearThree": {
                "val": "11.620"
            },
            "BudgetYearFour": {
                "val": "11.164"
            },
            "BudgetYearFive": {
                "val": "11.588"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The DoD CIO Information Systems Security Program (ISSP) provides focused research, development, testing and integration of technology and technical solutions critical to the Defense Information Assurance Program (10 USC 2224) through pilot programs and technology demonstration; investment in high leverage, near-term programs that offer immediate Information Assurance (IA) benefit; federal and multi-national initiatives; and short-term studies and research critical to protecting and defending information systems by ensuring their availability, integrity, authentication, confidentiality, and non-repudiation. These efforts focus on Computer Network Defense (CND) and the restoration of information systems by incorporating protection, detection, analysis and reaction and response capabilities; emerging cryptographic technologies; technology transition and IA research capabilities.  This program is designed to meet the requirements of 10 USC 2224 (Defense Information Assurance Program), 44 USC 3544, (Federal Information Security Management Act of 2002), OMB Circular A-130, and DoD Directives 8500.1, and 0-8530.1. This program is funded under Budget activity 7, Operational System Development because it integrates technology and technical solutions to the Defense Information Assurance Program."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.352"
                },
                "CurrentYear": {
                    "val": "11.780"
                },
                "BudgetYearOne": {
                    "val": "12.163"
                },
                "BudgetYearOneBase": {
                    "val": "12.163"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.348"
                },
                "CurrentYear": {
                    "val": "11.780"
                },
                "BudgetYearOne": {
                    "val": "10.673"
                },
                "BudgetYearOneBase": {
                    "val": "10.673"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.004"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.490"
                },
                "BudgetYearOneBase": {
                    "val": "-1.490"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.004"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.490"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.490"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program Change Explanation:\nFY 2012:  Program Adjustment -0.004 million."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "140"
                    },
                    "ProjectTitle": {
                        "val": "Information Systems Security Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.348"
                        },
                        "CurrentYear": {
                            "val": "11.780"
                        },
                        "BudgetYearOne": {
                            "val": "10.673"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.673"
                        },
                        "BudgetYearTwo": {
                            "val": "12.867"
                        },
                        "BudgetYearThree": {
                            "val": "11.620"
                        },
                        "BudgetYearFour": {
                            "val": "11.164"
                        },
                        "BudgetYearFive": {
                            "val": "11.588"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The NII Information Systems Security Program (ISSP) provides focused research, development, testing and integration of technology and technical solutions critical to the Defense Information Assurance Program (10 USC 2224) through pilot programs and technology demonstration; investment in high leverage, near-term programs that offer immediate Information Assurance (IA) benefit; federal and multi-national initiatives; and short-term studies and research critical to protecting and defending information systems by ensuring their availability, integrity, authentication, confidentiality, and non-repudiation. These efforts focus on Computer Network Defense (CND) and the restoration of information systems by incorporating protection, detection, analysis and reaction and response capabilities; emerging cryptographic technologies; technology transition and IA research capabilities.  This program is designed to meet the requirements of 10 USC 2224 (Defense Information Assurance Program), 44 USC 3544, (Federal Information Security Management Act of 2002), OMB Circular A-130, and DoD Directives 8500.1, and 0-8530.1. This program is funded under Budget activity 7, Operational System Development because it integrates technology and technical solutions to the Defense Information Assurance Program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Systems Security Program Plans and Accomplishments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.348"
                                            },
                                            "Text": {
                                                "val": "• Refined IA architecture, policy, and IA capabilities necessary to support “end-to-end” IA capability for the Joint Information Environment (JIE), including enterprise services of discovery and collaboration, and IT modernization.  Supported technology demonstrations and pilots focused on functions required in mid to long term increment of the IA Component of the JIE.\n\n• Provided essential support to DoD Information Assurance (IA) Risk Management (RM) Transformation that includes migrating the Defense IA RM process to comply with the mandated Federal (NIST) community RM standards, performing the functions of the DIACAP TAG Secretariat IAW DoD 8510.01, supporting enterprise-wide IA RM automation (eMASS) requirements identification and implementation, and managing DoD's single, virtual, authoritative Community of Interest (known as the DIACAP Knowledge Service) for DoD IA RM policies, activities, and initiatives.\n\n• Developed and refined the criticality analysis in support the DoD trusted defense system strategy (including Software and Hardware Assurance), to support its deployment.\n\n• Completed Phases 3 & 4 of the Inductive User Interface (aka: SAST) GUI to enhance ease of use and permit independent development, testing and maintenance of T&E, training and exercise scenarios.  Improvements will support joint exercises, the Department’s international exercise program, and capstone events at Service schools.\n\n• Piloted International Cyber Defense Workshop (ICDW) training exercise for DoD agencies.\n\n• Completed Phase II of Cyber Challenge, the Department’s FY13 annual awareness training product.\n\n• Continued development of Automated Consolidated Exercise Metrics Assessment Tool (CEMAT) capabilities in the IA Range.\n\n• Developed 508 solutions for Virtual Training Environment (VTE) content.\n\n• Refined the DoD Mobile Device Strategy and Roadmap, to include policy and IA capabilities necessary to support \"end-to-end\" IA capability for the JIE.\n\n• Developed and refined the DoD policy for Digital Persona Protection to include the construction of an implementation plan based on the final policy to support workforce protection awareness, education, and training throughout the department.\n\n• Refined and updated DoD policies related to wireless, emerging technologies, and mobile computing while ensuring the security standards and policies are implemented with both legacy and cutting edge technologies in mind throughout their entire life-cycle.\n\n• Provided IA Mobile Enterprise Services support to further develop and refine the DoD-enterprise cloud computing strategy as the DoD Mobile Device Strategy and Roadmap will work in lockstep with the cloud computing strategy.\n\n• Supported and monitored implementation of the SHA-256 (an encryption algorithm) Cryptographic migration.\n\n• Provided policy and guidance for the use of Federal Personal Identity Verification (PIV) and non-Federal PIV-I credentials within the DoD for mission applications and business functions.\n\n• Responded to inquiries from DoD Customers and Information system owners regarding DoD PKI and Identity Management policy and guidance.\n\n• Collaborated with USCYBERCOM to develop implementation guidance for DoD PKI and Identity Management policy. \n\n• Expanded the International Cyber Defense Workshop virtual environment by moving the portals and Security Assessment Simulation Toolkit (SAST) to the .mil domain; concluded information sharing agreement with Finland and provide more IA\/CND information in releasable form to all formal international partners (NATO, Five Eyes (FVEY), Japan, ROK, Singapore, France, Germany, Poland, and Sweden)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.780"
                                            },
                                            "Text": {
                                                "val": "• Develop products and test tools for a comprehensive cybersecurity awareness program.\n\n• Extend ICDW-like training exercises to all DoD agencies.\n\n• Continue Zanthenon GOTS API\/SDK enhancements.\n\n• Continue to provide essential support to DoD Information Assurance (IA) Risk Management (RM) Transformation that includes migrating the Defense IA RM process to comply with the mandated Federal (NIST) community RM standards, performing the functions of the DIACAP TAG Secretariat IAW DoD 8510.01, supporting enterprise-wide IA RM automation (eMASS) requirements identification and implementation, and managing DoD's single, virtual, authoritative Community of Interest (known as the DIACAP Knowledge Service) for DoD IA RM policies, activities, and initiatives.\n\n• Continue refinement of the DoD Mobile Device Strategy and Roadmap, to include policy and IA capabilities necessary to support \"end-to-end\" IA capability for the GIG-including mobile enterprise services such as discovery, collaboration, messaging, mediation, data tagging, etc.  Support mobile technology demonstrations, development and pilots focusing functions required in mid to long term increment of the IA Component of the GIG Architecture.\n\n• Further develop and refine the DoD policy for Digital Persona Protection to include the construction of an implementation plan based on the final policy to support workforce protection awareness, education, and training throughout the department.\n\n• Continue to refine and update DoD policies related to wireless, emerging technologies and mobile computing while to ensure the security standards and policies are implemented with legacy and cutting edge technologies in mind throughout their entire life-cycle.\n\n• Continue to provide IA Mobile Enterprise Services support to further develop and refine the DoD-enterprise cloud computing adoption strategy as the DoD Mobile Device Strategy and Roadmap will work in lockstep with the cloud computing strategy.\n\n• Develop Advanced Persistent Threat (APT) data standards and data collection capabilities\n\n• Pilot NIPRNet – INTERNET isolation capabilities. \n\n• Expand scope of International Cyber Defense Workshop to include more training modules and expanded IA range capabilities in SAST model; develop web portals for classified FVEY information sharing and methodologies for releasing IA\/CND information to formal partners in near real time.\n\n• Perform Continuous Monitoring and Risk Scoring (CM\/RS) by providing strategic management of CM\/RS; develop the strategy and objectives for institutionalizing continuous monitoring across DoD; coordinate CM\/RS capabilities; and prepare applicable CM\/RS issuances.  \n\n• Provide strategic management and oversight of the Computer Network Defense Service Provider (CNDSP) Program; and conduct trend analysis to identify systemic trends and associated gaps to the CNDSP program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.673"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.673"
                                            },
                                            "Text": {
                                                "val": "• Continue development of capabilities (test tools, etc.,) for a comprehensive cybersecurity awareness program.\n\n• Continue extension of ICDW-like training exercises to all DoD agencies.\n\n• Continue to provide essential support to DoD Information Assurance (IA) Risk Management (RM) Transformation: migrating the Defense IA RM process to comply with the mandated Federal (NIST) community RM standards; performing the functions of the DIACAP TAG Secretariat IAW DoD 8510.01; support for the enterprise-wide IA RM automation (eMASS) requirements identification and implementation; and management of the DoD single, virtual, and authoritative Community of Interest (known as the DIACAP Knowledge Service) for DoD IA RM policies, activities, and initiatives.\n\n• Continue the refinement of the DoD Mobile Device Strategy and Roadmap, to include policy and IA capabilities, necessary to support \"end-to-end\" IA capability for the GIG-including mobile enterprise services such as discovery, collaboration, messaging, mediation, data tagging, etc.  Support mobile technology demonstrations, development, and pilots.\n\n• Continue the development and refinement of the DoD policy for Digital Persona Protection, to include research and development of an implementation plan IAW the final policy on workforce protection awareness, education, and training.\n\n• Continue to research and refine DoD policies on wireless, emerging technologies and mobile computing while ensuring security standards and policies are implemented with both legacy and emerging technologies in mind throughout their entire life-cycle.\n\n• Research and refine Advanced Persistent Threat (APT) data standards and data collection capabilities\n\n• Provide strategic management and oversight of the CNDSP Program; and conduct trend analysis to identify systemic trends and associated gaps to the CNDSP program.\n\n• Continue research and refinement of IPv6 compatibility across NIPRNet; and ensuing implementation guidance.\n\n• Continue participation in the research, development, and implementation of DoD DMZ Increment engineering plans, to include monitoring the on-going implementation of NIPRNet DMZs and migration of outward facing applications.\n\n• Continue implementation and refinement of NIPRNet and SIPRNet Mapping and Leak Detection Solution to identify vulnerabilities and develop risk mitigation strategy. \n\n• Monitor the software engineering and implementation of the advanced Whitelisting database capability to reduce NIPRNet exposure to the Internet. \n\n• Continue collaborate with Combatant Commands (COCOMs) to support the identification and prioritization of cleared companies providing operational support and thereby assist and promote their full participation when the DIB CS\/IA voluntary program opens to all cleared defense contractors. \n\n• Monitor the DIB CS\/IA program expansion under FVEY CND MOU and any International amendments to the Framework Agreement.\n\n• Monitor the on-going implementation of SCRM key practices and test and evaluation processes across DoD."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0303140D8Z O&M DW"
                                    },
                                    "Title": {
                                        "val": "Information System Security Program"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.480"
                                        },
                                        "CurrentYear": {
                                            "val": "13.253"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.178"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.178"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.178"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.848"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.102"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.378"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Zanethenon improvements available as a core enterprise IA\/CND simulation tools.\n     -   CEMAT effectiveness in supporting the T&E community for data collection, reduction analysis, and reporting.\n     -  508 solution available for VTE content.\n     -  Cyber Challenge being used DoD-wide.\n     -  DoD agency CIOs reporting of International Cyber Defense Workshop (ICDW)-like training exercises, enhancing the cybersecurity skills of personnel."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Information System Security Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.148"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.280"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.173"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.173"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FFRDC Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}