{
    "id": "40c2da6573d874b9bb9579bc5d39f39369e9220b",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602624A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Technology"
        },
        "R1LineItemNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "53.883"
            },
            "CurrentYear": {
                "val": "35.218"
            },
            "BudgetYearOne": {
                "val": "37.798"
            },
            "BudgetYearOneBase": {
                "val": "37.798"
            },
            "BudgetYearTwo": {
                "val": "40.431"
            },
            "BudgetYearThree": {
                "val": "49.228"
            },
            "BudgetYearFour": {
                "val": "56.742"
            },
            "BudgetYearFive": {
                "val": "56.350"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 funding increase for indirect fire weapons and tunable pyrotechnics."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates, designs and evaluates enabling technology  to develop lethal and nonlethal weapons and munitions with increased performance and the potential for lower weight, reduced size, and improved affordability.  Project H18 focuses on weapons and munitions development. Project 19 researches technologies to maintain the lethality of US weapons as well as directed energy (DE) capabilities and subsystems to support the weaponization of high power microwave (HPM), and short pulse lasers.  Project H28 evaluates munition components such as fuzes, power, warheads with tailorable effects, and insensitive munition compliant energetic materials. \n \n\n\nWork in this PE is related to, and fully coordinated with, PE 0602303A (Aviation Advanced Technology), 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602772A (Advanced Tactical Computer Science and Sensor Technology), PE 0602782A (Command, Control, Communications Technology),  PE 0603004A (Weapons and Munitions Advanced Technology), and, PE 0603008A (Electronic Warfare Advanced Technology). The cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is primarily performed by the Armament Research, Development, and Engineering Center (ARDEC) at Picatinny Arsenal, NJ, in cooperation with the Army Research Laboratory (ARL) at Aberdeen Proving Ground, MD; the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Fort Belvoir, VA;, the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI; and the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "54.727"
                },
                "CurrentYear": {
                    "val": "35.218"
                },
                "BudgetYearOne": {
                    "val": "33.613"
                },
                "BudgetYearOneBase": {
                    "val": "33.613"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "53.883"
                },
                "CurrentYear": {
                    "val": "35.218"
                },
                "BudgetYearOne": {
                    "val": "37.798"
                },
                "BudgetYearOneBase": {
                    "val": "37.798"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.844"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.185"
                },
                "BudgetYearOneBase": {
                    "val": "4.185"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.809"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.185"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.185"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.035"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H18"
                    },
                    "ProjectTitle": {
                        "val": "Weapons & Munitions Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.785"
                        },
                        "CurrentYear": {
                            "val": "16.596"
                        },
                        "BudgetYearOne": {
                            "val": "13.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.200"
                        },
                        "BudgetYearTwo": {
                            "val": "13.161"
                        },
                        "BudgetYearThree": {
                            "val": "15.086"
                        },
                        "BudgetYearFour": {
                            "val": "21.339"
                        },
                        "BudgetYearFive": {
                            "val": "20.262"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs, investigates, and evaluates component technologies to enable affordable precision munitions as well as provide increased lethality and performance with reduced logistics and advanced direct\/indirect fire capabilities. \n\nThis project sustains Army science and technology efforts supporting the Ground portfolio.\n\nWork in this project is related to, and fully coordinated with efforts in projects H19 and H28 (also in PE 0602624A), PE 0602105A (Materials Technology), PE 0602303A (Aviation Advanced Technology), PE 0602618A (Ballistics Technology), PE 0602782A (Command Control, Communication Technology), project 232 in PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy\n\n\nWork in this project is performed by the Armament Research, Development, and Engineering Center (ARDEC), at Picatinny Arsenal, NJ in collaboration with a  the Army Research Laboratory (ARL), Aberdeen Proving Ground, MD; the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL; and the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Novel Propulsion Technology for the Future"
                                    },
                                    "Description": {
                                        "val": "This effort explores propellant technologies such as powder coextrusion and grain coatings, while retaining insensitive properties, for employment in gun launch environments as well as directional thrusters including those that deliver a broad spectrum of effects.  It also conduct experiments with these propellants to increase the range of artillery and mortars rocket assisted projectiles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.029"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Modeled propulsion systems and conducted trade studies for candidate conventional and new chemical ingredients, formulations, and configurations to maximize the performance of chemical propellants while improving their insensitivity to unplanned stimuli; formulated promising propellants and evaluated them for performance and insensitivity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.035"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate new propulsion ingredients for scale up of formulations to provide extended range; design, fabricate and evaluate new charge systems using coextrusion of multiple materials as well as coatings for burn rate modification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.521"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.521"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments on rocket propulsion systems concepts to extend the range of 155mm artillery and 120mm mortar;  will determine ballistic applications for co-extruded propellants; will leverage advancements in combustible cartridge case technologies to improve projectile propulsion; will design and develop optimal propellant configurations for specific applicable systems;  will develop 120mm mortar propellant for 120mm systems for improved range and cost; will develop and optimize advanced propellant for 81mm extended range system compliant with automated direct\/indirect fire mortar (ADIM)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Munition Payloads"
                                    },
                                    "Description": {
                                        "val": "This effort investigates novel payloads and related components for integration into gun-fired munitions and missiles to enable DoD cluster munition replacement policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.342"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated environments that  provided useful data for the development of components- setback, expulsion and impact; matured components and validated effectiveness and reliability through component and bench level testing. Efforts described here are coordinated and complimentary to related efforts in PE 0603004A\/Project 232."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Weapons Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates innovative weapon technologies such as recoil energy mitigation, affordable precision, extended range\/guided technologies, and advanced propelling for future medium caliber direct fire systems that could provide similar or greater lethality than current systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.214"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to mature most promising weapon technologies and evaluated for transition to advanced development; conducted additional small scale research into multiple novel weapon system candidate technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.178"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to mature hydrogen propellant ignition and remote automated gun firing in medium caliber weapons for transition to advanced development; conduct additional small scale research into multiple novel weapon system candidate technologies; develop precision technologies for extended\/guided range applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.297"
                                            },
                                            "Text": {
                                                "val": "Will mature most promising weapon technologies to enable swarming munitions that provide highly lethal target tailorable effects such as advanced miniature fuze and power systems and munition architectures for synergistic effects; will evaluate for transition to advanced development; will conduct additional small scale research into multiple novel weapon system candidate technologies, including fire control decision support services, and enhanced sniper technologies for improved precision at extended ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fire Control Target Recognition"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops networked fire control hardware and software that can be integrated with existing command and control architectures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.120"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Modeled fire control hardware and fire control and target recognition algorithms and conducted trade studies for candidate technologies to maximize the performance of weapon systems, while maintaining commonality for future application to multiple weapon system calibers and configurations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and investigate target data and weapon effects for improved mission planning planning; design and investigate weapon placement coordination; design weapons and effects database; investigate small unit fire control hardware; conduct experiments to validate design efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Line-of-Sight (LOS) Course Correction Munition Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates technologies such as small thrusters fired to the side of the round to correct trajectory and to improve precision and lower collateral damage in munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.080"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and developed components for line-of-sight (LOS) course correction munitions, i.e. warhead, sensor, communication link and guidance\/Control; investigated performance enhancements of a LOS Course correction munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate line-of-sight (LOS) course correction subsystem for ballistic testing; measure both structure and function of LOS course correction subsystem integrated into surrogate munition for performance and success."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Munition Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs and investigates scalable and modular enabling technologies such as novel decelerators, advanced explosive detonators, and advanced control actuators  for gun-launched munitions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.283"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate sensor targeting algorithm solutions for all-weather operations (to include experiments with semi-active laser sensors and other suitable options); investigate and mature affordable control actuation system components; conduct high-g survivability experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Novel Penetrator Designs"
                                    },
                                    "Description": {
                                        "val": "This effort provides novel direct fire capabilities against advanced heavy armor threats by investigating several projectile configurations and non depleted uranium (DU) materials to achieve flight stability and effectiveness against new armored targets."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.691"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.691"
                                            },
                                            "Text": {
                                                "val": "Will optimize components for better function and launch survival; will design and modify non-DU kinetic energy (NexGen KE) functional projectile leading to the tech demo."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Projectile Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops various methods of low cost extended range technologies for 60mm through 120mm mortar. Target acquisition  will improve with the incorporation of semi-active laser (SAL), video and GPS Guidance, Navigation and Control (GNC) state of the art technologies.  The warfighter\/Command & Control on a PDA and\/or computer will be able to see beyond line-of-sight targets and change directions of projectiles while in flight."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.997"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.997"
                                            },
                                            "Text": {
                                                "val": "Will mature component technologies such as aerodynamic shapes, tail fins, lift surfaces,improved propellant and base bleed for 60mm through120mm mortar projectiles; conduct experiments for directing the projectile onto target at ranges beyond 500 meters; validate and mature electronic components for insertion into projectiles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies that provide affordable precision capabilities for projectiles fired into GPS denied environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.695"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.695"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to validate the concept of utilizing commercial-off-the-shelf (COTS) inertial sensors for guided munition applications; determine the feasibility of applying arrayed sensor concepts  to gun launched munitions in order to determine position within navigation grade accuracies; validate target recognition algorithms adapted for use with the imaging modalities selected."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Printed Explosives, Power Sources & Electronics for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort develops and accelerates the state-of-the-art in materials printing, direct write, flexible electronics, and conformal systems for the warfighter."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.704"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.704"
                                            },
                                            "Text": {
                                                "val": "Will develop Printed Electronics, Energetics, Materials, & Sensors (PEEMS) technologies for armament applications; investigate ink development, device fabrication, and testing of printed electronics for current and future armament system;  determine the utility of PEEMS technologies for munitions fuzing, sensing, security, and logistics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Dropped Guided Munition Technology"
                                    },
                                    "Description": {
                                        "val": "This  effort develops and integrates component technologies that will enable a precision delivery and function of a 81mm mortar to defeat moving targets of opportunity in complex terrain."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.295"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.295"
                                            },
                                            "Text": {
                                                "val": "Will mature designs and analyze integration of Proximity Fuze system, with a wrap around antenna, and semi active laser seeker components, designed and developed to fit the volume and form factor of low cost and light weight air drop 60-81mm munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Indirect Fire Weapon Technology"
                                    },
                                    "Description": {
                                        "val": "This effort initially investigates and determines the viability of candidate extended range indirect fire weapon technologies that facilitate hyper-velocity launch and result in ranges beyond 60km.  The effort subsequently addresses the component level technological gaps."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will identify candidate technologies that can be used to facilitate hyper-velocity launch;  will investigate viability of candidate technologies;  will develop concepts utilizing the most promising technologies;  will indentify the subcomponent technological gaps that need to be addressed early."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H19"
                    },
                    "ProjectTitle": {
                        "val": "Asymmetric & Counter Measure Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.753"
                        },
                        "CurrentYear": {
                            "val": "7.762"
                        },
                        "BudgetYearOne": {
                            "val": "9.049"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.049"
                        },
                        "BudgetYearTwo": {
                            "val": "11.989"
                        },
                        "BudgetYearThree": {
                            "val": "15.319"
                        },
                        "BudgetYearFour": {
                            "val": "10.486"
                        },
                        "BudgetYearFive": {
                            "val": "12.046"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs and develops technologies to support asymmetric countermeasures such as radio frequency and ultra-short pulse directed energy and efforts to maintain the lethality and overmatch of US weapons.  Work in this project is related to, and fully coordinated with, efforts in projects H18 and H28 (also in PE 0602624A), PE 0602618A (Ballistics Technology), and projects 232 and L94 in PE 0603004A (Weapons and Munitions Advanced Technology).   \n \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan.   \n \nThis work is performed by the Armament Research, Development, and Engineering Center (ARDEC), at Picatinny Arsenal, NJ, and the Army Research Laboratory (ARL) at Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Novel Battlefield Effectors"
                                    },
                                    "Description": {
                                        "val": "This effort investigates unique weapon and munitions enabling technologies to achieve tunable effects on targets and that are capable of providing a full range of effects from non-lethal to highly lethal via a single weapon or munition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.970"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to develop most promising effector technologies and evaluate for transition to advanced development; conducted additional research into multiple novel battlefield effector candidate technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate most promising effector technologies and evaluate for transition to advanced development; conduct additional research into multiple novel battlefield effector candidate technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.208"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.208"
                                            },
                                            "Text": {
                                                "val": "Will continue to investigate additional new and promising effector technologies and evaluate them for transition to advanced development; conduct experiments to enable size, weight, power and cost (SWaP-C) reduction of solid state active denial technologies to allow for handheld applications and for use on the design of other novel battlefield effector candidate technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Denial Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops non-lethal, counter-personnel directed energy (DE) technology that can repel personnel up to 100 meters. \n."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed design and build of a palletized system to validate that solid state active denial technology could achieve desired range (100 meters); conducted experiments and determined personnel incapacitation or repel effects were achievable."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.761"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete integration and conduct experiments of the solid state active denial technology system to achieve the desired range of 100 meters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Countermeasure (CCM) Technologies for weapons and munitions"
                                    },
                                    "Description": {
                                        "val": "This effort investigates guidance signal reduction, inertial measurement unit, and antenna design technologies to enable continued effectiveness of US weapon systems against enemy countermeasures including Active Protection Systems (APS), Global Positioning System (GPS) jamming, and active seeker jamming."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.268"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to develop most promising CCM technologies and evaluate for transition to advanced development;  conducted additional small scale research into multiple counter countermeasure candidate technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.241"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate most promising CCM technologies and evaluate for transition to advanced development; conduct additional small scale research into multiple counter countermeasure candidate technologies; conduct various experiments to determine effectiveness against future threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.907"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.907"
                                            },
                                            "Text": {
                                                "val": "Will design CCM systems to protect against known vulnerabilities and evaluate for transition to advanced development; will investigate multiple counter countermeasure candidate technologies; explore susceptibilities and remediation techniques for armament systems; conduct various experiments to measure effects of directed energy and develop modeling and simulation to understanding underlying physics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Novel Penetrator Designs"
                                    },
                                    "Description": {
                                        "val": "This effort provides novel direct fire capabilities against advanced heavy armor threats by investigating several projectile configurations and non depleted uranium materials to achieve flight stability and effectiveness against new armored targets"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.015"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and developed novel penetrator designs concepts and conduct penetration experiments against range targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.960"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Down select to one penetrator design based on FY12 penetrator experiments and integrate into projectile cartridge for functional testing; execute a ballistic test to validate range and penetration requirements that support system performance and lethality goals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy (DE) Standoff Enabler"
                                    },
                                    "Description": {
                                        "val": "This effort investigates the capability for stand-off neutralization technology of improvised explosive devices (IED) utilizing high power, DE sources."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.340"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and developed DE standoff improvised explosive device (IED)  neutralization technology; conducted research on high voltage and RF coupling to laser induced plasma filaments; matured components required to achieve multi-mode anti-materiel DE effects"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fire Control Target Recognition & Classification"
                                    },
                                    "Description": {
                                        "val": "This effort incorporates the latest technologies, advanced algorithms, and fire control optical systems that will provide a target recognition and classification capability that currently does not exist."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.014"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.014"
                                            },
                                            "Text": {
                                                "val": "Will utilize  systems engineering to investigate the state-of-the-art of optics, microprocessors and target recognition\/classification algorithms based on market surveys of private industry\/academia\/other government agencies' sensor technologies; establish, develop and mature the associated fire control system requirements and performance goals; generate and evaluate concepts for software and hardware architectures for optimal fire control system performance and size, weight and power considerations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Recoil Reduction Disruptive Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies to reduce recoil momentum and energy waste for integration onto lighter vehicle platforms for increased mobility, using rarefaction wave gun and supporting technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.002"
                                            },
                                            "Text": {
                                                "val": "Will investigate fundamental means of radical recoil reduction to enable large caliber weapons to be lightweight and integrated to lightweight manned and unmanned vehicles; fund research into rarefaction wave gun and supporting technologies for use in supersonic up to hypervelocity launchers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improvised Explosive Device ( IED) Neutralization Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates multiple radio frequency (RF) functions to neutralize IEDs utilizing a common set of hardware and software, on a ground vehicle. It develops novel RF waveforms to neutralize a broad spectrum of IEDs and their electronic triggering devices. Results to transition to explosive hazard predonation system effort in PE 0603004A\/Project 232 in FY2014\/15."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.014"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.014"
                                            },
                                            "Text": {
                                                "val": "Will mature existing IED neutralization systems; conduct research to include the development of IED neutralization waveforms utilizing a modular exciter architecture, and development of a beam steering directional antenna to focus high power RF towards predicted threat zones to neutralize the IED; validate the increased performance of a convoy \/ route clearance based IED neutralization system by interfacing with IED detection sensor systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Decision Enhancing Capabilities for Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort develops target database and target management capability for company and below operations"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.904"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.904"
                                            },
                                            "Text": {
                                                "val": "Will develop software for integration and collaboration of remote weapon station for lethal\/non lethal effects; develop software for the processing and integration of sensor\/target information; develop LOS\/BLOS fires capability for company and below within program of record architecture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H1A"
                    },
                    "ProjectTitle": {
                        "val": "WEAPONS & MUNITIONS TECH PROGRAM INITIATIVE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.941"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Weapons and Munitions Technology applied research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.941"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This Congressional add funded multiple efforts in weapons and munitions System Concepts and Technology (SC&T), ARDEC core competencies, and efforts to support the Squad as a Strategic Formation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H28"
                    },
                    "ProjectTitle": {
                        "val": "Warheads\/ Energetics Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.404"
                        },
                        "CurrentYear": {
                            "val": "10.860"
                        },
                        "BudgetYearOne": {
                            "val": "15.549"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.549"
                        },
                        "BudgetYearTwo": {
                            "val": "15.281"
                        },
                        "BudgetYearThree": {
                            "val": "18.823"
                        },
                        "BudgetYearFour": {
                            "val": "24.917"
                        },
                        "BudgetYearFive": {
                            "val": "24.042"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates and designs enabling warhead and energetic technologies such as novel warhead architectures, new propellant techniques, and high-density explosives to produce smaller, lighter, more effective, multi-role warheads.  \n\nThis project sustains Army science and technology efforts supporting the Ground portfolio.\n\n\nWork in this project is related to, and fully coordinated with efforts in projects H18 and H19 in this PE, PE 0602303 (Aviation Advanced Technology), PE 0602618A (Ballistics Technology), and project 232 in PE 0603004A (Weapons and Munitions Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy\n\nThis work is performed by the U.S. Army Armament Research, Development, and Engineering Center (ARDEC), at Picatinny Arsenal, NJ in collaboration with the Army Research Laboratory (ARL) at Aberdeen Proving Ground, MD; and the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Scalable Warhead Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs scalable and adaptive explosives and reactive materials technology for either gun or missile-launched weapons and munitions that can deliver a broad spectrum of effects with reduced collateral damage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.356"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured scalable and adaptive technology components for small to medium caliber munitions; determined levels of reduced collateral damage using scalable and adaptive technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.210"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and test brassboard designs for shaped charge and explosively formed penetrator (EFP) with scaled up lethality; determine through modeling and simulation the range of lethal to less than lethal effects for scalable warheads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.176"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.176"
                                            },
                                            "Text": {
                                                "val": "Will design and conduct experiments for spin compensated shaped charges, enhanced fragmentation and multiple explosively formed penetrator (MEFP) warheads;  will investigate scalable technologies as they relate to lethal to less than lethal effects;  will develop designs for non-axisymmetric EFP warheads."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energetic Materials and Warheads"
                                    },
                                    "Description": {
                                        "val": "This effort designs energetic materials with controlled energy release for precision munition and counter-munition applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.784"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted scaled-up experiments with new pyrotechnic formulations, high efficiency energetics formulations and warheads with novel energetic material; validated the performance enhancements of new pyrotechnics, energetics and warheads.  Also,  modeled structural materials which exhibited potential for explosive characteristics and conducted trade studies for candidate conventional and new chemical ingredients, formulations, and configurations to maximize the performance of structural materials while improving their insensitivity to unplanned stimuli."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate most promising technologies like structural energetics, solventless propellants, and nanoinsensitive nitramines and evaluate them for transition to advanced development; conduct additional small scale research into multiple energetic materials and warheads candidate technologies for medium and large cal ammunition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.893"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.893"
                                            },
                                            "Text": {
                                                "val": "Will continue to investigate most promising technologies such as disruptive energetics, micro-thrusters and tailorable propellants,highly effective miniature lethal mechanisms, and nano insensitive nitramines; will also conduct evaluation for transition into novel swarming munitions, advanced warheads, medium and large cal ammunition; will seek new applications based on measured performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Insensitive Munitions Multi-Scale Reactive Modeling (IM-MSRM)"
                                    },
                                    "Description": {
                                        "val": "The IM-MSRM effort designs and investigates new M&S tools for the design and development of insensitive munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated and matured continuum models of thermal kinetics ignition based on meso and molecular\/atomic level predictions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate and develop atom level computer code modifications to create material models; develop mixed mode (blast\/fragmentation) analytical capability and detonation shock dynamics to improve the representations of physics and chemistry in explosives and provide more accurate supercomputer design tools for the U.S. insensitive munitions design community"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosives Research"
                                    },
                                    "Description": {
                                        "val": "This effort develops high energy\/high performance, multi-purpose insensitive munitions (IM) explosives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.564"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and develop new insensitive formulations using IM MSRM modeling and simulation tools; began to validate the models with experiments of new insensitive energetics ingredients; and investigated different caliber munitions for the application of the new energetics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin optimization and scale-up of promising ingredients formulations and tailored explosives for mixed-mode and combined effects; conduct baseline design and testing of novel components as well as structures based on nano-energetics, energetic fibers and reactive alloys, explosive inks, multipoint initiation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.996"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.996"
                                            },
                                            "Text": {
                                                "val": "Will determine most promising compounds to enable tailored energy release and combined effects; investigate and characterize new insensitive energetic ingredients; design and develop novel concepts for explosive initiation and formulation; scale up and test Nano energetic materials in TRL-4-5 experiments; develop nano-enhanced melt pour ingredients for reduced sensitivity and cost."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Material Development for Water Purification"
                                    },
                                    "Description": {
                                        "val": "This effort originated from a material development for armament systems and was found to have a dual use application.  The effort (also known as Adaptive Armament Reactive Interface Domains\/AARID) is intended to provide a capability to enhance contingency basing water efficiency via recycling with secondary contributions to reduction of waste and power.  Lesser focus advantages are on sustainment, greater logistics flexibility, and reduced Warfighter threat from supply convoys."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.499"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.499"
                                            },
                                            "Text": {
                                                "val": "Will investigate cycle time and water flow, determining rate of reaction for decontamination, validate the coating to lend itself useful for robustness of current filters, and design and develop laboratory systems for conducting experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosives Safety for Automated Base Camp Planning"
                                    },
                                    "Description": {
                                        "val": "This effort determines data interoperability requirements between explosive safety and base camp planning software tools; designs an integrated tool that increases explosive safety for base camps by managing the risk due to interaction between changes in Net Explosive Weight, geography, facilities and force structure.\nIn FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection - Basing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Will determine data interoperability requirements of explosives safety, risk assessment, and base camp planning tools leading to the development of the design architecture for an automated comprehensive base camp planning software suite."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tunable Pyrotechnics"
                                    },
                                    "Description": {
                                        "val": "This effort develops smoke and flare countermeasure for passive protection for ground and air combat platforms, and hand held signals for illumination and signaling.  This will increase warfighter and aircraft survivability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.685"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.685"
                                            },
                                            "Text": {
                                                "val": "Will investigate ultraviolet countermeasure (UVCM) flare reformulation with modeling & simulation and validate in scale up experiments; will develop and validate laser beam rider countermeasure (LBRCM) designs with functional experiments; will design & develop image seeking countermeasure (ISCM) flare configurations;. will mature and validate white illumination hand held signal designs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}