{
    "id": "4537d74114c3a4a35e49fb576b7c7a120e7e966d",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0203345D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Operations Security Initiative"
        },
        "R1LineItemNumber": {
            "val": "167"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "1.720"
            },
            "CurrentYear": {
                "val": "2.637"
            },
            "BudgetYearOne": {
                "val": "5.306"
            },
            "BudgetYearOneBase": {
                "val": "5.306"
            },
            "BudgetYearTwo": {
                "val": "7.121"
            },
            "BudgetYearThree": {
                "val": "8.696"
            },
            "BudgetYearFour": {
                "val": "8.854"
            },
            "BudgetYearFive": {
                "val": "9.026"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Operations Security (OPSEC) Initiative (DOSI) is an effort to revitalize DoD OPSEC capability and capacity across the Department to enable combatant commands (COCOMs), Services and Defense agencies with the capability and capacity to effectively plan, integrate, execute and assess OPSEC, particularly in concert with Military Deception (MILDEC) and other information-related capabilities used against adversaries or potential adversaries during military operations.  The DOSI provides oversight, guidance and program management support for Defense OPSEC education, training, exercises, career force management, operational and programmatic assessment, capability development, intelligence, planning, analysis and operational employment in Defense military operations.  RDT&E funds support the development, establishment and integration of OPSEC capabilities, next generation technologies, and Department activities. The objectives of the OPSEC Initiative are to:\n\n1. Establish governance structures, processes and procedures for development and oversight of infrastructure, policy, authorities, and warfighter advocacy across the Joint community and the defense support agencies and for OPSEC intelligence integration that will focus on the incorporation of special intelligence requirements; intelligence and threat repository support; Open Source Intelligence, Human Intelligence, Counterintelligence and Signals Intelligence support; and intelligence support to Military Deception in Support of OPSEC (DISO).\n2. Develop a concept for integrating OPSEC into critical plans, operations and activities that will clearly articulate OPSEC requirements and the means for fulfilling them.\n3. Establish an OPSEC force structure to meet the Department’s requirements by evaluating existing force structures, focusing on billets, personnel identifications and tracking, allocation, and operational employment.\n4. Create an integrated OPSEC education, training and exercise program that can be incorporated with MILDEC and other information-related capabilities and that focuses on exercise support and formal education curricula review and development.\n5. Develop a Technology and Tools Research, Testing, and Development Program to identify emerging physical, technical, and administrative technologies and tools.\n6. Fully integrate OPSEC and MILDEC so that they synchronize efficiently and effectively.\n7. Incorporate OPSEC and MILDEC as an integrated whole with other information-related capabilities such as Military Information Support Operations (MISO), Electronic Warfare (EW), Computer Network Operations (CNO), Intelligence, Counterintelligence (CI), Security, Special Technical Operations (STO) and Public Affairs (PA).\n8. Establish assessment programs to assess friendly and adversary measures and countermeasures based on observable actions, indicators, or information that can provide a basis for identifying such control measures as Action Controls, Countermeasures, and Counter Analysis and for assessing revised policy, doctrine, force structure, training and governance processes to identify corrective actions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.721"
                },
                "CurrentYear": {
                    "val": "2.637"
                },
                "BudgetYearOne": {
                    "val": "5.340"
                },
                "BudgetYearOneBase": {
                    "val": "5.340"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.720"
                },
                "CurrentYear": {
                    "val": "2.637"
                },
                "BudgetYearOne": {
                    "val": "5.306"
                },
                "BudgetYearOneBase": {
                    "val": "5.306"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.001"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.034"
                },
                "BudgetYearOneBase": {
                    "val": "-0.034"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Department Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.034"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.034"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Adjustment to fund higher priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "345"
                    },
                    "ProjectTitle": {
                        "val": "Defense Operations Security Initiative"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.720"
                        },
                        "CurrentYear": {
                            "val": "2.637"
                        },
                        "BudgetYearOne": {
                            "val": "5.306"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.306"
                        },
                        "BudgetYearTwo": {
                            "val": "7.121"
                        },
                        "BudgetYearThree": {
                            "val": "8.696"
                        },
                        "BudgetYearFour": {
                            "val": "8.854"
                        },
                        "BudgetYearFive": {
                            "val": "9.026"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Operations Security (OPSEC) Initiative (DOSI) is an effort to revitalize DoD OPSEC capability and capacity across the Department to enable combatant commands (COCOMs), services and defense agencies with the capability and capacity to effectively plan, integrate, execute and assess OPSEC, particularly in concert with Military Deception (MILDEC) and other information-related capabilities used against adversaries or potential adversaries during military operations.  The DOSI provides oversight, guidance and program management support for Defense OPSEC education, training, exercises, career force management, operational and programmatic assessment, capability development, intelligence, planning, analysis and operational employment in Defense military operations.  RDT&E funds support the development, establishment and integration of OPSEC capabilities, next generation technologies, and Department activities. The objectives of the Defense Operations Security (OPSEC) Initiative are to:\n\n1. Establish governance structures, processes and procedures for development and oversight of infrastructure, policy, authorities, and warfighter advocacy across the Joint community and the defense support agencies and for OPSEC intelligence integration that will focus on the incorporation of special intelligence requirements; intelligence and threat repository support; Open Source Intelligence, Human Intelligence, Counterintelligence and Signals Intelligence support; and intelligence support to Military Deception in Support of OPSEC (DISO).\n2. Develop a concept for integrating OPSEC into critical plans, operations and activities that will clearly articulate OPSEC requirements and the means for fulfilling them.\n3. Establish an OPSEC force structure to meet the Department’s requirements by evaluating existing force structures, focusing on billets, personnel identifications and tracking, allocation, and operational employment.\n4. Create an integrated OPSEC education, training and exercise program that can be incorporated with MILDEC and other information-related capabilities and that focuses on exercise support and formal education curricula review and development.\n5. Develop a Technology and Tools Research, Testing, and Development Program to identify emerging physical, technical, and administrative technologies and tools.\n6. Fully integrate OPSEC and MILDEC so that they synchronize efficiently and effectively.\n7. Incorporate OPSEC and MILDEC as an integrated whole with other information-related capabilities such as Military Information Support Operations (MISO), Electronic Warfare (EW), Computer Network Operations (CNO), Intelligence, Counterintelligence (CI), Security, Special Technical Operations (STO) and Public Affairs (PA).\n8. Establish assessment programs to assess friendly and adversary measures and countermeasures based on observable actions, indicators, or information that can provide a basis for identifying such control measures as Action Controls, Countermeasures, and Counter Analysis and for assessing revised policy, doctrine, force structure, training and governance processes to identify corrective actions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Operations Security Initiative (DOSI)"
                                    },
                                    "Description": {
                                        "val": "The Defense Operations Security (OPSEC) Initiative (DOSI) is an effort to revitalize DoD OPSEC capability and capacity across the Department to enable combatant commands (COCOMs), Services and Defense agencies with the capability and capacity to effectively plan, integrate, execute and assess OPSEC, particularly in concert with Military Deception (MILDEC) and other information-related capabilities used against adversaries or potential adversaries during military operations.  The DOSI provides oversight, guidance and program management support for Defense OPSEC education, training, exercises, career force management, operational and programmatic assessment, capability development, intelligence, planning, analysis and operational employment in Defense military operations.  RDT&E funds support the development, establishment and integration of OPSEC capabilities, next generation technologies, and Department activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.720"
                                            },
                                            "Text": {
                                                "val": "-Developed a tailored DoD OPSEC training course focused on integrating OPSEC with warfighter operations.\n-Planned and developed a concept and strategy to refocus OPSEC as an operations function designed to reduce availability of critical information and indicators to adversary collection capabilities in order to enhance warfighter operations.\n-Worked with the Joint Staff to update the Chairman’s Instruction on Joint OPSEC (CJCSI 3213.01C).\n-Worked with Under Secretary of Defense for Policy (USD(P)) to ensure the draft DoD Directive on Information Operations (DoDD 3600.01) effectively addressed OPSEC and MILDEC.\n-Developed and coordinated an update to the USD(I) chartering Directive (DoDD 5143.01) to specify USD(I) OPSEC and MILDEC responsibilities.\n-Completed an OPSEC Education and Training Needs Assessment (ETNA) of the COCOMs.\n-Drafted and informally coordinated a new DoD Instruction on Operational Integration of OPSEC (DoDI 3606.aa).\n-Coordinated and established a Defense-wide OPSEC governance structure.\n-Developed a concept for integrating OPSEC into critical plans, operations and activities throughout the Department.\n-Initiated evaluation of existing reported OPSEC force structure and worked with USD for Policy (USD(P)) and Cost Assessment and Program Evaluation (CAPE) to clarify force structure reporting requirements to better depict the Department’s OPSEC capability and capacity.\n-Initiated an OPSEC Joint Concept Development and Experimentation (JCD&E) initiative to address joint force capability gaps and current\/future security challenges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.637"
                                            },
                                            "Text": {
                                                "val": "-Refine and implement the DoD OPSEC training course focused on integrating OPSEC with warfighter operations and examine requirements for additional service, agency and joint OPSEC education and training initiatives.\n-Refine and further develop the concept and strategy to refocus OPSEC as an operations function and implement viable portions of it.\n-Finalize and formally coordinate and publish a new DoD Instruction on Operational Integration of OPSEC (DoDI 3606.aa).\n-Complete evaluation of revised reporting on OPSEC force structures and draft\/coordinate objective force structures for COCOMs, services and defense agencies to satisfy the Department’s OPSEC capability and capacity requirements.\n-Work with the Joint Staff, COCOMs, Services and Combat Support Agencies to complete the OPSEC JCD&E initiative and address joint force capability gaps and current\/future security challenges to the Joint Requirements Oversight Council (JROC).\n-Determine OPSEC technology and tools research, testing, and development requirements and advocate for the acquisition of emerging physical, technical, and administrative technologies and tools.\n-Integrate OPSEC and MILDEC so that they synchronize efficiently and effectively.\n-Initiate the incorporation of OPSEC and MILDEC as an integrated whole with other information-related capabilities such as Military Information Support Operations (MISO), Electronic Warfare (EW), Computer Network Operations (CNO), Intelligence, Counterintelligence (CI), Security, Special Technical Operations (STO) and Public Affairs (PA).\n-Establish a program to assess friendly and adversary measures and countermeasures based on observable actions, indicators, or information that can provide a basis for identifying such control measures as Action Controls, Countermeasures, and Counter Analysis.\n-Establish a program to assess revised policy, doctrine, force structure, training and governance processes to identify corrective actions.\n-Continue OPSEC Joint Concept Development and Experimentation (JCD&E) initiative to address joint force capability gaps and current\/future security challenges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.306"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.306"
                                            },
                                            "Text": {
                                                "val": "-Coordinate prioritization of OPSEC force structure requirements and advocate on the DoD Components’ behalf to fill critical priorities and advocate to fill secondary and tertiary priorities as resources become available.\n-Coordinate with the COCOMs, services and agencies to integrate OPSEC education and training with appropriate information-related capability education and training programs.\n-Continue to examine OPSEC technology and tools research, testing, and development requirements and advocate for the acquisition of emerging physical, technical, and administrative technologies and tools.\n-Complete the incorporation of OPSEC and MILDEC as an integrated whole with other information-related capabilities such as MISO, EW, CNO, Intelligence, CI, Security, STO and PA.\n-Continue to execute a program to assess friendly and adversary measures and countermeasures based on observable actions, indicators, or information that can provide a basis for identifying such control measures as Action Controls, Countermeasures, and Counter Analysis.\n-Continue to execute a program to assess revised policy, doctrine, force structure, training and governance processes to identify corrective actions.\n-Continue OPSEC Joint Concept Development and Experimentation (JCD&E) initiative to address joint force capability gaps and current\/future security challenges."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are measured through internal management controls and external assessments.  Performance metrics include, but are not limited to, time, money, realism, and fidelity as defined below:\n\nTime - Enable the warfighter to speed up processes faster than current capabilities.\nMoney - Enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities allow.\nRealism - Enable the warfighter to create an environment that is closer to the real world environment than current capabilities allow.\nFidelity - Ensure unity of efforts throughout the Information Operations (IO), Cyber, and Intelligence Operations Integrations (IOI) Communities."
                        }
                    }
                }
            ]
        }
    }
}