{
    "id": "51dce58a60847b855fdbf132c3ab9258fbe29089",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603200D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Advanced Concepts"
        },
        "R1LineItemNumber": {
            "val": "33"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.100"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This effort will investigate new concepts and technologies that fill critical warfighter needs with joint and interoperable systems at all echelons of warfare.  Through advanced mathematics and engineering methodologies, the Joint Interoperability Directorate will work to institutionalize joint interoperability concepts throughout the DoD to ensure reduced fratricide, increased force effectiveness, and decreased taxpayer cost through fully interoperable weapons remains a focus throughout the acquisition and program development processes.  Working closely with programs in the advanced technology development phase, this effort will result in reviews of program technology feasibility from an interoperability perspective and push to proof of concept through prototyping and modeling.\n\nJoint Interoperability has additional efforts to develop advanced mathematics techniques to manage large volumes of sensor data to solve DoD Battlefield challenges, to review new interoperability technologies, and to review program documentation not only to ensure a joint and interoperable approach, but also to mature technologies that advance warfighter effectiveness and that apply technology rapidly to battlespace challenges.\n\nFunding for this Program Element ends in FY 2012."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.571"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.100"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.529"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.531"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P208"
                    },
                    "ProjectTitle": {
                        "val": "Joint Interoperability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.874"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Director, Joint Interoperability provides oversight and guidance to initiatives and programs that support the joint tactical warfighter to enable reduced fratricide, increased force effectiveness, and decreased taxpayer cost through fully interoperable weapons systems, down to the tactical level of engagement.  Joint interoperability is the force multiplier that will enable our warfighters to fight jointly, be more efficient and effective in the battlespace, and allow warfighters to fight in the battle and not the tactical Command, Control, and Communications (C3) displays.  Sharing of systems and information across Services, and with coalition and non-DoD partners, has the benefit of a more rapid and better coordinated response to an ever more agile adversary.  It also enables the full exploitation of our costly (legacy and future) weapon systems at full kinematic range and makes full use of the assets in theater.  The taxpayers also benefit from reducing the cost of weapon system procurement by paying once versus multiple times for weapons systems that are used by Services in the battlespace."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Interoperability"
                                    },
                                    "Description": {
                                        "val": "• Identify Friend or Foe (IFF) Mode Five (Mode 5) Technology Synchronization.\n• IFF M5 North Atlantic Treaty Organization (NATO) Interoperability and technology export.\n• Joint Personnel Recovery (JPR) – Demand Assigned Multiple Access-Compatible (DAMA-C) lead with Defense Information Systems Agency (DISA), Services, and Joint Staff; Interoperability of personnel recovery equipment.\n• Sensor Signatures Oversight.\n• Interoperability Commission. \n• Digital Joint Close Air Support – Lead for the Office of the Under Secretary of Defense for Acquisition, Technology & Logistics (OUSD(AT&L)) – interoperability technology.\n• Command, Control, Computers, and Communications (C4)\/Cyber and Battlespace Awareness (BA) Functional Capabilities Boards and Working Group support.\n• Address policies and procedures used to ensure net-centric joint interoperability.\n• Model Driven Architecture exploitation in DoD.\n• Oversight of net-enabled Interoperability technologies.\n• Lead technology development for an All Domain Tactical Picture.\n• Perform Capability Development Framework (CDF) Interoperability Assessments for critical capability areas (for example, Base Protection and Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR))."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.874"
                                            },
                                            "Text": {
                                                "val": "• Led IFF Mode 5 Technology Synchronization.\n• Led IFF Mode 5 NATO Interoperability and technology export.\n• Led JPR – DAMA-C lead with DISA, Services, and Joint Staff  to improve Interoperability of personnel recovery equipment.\n• Provided Sensor Signatures Oversight.\n• Served as U.S. Chair on the Interoperability Commission for CID bilateral with the United Kingdom.\n• Served as the AT&L lead for Digital Joint CAS interoperability technology.\n• Revised policies and procedures used to ensure net-centric joint interoperability.\n• Led efforts on Model Driven Architecture and Open Architecture exploitation in DoD.\n• Provided oversight of net-enabled Interoperability technologies.\n• Led technology development for an All Domain Tactical Picture.\n• Performed CDF Interoperability Assessments for critical capability areas (for example:  Base Protection and C4ISR).\n• Enhanced the interface of Joint Capabilities Integration and Development System (requirements) with early stage system engineering.\n• Discovered, analyzed, and documented best practices for development planning and system of systems engineering.\n• Analyzed and documented interdependencies between DoD systems and mission areas."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "Not applicable for this item."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P209"
                    },
                    "ProjectTitle": {
                        "val": "Math Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.317"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Advances in mathematics must be applied to DoD systems in order to provide a common tactical picture for real-time, tactical operations with near-term potential for application to solve the Department's most pressing operational problems.  They will develop novel approaches to implement non-classical methods to solve computationally intensive problems like fusing numerous sensors that are generating terabytes of data in Afghanistan.  Our ability to sense has far exceeded our ability to process data into information.  Developing algorithms that are more computationally efficient at discerning information from large datasets will place smaller demands on our limited bandwidth and better enable the disadvantaged user to get information down to the tactical level.  This effort includes tests against recorded live data to demonstrate relevance to identified military needs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Math Program"
                                    },
                                    "Description": {
                                        "val": "This effort will develop advanced mathematical software algorithms and components in DoD-relevant areas such as topological evaluation and visualization of massive and high dimensional data sets, topological data analysis, and enhanced data extraction and filtering and fusion algorithms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.317"
                                            },
                                            "Text": {
                                                "val": "Continued to work with the following Advanced Mathematics Teams to ensure all DoD math challenge goals and milestones are met; to include their accomplishment of demonstrations on the Bluegrass Data:  (1) Pennsylvania State University Team Members; (2) BAE Team Members; (3) Johns Hopkins University\/Applied Physics Laboratroy Team; (4) Raytheon Team; and (5) Toyon Research Corporation.  Coordinated among the Advanced Mathematics teams and with the Bluegrass data team to ensure they continue to: (1) meet the technical challenge requirements; (2) meet their program milestones; (3) meet the needs of the warfighters and the developers of the warfighting systems; and (4) work effectively with Service labs throughout DoD to facilitate transition of the advanced mathematics topological methods to warfighting systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Successful demonstration using Bluegrass data no later than 1Q FY 2013 of either 1) Creating the elements of a common tactical picture in the low\/slow air and ground domain, or 2) Optimizing Sensor Placement and Management, depending on which challenge problem is being addressed."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P211"
                    },
                    "ProjectTitle": {
                        "val": "Joint Interoperability  Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.909"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funds re-aligned for higher priorities."
                        },
                        "ProjectMissionDescription": {
                            "val": "Based on recent Assistant Secretary of Defense (Research and Engineering) reorganization, the requirements of the Joint Interoperability program have grown and evolved to cover areas beyond what they had been previously.  Joint Interoperability removes barriers to communication and acts as a force multiplier to enable our warfighters to fight more efficiently and effectively across the spectrum of operations and is focused on maturing technologies that advance warfighter effectiveness and that apply technology rapidly to battlespace challenges.  Examples of the types of projects that are envisioned under this Program Element will focus on reducing fratricide, increasing force effectiveness, and reducing major acquisition program costs through fully interoperable weapons systems operating at tactical levels.  Typically these projects are on the technology maturity scale where an idea or technology opportunity is proven and demonstrated."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Interoperabiltiy Technology Development"
                                    },
                                    "Description": {
                                        "val": "This project will focus on reducing fratricide, increasing force effectiveness, and reducing major acquisition program costs through fully interoperable weapons systems operating at tactical levels.  Typically these projects are on the technology maturity scale where an idea or technology opportunity is proven and demonstrated."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.909"
                                            },
                                            "Text": {
                                                "val": "This project supported focus areas in portfolio management and activities associated with our program evaluation responsibilities providing for early shaping of Pre-Milestone A programs.  The effort provided early shaping of Department-wide portfolio based investment decisions, development, coordination, and institutionalization of enterprise wide Business Rules and procedures for investment strategies and resource balancing, integration of the requirements process with the acquisition process to bridge our military and civilian areas of responsibility with all Combatant Command, Services and Agencies.  In addition, provided DeputySecretary of Defense and DoD Components advice on how to maximize capability investment to meet warfighter needs.  Led the development of integrated capability roadmaps, and supported acquisition program reviews and development of Guidance for Development of the Force.  Represented Acquisition and Technology interests in requirements for future acquisition systems.  Developed and updated capability roadmaps to inform decision makers for portfolio investment decisions and DoD Requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "Not applicable for this item."
                        }
                    }
                }
            ]
        }
    }
}