{
    "id": "55a4c9eeda60a8b98d060fcfb391b73c272d8048",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DARPA_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602715E"
        },
        "ProgramElementTitle": {
            "val": "MATERIALS AND BIOLOGICAL TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "203.826"
            },
            "CurrentYear": {
                "val": "166.067"
            },
            "BudgetYearOne": {
                "val": "166.654"
            },
            "BudgetYearOneBase": {
                "val": "166.654"
            },
            "BudgetYearTwo": {
                "val": "179.383"
            },
            "BudgetYearThree": {
                "val": "193.695"
            },
            "BudgetYearFour": {
                "val": "194.814"
            },
            "BudgetYearFive": {
                "val": "199.412"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element is budgeted in the Applied Research Budget Activity because its objective is to develop material, biological and energy technologies that make possible a wide range of new military capabilities.\n\nThe major goal of the Materials Processing Technology project is to develop novel materials, materials processing and manufacturing techniques, mathematical models and fabrication strategies for advanced structural and functional materials and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems.  Included in this project are efforts across a wide range of materials including: structural materials and devices, functional materials and devices, and materials that enable new propulsion concepts for land, sea, and space vehicles and low distortion optical lenses.\n\nThe Biologically Based Materials and Devices project acknowledges the growing and pervasive influence of the biological sciences on the development of new materials, devices and processes, as well as the commensurate influence of materials, physics and chemistry on new approaches to biology and biochemistry.  Contained in this project are thrusts in the application of biomimetic materials and devices for Defense, the development of biochemical materials to maintain performance, the use of biology's unique fabrication capabilities to produce structures that cannot be made any other way, and the development of manufacturing tools that use biological components and processes for material synthesis.  It also supports a major thrust that will revolutionize the development of prosthetics for the wounded soldier.\n\nThe Tactical and Strategic Energy Technology project focused on the unique challenges facing the DoD in developing and demonstrating advanced power generation and energy storage technologies.  It addressed critical military needs for improved energy efficiency and availability to support a range of military missions that include individual warfighter and small unit operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "219.816"
                },
                "CurrentYear": {
                    "val": "166.067"
                },
                "BudgetYearOne": {
                    "val": "191.363"
                },
                "BudgetYearOneBase": {
                    "val": "191.363"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "203.826"
                },
                "CurrentYear": {
                    "val": "166.067"
                },
                "BudgetYearOne": {
                    "val": "166.654"
                },
                "BudgetYearOneBase": {
                    "val": "166.654"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-15.990"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-24.709"
                },
                "BudgetYearOneBase": {
                    "val": "-24.709"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-9.999"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.991"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-24.709"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-24.709"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Decrease reflects reductions for internal below threshold reprogrammings and the SBIR\/STTR transfer. \nFY 2014:  Decrease reflects completion of selected power and materials efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MBT-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS PROCESSING TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "113.051"
                        },
                        "CurrentYear": {
                            "val": "128.444"
                        },
                        "BudgetYearOne": {
                            "val": "126.353"
                        },
                        "BudgetYearOneBase": {
                            "val": "126.353"
                        },
                        "BudgetYearTwo": {
                            "val": "128.407"
                        },
                        "BudgetYearThree": {
                            "val": "129.338"
                        },
                        "BudgetYearFour": {
                            "val": "139.729"
                        },
                        "BudgetYearFive": {
                            "val": "143.577"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The major goal of the Materials Processing Technology project is to develop novel materials, materials processing techniques, mathematical models and fabrication strategies for advanced structural and functional materials and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems.  Included in this project are efforts across a wide range of materials including structural materials and devices, functional materials and devices, low distortion optical lenses, and materials that enable new propulsion concepts for land, sea, and space vehicles."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Materials Processing and Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Materials Processing and Manufacturing thrust is exploring new manufacturing and processing approaches that will dramatically lower the cost and decrease the time required to fabricate DoD systems.  It will also develop approaches that yield new materials and materials capabilities that cannot be made through conventional processing approaches as well as address efficient, low-volume manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.015"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated microstructure\/property\/process relationship needed for overcoming critical defect limitations in carbon fiber performance for structural applications.\n-  Demonstrated carbon fiber with 50% improvement in stiffness over today's state-of-the-art high-strength structural carbon fibers.\n-  Established  viability of fiber production process for structural carbon fiber in suitable quantities for small-lot manufacturing.\n-  Developed rapid, robust manufacturing and processing capabilities that resulted in an expanded base of manufacturing, improved performance, reduced production times, and more affordable manufacturing.\n-  Established rapid qualification and certification methodologies to enable low-cost, high-confidence prediction of performance in actual manufactured products."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.550"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate carbon fiber with 100% improvement in strength and 50% improvement in stiffness over today's state-of-the-art high-performance structure carbon fibers, at manufacturing scale.\n-  Develop and demonstrate rapid, robust manufacture processes with an end goal of 20% increase in key material properties, 50% reduction of cost over baseline, and 50% reduction in time over baseline.\n-  Establish impartial manufacturing centers of expertise that provide capability to non-traditional suppliers for demonstration, testing, and qualification of new manufacturing technologies; assist in transition to the supply chain; provide access to potential customers; and facilitate training. \n-  Perform virtual manufacturing system exercises that pass design, manufacture, and verification of a specific part through the entire chain.\n-  Demonstrate rapid qualification and certification methodologies that empirically optimize part qualification and employ probabilistics models for variability analysis and risk, with end goal of 50% reduction in certification time and cost."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.300"
                                            },
                                            "Text": {
                                                "val": "-  Validate predictive capability of process models on material properties and microstructure as well as component performance, quality level, and manufacturing effectiveness.\n-  Validate new probabilistic models and uncertainty quantification methodologies for rapid qualification and certification.\n-  Develop and demonstrate manufacturing assessment tools for select new manufacturing technologies.\n-  For additive manufacture of selected components, establish limits on lot size that provide a 50% reduction in cost and time over standard fabrication baselines.\n-  Establish a library of process models and manufacturing data to support model use and improvement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Structural Materials and Coatings"
                                    },
                                    "Description": {
                                        "val": "The Structural Materials and Coatings thrust is exploring and developing new materials that will provide enhanced structural and\/or surface properties for DoD applications.  Included are approaches that avoid corrosion through engineered material, provide superior strength at greatly reduced material density, provide the basis for a new generation of structural composite and submarine propeller materials, and enable prolonged lifetimes for DoD systems and components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.686"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated that meltless titanium alloy exhibits properties equivalent to the same conventionally processed alloy.\n-  Completed testing of two 24\" x 96\" x 12\" thick multi-material beam manufacturing demonstration articles. \n-  Designed, fabricated, and evaluated complex artifacts to determine the ability to adapt multi-material technology to complex geometries including addressing mechanical properties, structural details, modal characteristics, shock, fatigue, and dimensional controls. \n-  Addressed high-risk aspects of multi-material manufacturing and testing methods to scale-up the manufacturing process to full-scale articles.\n-  Designed, fabricated, and tested half artifact for experimental modal analysis to measure natural frequencies and mode shapes. \n-  Developed plans and test methods to address critical high-risk structural details of the blade connection methods.\n-  Continued development and initiated verification of the Coupling Software Environment (CSE) to enable strong coupling of the hybrid multi-material rotor (HMMR) domain codes required for time-accurate performance predictions of multi-material rotors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete CSE development and verification to enable strong coupling of the HMMR domain codes required for time-accurate performance predictions of multi-material rotors. \n-  Manufacture and evaluate complex structural test specimens demonstrating ability to design robust products with multi-material technology.\n-  Utilize the CSE to develop a design for a scaled multi-material propeller or rotor for testing on a large-scale vehicle.\n-  Design and fabricate representative articles for large-scale propeller or rotor blades for mechanical evaluations. \n-  Develop manufacturing process plans for large-scale vehicle propeller or rotor blades."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Deliver large-scale rotor to the Navy for in-water testing and assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multifunctional Materials and Structures"
                                    },
                                    "Description": {
                                        "val": "The Multifunctional Materials and Structures thrust is developing materials and structures that are explicitly tailored for multiple functions and\/or unique mechanical properties.  This thrust also explores novel materials and surfaces that are designed to adapt structural or functional properties to environmental and\/or tactical threat conditions.  Included in this thrust are efforts that will lower the weight and increase the performance of aircraft, enhance the efficiency of turbines, and improve the performance of surface dominated properties (friction, wear, and membrane permeability).  New materials synthesis processes for thin films will also be explored to extend equipment lifetime and reduce logistics costs.  In addition, reactive structures that can serve as both structure and explosive will be developed to decrease the weight and increase the performance of munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Designed a man-powered pump to drive a desalination device enabling 75 gph potable output from seawater with an overall power consumption of less than or equal to 5W\/gph.\n-  Finalized the design and test adaptive structural sub-assemblies incorporating tiered negative stiffness structural elements; activities included final design construction and testing of adaptive structural systems. \n-  Completed the development, construction, and testing of an adaptive structural sub-assembly that incorporated mechanical programs of tiered negative stiffness structural elements.\n-  Exploited latest generation laser technology to study high-temperature chemical reactions at room temperature."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a lightweight (20lbs) desalination system that provides up to 75gph potable output from seawater with an overall power consumption of less than or equal to 5W\/gph.\n-  Establish techniques to create a high flux of gas-phase reactants to a surface at ambient pressure and temperature. \n-  Demonstrate enhanced mobility of reactant molecules on a surface layer for material growth without bulk substrate heating.\n-  Exploit phenomena such as surface plasmon resonances to enable site-specific nucleation and growth of high-temperature coatings at room temperature. \n-  Conclude study to determine potential to concurrently reduce explosive payload while maintaining blast output. \n-  Complete characterization of load and strain rate effects on modulus of reactive cases as a function of microstructure, case thickness, and load path.\n-  Complete efforts to optimize amorphous metal reactive structure composition and morphology to sustain loads to >100,000 psi and at strain rates >10^3 sec^-1.\n-  Optimize fiber weave reinforcement architecture (3D) to sustain tensile, compressive, and hoop loads to >100.000 psi and at strain rates >10^3 sec^-1.\n-  Optimize composition, architecture, and impedance of fiber reinforcement weave and reactive matrix to \"extrude\" reactive constituents through reinforcement weave and produce activated, micron reactive particles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.374"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.374"
                                            },
                                            "Text": {
                                                "val": "-  Integrate flux, mobility and reactivity process components to validate low-temperature deposition of DoD-relevant thin film coatings that currently require high bulk temperature.\n-  Quantify temporal and spatial stability of reactive species at ambient temperature for a DoD-relevant thin film coating in an integrated deposition system.\n-  Initiate comprehensive local control approach to thin film synthesis. \n-  Integrate fiber-reinforced reactive matrix and high-stiffness amorphous metals into reactive case structure and characterize dynamic mechanical response. \n-  Demonstrate ability to survive penetration into reinforced concrete with a minimal amount of strain deformation.\n-  Demonstrate survivability of impact into reinforced concrete at ballistic velocities.\n-  Demonstrate scalability to low-rate manufacturing scales while maintaining blast enhancement of survivable materials over inert cased charge."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials for Force Protection"
                                    },
                                    "Description": {
                                        "val": "The Materials for Force Protection thrust is developing novel materials and materials systems that will greatly enhance protection against ballistic, blast, and explosively formed projectile (EFP) threats across the full spectrum of warfighter environments.  Included in this thrust are novel topological concepts as well as entirely new structural designs that will afford enhanced protection and functionality, at reduced weight and\/or cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.538"
                                            },
                                            "Text": {
                                                "val": "-  Extended the multi-hit performance capability of transparent armor at weights equivalent to that of opaque armor and its durability across the range of military operating environments (e.g., temperature, humidity, rock strike).\n -  Continued to identify and evaluate promising new armor concepts from non-traditional organizations both for military personnel and vehicles.\n-  Conducted experimental characterization of candidate energy management integrated into armor materials across stress levels, strain rates, and impulsive loading regimes characteristic of ballistic and blast threat regimes.\n-  Continued development and validation of physics-based models to explicitly compute dynamic behavior of armor materials that incorporate essential materials properties, critical response characteristics, and relevant energy management mechanisms. \n-  Continued development of ballistic and blast energy management mechanisms and initiated integration with material properties into candidate armor material systems for optimization against specific threats.\n-  Applied high performance armor technologies to maritime platform armor concepts and adapted them for applications where traditional materials would not be appropriate for the operational environment.\n-  Demonstrated laboratory scale synergistic passive and active armor systems for warhead defeat in multi-material configurations within critical size, weight, power, space, and cost constraints.\n-  Optimized advanced armor solutions utilizing the explosive reactive armor and non-explosive reactive armor  concepts.  Tested, modeled, and simulated target interactions to determine armor performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.573"
                                            },
                                            "Text": {
                                                "val": "-  Scale up transparent armor solution with multi-hit performance capability of transparent armor at weights equivalent to that of opaque armor and demonstrate the ability to produce transparent armor in military relevant sizes and shapes while maintaining optical and ballistic performance characteristics. \n-  Initiate development of capability to accurately account for and track load paths during an underbody blast event and provide material properties and energy management mechanisms to meet survivability objectives. \n-  Continue to identify and evaluate promising new armor concepts from non-traditional organizations both for military personnel and vehicles.\n-  Perform validation testing of optimized advanced armor solutions that exploit the high-performance characteristics of low-cost materials using unique combinations of material composition and topology.\n-  Develop and demonstrate the high-risk manufacturing methods to transition the advanced armor technologies from laboratory scale into large-scale manufacturing and quality control processes that provide a marinized armor solution.\n-  Initiate effort to identify critical parameters that will permit scaling of subscale ballistic modeling and testing into the regime of military relevance.\n-  Use the validated physics-based models and simulations previously developed to guide the design, development, and fabrication of ballistic and blast armor.\n-  Continue integration of ballistic and blast energy management mechanisms into material systems and incorporate into candidate armor material systems for optimization against specific threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.159"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.159"
                                            },
                                            "Text": {
                                                "val": "-  Integrate material properties and energy management mechanisms into ballistic armor materials optimized for single threat defeat in each regime (bullet, frag, EFP)  to meet survivability objectives.\n-  Demonstrate at least 50% enhancement in opaque vehicle ballistic armor performance in each regime (bullet, frag, EFP)  for single threats over state-of-the-art fielded designs.\n-  Based on single threat results, conduct study to establish feasibility of achieving 50% enhancement in opaque vehicle ballistic armor performance for multiple threats. \n-  Continue to identify and evaluate promising new armor concepts from non-traditional organizations both for military personnel and vehicles.\n-  Demonstrate >2x enhancement in energy absorption capability of candidate tactical vehicle floor isolation materials over currently employed materials.\n-  Determine feasibility to reduce effects of localized dynamic loading in an underbody blast event by 50% over state-of-the-art.\n-  Determine feasibility to reduce effects of global impulse in an underbody blast event by 50% over state-of-the-art."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reconfigurable Structures"
                                    },
                                    "Description": {
                                        "val": "In the Reconfigurable Structures thrust, new combinations of advanced materials, devices, and structural architectures are being developed to allow military platforms to move, morph, or change shape for optimal adaptation to changing mission requirements and unpredictable environments.  This includes the demonstration of new materials and devices that will enable the military to function more effectively in the urban theater of operations.  Another focus is to build synthetic versions of biological systems that exhibit strong reversible adhesion via van der Waals forces, magnets, or microspines to scale vertical surfaces without using ropes or ladders.  In addition, this thrust will develop a more principled, scientific basis for robotic ground mobility and manipulation, and leverage these results to develop and demonstrate innovative robot design tools, fabrication methods, and control methodologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Transitioned additional Z-MAN prototype technologies (magnets and microspines) to initial Services clients. \n-  Demonstrated a human static load hanging from gecko nanoadhesive on glass and first-demonstration of human climbing on glass using gecko nanoadhesives.\n-  Integrated and demonstrated components of new design tools for accelerating high-quality design of robots by non-experts, including replacing human programming by user-guided evolution of a controller for a novel legged robot.\n-  Created new brass board fabrication methods for producing robots at low cost, including printing components of a walking robot.\n-  Demonstrated new control algorithms in simulation that significantly improved performance including mobility algorithms that allowed robots to locomote at least two times more efficiently by virtue of a compliant suspension, and manipulation techniques that operated in confined spaces.\n-  Designed proof-of-concept full robots with higher-performance mobility including bipeds that can walk on rough terrain (specifically up steep stairs), which current platforms cannot, and robots that locomote at speeds at least twice as fast as current platforms (and in the process set the land-speed record for legged robots). \n-  Explored the actuation design space and developed concepts for actuators with optimized power factor, optimized transmission, and minimized modulation loss."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.598"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate that a soldier with operationally relevant equipment (250lb upper limit) can robustly climb 25-foot walls built from diverse materials using gecko nanoadhesive.\n-  Transition additional Z-MAN prototype sets of gecko nanoadhesive to the Services. \n-  Demonstrate low-volume manufacturing capability of gecko nanoadhesive.\n-  Apply novel design tools to reduce design time of robots to include user-guided evolution of structures and controller, and automated morphological design processes.\n-  Apply fabrication methods to produce robot components at substantial (> 50% lower) cost savings, to include printing and assembly by folding of a walking robot, and fabrication of a soft pneumatically actuated robot. \n-  Demonstrate new control algorithms on real robots, to include mobility efficiency improvements of at least 2x, prevention of rollover by reasoning about vehicle dynamics, and a touch-sensitive arm to reach through a cluttered workspace. \n-  Build and demonstrate robots with higher-performance mobility, including biped robots that can walk on previously inaccessible rough terrain, and robots that locomote at speeds at least twice as fast as current platforms.\n-  Develop high efficiency actuators, e.g., mechanical power factor correctors; mechanical, hydraulic, and electrical approaches for lightweight, high-power, variable-ratio transmissions; and switching modulation for hydraulic actuators, stepper motors, and purely mechanical systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.735"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.735"
                                            },
                                            "Text": {
                                                "val": "-  Complete design of actuation system for a humanoid robot, including bench-top testing of high-risk components and\/or subsystems.\n-  Demonstrate actuation of a humanoid robot that increases its energy efficiency by 20x, using the same kinematic structure, energy source, computing, and low-level control software. \n-  Demonstrate advanced energy-efficiency improvement actuation approaches by quantitative analysis and\/or simulation. \n-  Validate advanced energy-efficiency improvement actuation approaches by experiment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Functional Materials and Devices"
                                    },
                                    "Description": {
                                        "val": "The Functional Materials and Devices thrust will address problems with high-performance functional optical materials and components development.  Improved materials require deliberate control at the scale of the relevant phenomena.  This thrust will leverage the advanced fabrication capabilities currently available, coupled with design of optical materials and component structure, to drive functional materials to high performance for soldier-centric DoD applications by design.  Novel optical materials exploiting three-dimensional degrees of freedom to increase wavefront control, and IR emissive materials are examples of materials in which design of structure at the scale of the critical phenomena can have significant impact on their performance.  To provide organic information, surveillance, and reconnaissance to the warfighter that greatly enhances awareness, security, and survivability, the capability for wearable (i.e., ultra-low size, weight, and power) systems with specific functionality will be developed.  These functions include hands-free zoom, automated brightness adjustment, threat detection, targeting assistance, change detection, and supplementary data overlay.  This thrust will also explore newly emerging areas where structure may play an important role."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.492"
                                            },
                                            "Text": {
                                                "val": "-  Fabricated and tested contact lens binocular telescope components enabling hands-free, 2.8x, all-optical zoom, on demand.  \n-  Identified potential design options for eventual 10x zoom capability. \n-  Fabricated and tested low profile heads-up display components enabling field of view and resolution comparable to the unaided eye. \n-  Designed wide field of view compact camera that works in conjunction with eye-tracking and head-mounted display to yield low size, weight, and power."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate processes for integrating nano-polarizers with rigid gas permeable contact lenses. \n-  Demonstrate and conduct user testing of 2.8x contact lens binocular telescope.\n-  Demonstrate and conduct user testing of low profile heads-up display components. \n-  Demonstrate wide field of view compact camera components with low size, weight, and power. \n-  Demonstrate software design components supporting the joint optimization of optical and algorithms degrees of freedom.\n-  Demonstrate algorithms for computer-enhanced vision in conjunction with low size, weight, and power micro-cameras."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.985"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.985"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate and conduct user testing of 10x hands free zoom capability. \n-  Demonstrate and conduct user testing of fully integrated heads-up display with eye tracking. \n-  Integrate and test of wide field of view compact camera with gaze-following foveation. \n-  Demonstrate integrated software environment for computational imaging."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturable Gradient Index Optics (M-GRIN)"
                                    },
                                    "Description": {
                                        "val": "The Manufacturable Gradient Index Optics (M-GRIN) program seeks to advance the development of GRIN lenses from a Technology Readiness Level (TRL) 3 to a Manufacturing Readiness Level (MRL) 8.  The program will expand the application of gradient index optics (GRIN) by providing compact, lightweight, and cost-effective lenses with controlled dispersion and aberrations that will replace large assemblies of conventional lenses.  The ability to create entirely new optical materials and surfaces creates the potential for new or significantly improved military optical applications, such as solar concentrators, portable designators, highly efficient fiber optics, and imaging systems.  The program also seeks to extend GRIN manufacturing technologies to glass, ceramic, and other inorganic materials in order to allow for small, lightweight, customized optical elements for mid-wave and long-wave infrared (MWIR and LWIR) applications.  A key component of the program is to develop new design tools that enable optics designers to incorporate dynamic material properties, fabrication methods, and manufacturing tolerances.  The integration of new materials, design tools, and manufacturing processes will enable previously unattainable 3-D optical designs to be manufactured.  This new manufacturing paradigm will enable flexible production of GRIN optics in quantities of one unit to thousands of units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.054"
                                            },
                                            "Text": {
                                                "val": "-  Developed new materials with variable index of refraction (lens tunability).\n-  Improved materials and designs to reduce size, weight, and\/or complexity of optical assemblies for DoD-relevant applications.\n-  Developed new methods for controlling refractive index in thin layers of infrared (IR)-transparent materials.\n-  Developed and demonstrated fusion of multiple layers of IR-transparent materials into preforms and characterized their optical performance.\n-  Developed GRIN design tools with fabrication design rules and manufacturing tolerances."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.223"
                                            },
                                            "Text": {
                                                "val": "-  Design and fabricate tunable lens from variable refractive index materials.\n-  Establish GRIN exchange to share design tools and build operational framework.\n-  Design and build prototype IR lenses using previously developed GRIN lens design tools and metrology methods.\n-  Demonstrate intermediate volume capability with several small lots.\n-  Demonstrate GRIN design tools for optical design software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.300"
                                            },
                                            "Text": {
                                                "val": "-  Complete GRIN lens production scale-up and MRL-7\/8 consistent with yields of 1-1000 units as well as rapid redevelopment cycles.\n-  Design and fabricate a GRIN-based optical system to retrofit an existing DoD product or enable a new DoD product with less weight and\/or fewer optical elements.\n-  Demonstrate initial DoD customer interest as measured by orders placed through the GRIN Exchange for custom designed prototypes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternate Power Sources"
                                    },
                                    "Description": {
                                        "val": "The Alternate Power Sources thrust aims to develop materials and technologies to utilize alternative power sources with the potential to provide significant strategic and tactical advantages to the DoD.  A consistent DoD need continues to be greater efficiency in a portable form factor.  Portable photovoltaic (PV) technologies will strive to meet this need using low cost manufacturing approaches."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.173"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated portable PV devices that produced more than 70% of their specified electrical output after the equivalent of one year of sunlight and after exposure to environmental hazards such as punctures, humidity, and temperature extremes.\n-  Designed portable PV devices that function at greater than 20% power conversion efficiency. \n-  Designed PV devices that have a density of less than 1500 grams per square meter. \n-  Designed portable PV devices that have a maximum radius of curvature of 3 cm."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate portable PV devices that produce at least 80% of their specified electrical output after the equivalent of one year of sunlight and after exposure to environmental hazards such as punctures, humidity, and temperature extremes. \n-  Demonstrate portable PV devices that function at greater than or equal to 20% power conversion efficiency.\n-  Design portable PV devices that allow for $2 per Watt manufacturing. \n-  Demonstrate PV devices that have density of less than or equal to 1500 grams per square meter."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials for Initiation and Actuation"
                                    },
                                    "Description": {
                                        "val": "The Materials for Initiation and Actuation thrust explored and developed materials for initiation and propagation of mechanical and\/or chemical effects.  Included efforts were structures for meso-scale, electrically initiated combustion and modulation of flame plasmas using acoustics and electrical fields.  In addition, reactive structures that can be used to decrease the weight and increase the performance of munitions will be developed.  Efforts under Materials for Initiation and Actuation have been merged under Multifunctional Materials and Structures starting in FY 2013."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "-  Identified approaches for scaling up electrostatic and acoustic flame suppression to address fires of 1 m^2, alone and in conjunction with conventional approaches, and determined that they are not currently realizable at this scale. \n-  Demonstrated scalability of fabrication, mechanical properties, and blast performance of high-strength reactive cases to 1kg scale.\n-  Initiated study to determine potential to concurrently reduce explosive payload and while maintaining blast output.\n-  Initiated characterization of load and strain rate effects on modulus of reactive cases as a function of microstructure, case thickness and load path.\n-  Initiated efforts to optimize amorphous metal reactive structure composition and morphology to sustain loads to >100ksi and at strain rates >10^3 sec^-1."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BioFuels"
                                    },
                                    "Description": {
                                        "val": "The Biofuels program explored longer term, higher risk approaches to obtaining and using energy.  A pathway to affordable self-sustainable agriculture-sourced production of an alternative to petroleum-derived JP-8, that meets all DoD needs, was investigated.  Initial efforts focused on the conversion of crop oil triglycerides to JP-8.  Additional efforts expanded the spectrum of convertible feedstocks to cellulosic, algal, and other similar materials, enabling a diversified feedstock portfolio that can meet the entire DoD need within a sustainable commercial framework.  An important variant of this latter category is the development of man- and vehicle-portable technologies that produce substantial quantities of JP-8 and other useful liquid fuels from indigenously available or harvestable resources near desired locations worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.593"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated pre-pilot scale technologies that enable the increase in conversion efficiency of cellulosic materials and validate competitive projected production costs of JP-8 at initial commercial scale implementation (50M gal\/yr).\n-  Demonstrated pre-pilot scale technology to enable low cost triglyceride oil from algae and validate competitive projected production costs of JP-8 at initial commercial scale implementation (50M gal\/yr).\n-  Identified and validated critical economic drivers in bio-fuels cost models through additional data generation at pre-production operation levels."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MBT-02"
                    },
                    "ProjectTitle": {
                        "val": "BIOLOGICALLY BASED MATERIALS AND DEVICES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "47.379"
                        },
                        "CurrentYear": {
                            "val": "37.623"
                        },
                        "BudgetYearOne": {
                            "val": "40.301"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.301"
                        },
                        "BudgetYearTwo": {
                            "val": "50.976"
                        },
                        "BudgetYearThree": {
                            "val": "64.357"
                        },
                        "BudgetYearFour": {
                            "val": "55.085"
                        },
                        "BudgetYearFive": {
                            "val": "55.835"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project acknowledges the growing and pervasive influence of the biological sciences on the development of new DoD capabilities.  This influence extends throughout the development of new materials, devices, and processes and relies on the integration of biological breakthroughs with those in engineering and the physical sciences.  Contained in this project are thrusts in the application of biomimetic materials and devices for Defense, the use of biology's unique fabrication capabilities to produce structures that cannot be made any other way, the application of materials in biological applications, and the development of manufacturing tools that use biological components and processes for materials synthesis.  This project also includes major efforts aimed at integrating biological and digital sensing methodologies and maintaining human combat performance despite the extraordinary stressors of combat.  Finally, this thrust will develop new cognitive therapeutics, and explore neuroscience technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Neuroscience Technologies"
                                    },
                                    "Description": {
                                        "val": "The Neuroscience Technologies thrust leverages recent advances in neurophysiology, neuro-imaging, cognitive science, and molecular biology to sustain and protect the cognitive functioning of the warfighter faced with challenging operational conditions.  Warfighters experience a wide variety of operational stressors, both mental and physical, that degrade critical cognitive functions such as memory, learning, and decision making.  These stressors also degrade the warfighter's ability to multitask, leading to decreased ability to respond quickly and effectively.  Currently, the long-term impact of these stressors on the brain is unknown, both at the molecular and behavioral level.  This thrust area will utilize modern neuroscientific techniques, in conjunction with emerging solutions in neurally enabled human-machine interface technologies, to develop quantitative models of this impact and explore mechanisms to protect, maintain, complement, or restore cognitive functioning during and after exposure to operational stressors.  In addition, new approaches for using neural signals to make human-machine systems more time efficient and less workload intense will be identified, developed, and evaluated.  This thrust area will have far-reaching implications for both current and future military operations, with the potential to protect and improve cognitive performance at the individual and group level both prior to and during deployment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.827"
                                            },
                                            "Text": {
                                                "val": "-  Began reconstructing a multi-scale network linked to specific stressors and stress response systems using integrated epigenetics, genetics, quantitative model building, bioinformatics, and computational biology approaches. \n-  Continued modeling and verification of causal factors and relationships between variables in the complex systems and networks involved in the response to stress and the ability to resist stress. \n-  Modulated genes and pathways mediating acute and chronic stress-induced dysfunction in circuits for reward, fear, and habit learning for reduction of stress-related dysfunction in animal models. \n-  Developed and implemented interventions for prevention of stress-induced cognitive dysfunction in animal models of acute and chronic stress. \n-  Expanded studies of stress-related dysfunction to include identifying gene, network and specific brain region dysfunction as it relates to suicide. \n-  Demonstrated quantitative biochemical measurement of the impact of stress in real-time through development of advanced biosensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Integrate human data on stress genes to determine human stress-related gene networks for targeting interventions.\n-  Translate genes and networks identified in animals to humans using high throughput molecular data from population-based studies. \n-  Determine biomarkers of alertness in active duty personnel with psychological health problems\/traumatic brain injury.\n-  Relate clinical and psychological profiles of patients with post-traumatic stress disorder to neural networks, neurochemicals and behavior for biomarker identification. \n-  Develop empirically validated intervention strategies to include stress reduction (exercise, meditation), stress inoculation (video training\/hyperrealistic training), and\/or pharmacological interventions, while maintaining performance.\n-  Identify objective measures of physical and cognitive states through the application of integrated analytics and advanced computational techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Determine genetic, epigenetic, and proteomic changes underlying vulnerability to poor decision making in humans.\n-  Exploit advances in the predictive models of the brain to develop tools and techniques that can improve cognitive performance under stress at both the individual and group level."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BioDesign"
                                    },
                                    "Description": {
                                        "val": "BioDesign will employ system engineering methods in combination with biotechnology and synthetic chemical technology to create novel beneficial attributes.  BioDesign mitigates the unpredictability of natural evolutionary advancement primarily by advanced genetic engineering and molecular biology technologies to produce the intended biological effect.  This thrust area includes designed molecular responses that increase resistance to cellular death signals and improved computational methods for prediction of function based solely on sequence and structure of proteins produced by synthetic biological systems.  Development of technologies to genetically tag and\/or lock synthesized molecules would provide methods for prevention of manipulation (\"tamper proof\" synthetic biological systems).  This thrust will also develop new high-throughput technologies for monitoring the function of cellular machinery at the molecular level and the response(s) of that machinery to physical, chemical, or biological threats.  While conventional approaches typically require decades of research, new high-throughput approaches will permit rapid assessment of the impact of known or unknown threats on identified biomolecules and cell function."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.791"
                                            },
                                            "Text": {
                                                "val": "-  Developed genetically encoded locks to create \"tamper proof\" DNA.\n-  Developed strategies to create a synthetic organism \"self-destruct\" option to be implemented upon unapproved removal and transport of an organism."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.023"
                                            },
                                            "Text": {
                                                "val": "-  Develop novel genomic security technologies to identify microorganisms that were intentionally made resistant to antimicrobials.\n-  Develop novel genomic circuits to identify microorganisms that were tested for virulence using live animals.\n-  Develop strategies that time-limit production of high-value commercial microorganisms licensed for international use.\n-  Develop lock-key recall enzyme reporting systems which resurrect event recording from proprietary microorganisms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.084"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.084"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate functionality of genomic security technologies in two or more different commercially relevant microbes used for production of biocommodities.\n-  Evaluate high-throughput methods such as mass spectrometry imaging that have the potential to map intracellular proteins.\n-  Utilize mass spectrometry imaging to characterize cellular components and interactions between them that reveal the effects of challenge compounds (e.g., chemical threats) on intracellular machinery."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of Living Foundries is to create a revolutionary, biologically-based manufacturing platform to provide new materials, capabilities, and manufacturing paradigms for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale, adapt to changing environments and self-repair, biology represents one of the most powerful manufacturing platforms known.  However, the DoD's ability to harness this platform is rudimentary.  Living Foundries seeks to develop the tools, technologies, and methodologies to transform biology into an engineering practice, speeding the biological design-build-test cycle and expanding the complexity of systems that can be engineered.  The program will enable the rapid and scalable development of previously unattainable technologies and products (i.e., those that cannot be accessed using known, synthetic mechanisms), leveraging biology to solve challenges associated with production of new materials (e.g., flouropolymers, enzymes, lubricants, coatings and materials for harsh environments), novel functions (e.g., self-repairing and self-regenerating systems), biological reporting systems, and therapeutics to enable new solutions and enhancements to military needs and capabilities.  Ultimately, Living Foundries aims to provide game-changing manufacturing paradigms for the DoD, enabling distributed, adaptable, on-demand production of critical and high-value materials, devices, and capabilities in the field or on base.  Such a capability will decrease the DoD's dependence on tenuous material supply chains vulnerable to political change, targeted attack, or environmental accident.\n\nResearch thrusts will focus on the development and demonstration of open technology platforms, or bioproduction pipelines, that integrate the tools and capabilities developed in PE 0601101E, TRS-01 to prove out capabilities for rapid (months vs. service-oriented architecture years) design and construction of new bio-production systems for novel materials.  The result will be an integrated, modular infrastructure across the areas of design, fabrication, debugging, analysis, optimization, and validation -- spanning the entire development life-cycle and enabling the ability to rapidly assess and improve designs.  Integrated processes developed in this program will translate into significant performance improvements and cost savings for the production of advanced materials, biological reporting systems, and therapeutics.  These technologies will ultimately result in point-of-use, on-demand, customizable, and distributed production of strategic materials and systems.  Key to success will be tight coupling of computational design, fabrication of systems, debugging using multiple characterization data types, analysis, and further development such that iterative design and experimentation will be accurate, efficient and controlled.  Demonstration platforms will be challenged to build a variety of military-relevant and complex materials and functionalities, such as synthesis of advanced, functional chemicals and polymers  (e.g., those tolerant of harsh environments), production of bio-reporting systems, or rapid and dynamic prevention, identification, and repair of corrosion\/materials degradation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate integration of fundamental tools and capabilities developed in PE 0601101E, TRS-01 to speed the design, build, and test loop of biological manufacturing, and start bio-foundries development.\n-  Begin development and refinement of tools and capabilities to translate designs across multiple platforms and biological systems.\n-  Begin to standardize fabrication, characterization, and test processes on a common infrastructure to enable modularity and flexibility for design and construction of new systems.\n-  Begin development of new computational algorithms to perform quality control and evaluate screening data to automatically inform the redesign and optimization of novel biological production systems.\n-  Begin initial demonstrations of ability to design, build and test materials production pathways that are difficult or impossible to synthesize using known mechanisms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.217"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.217"
                                            },
                                            "Text": {
                                                "val": "-  Continue standardization, integration, and automation of the fundamental tools and capabilities developed in PE 0601101E\/TRS-01 into a readily adoptable and adaptable biosystem engineering platform.\n-  Continue demonstrations of ability to design, build and test materials production pathways that are difficult or impossible to synthesize using known mechanisms.\n-  Begin to integrate data streams (using previously developed computation algorithms and software) from fabrication, quality control and characterization tools to provide a comprehensive debugging capability and to enable forward design.\n-  Begin to demonstrate, test, and evaluate the extent of design-build-test cycle compression using integrated platform to engineer new bioproduction systems.\n-  Begin testing ability to rapidly transfer a design to a new chassis\/biological system to establish flexibility of the platform and production system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintaining Combat Performance"
                                    },
                                    "Description": {
                                        "val": "The Maintaining Combat Performance thrust utilizes breakthroughs in biology and physiology to sustain the peak physical and cognitive performance of warfighters operating in extreme conditions.  Today, warfighters must accomplish their missions despite extraordinary physiologic stress.  Examples of these stressors include temperature extremes (-20 degrees F to 125 degrees F), oxygen deficiency at high altitude, personal loads in excess of 100 lbs, dehydration, psychological stress, and even performance of life-sustaining maneuvers following combat injury.  Not only must troops maintain optimum physical performance, but also peak cognitive performance, which includes the entire spectrum from personal navigation and target recognition, to complex command and control decisions, and intelligence synthesis.  The Maintaining Combat Performance thrust leverages breakthroughs in diverse scientific fields in order to mitigate the effects of harsh combat environments ranging from fundamental research elucidating the biological mechanisms of adaptation to application of novel body-worn actuation materials to reduce soldier loads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.300"
                                            },
                                            "Text": {
                                                "val": "-  Initiated a limited Food and Drug Administration (FDA) Phase I clinical trial for pharmacokinetics, surrogate-efficiency markers, and tolerance to determine drug safety.\n-  Assisted in creating the Mountain Warfare Research Center for Excellence (MWRCE) at the Marine Corps Mountain Warfare Training Center, which will be sustained by support from each of the Services to facilitate high-altitude medical R&D, equipment testing, and clinical trials.\n-  Established baseline physiology testing at the MWRCE in support of Phase 2 clinical trials for the prevention of altitude illness.\n-  Coordinated a technical review with major pharmaceutical companies to prepare for commercialization of the rapid altitude and hypoxia acclimatization therapeutics. \n-  Initiated relevant core technology efforts: analysis, design, and\/or benchtop testing of subsystems.\n-  Initiated development of human and system performance analytical models (as a baseline) and system performance to assess injury mitigation strategies in a simulation environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete altitude illness prevention clinical trials packet for review by FDA\/Center for Drug Evaluation and Research (FDA\/CDER).\n-  Complete altitude illness treatment clinical trials packet for review by FDA\/CDER. \n-  Transition rapid altitude and hypoxia acclimatization therapeutics and preventives to Defense Threat Reduction Agency\/Transformational Medical Technologies (DTRA\/TMT). \n-  Transition capabilities of Mountain Warfare Research Center for Excellence to the Services to allow for continued testing of cold weather and high altitude equipment and therapeutics and collaboration with the U.S. Army Research Institute of Environmental Medicine (USARIEM)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blood Pharming"
                                    },
                                    "Description": {
                                        "val": "The Blood Pharming program objective is to develop an automated culture and packaging system that yields transfusable levels of universal donor red blood cells (RBCs) from progenitor cell sources.  The goal is to produce 100 units of universal donor (Type O negative) RBCs per week for eight weeks in an automated closed culture system using a renewing progenitor population, and to demonstrate a two hundred million-fold expansion of progenitor cell populations to mature RBCs.  The program will capitalize advances in cell differentiation, expansion, and bioreactor technology developed early in the program.  Successful completion of the Blood Pharming effort will provide a safe donorless blood supply that is the functional equivalent of fresh donor cells, satisfying a large battlefield demand and reducing the logistical burden of donated blood in theater."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.550"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated continuous production of universal donor RBCs in a large scale bioreactor perfusion system at densities >30 million cells\/ml. \n-  Demonstrated differentiation and maturation of human hematopoietic stem cells to achieve levels of hemoglobin and erythroid lineage commitment markers and enucleation efficiencies approaching 30%. \n-  Developed and integrated novel and efficient downstream processing systems enabling rapid throughput to select and isolate mature RBCs suitable for transfusion.\n-  Demonstrated a multi-fold reduction in cost per unit of RBCs by increasing the RBC cell density in the bioreactor and by reducing the media cost from $250L to $40\/L to meet production goals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate prototype instrument for commercialized in vitro blood production.\n-  Align with interagency requirements for protection of blood supply and to enable rapid response in emergency scenarios.\n-  Expand capability of bioreactor to produce therapeutic blood products beyond packed red blood cells."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Revolutionizing Prosthetics"
                                    },
                                    "Description": {
                                        "val": "The goal of this thrust is to radically improve the state of the art for upper limb prosthetics, moving them from crude devices with minimal capabilities to fully integrated and functional limb replacements.  Current prosthetic technology generally provides only gross motor functions, with very crude approaches to control.  This makes it difficult for wounded soldiers to re-acquire full functionality and return to military service if so desired.  The advances required to provide fully functional limb replacements will be achieved by an aggressive, milestone driven program combining the talents of scientists from diverse areas including: medicine, neuroscience, orthopedics, engineering, materials science, control and information theory, mathematics, power, manufacturing, rehabilitation, psychology and training.  The results of this program will radically improve the ability of combat amputees to return to normal function.  This effort will be funded in PE 0602115E, Biomedical Technology beginning in FY 2013."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.200"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated neural control of arms by spinal cord-injured patients.\n-  Demonstrated safety and stability of neural interfaces over multiple month periods.\n-  Supported transition efforts of final limb, components, and refinements required by the Food and Drug Administration (FDA).\n-  Provided clinical data to support FDA submission.\n-  Optimized the sensor configuration and algorithm development of the hand and arm to provide meaningful sensory feedback."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Technology Threat Warning System (CT2WS)"
                                    },
                                    "Description": {
                                        "val": "Recent advances in computational and neural sciences indicate it is possible to push the visual threat detection envelope to enable more response choices for our soldiers than ever before.  The objective of the Cognitive Technology Threat Warning System (CT2WS) program was to drive a breakthrough in visual threat warning devices by leveraging discoveries in the disparate technology areas of flat-field, wide-angle optics, large pixel-count digital imagers, visual processing pathways, neurally based target detection signatures and ultra-low power analog-digital hybrid signal processing electronics.  This program led to the development of prototype digital imaging threat cueing systems capable of effective detection ranges of 1 km against dismounts, 5 km against stationary vehicles, and 10 km against moving vehicles.  Simultaneously, the system surveys a 120-degree or greater field of view, enabling the warfighter to detect, decide and act on the most advantageous timeline in complex operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.450"
                                            },
                                            "Text": {
                                                "val": "-  Extended algorithms to handle imagery from Army and Marine Corps system, specifically the Cerberus SCOUT, which generated visible, IR, and radar imagery from mast-mounted systems.\n-  Improved algorithms to increase frame rate without dropping frames.\n-  Improved brain machine interface to use wearable dry electroencephalogram (EEG) sensors.\n-  Integrated and package threat warning system prototype.\n-  Performed extended field testing and evaluation at sites selected by Night Vision Lab at Camp Roberts, CA."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neovision2"
                                    },
                                    "Description": {
                                        "val": "Biological vision systems have the exquisite ability to recognize, categorize, and learn new objects in fractions of a second.  While animals and humans accomplish this seemingly effortlessly and constantly, computational vision systems have, to date, been unable to replicate this feat of biology.  The Neovision2 program pursued an integrated approach to developing an advanced object recognition capability based on the visual pathways in the mammalian brain.  Specifically, this program developed a cognitive sensor technology with limited size, weight, and power that transforms data from an imaging sensor suite into communicable knowledge for mobile, autonomous surveillance systems.  The program demonstrated an improvement of four orders of magnitude in energy efficiency compared to state-of-the-art algorithms.  To achieve the vision, the program utilized advanced device design, signal processing and mathematical techniques across multiple brain regions to create an electronic neuro-biological (neuromorphic) vision system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.261"
                                            },
                                            "Text": {
                                                "val": "-  Completed Phase 1 algorithm development, hardware system implementation, and physiology data collection.\n-  Conducted Phase 1 test and evaluation.  For algorithms, compared performance (probability of detection, probability of false alarm) of neuromorphic systems to conventional, engineered systems on 150 videos taken from a tower, a low-flying helicopter, and a low-flying fixed wing aircraft.  For hardware, assessed degree of fidelity to the mammalian visual system, performance in collecting and processing data, and potential for low-power operation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MBT-03"
                    },
                    "ProjectTitle": {
                        "val": "TACTICAL AND STRATEGIC ENERGY TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.396"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project focused on the unique challenges facing the DoD in developing and demonstrating advanced power generation and energy storage technologies.  It addressed critical military needs for improved energy efficiency and availability to support a range of military missions.  At the individual warfighter and small unit operations level, efforts are addressing the need for mission extending power generation and energy storage technologies with particular emphasis on portability and robustness challenges that are unique to the DoD.  As electronic systems are common to all scales of power generation and energy storage and management, this project also investigated improved board-level power conversion and regulation strategies to more efficiently convert and distribute high voltages to locally required low voltages for powering integrated circuits and sensors.  The project also included an effort that is exploring ultra-high-efficiency gas turbine engines for power generation on large platforms including Navy cruisers and destroyers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Advanced Power (TAP)"
                                    },
                                    "Description": {
                                        "val": "The Tactical Advanced Power (TAP) program solved high-risk, mission-critical portable power and energy challenges (approximately 1 kilowatt and below) that are unique to DoD.  TAP has provided near-term solutions to DoD energy needs through an integrated approach that leverages available technologies, further develops existing science, and establishes new methods of energy generation, extraction, transmission, conversion, and storage.  TAP has deployed fuel cell-enabled small (hand-launched) unmanned aerial vehicles for long-endurance missions (greater than 6 hours)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.800"
                                            },
                                            "Text": {
                                                "val": "-  Transitioned deployable long-endurance small, unmanned aerial system to user community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vulcan"
                                    },
                                    "Description": {
                                        "val": "The goal of the Vulcan program was to design, build, and ground test a pressure gain combustion (PGC) technology system that demonstrates a 20% reduction in specific fuel consumption for power generation turbine engines.  PGC technology has been under development for more than a decade and considerable progress has been made in key enabling technology areas.  The technology is believed mature enough to permit a dramatic new system capability.  PGC, when combined with turbine engines, offers the ability to design a new class of hybrid turbine power generation engines and Mach 4+ air breathing propulsion systems.  The Vulcan system consists of a full scale PGC, a compressor, and a turbine, and has direct application to ship power generation and propulsion turbine engines, aviation turbine engines, high-Mach air breathing engines, as well as commercial turbine engines of the same variety."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.396"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated pressure gain combustion in combustor components.\n-  Developed preliminary design of a full scale gas turbine engine with an integrated PGC module.\n-  Completed fabrication and test of final phase II rig demonstration hardware. \n-  Instrumented and demonstrated combustor\/turbine interaction rig to verify utility of harnessing pressure gain combustion.\n-  Completed risk reduction testing and demonstrations of key PGC component technologies and subsystems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Microscale Power Conversion"
                                    },
                                    "Description": {
                                        "val": "The Microscale Power Conversion (MPC) program will address the fundamental limitations of power conversion by enabling a new technology and approach that exploits advances in basic power devices that can operate at very high frequencies with low losses.  A key benefit of these new devices is that they can be integrated into very compact circuits and assemblies that will provide dramatic advances to the power bus of a platform.  Specifically, this program will develop the technology to enable DC to DC power conversion for military applications at the scale of an integrated circuit so it can be embedded within the electronics subsystem and a new distributed power architecture can be realized.  The focus of this program is on attaining 100MHz internal operation frequencies of power circuits since the size of the passive elements (inductors and capacitors) in a power converter scales inversely as the fourth power of the internal operating frequency.  Program funding continues in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.200"
                                            },
                                            "Text": {
                                                "val": "-  Developed very high frequency, low-loss power switch technology for implementing large envelope-bandwidth modulators for RF power amplifiers.\n-  Completed initial co-designs of advanced X-band power amplifier technologies to include drain and gate bias modulation, dynamic output impedance matching, and closed-loop control to enable fast-switching power modulation.\n-  Designed and prototyped preliminary amplifier architectures for highly efficient handling of large peak-to-average ratio RF waveforms for military systems.\n-  Initiated prototype characterization and testing in a laboratory environment.\n-  Demonstrated converter efficiency and losses, including co-designed power amplifiers of many classes and approaches through initial prototype deliverables.\n-  Designed low-loss packaging strategies and monolithic integration approaches for most promising amplifier-modulator circuit combinations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}