{
    "id": "5c03ea544cfa59a7059f78c69cad433d6338a6e7",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603456F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Advanced Technology Development"
        },
        "R1LineItemNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.082"
            },
            "CurrentYear": {
                "val": "21.523"
            },
            "BudgetYearOne": {
                "val": "20.967"
            },
            "BudgetYearOneBase": {
                "val": "20.967"
            },
            "BudgetYearTwo": {
                "val": "21.520"
            },
            "BudgetYearThree": {
                "val": "17.561"
            },
            "BudgetYearFour": {
                "val": "16.738"
            },
            "BudgetYearFive": {
                "val": "16.523"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates technologies to enhance human performance and effectiveness in the aerospace force.  State-of-the-science advances are made in warfighter training, warfighter system interfaces, directed energy bioeffects, deployment and sustainment of warfighters in extreme environments, and understanding and shaping adversarial behavior.  The Mission Effective Performance project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness.  The Warfighter Interfaces project develops, demonstrates, and transitions technologies to revolutionize the way human operators synergistically use Air Force systems, including autonomous machines and adaptive teams of humans and machines.  The Directed Energy Bioeffects Parameters project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems.  The Human Dynamics and Terrain Demonstration project develops, demonstrates, and transitions human-centric technologies to address processing, exploitation, and dissemination of intelligence, surveillance, and reconnaissance (ISR) capability needs.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 3, Advanced Technology Development, since it develops and demonstrates technologies to protect and enhance the performance of Air Force personnel in operational environments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.283"
                },
                "CurrentYear": {
                    "val": "21.523"
                },
                "BudgetYearOne": {
                    "val": "17.088"
                },
                "BudgetYearOneBase": {
                    "val": "17.088"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.082"
                },
                "CurrentYear": {
                    "val": "21.523"
                },
                "BudgetYearOne": {
                    "val": "20.967"
                },
                "BudgetYearOneBase": {
                    "val": "20.967"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.201"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.879"
                },
                "BudgetYearOneBase": {
                    "val": "3.879"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.686"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.515"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.879"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.879"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2014 is due to increased focus on Directed Energy Bioeffects."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635323"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Bioeffects Parameters"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.202"
                        },
                        "CurrentYear": {
                            "val": "1.040"
                        },
                        "BudgetYearOne": {
                            "val": "3.700"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.700"
                        },
                        "BudgetYearTwo": {
                            "val": "3.600"
                        },
                        "BudgetYearThree": {
                            "val": "2.700"
                        },
                        "BudgetYearFour": {
                            "val": "2.700"
                        },
                        "BudgetYearFive": {
                            "val": "2.590"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems.  This project also develops the human components of the guidelines for testing, deployment, and protection from high power microwave and high energy laser systems and uses this information to enhance the effectiveness of these weapon systems in air, space, and cyber operations.  The optical radiation bioeffects thrust develops and demonstrates technologies that counter optical threats, while exploiting optical systems for non-lethal applications.  The radio frequency (RF) radiation bioeffects thrust develops and demonstrates technologies to assess RF bioeffects and collateral hazards from high power RF directed energy systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate optical protective technologies for aircrew and ground personnel to provide protection against directed energy threats.  Develop modeling capabilities to assess collateral hazards from high power directed energy laser systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.819"
                                            },
                                            "Text": {
                                                "val": "Tested end-to-end laser eye protection (LEP) design capability by merging frame and format design capability with a visual performance metrics and modeling capability to create a single, integrated package allowing complete human systems integration of LEP.  Validated microwave modeling and simulation tool.  Developed software to incorporate RF energy-induced human effects from collateral hazard predictions into wargaming scenarios.  Increased computational speed of collateral hazard predictions for near-real-time modules for weapon system fire control and mission planning applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.820"
                                            },
                                            "Text": {
                                                "val": "Integrate and test physics-based modeling techniques for advanced LEP in next generation cockpit scenarios for human systems integration and protection.  Integrate laser bioeffects models and collateral effects algorithms into high-fidelity predictions of high energy laser weapons effects to enable safe testing of weapons effects and demonstrator concepts.  Benchmark collateral hazard prediction algorithms for lasers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.229"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.229"
                                            },
                                            "Text": {
                                                "val": "Merge a frame and format design capability with a visual performance metrics and modeling capability to create a single, integrated package allowing complete human systems integration of LEP.  Use three-dimensional (3-D) optical modeling tools to quantify and visually render the effects of LEP filters on human vision.  Participate in demonstration of mission planning analysis tool for optimization of directed energy\/kinetic energy weapons use.  Validate bioeffects models.  Begin integration of probabilistic tools into high energy laser collateral damage models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects:"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to assess RF bioeffects and collateral hazards from high power RF directed energy systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.383"
                                            },
                                            "Text": {
                                                "val": "Tested and validated high energy laser collateral effects real-time predictive models for directed energy weapon systems.  Integrated directed energy hazard assessment tools in wargaming scenarios.  Tested and validated near-real-time modules for weapon system fire control and mission planning applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.220"
                                            },
                                            "Text": {
                                                "val": "Demonstrate validated microwave modeling and simulation tools to non-lethal RF weapon wargames for realistic human effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.471"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.471"
                                            },
                                            "Text": {
                                                "val": "Identify candidate directed energy weapons system and begin to incorporate real-time collateral effects and hazard calculations into weapon systems.  Participate in demonstration of mission planning analysis tool for optimization of directed energy\/kinetic energy weapons use.  Validate bioeffects models.  Begin integration of RF bioeffects real-time model and control algorithms into RF weapons to optimize non-lethal human effects while minimizing collateral damage from RF weapons."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635324"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics and Terrain Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.949"
                        },
                        "CurrentYear": {
                            "val": "9.988"
                        },
                        "BudgetYearOne": {
                            "val": "8.640"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.640"
                        },
                        "BudgetYearTwo": {
                            "val": "9.339"
                        },
                        "BudgetYearThree": {
                            "val": "7.697"
                        },
                        "BudgetYearFour": {
                            "val": "7.312"
                        },
                        "BudgetYearFive": {
                            "val": "7.493"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to identify human threats within the air, space, and cyber domains.  These technologies will enhance Air Force capabilities in ISR, layered sensing, autonomous and adaptive decision-making systems, decision aids for computer network attack\/defense\/support, ISR force development and training, anticipatory command, control, and intelligence (C2I), measures of enhanced psychological operations, cross-cultural communication, and human-centric exploitation of measurement and signatures intelligence."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Develop\/demonstrate human-centered design processes and operational tools that optimize ISR information flows in a distributed, multisource mission planning environment.  Develop\/demonstrate anticipatory C2I decision-aiding technologies to rapidly assess battlefield behaviors, and select\/prioritize courses of action.  Develop\/demonstrate anticipatory C2I decision-aiding technologies to rapidly assess battlefield situation, predict likely adversary behaviors, and select\/prioritize courses of action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.287"
                                            },
                                            "Text": {
                                                "val": "Delivered software prototype of unified analytical tool kit and work environment to support increased analyst speed and more robust, inclusive decision-making with lower cognitive overhead.  Delivered prototype human-inspired cueing system to speed image analysis.  Developed and tested new methods to support visualization and manipulation of large, abstract data sets by combining recent advances in neuroscience and neuroimaging\ntechniques with neural-based feature extraction and data filtering.  Built in-house prototype to rapidly and effectively detect and correlate relationships with patterns of life and anomalous threat detection and identification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.144"
                                            },
                                            "Text": {
                                                "val": "Develop an analyst testbed concept for evaluating effectiveness of analyst tool integration in the processing, exploitation, and dissemination process.  Develop work aids for intelligence analysts and tools for collaborative synthesis and social cogitive analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.040"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.040"
                                            },
                                            "Text": {
                                                "val": "Demonstrate work aids for intelligence analysts and tools for collaborative synthesis and social cognitive analysis.  Demonstrate human-centric analytic work environment for intelligence analysis and behavioral influence analysis.  Assess effectiveness of analyst aids in the processing, exploitation, and dissemination process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Develop\/demonstrate technology to optimize human operator performance, adversarial modeling techniques, and automated speech translation tools to aid Air Force information\/influence operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.077"
                                            },
                                            "Text": {
                                                "val": "Developed advanced techniques to rapidly develop and easily maintain speech-to-speech translation systems in multiple languages and application domains with limited data availability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Develop tools, algorithms, and techniques that can be used for domain specific automatic speech recognition, machine translation, and natural language processing components in new languages and domains, especially those characterized by minimal data availability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Text": {
                                                "val": "Mature human language technologies to develop tools that improve the effectiveness of ISR operators and intelligence analysts.  Develop, assess, and test capabilities against specific customer data sets, especially those characterized by scientific and technical terminology.  Evaluate and integrate algorithms into frameworks supporting ISR collection and exploitation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Signatures"
                                    },
                                    "Description": {
                                        "val": "Apply human threat signatures to enhance threat detection training for intelligence analysts, reconnaissance patrol, and force protection security operators."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.585"
                                            },
                                            "Text": {
                                                "val": "Developed training based on physical\/physiological indicators of deceptive behavior.  Initiated development of software training module for human threat indicators.  Provided requirements for sensor resolution and optimized sensor placement for human threat indicator detection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.344"
                                            },
                                            "Text": {
                                                "val": "Develop human threat recognition capabilities by creating libraries of human signatures to include simple and complex motions and biofidelic avatars with variable dimensions in gender, age, size, and shape.  Demonstrate initial libraries in joint virtual training software for human threat recognition and feasibility for integration into future on-board sensor systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "Initiate multimodal exploitation of signatures through fusion of radar, electro-optical, and infrared sensing.  Collect outdoor signatures for hyperspectral and polarized light with realistic background.  Begin development on multimodal avatar with radar output and morphology governing size, shape, and motion definition.  Begin development of an on-the-job training platform for ISR analysts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635325"
                    },
                    "ProjectTitle": {
                        "val": "Mission Effective Performance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.985"
                        },
                        "CurrentYear": {
                            "val": "3.925"
                        },
                        "BudgetYearOne": {
                            "val": "2.336"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.336"
                        },
                        "BudgetYearTwo": {
                            "val": "2.685"
                        },
                        "BudgetYearThree": {
                            "val": "1.994"
                        },
                        "BudgetYearFour": {
                            "val": "2.006"
                        },
                        "BudgetYearFive": {
                            "val": "2.042"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness.  This project also develops advanced methods and technologies to enable interactive live, virtual, and constructive (LVC) environments for performance-aiding methods and technologies.  Focus areas include integrated high-fidelity weapon systems training technologies for air, space, and cyber; tailored immersive simulation environments for airmen at the tactical and operational levels; and incorporating performance assessment and feedback tools.  These methods and technologies facilitate the development of mission-essential competencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate secure, persistent, and standardized LVC training enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.962"
                                            },
                                            "Text": {
                                                "val": "Conducted initial evaluations of the reconfigurable and deployable training environment for Air Force applications.  Completed evaluation for deployable training for Combatant Commander capability assessment across LVC contexts.  Completed specification development for an integrated learning assessment and management system for Distributed Mission Operations (DMO) and LVC operations.  Defined data and interoperability standards for remotely piloted aircraft (RPA) sensor and pilot training integration in LVC operations.  Developed and demonstrated learning management tools.  Demonstrated integration of performance metrics in the after action review tool kit."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.925"
                                            },
                                            "Text": {
                                                "val": "Demonstrate learning managed LVC for fifth generation air combat mission training.  Develop joint criteria, models, and tools for environment certification applicable across LVC contexts.  Demonstrate standardized process and integrated toolsets for correlated simulation database development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.336"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.336"
                                            },
                                            "Text": {
                                                "val": "Complete development, demonstration, and initial transition of learning management system for DMO and LVC operations.  Initiate development of standards for shareable scenario content, data, and metrics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DMO Training\/Rehearsal"
                                    },
                                    "Description": {
                                        "val": "Develop\/demonstrate high-fidelity DMO training\/rehearsal capability for Air and Space Operations Center (AOC) operators."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.023"
                                            },
                                            "Text": {
                                                "val": "Completed development of immersive training for operational planning prototype training system for AOC Combat Plans Division.  Demonstrated scenario development and execution management for training for one AOC planning team.  Evaluated prototype in deliberate planning phases and execution phases of operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Work Completed in FY 2012."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635327"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Interfaces"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.946"
                        },
                        "CurrentYear": {
                            "val": "6.570"
                        },
                        "BudgetYearOne": {
                            "val": "6.291"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.291"
                        },
                        "BudgetYearTwo": {
                            "val": "5.896"
                        },
                        "BudgetYearThree": {
                            "val": "5.170"
                        },
                        "BudgetYearFour": {
                            "val": "4.720"
                        },
                        "BudgetYearFive": {
                            "val": "4.398"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to revolutionize the way human operators optimize the capabilities of Air Force systems, including autonomous machines and adaptive teams of humans and machines.  Improvements in the presentation of operational information to the community of users, from the system operator to the commander, must be developed in step with advancements in the acquisition, storage, and retrieval of information.  This project provides the advances in understanding of human cognitive abilities, as well as the utilization of human interfaces, multisensory fusion, high-resolution image displays, and 3-D audio to customize communications and enhance shared understanding across a diverse user community in air, space, and cyber for maximum situational awareness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Develop sense, assess, and augment technologies to facilitate efficient workflow in distributed operational environments.  Develop empirically validated cyber operator-centered tools for distributed cyber operations integrated into a single user interface."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.915"
                                            },
                                            "Text": {
                                                "val": "Developed technology to assess the value of operator immersion and related virtual presence technology for improving human and mission performance, designed novel warfighter visualizations, and developed intuitive control methods for exercising telepresence in the urban battlespace.  Developed conceptual operator telepresence technology interfaces (remote and on-scene) for the larger context of supervisory control of the sensor networks and ISR services.  Assessed hardware and software technology options for developing team workload and performance detection capability and visualization requirements.  Began to develop and plan to integrate both on-human and off-human sensor technologies.  Worked with command and control operational users from control and reporting centers to identify characteristics of team membership and visualization requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.831"
                                            },
                                            "Text": {
                                                "val": "Develop neurophysiologic sensored technology for determining operator workload.  Integrate neurophysiologic sensors with automated system adaptation methods, software, and tools.  Identify visualization, tool composition, and user interface requirements to support cyber operations.  Analyze human operator team composition and requisite skill sets based upon cyber tool set composition and information flow.  Based upon human-computer interface requirements analyses, provide training recommendations for the transition of cyber offensive tools and technologies to the operational community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Complete analysis of human operator team composition and requisite skill sets based upon cyber tool set composition, operational information flow, and concept of operations.  Begin initial design of an integrated offensive and defensive cyber operator tool set."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Demonstrate ability to forecast acoustic profiles for any atmospheric\/terrain condition.  Demonstrate technologies to enhance the battlefield airman's situational awareness through wearable interfaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.971"
                                            },
                                            "Text": {
                                                "val": "Integrated a high-fidelity acoustic simulation model into existing Air Force fielded software applications to demonstrate technology in the user's environment.  Performed initial proof-of-concept verification and validation of the integrated acoustic model.  Developed and tested field data collection procedures to validate the acoustic predictions of sound propagation and source characterization.  Collected soundscape data for a background noise database.  Performed related research on human hearing and vigilance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.735"
                                            },
                                            "Text": {
                                                "val": "Develop 3-D acoustic models of manned and unmanned aircraft for incorporation into high-fidelity acoustic mission planning tools.  Collect high-fidelity 3-D acoustic measurements of manned and unmanned aircraft.  Determine aural detectability across a wide range of weather conditions, geography, and background sounds.  Employ usability engineering methodologies to establish user requirements and use-case scenarios for the pararescue jumper community.  Prototype designs of wearable interface concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.475"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.475"
                                            },
                                            "Text": {
                                                "val": "Refine high fidelity 3-D acoustic models for integration into mission planning tools.  Validate acoustic models against real-world data obtained from airborne platform measurements.  Incorporate weather effects, landscape sounds, and geography into acoustic models.  Develop prototype user interfaces based on pararescue jumper requirements and use-case scenarios.  Refine wearable interface designs based on operator feedback."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an integrated human-centered interface to control multiple RPAs that have various levels of autonomy and that optimize net-centric information flow."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.032"
                                            },
                                            "Text": {
                                                "val": "Analyzed warfighter requirements for a future generation control station that will accommodate advanced and legacy RPAs.  Developed and integrated operator interface controls, displays, and decision-aid technologies for effective situation assessment, decision-making, and action implementation to manage semiautonomous, multimission RPAs and heterogeneous payloads.  Tested control station technology to determine baseline functionality and performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.004"
                                            },
                                            "Text": {
                                                "val": "Validate warfighter requirements for the next generation operator control station that will accommodate advanced and legacy RPAs.  Integrate and test technologies for operator interface controls, displays, and decision-aids to manage multimission RPAs and payloads.  Conduct prototype evaluations of operator interface controls.  Perform initial testing of technologies designed to assess the value of RPA operator immersion and telepresence for improving human and mission performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.016"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.016"
                                            },
                                            "Text": {
                                                "val": "Integrate, test, and evaluate operator interface designs to support decision making and situation awareness while controlling multiple advanced and legacy RPAs in a dynamic mission environment.  Develop multi-transit control station interface technology to enable a single pilot to simultaneously control multiple RPAs transiting through airspace. Begin developing and evaluating interface controls for a networked RPA collaborative environment allowing teams of pilots along with sensor and payload operators to work together during stringent mission phases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Visualization"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate space visualization technologies that provide visually intuitive awareness of the battlespace, including trend portrayal useful for decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.028"
                                            },
                                            "Text": {
                                                "val": "Examined and analyzed the workflow and information required to provide warfighters with an inherent awareness of the operational space situation.  Exploited available cognitive task analyses of space operations and developed user requirements for visualization tools that simplify the process of portraying relevant data from large data sets.  Developed and tested laboratory prototypes of visualization tools developed from user-derived requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Work completed in FY 2012."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}