{
    "id": "5ca84f20d39d52ba4b70640e9f88f0d202e84f72",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602601F"
        },
        "ProgramElementTitle": {
            "val": "Space Technology"
        },
        "R1LineItemNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "117.986"
            },
            "CurrentYear": {
                "val": "98.375"
            },
            "BudgetYearOne": {
                "val": "104.063"
            },
            "BudgetYearOneBase": {
                "val": "104.063"
            },
            "BudgetYearTwo": {
                "val": "109.561"
            },
            "BudgetYearThree": {
                "val": "118.110"
            },
            "BudgetYearFour": {
                "val": "119.604"
            },
            "BudgetYearFive": {
                "val": "124.194"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element focuses on four major areas.  First, space survivability and surveillance develops technologies to understand space weather and the geophysics environment for mitigation and exploitation of these effects to Air Force systems.  Second, spacecraft payload technologies improve satellite payload operations by developing advanced component and subsystem capabilities.  Third, spacecraft protection develops technologies for protecting U.S. space assets in potential hostile settings.  The last major area, spacecraft vehicles, focuses on spacecraft platform and control technologies, and their interactions.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary space technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "115.158"
                },
                "CurrentYear": {
                    "val": "98.375"
                },
                "BudgetYearOne": {
                    "val": "109.644"
                },
                "BudgetYearOneBase": {
                    "val": "109.644"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "117.986"
                },
                "CurrentYear": {
                    "val": "98.375"
                },
                "BudgetYearOne": {
                    "val": "104.063"
                },
                "BudgetYearOneBase": {
                    "val": "104.063"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.828"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.581"
                },
                "BudgetYearOneBase": {
                    "val": "-5.581"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.466"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.638"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.581"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.581"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY14 is due to higher DoD priorities.\n\nReprogrammed for specific projects in accordance with Section 219 of the Duncan Hunter National Defense Authorization Act for Fiscal Year (FY) 2009, as amended by Section 2801 of the National Defense Authorization Act for FY 2010."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621010"
                    },
                    "ProjectTitle": {
                        "val": "Space Survivability & Surveillance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "46.718"
                        },
                        "CurrentYear": {
                            "val": "30.199"
                        },
                        "BudgetYearOne": {
                            "val": "35.987"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.987"
                        },
                        "BudgetYearTwo": {
                            "val": "38.733"
                        },
                        "BudgetYearThree": {
                            "val": "40.568"
                        },
                        "BudgetYearFour": {
                            "val": "44.904"
                        },
                        "BudgetYearFive": {
                            "val": "48.066"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies to understand and control the space environment for warfighter's future capabilities.  The focus is on characterizing and forecasting the battlespace environment for more realistic space system design, modeling, and simulation, as well as the battlespace environment's effect on space systems' performance.  This includes technologies to specify and forecast the space environment for planning operations, ensure uninterrupted system performance, optimize space-based surveillance operations, and provide capability to mitigate or exploit the space environment for both offensive and defensive operations.  Finally, this project includes the seismic research program that supports national requirements for monitoring nuclear explosions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Environment Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for specifying, monitoring, predicting, and controlling space environmental conditions hazardous to DoD operational space systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.963"
                                            },
                                            "Text": {
                                                "val": "Completed improved database for solar flare prediction tool.  Developed a new instrument to measure energetic electrons, ions, and neutral atoms in low earth orbit (LEO).  Refined and expanded models of the radiation belts based on anticipated data sets from planned space flight experiment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.344"
                                            },
                                            "Text": {
                                                "val": "Refine the concept-of-operations for solar optical flare specification and prediction unit, and complete the setup of the associated solar optics laboratory.  Explore properties of spacecraft materials and novel coatings to understand effects of temperature and aging on spacecraft charging and develop new techniques for charge mitigation.  Continue development of space environment models and tools to support improved spacecraft design and space mission planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.409"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.409"
                                            },
                                            "Text": {
                                                "val": "Continue energetic space particle dynamics research to improve quality of spacecraft environmental hazard predictions.  Continue spacecraft material temperature, dose, and aging effects research.  Develop spacecraft charge mitigation techniques related to on-orbit material aging.  Develop next-generation miniaturized space environment sensor concepts.  Exploit developing solar ultraviolet emissions and solar wind models to enable a time-dependent solar wind model capable of handling transients.  Investigate potential alternatives to traditional solar flare specification and prediction to achieve more accurate predictions.  Develop improved solar radio frequency monitoring concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Surveillance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced target detection techniques, spectral signature libraries, and decision aids for space-based sensors and surveillance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.368"
                                            },
                                            "Text": {
                                                "val": "Investigated space-based hypertemporal (HT) detection methods and data processing.  Investigated utilization of HT detection methods for monitoring concealed activity.  Continued to develop a search sensor system to monitor and characterize resident space objects and maneuver signatures.  Refined concepts and applications for space-based thermal infrared (IR) hyperspectral imaging payloads.  Developed atmospheric compensation and temperature-emissivity separation models for space-based thermal infrared hyperspectral imaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.169"
                                            },
                                            "Text": {
                                                "val": "Evaluate space-based HT sensor performance.  Complete HT data processing methodology and continue investigation of HT detection methods for concealed activity monitoring.  Continue trade-space studies of components used in space-based thermal IR hyperspectral imaging payloads.  Begin development of case scenarios and sensitivity analyses of atmospheric compensation and temperature-emissivity separation codes required for space-based thermal IR hyperspectral imaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.546"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.546"
                                            },
                                            "Text": {
                                                "val": "Continue to support development, calibration, data exploitation, and deployment for multiple types of hyperspectral sensors.  Continue space-based HT sensor performance trade studies.  Continue evaluation of HT detection methods for concealed activity monitoring.  Develop and test new temperature emissivity separation and atmospheric compensation algorithms to enable future space-based long wave IR hyperspectral sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ionospheric Research"
                                    },
                                    "Description": {
                                        "val": "Develop techniques, forecasting tools, and sensors for ionospheric specification and forecasting, space-based geolocation demonstrations, and determination of potential radar degradation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.656"
                                            },
                                            "Text": {
                                                "val": "Investigated methods to exploit grid-free calculations of plasma processes in the magnetosphere and ionosphere, as well as in the solar atmosphere and solar wind.  Studied energy flow between solar and terrestrial environments to improve solar weather forecasts.  Studied plasma instabilities and plasma processes in the equatorial and solar ionospheres.  Incorporated coupled physics-based models into space weather forecasts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.640"
                                            },
                                            "Text": {
                                                "val": "Incorporate methods to exploit grid-free calculations of plasma processes in the magnetosphere and ionosphere to improve solar weather forecasts.  Begin modeling energy flow between solar and terrestrial environments.  Study plasma instabilities and processes in the equatorial ionosphere to predict global positioning system and communication impacts.  Develop plan for increased measurement capabilities in severely under-sampled region for more accurate predictions of communication\/navigation effects.  Begin development of physics-based LEO satellite drag prediction tool."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.005"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.005"
                                            },
                                            "Text": {
                                                "val": "Continue investigations for physics-based improvements of space weather forecast models.  Develop improved scintillation specification and forecast capability for communication and global positioning system (GPS) impacts by assimilating space, ground and other unexploited data sources.  Begin implementing plan for increasing measurements in under-sampled regions for more accurate prediction of communications and GPS degradation.  Validate preliminary LEO satellite drag prediction tool and improve by assimilating satellite observations.  Begin study of auroral clutter effects on radar systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radiation Remediation Research"
                                    },
                                    "Description": {
                                        "val": "Conduct Radiation Belt Remediation (RBR) and ionospheric research at the High-frequency Active Auroral Research Program (HAARP) site."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.332"
                                            },
                                            "Text": {
                                                "val": "Conducted applications-related demonstrations exploiting ionosphere ducts for very long-range, beyond the horizon, communications and surveillance purposes.  Conducted research to characterize the interactions of radio waves and charged particles in the earth's radiation belts, to assess the planned Demonstration and Science Experiment (DSX) satellite experiments.  Developed RBR end-to-end model and validated to improve understanding of wave particle interaction, space transmitter, and lightning phenomenology.  Investigated options for future use of HAARP."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.850"
                                            },
                                            "Text": {
                                                "val": "Continue to characterize the interactions of radio waves and charged particles in the earth's radiation belts, to assess planned DSX satellite experiments.  Apply understanding of very low frequency (VLF) propagation from space sources and the resulting wave particle interactions.  Continue developing a validated end-to-end model to assess the feasibility of a fielded RBR system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.161"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.161"
                                            },
                                            "Text": {
                                                "val": "Continue ground-based VLF propagation experiments using national and international assets.   Validate revised VLF ionospheric propagation models for RBR modeling to include natural and man-made VLF sources.  Incorporate results from planned VLF and particle mapping flight experiment to support ground-based and space-based VLF transmitter experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seismic Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop seismic technologies to support national requirements for monitoring nuclear explosions with special focus on regional distances less than 2,000 kilometers from the sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.399"
                                            },
                                            "Text": {
                                                "val": "Completed refinement of unified model results of seismic calibration and observational studies of seismic wave propagation, including propagation in Eurasia.  Evaluated the results of using three-dimensional earth models in test processing of seismic events for some regions of high interest.  Tested potential improvements in high-frequency regional discrimination.  Continued detailed studies of particular challenge areas in local seismic monitoring."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.196"
                                            },
                                            "Text": {
                                                "val": "Migrate unified models of seismic calibration and wave propagation in Eurasia to three-dimensional physics-based models.  Begin to extend coverage of unified model to all of Eurasia.  Test new processing approaches to image local seismic structure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.782"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.782"
                                            },
                                            "Text": {
                                                "val": "Improve resolution of three-dimensional physics-based seismic wave propagation models through scientific and computational advances.  Investigate use of these three-dimensional models to match all details of seismic signals.  Continue extending coverage of unified model throughout Eurasia."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Navigation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies based on cold atom physics that provide autonomous jam-proof precision inertial navigation to augment GPS in case of GPS-denial.  Develop atomic clocks based on new technologies to replace legacy GPS atomic clocks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.084"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.084"
                                            },
                                            "Text": {
                                                "val": "Design a compact atomic clock that would provide both the accuracy and robustness necessary to replace legacy atomic clocks for GPS with modern sustainable technology.  Begin construction of a free space cold atom gyroscope\/accelerometer that would enable GPS-free precision navigation.  Evaluate design of a confined cold atom gyroscope to reduce size and weight requirements to expand GPS-free navigation to a larger number of Air Force platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624846"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Payload Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.743"
                        },
                        "CurrentYear": {
                            "val": "22.336"
                        },
                        "BudgetYearOne": {
                            "val": "19.122"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.122"
                        },
                        "BudgetYearTwo": {
                            "val": "20.243"
                        },
                        "BudgetYearThree": {
                            "val": "20.192"
                        },
                        "BudgetYearFour": {
                            "val": "21.793"
                        },
                        "BudgetYearFive": {
                            "val": "22.169"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops advanced technologies that enhance spacecraft payload operations by improving component and subsystem capabilities.  The project focuses on development of advanced, space-qualified, survivable electronics, and electronics packaging technologies; development of advanced space data generation and exploitation technologies, including infrared sensors; and development of high-fidelity space simulation models that support space-based surveillance and space asset protection research and development for the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space-Based Detector Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced infrared device technologies that enable hardened space detector arrays with improved detection to perform acquisition, tracking, and discrimination of space objects and missile warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.039"
                                            },
                                            "Text": {
                                                "val": "Evaluated performance of advanced high operating temperature infrared devices exposed to radiation environment; made data and analysis available to academia, industry, and government.  Evaluated in-house fabricated tunable detector samples to demonstrate proof-of-concept.  Investigated tunable filters, developing code and simulations for absorbing pulses in preparation for experimental verification.  Initiated silicon-based, hardened and extended response photodetector arrays effort leveraging low-cost silicon materials to detect further in the infrared than state-of-the-art.  Completed investigation of imaging and tracking for space situational awareness (SSA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.432"
                                            },
                                            "Text": {
                                                "val": "Continue predictive capability for next generation large format detector array and readout array technology challenges toward Wide Area, Global Access Detection and Tracking.  Continue developing alternative, lower-cost detector materials that operate at higher temperatures for the persistent surveillance mission.  Explore theoretical and experimental electronic transport and tenability studies in semiconductors to improve detector sensitivity and operation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.477"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.477"
                                            },
                                            "Text": {
                                                "val": "Develop innovative components and technologies to enable new capabilities or enhance existing performance of space sensors.  Pursue revolutionary breakthroughs to improve target detection and identification, enable mission configurability, and provide all weather, all terrain, dim\/distant target detection and identification while reducing the volume, weight and cost."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Situational Awareness Sensing Research"
                                    },
                                    "Description": {
                                        "val": "Develop innovative means for measuring, modeling, and predicting phenomena for SSA and protection applications.  Develop new methods to evaluate how well specific data contributes to identifying particular physical and functional information about a space-based object, and ultimately enable decision-makers to pursue courses of action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.021"
                                            },
                                            "Text": {
                                                "val": "Furthered analysis, modeling, and bench-top experiments in new sensing methods, including radio and IR bands, polarimetry, and non-traditional interferometric techniques.  Developed a new method for mapping decision-maker information needs to sensing capability needs, including quality, quantity, and timeliness measures of effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.228"
                                            },
                                            "Text": {
                                                "val": "Initiate predictive modeling capabilities for select sensing methods and phenomena.  Develop theory required and apply to a variety of space awareness mission threads and potential threat scenarios.  Verify and validate decision-critical information mapping exercise results.  Complete the multi-sensor exploitation for space object characterization effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.036"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.036"
                                            },
                                            "Text": {
                                                "val": "Verify and validate predictive modeling capabilities against laboratory and field measurements.  Initiate next-generation analysis of sensing methods and phenomena to exploit for space protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Electronics Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for space-based payload components such as radiation-hardened electronic devices, micro-electro-mechanical system devices, and advanced electronics packaging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.882"
                                            },
                                            "Text": {
                                                "val": "Investigated high power microwave hardening techniques for satellite systems to develop methodologies to mitigate against narrowband high power microwaves over a wide frequency range.  Began research on advanced system-on-chip integration for improved performance of space sensor systems.  Completed development of radiation hardened plug-and-play interface module for reconfigurable spacecraft hardware.  Initiated development of integrated modules using three-dimensional techniques to reduce size, weight, and power and increase performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.493"
                                            },
                                            "Text": {
                                                "val": "Continue investigation of hardening techniques to protect satellites from high power microwaves.  Continue research on advanced system-on-chip integration for improved performance of space sensor systems.  Continue development of integrated modules using three-dimensional techniques to reduce size, weight, and power and increase performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.924"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.924"
                                            },
                                            "Text": {
                                                "val": "Complete investigation of hardening techniques to protect satellites from high power microwaves.  Complete integration model of basic technologies for proof-of-concept system-on-chip integration.  Continue research and development of advanced system-on-chip integration for improved performance of space sensor systems.  Complete three-dimensional evaluation test devices to prove feasibility of the process within the foundry.  Continue development of integrated modules using three-dimensional techniques to reduce size, weight, and power and increase performance.  Begin investigating multicore processor architectures for integration with three-dimensional and system-on-chip techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation Tools for Space Applications"
                                    },
                                    "Description": {
                                        "val": "Develop modeling and simulation tools for space-based ground surveillance systems, rendezvous and proximity operations, imaging of space systems, distributed satellite architecture, and space control payloads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.294"
                                            },
                                            "Text": {
                                                "val": "Developed engineering and military utility models for space superiority analysis of SSA and defensive operations technologies.  Supported autonomous space flight experiments with cost modeling and trade studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.183"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and test spacecraft simulations that model system performance, mission planning, and experiments for future flight experiments.  Develop a data center to be able to archive telemetry from flight experiments.  Note:  Increase in funding is due to additional emphasis on modeling and simulation technologies supporting Defensive Space Control and SSA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.685"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.685"
                                            },
                                            "Text": {
                                                "val": "Continue to develop spacecraft and mission simulations in close conjunction with customers across DoD.  Integrate state-of-the-art system performance and mission planning algorithms into modeling and simulation software tools.  Transition validated tools to the data center in preparation for upcoming flight programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Communication Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for next-generation space communications terminals and equipment and methods\/techniques to enable future space system operational command and control concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.507"
                                            },
                                            "Text": {
                                                "val": "Researched technologies\/components that support optical communication, reconfigurable and cognitive communication, advanced radio frequency (RF) communication, and communication security to increase the capacity and flexibility of current and future space protected communication system concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This effort has been moved to Project 628809 to better align with Air Force science and technology goals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625018"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Protection Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.436"
                        },
                        "CurrentYear": {
                            "val": "4.230"
                        },
                        "BudgetYearOne": {
                            "val": "5.423"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.423"
                        },
                        "BudgetYearTwo": {
                            "val": "7.269"
                        },
                        "BudgetYearThree": {
                            "val": "7.803"
                        },
                        "BudgetYearFour": {
                            "val": "6.439"
                        },
                        "BudgetYearFive": {
                            "val": "6.367"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the technologies for protecting U.S. space assets in potentially hostile environments to assure continued space system operation without performance loss in support of warfighter requirements.  The project focuses on identifying and assessing spacecraft system vulnerabilities, developing threat warning technologies, and developing technologies to mitigate the effects of both intentional and unintentional threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Threat Warning Research"
                                    },
                                    "Description": {
                                        "val": "Develop satellite threat warning technologies and tools for space defense.  Exploit on-board inherent satellite resources, satellite-as-a-sensor, and self-aware satellite technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.436"
                                            },
                                            "Text": {
                                                "val": "Developed technologies for on-orbit threat detection, assessment, and response, including development of algorithms for pursuit-evasion, space-based tasking, and co-orbital threat detection.  Baselined all-in-all satellite conjunction analysis system.  Developed net-centric situation awareness system.  Reduced size, weight, and power requirements for next-generation proximity detection sensors.   Note:  In FY 2012, increased emphasis on threat warning technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.230"
                                            },
                                            "Text": {
                                                "val": "Continue technology development of advanced on-orbit threat detection, assessment, and response, including data processing and handling for course of action determination, space-based tasking, co-orbital threat detection, and autonomous response.  Demonstrate situational awareness system in operational environment.  Develop and obtain initial operating capability for situational awareness testbed.  Reduce size, weight, and power for next-generation proximity detection sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.423"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.423"
                                            },
                                            "Text": {
                                                "val": "Enhance satellite-as-a-sensor technology development.  Demonstrate improved ability to determine satellite orbital conjunctions and develop proof-of-concept for closed loop situational awareness system.  Develop integrated sensor and response system for threat detection, characterization, and warning.  Advance detection sensor technology to improve data-to-information-to-decision capabilities.  Develop improved sensor algorithms and data fusion techniques.  Continue to reduce size, weight, and power requirements for next generation proximity detection sensors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "628809"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Vehicle Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.089"
                        },
                        "CurrentYear": {
                            "val": "41.610"
                        },
                        "BudgetYearOne": {
                            "val": "43.531"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.531"
                        },
                        "BudgetYearTwo": {
                            "val": "43.316"
                        },
                        "BudgetYearThree": {
                            "val": "49.547"
                        },
                        "BudgetYearFour": {
                            "val": "46.468"
                        },
                        "BudgetYearFive": {
                            "val": "47.592"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on spacecraft platforms (e.g., structures, power, and thermal management); satellite control (e.g., signal processing and control); and space experiments of maturing technologies for space qualification."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Power\/Thermal Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for advanced space platform subsystems such as cryocoolers, compact, high efficiency solar power cells and arrays, and innovative power generation concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.734"
                                            },
                                            "Text": {
                                                "val": "Began effort to increase cryocooler efficiency from 12% to 30% through in-house modeling, energy analysis of single and multi-stage coolers, and distributed cooling.  Began to research effective low and zero vibration cryocooler technologies, including solid state coolers.  Modeled spacecraft thermal radiation signature phenomenology to understand the physics of IR sensing of resident space objects.  Advanced development of materials and concepts for 40% efficiency or greater solar cells.  Demonstrated cell interconnect and module technologies to enable flexible arrays."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.773"
                                            },
                                            "Text": {
                                                "val": "Continue to increase cryocooler efficiency from 12% to 30% through modeling, energy analysis of single and multi-stage coolers, and cross gimbal\/distributed cooling.  Continue to research effective low and zero vibration cryocooler technologies, including solid state coolers.  Continue to investigate approaches and concepts for development of greater than 40% efficient solar cells.  Continue development of novel flexible array technologies to enable greater launch volume stowage efficiency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.444"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.444"
                                            },
                                            "Text": {
                                                "val": "Complete preliminary cryocooler modeling, energy analysis of single and multi-stage coolers, and cross gimbal\/distributed cooling to improve cryocooler efficiency and demonstrate some strategies.  Continue to research and advance effective low and zero vibration cryocooler technologies, including solid state coolers.  Begin moving forward with maturation of most promising technical approaches for greater than 40% efficient solar cells.  Continue development of novel flexible array technologies to enable greater launch volume stowage efficiency and higher specific power."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Structures and Controls Research"
                                    },
                                    "Description": {
                                        "val": "Develop revolutionary and enabling technologies, including lighter weight, lower cost, high performance structures for space platforms; guidance, navigation, and controls hardware and software for next generation of space superiority systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.301"
                                            },
                                            "Text": {
                                                "val": "Completed integrated thermal management subsystem for satellites applications.  Developed novel technologies for high-efficiency deployable structures for RF frequencies and electro-optical payloads for SSA.  Developed automated guidance, navigation, and control subsystem design tools for spacecraft.  Initiated development of advanced estimation-based algorithms for search, detect and track of space objects.  Initiated new dynamics analysis efforts for prediction of spacecraft relative motion and development of improved navigation system and maneuver detection methods.  Initiated efforts to produce improved spacecraft thruster dynamic response models to allow increased precision in relative-motion control applications. Initiated development of next-generation electronics to enable more rapid spacecraft build and to reduce spacecraft cost.  Developed technologies for integrated satellite bus checkout and sensor calibration using autonomous flight architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.891"
                                            },
                                            "Text": {
                                                "val": "Produce experimental flight hardware for thermal management systems requiring high power input. Develop capabilities for characterizing novel, structural materials in a relevant environment.  Complete design tools for automated guidance, navigation, and control subsystem for spacecraft.  Demonstrate and transition advanced estimation-based algorithms for search, detect, and track of space objects.  Continue development of advanced dynamic analysis methods for spacecraft relative motion applications; validate improved spacecraft thruster models in relevant environment; initiate new techniques supporting debris mitigation, including passive (fuel free) techniques for de-tumbling debris to allow for easier removal; initiate new research in collaborating autonomous spacecraft guidance, navigation, and control techniques supporting distributed spacecraft missions.  Continue development of next-generation electronics to enable rapid spacecraft build and reduce spacecraft cost.  Demonstrate autonomous flight architecture enabling rapid threat detection and response."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.711"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.711"
                                            },
                                            "Text": {
                                                "val": "Perform multi-physics characterization of relevant and non-linear structural materials (mechanical, thermal, electromagnetic).  Produce flight hardware for experimental de-orbit mechanism for satellites and rocket stages.  Complete advanced dynamics analysis methods efforts and demonstrate in relevant environment(s); continue space debris mitigation efforts; continue collaborative autonomous spacecraft guidance, navigation, and control efforts supporting distributed spacecraft missions; initiate efforts to integrate guidance, navigation, and control methods with advanced spacecraft autonomy decision architectures.  Demonstrate on the ground space-to-space surveillance system with autonomous sensor control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Experiments"
                                    },
                                    "Description": {
                                        "val": "Develop flight experiments to improve the capabilities of existing operational space systems and to enable new transformational space capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.054"
                                            },
                                            "Text": {
                                                "val": "Completed assembly, integration, and test of the DSX satellite to launch ready.  Continued operations concept planning and continued development, design, and build of DSX mission planning tools for on-orbit operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.389"
                                            },
                                            "Text": {
                                                "val": "Begin launch readiness preparations, electrical trailblazer, insertion of flight batteries and communications security equipment, and regression testing with satellite operations center in preparation for integration on the launch vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.245"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.245"
                                            },
                                            "Text": {
                                                "val": "Continue pre-launch preparations and pre-launch-vehicle integration for on-orbit radiation remediation proof-of-concept experiment.  Develop innovative technologies for planned on-orbit experiment using the Evolved Expendable Launch Vehicle Secondary Payload Adaptor to support both platform and payloads, as well as developing advanced interfaces to accommodate partner payloads and technologies.  Complete manufacturing and delivery of very low frequency particle mapper (VPM) payload suite, and begin satellite bus integration.  Begin VPM mission launch readiness actions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Communication Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for next-generation space communications terminals and equipment and methods\/techniques to enable future space system operational command and control concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.557"
                                            },
                                            "Text": {
                                                "val": "Conduct research and develop various technologies (i.e., high power amplifiers, integrated optical transceivers, high-performance satellite antenna, and reconfigurable satellite radios) to support future space communication systems; particular emphasis is placed on optical (laser) communication, reconfigurable and cognitive communication, advanced radio frequency communication, high-bandwidth photonic satellite bus networks, and satellite communication security\/encryption."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.131"
                                            },
                                            "Text": {
                                                "val": "Continue applied research and development efforts (modeling, simulation, and laboratory testing) to reduce component technical risks (e.g., functionality and performance) and to meet technology and capability needs for optical (i.e., laser communication), millimeter-wave (i.e., Ka-band, V-band, W-band), and protected satellite communication technology."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}