{
    "id": "606964d4f1862bbb3e28353e5cd4fb51d1da620e",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603203F"
        },
        "ProgramElementTitle": {
            "val": "Advanced Aerospace Sensors"
        },
        "R1LineItemNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "119.227"
            },
            "CurrentYear": {
                "val": "37.657"
            },
            "BudgetYearOne": {
                "val": "30.579"
            },
            "BudgetYearOneBase": {
                "val": "30.579"
            },
            "BudgetYearTwo": {
                "val": "29.808"
            },
            "BudgetYearThree": {
                "val": "29.496"
            },
            "BudgetYearFour": {
                "val": "33.641"
            },
            "BudgetYearFive": {
                "val": "33.433"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Divided into two broad project areas, this program develops technologies to enable the continued superiority of sensors from aerospace platforms.  The first project develops and demonstrates advanced technologies for electro-optical sensors, radar sensors and electronic counter-countermeasures, and components and algorithms.  The second project develops and demonstrates radio frequency (RF)and electro-optical (EO)sensors for detecting, locating, and targeting airborne, fixed, and time-critical mobile ground targets obscured by natural or man-made means.  Together, the projects in this program develop the means to find, fix, target, track, and engage air and ground targets anytime, anywhere, and in any weather.  This program has been coordinated through the the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 3, Advanced Technology Development, since it develops and demonstrates technologies for existing system upgrades and\/or new sensor and electronic combat system developments that have military utility and address warfighter needs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "121.666"
                },
                "CurrentYear": {
                    "val": "37.657"
                },
                "BudgetYearOne": {
                    "val": "31.366"
                },
                "BudgetYearOneBase": {
                    "val": "31.366"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "119.227"
                },
                "CurrentYear": {
                    "val": "37.657"
                },
                "BudgetYearOne": {
                    "val": "30.579"
                },
                "BudgetYearOneBase": {
                    "val": "30.579"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.439"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.787"
                },
                "BudgetYearOneBase": {
                    "val": "-0.787"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.573"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.866"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.787"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.787"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Reprogrammed for specific projects in accordance with Section 219 of the Duncan Hunter National Defense Authorization Act for Fiscal Year (FY) 2009, as amended by Section 2801 of the National Defense Authorization Act for FY 2010."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "63665A"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Aerospace Sensors Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.705"
                        },
                        "CurrentYear": {
                            "val": "16.269"
                        },
                        "BudgetYearOne": {
                            "val": "16.649"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.649"
                        },
                        "BudgetYearTwo": {
                            "val": "12.809"
                        },
                        "BudgetYearThree": {
                            "val": "14.900"
                        },
                        "BudgetYearFour": {
                            "val": "14.609"
                        },
                        "BudgetYearFive": {
                            "val": "15.245"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates aerospace sensor and processing technologies for intelligence, surveillance, reconnaissance (ISR), target, and attack radar applications in both manned and unmanned platforms, including electro-optical sensors and electronic counter-countermeasures for radars.  It provides aerospace platforms with the capability to precisely detect, track, and target both airborne (conventional and low radar cross-section) and ground-based, high-value, time-critical targets in adverse clutter and jamming environments.  Project activities include developing multi-function radio-frequency systems including radar and electronic warfare technology.  Desired warfighting capabilities include the ability to detect concealed targets in difficult background conditions."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort for Program Increase."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Navigation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to provide precision position and timing information to enable distributed, layered sensing on air and space vehicles in Global Positioning System (GPS) degraded\/denied environments.  Develop technologies to maximize positional accuracy, timing accuracy, and exploitation techniques to improve offensive and defensive combat capabilities.  Simulate, develop, and demonstrate integrated navigation warfare technologies, to establish and maintain a military advantage in satellite-based navigation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.963"
                                            },
                                            "Text": {
                                                "val": "Developed strategies to optimize reference technologies for distributed sensing missions. Explored alternatives when GPS is degraded or denied.  Reduced size, weight, and power of inertial components. Enhanced precision of GPS and non-GPS reference technologies. Developed reference optimization components necessary to support bi-static and multi-static radar technologies. Evaluated progress and determined next spiral requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.621"
                                            },
                                            "Text": {
                                                "val": "Continue to develop strategies to optimize reference technologies for distributed sensing missions.  Maintain\/enhance performance while reducing size, weight, and power.  Continue development of reference optimization components necessary to support bi-static and multi-static radar technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "Develop technologies to preserve position, navigation, and timing (PNT) avilability, including augmentation technologies for GPS in the event of outage, and advanced technologies that do not rely on GPS. Explore integration of GPS with precise inertial measurement units (IMUs) and augmentation using geo-referenced imagery. Collaborate with Space Vehicles Directorate to develop advanced, low-drift IMUs involving novel measurement techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Sensing in Contested Environment Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop active RF sensor solutions to use against difficult-to-detect targets in challenging environments, and advanced RF architectures for open and reconfigurable systems.  Enable persistent ISR over wide areas, and detect advanced air and ground targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.337"
                                            },
                                            "Text": {
                                                "val": "Initiated test and evaluation of dismount radar detection back end and algorithms in conjunction with the outdoor range.  Initiated persistent multiple intelligence (multi-INT) sources layered sensing demonstration.  Developed modular RF backend (demonstration of open systems architecture) for combined radar and signals intelligence (SIGINT) processing for eventual integration into the outdoor range.  Provided systems engineering for development of integrated sensor for high altitude ISR.  Initiated support and risk reduction efforts for a high altitude radar flight demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.844"
                                            },
                                            "Text": {
                                                "val": "Complete development of modular RF backend (demonstration of open systems architecture) for combined radar and SIGINT processing and integrate into the outdoor range.  Continue development and testing of a wide area staring radar."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Complete modular RF backend demonstration for combined radar and SIGINT.  Continue research and development of a wide area staring radar, and begin development of staring rader RF testbed.  Initiate research and development in next generation active RF sensing for contested spectrum environments, including investigation of the limits of active RF sensing with an emphasis on contested and denied environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Passive RF Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced techniques and prototype passive RF sensors to intercept, collect, locate and track enemy RF sensor systems for intelligence, reconnaissance and surveillance of air and ground targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.246"
                                            },
                                            "Text": {
                                                "val": "Completed system engineering and performed initial flight test of multistatic radar using existing aperture and receiver components. Collected flight data for small RPA direction finding and geolocation system, processed data using multiple algorithms. Demonstrated advanced electromagnetic methods for detecting difficult targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.675"
                                            },
                                            "Text": {
                                                "val": "Complete flight test data collection of passive multistatic radar process data and develop algorithms for future multistatic radar systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.149"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.149"
                                            },
                                            "Text": {
                                                "val": "Initiate research for creating passive RF sensing testbed for use in indoor and outdoor range laboratories.  Initiate advanced exploration and investigation of the limits of passive RF sensing with an emphasis on innovative passive techniques for operations in contested and denied environments.  Develop advanced techniques for the exploitation of active RF emitters utilizing passive RF sensing techniques. Conduct research and development of passive RF sensors including phenomenology, modeling and simulation, algorithm development and experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop radio frequency (RF) and electro-optical (EO) sensor technology to detect, locate, and identify air and ground targets at long ranges, including those that are low-observable, or use deception or camouflage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.744"
                                            },
                                            "Text": {
                                                "val": "Performed concept validation and signature utility experiments for long-range synthetic aperture laser radar imaging.  Conducted laboratory and field experiments for mitigating primary risk areas associated with synthetic aperture laser radar imaging from airborne platforms.  Initiated development of master oscillator technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.129"
                                            },
                                            "Text": {
                                                "val": "Refine performance and signature models to validated requirements and concept of operations for long range synthetic aperture laser radar imaging.  Continue laboratory and field experiments for mitigating primary risk areas associated with synthetic aperture laser radar imaging from airborne platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Initiate development of advanced active and passive electro-optical sensing technologies for surveillance and reconnaissance at standoff ranges in contested environments. Continue develop of long range temporal synthetic aperture ladar system.  Demonstrate high power, high coherence transmitter and receiver array.  Initiate ground and flight test plans for aircraft integration.  Develop transceiver hardware for ground based imaging of satellite in geosyncronous orbit.  Initiate test and characterization of mercury-cadmium-teluride on silicone focal plane.  Initiate design and prototyping of passive infrared imaging system for enhanced range infrared target recognition and full motion video."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamic Target Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop electro-optical sensing technologies for surveillance, tracking, and identification of dynamic targets in urban areas from manned and unmanned platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.415"
                                            },
                                            "Text": {
                                                "val": "Conducted concept demonstration experiments for exploiting infrared persistent surveillance imagery to detect, track, and characterize targets in urban areas.  Performed utility assessment experiments to quantify system performance, analyzed human perception performance, and developed image processing techniques.  Conducted proof-of-concept development of large format infrared camera technology for distributed airborne surveillance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort terminated due to higher DoD priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6369DF"
                    },
                    "ProjectTitle": {
                        "val": "Target Attack and Recognition Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "84.522"
                        },
                        "CurrentYear": {
                            "val": "21.388"
                        },
                        "BudgetYearOne": {
                            "val": "13.930"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.930"
                        },
                        "BudgetYearTwo": {
                            "val": "16.999"
                        },
                        "BudgetYearThree": {
                            "val": "14.596"
                        },
                        "BudgetYearFour": {
                            "val": "19.032"
                        },
                        "BudgetYearFive": {
                            "val": "18.188"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced technologies for attack management, fire control, and target identification and recognition.  This includes developing and demonstrating integrated and cooperative fire control techniques to provide for adverse-weather precision air strikes against multiple targets per pass and at maximum weapon launch ranges.  Specific fire control technologies under development include attack management, sensor fusion, automated decision aids, advanced tracking for low radar cross section threats, and targeting using both on-board and off-board sensor information.  This project also evaluates targeting techniques to support theater missile defense efforts in surveillance and attack.  These fire control technologies will provide force multiplication and reduce warfighter exposure to hostile fire.  This project also develops and demonstrates target identification and recognition technologies for positive, high confidence cueing, recognition, and identification of airborne and ground-based, high-value, time-critical targets at longer ranges than are currently possible.  The goal is to apply these technologies to tactical air-to-air and air-to-surface weapon systems so they are able to operate in all weather conditions, during day or night, and in high-threat, multiple target environments.  Model-based vision algorithms and target signature development techniques are the key to target identification and recognition.  This project is maturing these technologies in partnership with the Defense Advanced Research Projects Agency and evaluating the techniques to support theater missile defense efforts in surveillance and attack.  Fire control and recognition technologies developed and demonstrated in this project are high leverage efforts, providing for significant advancements in operational capabilities largely through software improvements readily transitionable to new and existing weapon systems."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Blue Devil 1"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "58.600"
                                        },
                                        "Text": {
                                            "val": "Supported Blue Devil 1 operations in theater."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automatic Target Recognition"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an automatic target recognition capability integrated with advanced geo-registration techniques and innovative change detection algorithms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.809"
                                            },
                                            "Text": {
                                                "val": "Conducted assessment and enhancement of technology supporting time-critical targeting systems for Planning & Direction, Collection, Processing & Exploitation, Analysis & Production, and Dissemination (PCPAD)Experimentation.  Conducted spiral development and validation of synthetic data generation capability critically needed to augment collected research, development, and operational data sets. Enhanced the Air Force automatic target recognition test and evaluation facility and datasets as required to support enhanced PCPAD capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.516"
                                            },
                                            "Text": {
                                                "val": "Complete development of enhancements to automatic target recognition, automatic target cueing, geo-registration, and change detection technology to meet warfighter needs. Complete assessment and enhancement of technology supporting time-critical targeting systems in automatic target recognition. Complete development and validation of synthetic data generation capability critically needed to augment collected research, development, and operational data sets. Enhance the Air Force automatic target recognition test and evaluation facility and data sets as required to support enhanced time-critical targeting capabilities. Complete development and assessment of time-critical targeting and advanced target tracking technologies required to meet warfighter requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort moved to Thrust 4 in this Project to better align efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Sensor Targeting Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop an advanced suite of sensors with automatic target recognition, fusion, and target tracking, all working in concert to provide a high-confidence identification capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.247"
                                            },
                                            "Text": {
                                                "val": "Identified candidate technologies to address deficiencies to improve aimpoint tracking, electro-optical automatic target recognition, synthetic aperture radar automatic target recognition, and the multi-sensor fusion algorithms. Predicted performance of the integrated technologies and system.  Enhanced phenomenological modeling, target, and scenario databases and exploitation tools necessary to support technology development. Assessed maturity of applicable technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.042"
                                            },
                                            "Text": {
                                                "val": "Continue to identify candidate technologies to address deficiencies to improve electro-optical automatic target recognition, synthetic aperture radar automatic target recognition, and multi-sensor fusion algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Text": {
                                                "val": "Continue identification of new candidate technologies to address deficiencies to improve electro-optical automatic target recognition, synthetic aperture radar automatic target recognition and the multi-sensor fusion algorithms for both PCPAD and combat identification applications in contested and denied environments.  Enhance phenomenological modeling, target and scenario databases and exploitation tools necessary to address contested and denied environments.  Continue development of PCPAD capabilities for non-contested environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air-to-Ground Identification Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop an \"identify friend, foe, or neutral\" air-to-ground capability using cooperative and non-cooperative identification techniques."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.988"
                                            },
                                            "Text": {
                                                "val": "Developed physics-based signature exploitation, modeling methods, and signal processing for feature-based recognition and fusion and applied these methods to sensor design to enable performance-based sensing. Developed an integrated radar sensor signature exploitation and signal processing analysis capability for recognition applications including staring radar,combat identification (CID), space situational awareness (SSA), measurement and signatures intelligene (MASINT), and ISR applications.  Developed efficient methods for collecting and processing radar sensor data for recognition. Developed methods to analyze salient features to aid in the prediction, analysis, and processing capability as a function of sensor design parameters for performance-driven sensing. Developed a loosely coupled capability for multi-sensor measurement, processing, modeling, and analysis methods to support target recognition database development efforts and MASINT applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort terminated due to higher DoD priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Sensor Target Recognition"
                                    },
                                    "Description": {
                                        "val": "Develop and assess multi-sensor automatic target recognition for intelligence, surveillance, reconnaissance, strike, and weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.832"
                                            },
                                            "Text": {
                                                "val": "Completed assessment of multi-sensor automatic exploitation algorithms in non contested environments. Initiated development of new automatic target recognition fusion algorithm  to overcome shortfalls.  Assessed technology supporting intelligence, surveillance, and reconnaissance systems.  Continued development of an automatic target recognition fusion sensor data exploitation capability utilizing analysis and experimentation of data independence and interdependence of features to support development of an optimum data fusion exploitation capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.807"
                                            },
                                            "Text": {
                                                "val": "Initiate technology assessment of intelligence, surveillance and reconnaissance systems in anti-access\/area denial environments. Analyze unique technology requirements for new automatic target recognition fusion algorithms to address anti-access\/area denial environments. Initiate research in exploitation algorithms supporting Planning, Collection, Processing, Analysis and Dissemination (PCPAD).  Continue development of fusion algorithm for automatic target recognition and exploitation in non-contested environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "Continue assessment of technology supporting intelligence, surveillance and reconnaissance systems in contested anti-access\/area denial environments.  Continue development of new automatic target recognition fusion research to address technology gaps. Initiate research in development and assessment of multi-sensor automatic target recognition specifically for strike.   Initiate spiral development of sensor exploitation algorithms of multi-sensor automatic target recognition systems supporting PCPAD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wide-Angle, Continuously-Staring Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop wide angle, continuous staring, multi-sensor\/wavelength sensing and automated exploitation technology to detect, track, and identify targets over large areas at low sensor update rates."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.815"
                                            },
                                            "Text": {
                                                "val": "Developed, integrated, and tested the next spiral engineering model of the multi-sensor, multi-wavelength wide-angle, continuously-staring capability building upon the technologies developed during the previous demonstration. Integrated, demonstrated, and tested the enhanced wide angle, continuously-staring component technologies via a combination of exercises and scientific analyses. Conducted spiral development of wide angle, continuous staring exploitation algorithms, phenomenological modeling, target, and scenario databases necessary to support transition to the warfighter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.225"
                                            },
                                            "Text": {
                                                "val": "Develop, integrate, and test the next spiral engineering model of the multi-sensor, multi-wavelength wide-angle, continuously-staring capability building upon the technologies developed during the previous demonstration. Continue to integrate, demonstrate, and test the enhanced wide angle, continuously-staring component technologies via a combination of exercises and scientific analyses. Continue spiral development of wide angle, continuous staring exploitation algorithms, phenomenological modeling, target, and scenario databases necessary to support transition to the warfighter."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.730"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.730"
                                            },
                                            "Text": {
                                                "val": "Initiate development of continuously-staring capability in contested and denied environments  building upon the previous technologies developed for non-contested environments.  Integrate, demonstrate and evaluate the enhanced wide angle, continuously-staring component technologies in contested and denied environments. Continue spiral development of wide angle, continuous staring exploitation algorithms, phenomenological modeling, target and scenario databases necessary to support transition to the warfighter."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RF Persistent Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop active RF sensor solutions to use against difficult-to-detect targets in challenging environments, and advanced RF architectures for open and reconfigurable systems.  Enable persistent ISR over wide areas, and detect advanced air and ground targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.231"
                                            },
                                            "Text": {
                                                "val": "Conducted systems engineering and initiated development of dual-band wide-angle, continuously staring hardware and identifed platform integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.798"
                                            },
                                            "Text": {
                                                "val": "Complete development of dual-band system, and integrate on to identified platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A.  This effort completes in FY13."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}