{
    "id": "643d795d676695142f1ab0c4f034ba4fe1fb289b",
    "meta": {
        "filename": "dod-2014_RDTE_2014_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2014.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0204571J"
        },
        "ProgramElementTitle": {
            "val": "Joint Staff Analytical Support (JSAS)"
        },
        "R1LineItemNumber": {
            "val": "168"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.018"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "2.097"
            },
            "BudgetYearOneBase": {
                "val": "2.097"
            },
            "BudgetYearTwo": {
                "val": "0.924"
            },
            "BudgetYearThree": {
                "val": "0.942"
            },
            "BudgetYearFour": {
                "val": "1.029"
            },
            "BudgetYearFive": {
                "val": "1.038"
            },
            "CostToComplete": {
                "val": "0.0"
            },
            "TotalCost": {
                "val": "6.048"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Staff Analytical Support (JSAS) family of programs provides defense analytical support capabilities for the CJCS and Combatant Commands (CCMD).  JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulate the results to best assist the Chairman in fulfilling his statutory responsibilities.  Key deliverables provided by JSAS include wide-ranging force structure assessments, course of action development for the Joint Force environment, analyses and studies to aid in decision-making, and other analysis efforts to implement timely, low-cost initiatives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.018"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.018"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.097"
                },
                "BudgetYearOneBase": {
                    "val": "2.097"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.097"
                },
                "BudgetYearOneBase": {
                    "val": "2.097"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program change"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.097"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.097"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding for additional Global Force Management requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Concept Development Red Teaming"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.018"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.0"
                        },
                        "TotalCost": {
                            "val": "0.018"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Staff Analytical Support (JSAS) family of programs provides defense analytical support capabilities for the CJCS and COCOMs. JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulate the results to best assist the Chairman in fulfilling his statutory responsibilities. Key deliverables provided by JSAS include wide-ranging force structure assessments, course of action development for the Joint Force environment, analyses and studies to aid in decision-making, and other analysis efforts to implement timely, low-cost initiatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Concept Development Red Teaming"
                                    },
                                    "Description": {
                                        "val": "Funds discovery experimentation activities supporting Joint Operations Concept (JOpsC) Development Process, implementation, and system integration.  Provides expert assessment of future conceptual approaches, alternate means to achieve future solutions and capabilities through Red Teaming.   Supports development and competition of ideas that provide the fundamental underpinnings for force development and design critical to assessing risk to DoD future capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.018"
                                            },
                                            "Text": {
                                                "val": "Funding provides program support for one concept."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P002"
                    },
                    "ProjectTitle": {
                        "val": "Global Force Management Data Initative (GFM DI)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.097"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.097"
                        },
                        "BudgetYearTwo": {
                            "val": "0.924"
                        },
                        "BudgetYearThree": {
                            "val": "0.942"
                        },
                        "BudgetYearFour": {
                            "val": "1.029"
                        },
                        "BudgetYearFive": {
                            "val": "1.038"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "6.030"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Automates the development of the Global Force Management Implementation Guidance Forces For Unified Commands Memorandum Assignment and Apportionment tables.  This will be accomplished using the Automated GFM Tool (AGT) and Collaborative Issue Resolution Tool (CIRT).  AGT and authoritative force structure data tagged with Organizational Unique Identifiers (OUID) will be transferred “machine-to-machine” from the Services to AGT. Additionally, AGT development will incorporate force readiness information.  The goal is to greatly improve the quality, timeliness, and accuracy of information available to perform Force Management (FM) throughout the Department."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Global Force Management Data Initative (GFM DI)"
                                    },
                                    "Description": {
                                        "val": "RDT&E funds for the Global Force Management (GFM) program will enable the Assignment, the Allocation, and the Apportionment functions for forces to meet the requirements set forth in Title 10 U.S.C. and the Unified Command Plan.  The development of the Secretary of Defense’s “Forces for Unified Commands” Memorandum Assignment Tables has historically been a labor intensive staffing process conducted annually.  The Automated GFM Toolset is the first downstream consumer of force structure data resident in the seven organization (org) servers that are made available by the GFM DI effort.  CIRT has streamlined force management, increased common understanding of force assignment, and supported timely force management decisions.  The objective is to automate the generation of the Global Force Management Implementation Guidance (GFMIG) and Forces For Unified Commands (Forces For) Assignment, Apportionment and Allocation tables.  These efforts will flatten, streamline, and automate the current process while providing high fidelity data and transparency and enhance Combatant Commander risk assessment to operational plans.  \n\nFailure to fund for this effort negatively impacts the ability of the Services, CCMDs, JS and OSD to efficiently manage force structure resources.  Without continued funding, the current FY13 Forces For staffing cycle will rely on manual, inefficient, less-timely spreadsheets to develop the Assignment and Apportionment Tables.  Additionally, this initially successful CIRT and AGT will fail and negatively impact the use of authoritative force structure data in GFM DI Next Steps."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.097"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.097"
                                            },
                                            "Text": {
                                                "val": "Development of the AGT for Assignment and Apportionment functions to meet FOC schedule.  Once FOC, AGT will need to be tested with actual data via individual service management systems (servers) to validate the forces Assignment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "- The Services, CCMDs, JS and OSD will be able to efficiently manage force structure resources in half the time the current process takes\n- Global force structure management will now become near-real time planning tool"
                        }
                    }
                }
            ]
        }
    }
}