{
    "id": "6935a0f8914b147b20bcb50f09dcf870859e26a2",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604870A"
        },
        "ProgramElementTitle": {
            "val": "Nuclear Arms Control Monitoring Sensor Network"
        },
        "R1LineItemNumber": {
            "val": "116"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.160"
            },
            "CurrentYear": {
                "val": "7.922"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            }
        },
        "ProgramElementNote": {
            "val": "Program being moved from Army to OSD DTRA in FY14."
        },
        "ProgramElementMissionDescription": {
            "val": "This project provides Research, Development, Testing & Evaluation (RDTE) to meet technology requirements in support of implementation, compliance, monitoring and inspection for existing and emerging nuclear arms control activities and dual use technology for missile defense integration activities.  The project addresses requirements validated by the Office of the Under Secretary of Defense, Acquisition, Technology & Logistics (OUSD AT&L).  This project conforms to the administration's research and development priorities as related to Weapons of Mass Destruction (WMD) arms control and disarmament.  Technical assessments are made to provide the basis for sound project development, evaluate existing programs and provide the data required to make compliance judgments and support US policy, decision-makers and negotiating teams.  Technology developments and system improvement projects are conducted to ensure that capabilities for monitoring systems are available when required.  \n\nPrimary emphasis is on improved sensor capabilities and improved detection and assessment capabilities against a wide range of threat origins.  \n\nThe program includes development of equipment and procedures for data exchanges, inspections and monitoring capability and analysis.  The technologies and procedures developed in the arms control technology program provide an invaluable source of information on equipment and procedures that is extensively used by US and international agencies.  This project also supports the warfighting capability area of combating Weapons of Mass Destruction (WMD)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.391"
                },
                "CurrentYear": {
                    "val": "7.922"
                },
                "BudgetYearOne": {
                    "val": "7.806"
                },
                "BudgetYearOneBase": {
                    "val": "7.806"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.160"
                },
                "CurrentYear": {
                    "val": "7.922"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.231"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-7.806"
                },
                "BudgetYearOneBase": {
                    "val": "-7.806"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.231"
                                },
                                "BudgetYearOne": {
                                    "val": "-7.806"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.806"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SE1"
                    },
                    "ProjectTitle": {
                        "val": "NACT SENSOR ENGINEERING"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.160"
                        },
                        "CurrentYear": {
                            "val": "7.922"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides Research, Development, Testing & Evaluation (RDTE) to meet technology requirements in support of implementation, compliance, monitoring and inspection for existing and emerging nuclear arms control activities and dual use technology for missile defense integration activities.  The project addresses requirements validated by the Office of the Under Secretary of Defense, Acquisition, Technology & Logistics (OUSD AT&L).  This project conforms to the administration's research and development priorities as related to Weapons of Mass Destruction (WMD) arms control and disarmament.  Technical assessments are made to provide the basis for sound project development, evaluate existing programs and provide the data required to make compliance judgments and support US policy, decision-makers and negotiating teams.  Technology developments and system improvement projects are conducted to ensure that capabilities for monitoring systems are available when required.  \n\nPrimary emphasis is on improved sensor capabilities and improved detection and assessment capabilities against a wide range of threat origins.  \n\nThe program includes development of equipment and procedures for data exchanges, inspections and monitoring capability and analysis.  The technologies and procedures developed in the arms control technology program provide an invaluable source of information on equipment and procedures that is extensively used by US and international agencies.  This project also supports the warfighting capability area of combating Weapons of Mass Destruction (WMD)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Support OSD Treaty Manager"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.566"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Planned \/ Supported joint U.S. \/ PTS technology conferences \/ exchanges (i.e. Workshop on Medical Isotope Production (WOSMIP) III, PTS \/ U.S. Technology Working Group 4th Annual Conference; PTS PKI \/ Command & Control experiment; U.S. \/ Great Britain technology \/ operations interchange meetings). Provided technical and operational support for the PTS\/U.S. sponsored monitoring technology developments, standard reliability and operations \/maintenance profile conference. Prepared \/ Supported IMS technology DASD (TRAC) overview briefings in preparation for interagency meetings."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.667"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plan \/ Support joint U.S. \/ PTS technology conferences \/ exchanges (i.e. Workshop on Medical Isotope Production (WOSMIP) IV, PTS \/ U.S. Technology Working Group 5th Annual Conference; U.S. \/ Great Britain technology \/ operations interchange meetings). WOSMIP focus is designed to better understand the processes involved with isotope production and to more capably account for backgrounds observed in International Monitoring Systems (IMS) stations. Provide technical and operational support for the PTS\/U.S. sponsored monitoring technology developments, standard reliability and operations \/ maintenance profile conference. Prepare \/ Support DASD (TRAC) IMS technology overview briefings in preparation for interagency meetings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototype Sensor Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.365"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Work continued on deploying the Transportable Xenon Laboratory (TXL) to foreign destinations with specific focus on improvements in satellite data communication capabilities and ruggedizing the Swedish Automated Unit for Noble Gas Analysis (SAUNA) systems installation. Operations and maintenance perform in advance of the TXL\/SAUNA foreign deployment will be performed to establish an operations baseline for the SAUNA and provide additional opportunity to diagnose and resolve any remaining operational concerns with TXL and\/or the installed SAUNA. The mobile noble gas labs have been deployed to Japan and Indonesia and are operational and delivering data to the customer. Continued to deploy next generation infrasound sensors for dynamic operational performance testing at the UTTR ordinance disposal site.  Continued testing of deployed next generation sensors to the PTS Conrad Site for dynamic performance measurements against the CTBT performance and acceptance requirements. Initial in situ array calibration procedure tested at 5 IMS sites and at the PTS Conrad Observatory test facility. Ruggedized systems are under development. \nDiagnostic systems for sensor and wind filter are under development. \nFirst stage calibration chamber fabrication is complete; testing to begin.\nAnalogue sensor technology transfer license has been issued. Independent testing is underway."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue sensor and array calibration development efforts.   Sensor stability and uniformity is required for optimal array performance. Techniques, facilities, and equipment to calibrate sensors and arrays under laboratory conditions and in the field are being developed. Higher-performance, more stable and uniform sensors are being developed. Continue station calibration & metrology planning. The array calibration will focus on in-situ array calibration systems and array performance measurements. Plan and carry-out signal capture & identification efforts to include signal clutter source studies, noise source studies, participate in exercises to collect field source data, develop field clutter rejection methodology \/ algorithms, and False Alarm Rejection Methodology and continue analysis. Initiate planning to evaluate options for performing an experiment to evaluate measurement performance of IMS stations from a planned underground or under water detonation. The explosion will be non-nuclear in nature and will be configured to include the release of radioactive noble gasses in concentrations acceptable to environmental regulations and of a nature suitable to challenge IMS measurement technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radionuclide Particulate \/ Xenon Gas Sensor System Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.347"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Deployed and field tested the field portable Xenon gas system within the EU project for Global Xenon background characterization.  Continued acceptance \/ operational performance testing and deployment of the next generation particulate system's detector \/ cryogenic cooler replacement system.  Continued developing single-isotope Xenon calibration standards production methods (i.e. Xenon detection system calibration standards). Planned and developed methods for measurements to better determine the world-wide concentration of radioxenon. These measurements are necessary to design and test a Xenon spectrum categorization scheme that is applicable to U.S. and other monitoring stations. The measurements will better enable IMS stations to remove the influence of background Xenon concentrations not associated with nuclear explosions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.465"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Xenon gas systems research. Study and evaluate Xenon backgrounds & transport - Xenon categorization, data analysis & interpretation & Xenon transport from underground\/underwater. Implement a study of past detection schemes and compare current and future detections options with a focus on best pathways to improve sensitivity, selectivity (radon daughters vs. fission products), and reliability. Continue efforts to improve data quality and confidence in measurement data through development of high accuracy SAUNA gas calibration procedures and improvements to RASA filter splitting & handling."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Management Systems Enhancements"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development of Infrasound propagation models to improve detection, identification, and location of sources of interest. Conduct field experiments to collect and provide data to constrain and refine the models. Reviewed and analyzed data collected from Sayarim experiments and test at the Utah Test and Training Range (UTTR).  Information from these experiments will be evaluated by the models to improve and provide a fuller accounting of phenomenology.  Developed Portable Infrasound Calibrator."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.525"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Infrasound propagation models development for purposes to improve detection, identification, and location of sources of interest. Continue field experiments to collect data to constrain and refine models. To make contact with the data, models will include fine-scale atmospheric conditions, topography, 3D winds and effects of non-linear propagation. Plan development of a portable \/ rapid deployable infrasound array and standard sound source for calibrating Infrasound stations \/ arrays. Continue extensive testing and validation of propagation models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continue Research & Development support system"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.896"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued radionuclide technology development projects focused on: improving International Monitoring System (IMS) Xenon samplers' detection systems, improved information on the background levels of fission products in the atmosphere, and technology to decrease the effluent from medical isotope production plants that cause large backgrounds of radionuclides for IMS samplers. Developed and tested RASA SIU for immediate commercialization and use. Continued waveform (infrasound \/ seismic) development program focused on infrasound sensor \/ station calibration and metrology, on infrasound sensor development and on data collection and analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Aging of the original RASA components, along with uptime\/sustainment challenges (e.g., cooler failures) indicates the necessity to upgrade subsystems in the RASA. Increasing manufacturer obsolescence of many components has created a challenge to operations. Complete RASA drawing package. Conduct RASA performance and design study. Based on those results, plans are to collect and prioritize requirements from Station Operators and design-build-test highest priority upgrades. Focus areas are nuclear detector (including cooling); filtration medium and sample head; and electronic controls. Continue support for the sustainment of Fielded IMS Systems. Analyze alternate cooling options for RASA particulate systems, focus on development of system component upgrades, and maintain software updates\/sustainment activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continue U.S. IMS Sensor Event Signal Identification Technique Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.296"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Work continued on deploying the Transportable Xenon Laboratory (TXL) to foreign destinations with specific focus on improvements in satellite data communication capabilities and ruggedizing the Swedish Automated Unit for Noble Gas Analysis (SAUNA) systems installation. The mobile noble gas labs have been deployed to Japan and Indonesia and are operational and delivering data to the customer. Deploy next generation digital infrasound sensor at UTTR (data collection; source location; event analysis; performance, validation, reliability testing). Continue clutter, false alarms and noise mitigation analysis (US Array studies; catalogue persistent sources; noise studies; wind noise physics; false alarm rejection). Continue joint U.S.\/CEA (DASE) collaboration (test against US and European network)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.360"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue operating the TXL and SAUNA systems in advance of deployment. Operations and maintenance performed in advance of the TXL\/SAUNA foreign deployment will establish an operations baseline for the SAUNA and provide additional opportunity to diagnose and resolve any remaining operational concerns. The mobile noble gas labs deployed to Japan and Indonesia and are operational and will continue to deliver data to the customer. Continue evaluating the memory effect that occur when highly polarizable Xenon atoms attach to surfaces used in beta-gamma detection systems, or diffuse into the plastic cell wall. Continue infrasound event signal clutter, false alarms and noise mitigation analysis (U.S. Array studies; catalogue persistent sources; noise studies; wind noise physics; false alarm rejection). Large numbers of spurious detections and high noise levels at IMS stations can make data unusable. Noise reduction technologies, both algorithmic and mechanical, are being developed. Algorithms for the reduction of false positives will be investigated. Metrics for data usability will be developed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continue \"On-Location\" Infrasound Event Calibration Research"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued calibration and metrology research and development (R&D) at established engineering and development test centers (EDTC) - Operations & Maintenance at Sandia National Laboratory (SNL) O&M test bed; Research & Development at Pennsylvania State University (PSU) R&D test bed; U.S. IMS state-of-health (SOH) performance and data quality metrics at the University of Alaska-Fairbanks (UAF), Pennsylvania State University (PSU), and University of Mississippi (UM).  Evaluated and tested U.S. developed infrasound array for possible future deployment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.605"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Sayarim experiments and test at the Utah Test and Training Range (UTTR).  Data will be collected and analyzed. \nModels will continue to be improved and provide a fuller accounting of phenomenology.  Continue planning and developing the EDTC.  The test beds will be utilized for research, testing and evaluations relevant to station shut downs; configuration changes; and invasive procedures. These test beds will allow for evaluation of R&D primary array developments of new technologies and their associated field testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continue U.S. IMS Radionuclide Detection & Measurement Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.797"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued advanced Xenon separation modeling and simulation methods development for next generation Xenon detection and monitoring systems (i.e. life cycle and obsolescence management planning).  The mobile noble gas labs have been deployed to Japan and Indonesia and are operational and delivering data to the customer. Continued U.S. IMS Radionuclide Laboratory (RL-16), laboratory gas analysis system performance and validation testing for use as a secondary, laboratory-based radioxenon spectrometer. Continued evaluating detector performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.850"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Xenon gas systems research. Evaluate gas yield and detection limits. PTS requirements indicate that the RL-16 gas system requires additional capability to meet the requirements.  Develop test methods to increase yield and to improve detection efficiency. The processing train will be updated to improve transfer efficiency and to reduce dead volumes. To assure the RL-16 gas system is making a high precision measurement, the samples will be sent to a certified laboratory for part of the calibration.  Current IMS operations of SAUNA radioxenon detection systems indicate the need for more robust and repeatable calibrations, ability to replace aging radiation detectors with more reliable, more flexible units, and a real-time state of health monitoring system to assist in improving data availability. Directed research will allow for timely and effective solutions to address these lessons learned and improve operational quality. Development of a robust, high precision method to calibrate the nuclear detectors effectively will be pursued. Task will develop the calibration methods to obtain the absolute calibration of the nuclear detector."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SMDC Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.366"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.566"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.667"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development Program"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "UM, MS, PNNL, WA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "19.039"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.701"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.125"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "28.865"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SMDC Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SMDC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AL, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.762"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.396"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.525"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.102"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.497"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.605"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}