{
    "id": "6e995351c2e44d2a58dfce6bacace2bd302dabee",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA7_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0203726A"
        },
        "ProgramElementTitle": {
            "val": "Adv Field Artillery Tactical Data System"
        },
        "R1LineItemNumber": {
            "val": "161"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "28.649"
            },
            "CurrentYear": {
                "val": "32.556"
            },
            "BudgetYearOne": {
                "val": "30.940"
            },
            "BudgetYearOneBase": {
                "val": "30.940"
            },
            "BudgetYearTwo": {
                "val": "35.314"
            },
            "BudgetYearThree": {
                "val": "32.365"
            },
            "BudgetYearFour": {
                "val": "30.236"
            },
            "BudgetYearFive": {
                "val": "30.075"
            }
        },
        "ProgramElementNote": {
            "val": "The decrease in FY 2012 funding of $0.851 million is to fund the Army's higher priority items in FY2012.\n\nThe increase in FY 2014 funding of $2.289 million is to fund emerging requirements for Advanced Field Artillery Tactical Data System (AFATDS) Capability Development Document (CDD) for the Increment 2, including the Common Operating Environment (COE) architecture.  The program office is expecting to start the Increment 2 development in 4Q FY2014.   The decrease in FY 2014 funding of $4.363 million is to fund the Army's higher priority items in FY2014."
        },
        "ProgramElementMissionDescription": {
            "val": "There are two developmental efforts that are being executed concurrently. They are Advanced Field Artillery Tactical Data System (AFATDS) Increment 1 and Joint Automated Deep Operations Coordination System (JADOCS).  In FY14, the program office will initiate the execution of the AFATDS Increment 2 requirements. \n\nAFATDS provides the Army, Navy, and Marine Corps automated fire support command, control and communications and functions as the land component’s automated Fire Support Command and Control (FSC2) system.  AFATDS is used in the Fires Warfighting Function to plan, execute, and deliver lethal and non-lethal effects within the overall Mission Command and Control (MC2) enterprise. Additionally, the system interoperates and integrates with over 80 different battlefield systems, to include Navy and Air Force command and control weapon systems; and the German, French, Turkish, and Italian fire support systems.  \n\nAFATDS fuses the essential situational awareness (SA) data, intelligence information and targeting data, in near real time, in order to effectively manage target selection and target engagement in accordance with the Maneuver Commanders guidance and priorities.  Additionally, the system will pair targets to weapons to provide optimum use of fire support assets and timely execution of fire missions.  Also, the system automates the planning, coordinating, and controlling of all fire support assets (field artillery, mortars, close air support, naval gunfire, attack helicopters, offensive electronic warfare, fire support meteorological systems, forward observers, and fire support radars).  Furthermore, the system will automatically implement detailed commander’s guidance in the automation of operational planning, movement control, targeting, target value analysis, and fire support planning. Currently, the system interoperates with the other Army mission command systems, and is being used in operations in Afghanistan. The program office is currently fielding non-developmental, rugged common hardware, running the Windows Operating System. The total force will be fielded a Windows based platform by fiscal year 2013.  Currently, AFATDS Version 6.8 and 6.8.X are being developed and expect to achieve Full Materiel Releases (FMR) in 2Q FY2013 and 2Q FY2015.  With the completion of AFATDS Version 6.8.X, the program office will complete the AFATDS Increment 1 requirements and will start the Increment 2 development in 4Q FY2014.  \n\nJADOCS is a Joint, Interagency, Intergovernmental and Multinational (JIIM) Targeting, Mission Management, and Common Operational Picture (COP) Windows-based software suite which functions as a complementary system to the Advanced Field Artillery Tactical Data System (AFATDS). JADOCS provides integration and synergy between multiple Command & Control (C2) systems of the uniformed services, and joint and combined elements involved in the targeting process and performs coordination and calculates collateral damage. JADOCS Mission Managers support this coordination amongst Warfighter functional areas to rapidly execute critical missions. JADOCS enables coordination and de-confliction of conventional and asymmetric war-fighting missions. JADOCS is fielded to Air Force, Navy, Marine Corps, and Army units involved in the targeting process at Division, Corps and Echelons Above Corps. JADOCS provides the Combatant Commands with the capability to plan and direct theater counter-fire and precision strike operations through the real time synchronization of US and Coalition assets. The application provides the Warfighter with a combination of tools, services and Mission Managers for rapid \"system of systems\" integration, visualization, coordination and deconfliction of critical mission information. It not only enhances Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems in the areas of strike planning but also in SA, joint and combined interoperability and force transition in war."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "29.500"
                },
                "CurrentYear": {
                    "val": "32.556"
                },
                "BudgetYearOne": {
                    "val": "33.014"
                },
                "BudgetYearOneBase": {
                    "val": "33.014"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "28.649"
                },
                "CurrentYear": {
                    "val": "32.556"
                },
                "BudgetYearOne": {
                    "val": "30.940"
                },
                "BudgetYearOneBase": {
                    "val": "30.940"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.851"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.074"
                },
                "BudgetYearOneBase": {
                    "val": "-2.074"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.851"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.289"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.289"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 3"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.363"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.363"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "322"
                    },
                    "ProjectTitle": {
                        "val": "Adv Field Artillery Tactical Data System(AFA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.511"
                        },
                        "CurrentYear": {
                            "val": "23.961"
                        },
                        "BudgetYearOne": {
                            "val": "12.237"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.237"
                        },
                        "BudgetYearTwo": {
                            "val": "5.425"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Advanced Field Artillery Tactical Data System (AFATDS) Increment 2 project code (DU5)  was created in this budget cycle and has been added to the program element 0203726A. Funds were transferred from AFATDS (project code 322)."
                        },
                        "ProjectMissionDescription": {
                            "val": "There are two developmental efforts that are being executed concurrently on this budget item. They are Advanced Field Artillery Tactical Data System (AFATDS) and Global Positioning System (GPS) based Precision Guided Munitions (PGMs).  \n\nAFATDS provides the Army, Navy, and Marine Corps automated fire support command, control and communications and functions as the land component’s automated Fire Support Command and Control (FSC2) system.  AFATDS is used in the Fires Warfighting Function to plan, execute, and deliver lethal and non-lethal effects within the overall Mission Command and Control (MC2) enterprise. Additionally, the system interoperates and integrates with over 80 different battlefield systems, to include Navy and Air Force command and control weapon systems; and the German, French, Turkish, and Italian fire support systems.  \n\nAFATDS fuses the essential situational awareness (SA) data, intelligence information and targeting data, in near real time, in order to effectively manage target selection and target engagement in accordance with the Maneuver Commanders guidance and priorities.  Additionally, the system will pair targets to weapons to provide optimum use of fire support assets and timely execution of fire missions.  Also, the system automates the planning, coordinating, and controlling of all fire support assets (field artillery, mortars, close air support, naval gunfire, attack helicopters, offensive electronic warfare, fire support meteorological systems, forward observers, and fire support radars).  Furthermore, the system will automatically implement detailed commander's guidance in the automation of operational planning, movement control, targeting, target value analysis, and fire support planning. Currently, the system interoperates with the other Army mission command systems, and is being used in operations in Afghanistan. The program office is currently fielding non-developmental, rugged common hardware, running the Windows Operating System. The total force will be fielded a Windows based platform by fiscal year 2013.  Currently, AFATDS Version 6.8 and 6.8.X are being developed and expect to achieve Full Materiel Releases (FMR) in 2Q FY2013 and 2Q FY2015.  With the completion of AFATDS Version 6.8.X, the program office will complete the AFATDS Increment 1 requirements and will start the Increment 2 development in 4Q FY2014.  \n\nGPS-based PGMs require pre-launch loading of sufficient GPS Satellite related data down at the Weapon Platform level to enable delivery of Precision Capable Fires.  This hot start capability allows for rapid post-launch time-to-first-fix of GPS signal and maximum utilization of PGM maneuver authority to ensure required target engagement performance.  This is especially critical for short flight times and steer-early solutions such as Mortar and Cannon based PGMs.  Local GPS Satellite visibility challenges due to vertical terrain\/complex environment issues during normal combat operations can prohibit Precision Capable Fires when using GPS Satellite data generated exclusively at the Firing Weapon Platform.   A system-of-systems Network Assisted GPS capability will be developed, integrated, and validated to overcome local GPS Satellite masking problems through the sharing of sufficient timely required GPS Satellite data via Wide-Area Network (WAN) and Local-Area Network (LAN) based materiel solutions that effectively and efficiently leverage mature Technologies and taxpayer investments of existing acquisition programs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Support Costs for AFATDS software development"
                                    },
                                    "Description": {
                                        "val": "Provide program support for AFATDS software development efforts for Versions 6.8 and 6.8.X"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.905"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Program support for AFATDS Increment 1 software development efforts"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Program support for AFATDS Increment 1 software development efforts"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.715"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.715"
                                            },
                                            "Text": {
                                                "val": "Program support for AFATDS Increment 1 software development efforts"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AFATDS software development efforts cost"
                                    },
                                    "Description": {
                                        "val": "Development of AFATDS Increment 1 requirements - including Version 6.8 and 6.8.X"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.956"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete development of AFATDS Version 6.8 and initiate development of AFATDS Version of 6.8.X"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.167"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of AFATDS Version 6.8.X"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.907"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.907"
                                            },
                                            "Text": {
                                                "val": "Complete development of AFATDS Version 6.8.X"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Assisted GPS for Precision Fires"
                                    },
                                    "Description": {
                                        "val": "Define system architecture and standardize tactical GPS Satellite data exchange solutions. Initiate WAN and LAN based system-of-systems Network Assisted GPS capability for PGMs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of Network Assisted GPS for Precision Fires."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continue development of Network Assisted GPS for Precision Fires."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Testing"
                                    },
                                    "Description": {
                                        "val": "Conduct and support test activities for AFATDS development of Increment 1 requirements"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct and support test activities for AFATDS Increment 1 software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.875"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct and support test activities for AFATDS Increment 1 software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.615"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.615"
                                            },
                                            "Text": {
                                                "val": "Conduct and support test activities for AFATDS Increment 1 software."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B28600"
                                    },
                                    "Title": {
                                        "val": "ADV FA TAC DATA SYS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.119"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "6.119"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B28620"
                                    },
                                    "Title": {
                                        "val": "MOD OF IN-SVC EQUIP, AFATDS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "34.556"
                                        },
                                        "CurrentYear": {
                                            "val": "41.816"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.702"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.702"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.310"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.206"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "114.590"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "AFATDS began fielding in FY1996, with the original AFATDS Version 96.  It has been updated with subsequent releases reflecting the Spiral development strategy of the program.  Currently, AFATDS Version 6.8 and 6.8.X are being developed and expect to achieve Full Materiel Releases (FMR) in 2Q FY2013 and 2Q FY2015, respectively.  With the completion of AFATDS Version 6.8.X, AFATDS Increment 1 will have achieved Full Operational Capability (FOC)."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management for Increment 1 Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "BA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Mission Command (MC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.274"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.825"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.829"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.560"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.560"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.350"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.838"
                                                    },
                                                    "TargetValue": {
                                                        "val": "18.838"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development of AFATDS Increment 1 Requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon Systems Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Wayne, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "311.020"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "311.020"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development of AFATDS Version 6.8"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon Systems Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Wayne, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "33.134"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.342"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "38.476"
                                                    },
                                                    "TargetValue": {
                                                        "val": "310.361"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development of AFATDS Version 6.8.X"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon Systems Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Wayne, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.614"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "15.167"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.907"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.907"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.500"
                                                    },
                                                    "TotalCost": {
                                                        "val": "32.188"
                                                    },
                                                    "TargetValue": {
                                                        "val": "33.188"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Network Assisted GPS for Precision Fires Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Joint Battle Command Platform, PM Mission Command, and various Army agencies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Information Assurance and Engineering Support  for AFATDS Increment 1 requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eatontown, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.340"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.080"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.420"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.375"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Information Assurance and Engineering Support  for AFATDS Increment 1 requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.090"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.155"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.155"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.160"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.405"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.405"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support for AFATDS Increment 1 requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Titan and various contractors"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.418"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.745"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.163"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.055"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test Support for AFATDS Increment 1 requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Engility and various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.730"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.575"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.350"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.025"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.680"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.030"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Limited User Test\/Government Confidence Demo for AFATDS Increment I and II requirements"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "BA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test & Evaluation Command (ATEC)\/Fires Test Directorate (FTD)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.102"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.175"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.265"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.265"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.390"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.232"
                                                    },
                                                    "TargetValue": {
                                                        "val": "17.232"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Materiel Release V6.8"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding V6.8"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development and Testing V6.8.X"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Materiel Release V6.8.X"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding V6.8.X"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development \/Testing Network Assisted GPS for Precision Fires"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Materiel Release Network Assisted GPS for Precision Fires"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding Network Assisted GPS for Precision Fires"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DU5"
                    },
                    "ProjectTitle": {
                        "val": "AFATDS Increment II"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "12.140"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.140"
                        },
                        "BudgetYearTwo": {
                            "val": "16.910"
                        },
                        "BudgetYearThree": {
                            "val": "21.104"
                        },
                        "BudgetYearFour": {
                            "val": "20.853"
                        },
                        "BudgetYearFive": {
                            "val": "24.148"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Advanced Field Artillery Tactical Data System (AFATDS) Increment 2 project code (DU5)  was created in this budget cycle and has been added to the program element 0203726A. Funds were transferred from AFATDS (project code 322).  Will start AFATDS Increment 2 development in FY2014."
                        },
                        "ProjectMissionDescription": {
                            "val": "AFATDS Increment 2 will continue as the automated C2 system for the Fires War Fighting Function.  Increment 2 will permit the management and targetability of the collective and coordinated target acquisition data, effective selection of munitions-target pairing from indirect fire weapons (land and sea based), as well as fixed and rotary wing aircraft against targets located throughout an area of operations.  AFATDS Increment 2 will be used to actively plan offensive information operations and exploit electronic attack weapon systems through the use of planning tools for effects and the status and readiness of the systems that can best support the commander's intent.  AFATDS Increment 2, through a network of Fires assets, can assist the commander to accomplish these tasks using it at the operational and tactical levels of war from the Soldier, Sailor, and Marine fighting the tactical fight to the operational staff preparing for the future fight.  AFATDS Increment 2 will provide the supported maneuver commander the capability to plan, coordinate, rehearse, and execute integrated networked fires.  Networked fires will include lethal and non-lethal effects producing weapon platforms and the empowerment of knowing, within seconds, the lethal status and availability of the fires platforms within the commander's area of influence, which include air, sea, and land-based weapon platforms.  Net-centricity will enable the Brigade Combat Team (BCT) commander to view targets that adjacent BCTs have encountered or engaged in their area of operations.  This capability enables the commander to:  exploit under-tasked air support assets, view\/task weapons platforms based on coordinated command-supported relationships, and search target data files and repositories.  Using the web-based tools, the BCT commander can access higher command centers via search wizards over Warfighter Information Network Tactical (WIN-T) portals and internet gateways to the Global Information Grid (GIG). There is an operational need to provide Fires data to a central database repository within the BCT.  That repository will be accessible through network addressing or web-enabled search wizards to locate information relative to a certain maneuver element, within a BCT or adjacent BCTs, thus supporting unified battle command.  AFATDS Increment 2 will provide three distinct applications that interface via Local Area Network\/Tactical Communications Protocol\/Internet Protocol\/User Datagram Protocol(LAN\/TCP\/IP\/UDP) addressing with a common core database and core system functions\/management that resides on a remote battle command server.  The three applications–Fire Support, Fire Control, and Fire Direction–will support role-based functionality and provide a less complicated AFATDS package to the Warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Support Costs for AFATDS software development"
                                    },
                                    "Description": {
                                        "val": "Provide program support for AFATDS software development efforts for Version 6.9"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.720"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.720"
                                            },
                                            "Text": {
                                                "val": "Program support for AFATDS Increment 2 software development efforts"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AFATDS software development efforts cost"
                                    },
                                    "Description": {
                                        "val": "Development of AFATDS Increment 2 requirements - Version 6.9"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.100"
                                            },
                                            "Text": {
                                                "val": "Initiate development of AFATDS Version of 6.9"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Testing"
                                    },
                                    "Description": {
                                        "val": "Conduct and support test activities for AFATDS development of Increment 2 requirements"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.320"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.320"
                                            },
                                            "Text": {
                                                "val": "Conduct and support test activities for AFATDS development of Version 6.9"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Increment 2 Procurement funding line has not been identified."
                        },
                        "AcquisitionStrategy": {
                            "val": "AFATDS began fielding in FY1996, with the original AFATDS Version 96. It has been updated with subsequent releases reflecting the Spiral development strategy of the program. With the completion of AFATDS Version 6.8.X in 2Q FY2015, AFATDS Increment 1 will have achieved Full Operational Capability (FOC).\n\nThe Joint Requirements Oversight Council (JROC) issued a memorandum in June 2011 approving the Capability Development Document (CDD) for AFATDS Increment 2. Additionally in the memorandum, the JROC validated the Key Performance Parameters, assigned oversight authority to the Fires Center of Excellences Fire Support Command and Control Tactical Software Governance Board, and set a funding ceiling. These actions support the use of the emerging DoD 5000 systems acquisition approach for Information Technology (IT) (IT Box model). AFATDS Increment 2 development will follow the IT Box Model for systems acquisition.  AFATDS Increment 2 will be developed using an incremental approach that will employ fielded and emerging digital platforms, communications systems technology and architecture, and spaced-based systems, to virtually interconnect via web-enabled networks to exploit the capabilities of Fires platforms and precision munitions.  Increment 2 will provide a surface-to-surface Joint Fires asset manager building on the existing capabilities and functions of the current fielded AFATDS. It will provide additional targeting and decision aids, Situational Awareness (SA), Battlefield Visualization, Information Operations (IO) management aids, and control\/coordination and synchronization capabilities for all types of Fires assets to include electronic attack. The AFATDS Increment 2, unlike the current increment of AFATDS, will be based on a net-centric application with open modular service oriented architecture and a decentralized processing approach, which will make it effective, flexible, survivable, mobile, user friendly, and simple to maintain. This increment will also be developed to enable the establishment of detached or decentralized work platforms and applications when network services or connections are not available.  Using the current AFATDS Increment 1 software and functionality as a basis, AFATDS Increment 2 will provide three distinct software applications – Fire Direction, Fire Control, and Fire Support -  that will provide a less complicated AFATDS package to the Warfighter that will simplify training and support ease of use.  The fire direction application will provide the battery and platoon FDC's the functionality to perform mission processing and reporting.  The fire control application will permit the user to analyze the systems in his command supported relationship and supporting units. The Fire Support application will be used for coordination of fires assets within his area of influence primarily at Fire Support Elements (FSEs) and Fire Support Coordination Cells (FSCCs.).  AFATDS Increment 2 capabilities will be developed over three distinct software versions - Versions 6.9, 7.0 and 7.1.  It is planned to award AFATDS Version 6.9 via full and open competition.  The acquisition strategy for the award of the follow on versions of AFATDS software will be determined after the award of the Version 6.9 software Preliminary Design Review.\n\nAFATDS v6.9 will modernize and re-architect the AFATDS software to align with the requirements of the Inc 2 CDD."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management for Increment 2 Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "BA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Mission Command (MC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.565"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.565"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development of AFATDS Version 6.9"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Information Assurance and Engineering Support for AFATDS Version 6.9"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.155"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.155"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support for AFATDS Version 6.9"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.875"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.875"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Limited User Test\/Government Confidence Demo for AFATDS Version 6.9"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "BA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test & Evaluation Command (ATEC)\/Fires Test Directorate (FTD)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.445"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.445"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Materiel Development Decision (MDD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Build Decision (Milestone)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Implementation & Deployment for V.6.9"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding V.6.9"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F19"
                    },
                    "ProjectTitle": {
                        "val": "JADOCS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.138"
                        },
                        "CurrentYear": {
                            "val": "8.595"
                        },
                        "BudgetYearOne": {
                            "val": "6.563"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.563"
                        },
                        "BudgetYearTwo": {
                            "val": "12.979"
                        },
                        "BudgetYearThree": {
                            "val": "11.261"
                        },
                        "BudgetYearFour": {
                            "val": "9.383"
                        },
                        "BudgetYearFive": {
                            "val": "5.927"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "JADOCS software provides joint and organic fire support management, and Common Operational Picture (COP) capabilities. JADOCS complies with DoD and previously identified JFCOM guidance, and complements the Mission Command architecture with joint and collaborative capabilities that can be employed and tailored based on unit mission and operational situation.  JADOCS software supports integration between multiple Joint Command and Control (C2) systems of the uniformed Services involved in the targeting process at United States Air Force (USAF) Air Operations Centers (AOCs), United States Navy (USN) Fleet Maritime Operations Centers (MOCs), United States Marine Corps (USMC) Combat Operations Centers (COCs), staff sections at the regional Combatant Commands (CCMDs), United States Special Operations Command (USSOCOM) and Army Battlefield Coordination Detachments (BCDs) and Army Service Component Command (ASCC) at Division and higher."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JADOCS Software Development Efforts costs."
                                    },
                                    "Description": {
                                        "val": "Complete development version 1.0.5.2 (Phase 1 and 2), Initiate development of version 1.0.5.3 (COE version 2)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.037"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported operational requirements (maintenance of existing capabilities)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.810"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete support of operational requirements (maintenance of existing capability) and fielding of version 1.0.5.2 (Phase 1) and complete support of operational requirements (maintenance of existing capability) and fielding of version 1.0.5.2 (Phase 2)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.148"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.148"
                                            },
                                            "Text": {
                                                "val": "Modernize the JADOCS software and develop JADOCS widgets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Support Costs for JADOCS Software Development Efforts"
                                    },
                                    "Description": {
                                        "val": "Program support for JADOCS software development efforts for version 1.0.5.2 (Phase 1 and 2), and version 1.0.5.3 Common Operating Environment (COE) version 2."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported program costs for JADOCS software development efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.065"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues the program support for JADOCS software development efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.140"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.140"
                                            },
                                            "Text": {
                                                "val": "Future program support for JADOCS software development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Testing"
                                    },
                                    "Description": {
                                        "val": "Conduct and Support Army and Joint Testing Activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.110"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted and supported Army and Joint testing activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.420"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued support of Army and Joint testing activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.275"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.275"
                                            },
                                            "Text": {
                                                "val": "Future support of Army and Joint testing activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Management Services and Support."
                                    },
                                    "Description": {
                                        "val": "Funds the System Engineering and Technical Assistance received by Liason Officers and JADOCS training managers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.931"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funded program support for JADOCS training activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues program support for JADOCS training activities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "JADOCS began as a Defense Advanced Research Projects Agency technology demonstration, and has evolved through a series of Army-led Joint Advanced Concept Technology Demonstrations (ACTDs), culminating in a joint and combined deployed operational capability. The Vice Chief of Staff of the Army approved JADOCS for acquisition program status under the Capabilities Development for Rapid  Transition (CDRT) process. The approved JADOCS Capability Production Document (CPD) dated 16 April 2012, documents the current JADOCS threshold capabilities that are in the field today. As the lead agency for managing JADOCS capabilities within the Department of Defense, the Fires Center of Excellence, tailored the JADOCS CPD to incorporate Field Artillery tasks not included in the currently fielded version (v 1.0.5.1) of the software. JADOCS retirement will occur when system capabilities are individually or collectively incorporated into Army, Service, or Joint programs or are no longer needed as determined by its multi-Service users. JADOCS Increment 1 will be managed as an Information Technology (IT) program under the IT Box Construct with periodic software updates. JADOCS Increment 1 will support any software refinements \/ modifications to enable enhancements identified by the Warfighter. Future increments of JADOCS will address operational lessons learned, changes in the Joint Operation Centers (JOCs) and the Joint Information Center (JIC), integrated architectures and optimizing the use of the Global Information Grid (GIG) with web based applications.\n\nThe JADOCS program strategy is to capture and sustain JADOCS capabilities IAW the approved JADOCS CPD dated 16 April 2012. All JADOCS Targeting and Fires capabilities required by the US Army and US Marine Corps, not already in AFATDS, will be captured in the AFATDS Increment 1 product, along with any appropriate interoperability, architecture modernization and web application modernizations that may be needed. All other capabilities will be captured in other Army, Service or Joint programs or otherwise sustained, updated, and enhanced as specified by the Warfighter in future increments of JADOCS (until no longer needed as determined by its multi-Service users). An objective of the Increment 1 effort will be to modernize the JADOCS software and develop JADOCS widgets and provide inter- widget communications in accordance with TCM Fires Cells requirements and the requirements of COE. These widgets will support the Warfighting Function (WFF) for the sharing of data and collaboration between unit Commanders and their Staff sections.\n\nA draft JADOCS Acquisition Decision Memorandum (ADM) has been prepared and is currently under review by the HQDA staff.  This ADM will be presented to the Army Acquisition Executive (AAE) for review and signature.  It is expected that the AAE will sign the ADM in April 2013.  Under the provisions of the ADM, JADOCS will be established as a formal Army Acquisition Program with milestone decision authority (MDA) delegated to the Program Executive Office, Command, Control and Communications-Tactical (PEO C3T) and entry into the acquisition life cycle at Milestone C.  It is projected that the Milestone C Decision Review will be held in 2QFY14."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Business\/Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Chenega Federal Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.323"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.931"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development & Test"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oberon Associates INC."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Manassas, Virginia"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.995"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.037"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.810"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development & Test"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.148"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.148"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.148"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management - Government"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Mission Command (MC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.695"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.065"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.140"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.140"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Army and Joint Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Joint Service Testing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.587"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.110"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.420"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Acquisition Decision Memorandum (ADM) signed by Army Acquisition Executive"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Development and Testing - V1.0.5.2 (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MIDB Tech Testing - V1.0.5.2 (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Government Confidence Demonstration (GCD) V1.0.5.2 (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Final Integration Test - V1.0.5.2 (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Army Interoperability Certification - V1.0.5.2 (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Materiel Release - V1.0.5.2, (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding - V1.0.5.2, (CS 11-12)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Draft for Comment RFP -  JADOCS Maintenance and Widgets."
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Development and Testing - JADOCS Maintenance and Widgets."
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Materiel Release - JADOCS Maintenance and Widgets."
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding - JADOCS Maintenance and Widgets."
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}