{
    "id": "710c5315349f33592069cf31ada37fcc34591732",
    "meta": {
        "filename": "dod-2014_RDTE_2014_SOCOM_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.zzz_unzipped_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160402BB"
        },
        "ProgramElementTitle": {
            "val": "Special Operations Advanced Technology Development"
        },
        "R1LineItemNumber": {
            "val": "72"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "974.173"
            },
            "PriorYear": {
                "val": "31.690"
            },
            "CurrentYear": {
                "val": "45.317"
            },
            "BudgetYearOne": {
                "val": "46.809"
            },
            "BudgetYearOneBase": {
                "val": "46.809"
            },
            "BudgetYearTwo": {
                "val": "47.630"
            },
            "BudgetYearThree": {
                "val": "48.192"
            },
            "BudgetYearFour": {
                "val": "49.223"
            },
            "BudgetYearFive": {
                "val": "50.252"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY 2014 Special Operations (SO) Advanced Technology Development represents the approved consolidation of  SO Advanced Technology Development, Program Element (PE) 1160402BB; SOF Aviation Engineering Analysis, PE 1160422BB; and SOF Information and Broadcast Systems Advanced Technology, PE 1160472BB."
        },
        "ProgramElementMissionDescription": {
            "val": "Advanced Technology Development conducts rapid prototyping and Advanced Technology Demonstrations (ATDs).  ATDs provide a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by Special Operations Forces (SOF) users.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  Advanced Technology Development also addresses projects that are a result of unique joint special mission or area-specific needs for which a few-of-a-kind prototypes must be developed on a rapid response basis, or are of sufficient time sensitivity to accelerate the prototyping effort of a normal acquisition program in any phase.  \n\nAviation Engineering Analysis provides rapid response capability for the investigation, evaluation, and demonstration of technologies for SOF-unique aviation requirements. Timely application of SOF-unique technology is critical and necessary to meet requirements in such areas as: sensor integration; enhanced situational awareness; near-real-time intelligence to include data fusion, threat detection and avoidance; electronic support measures for threat geo-location and specific emitter identification; navigation; target detection; weapon performance integration; and future SOF aircraft requirements, both manned and unmanned.\n\nInformation and Broadcast Systems Advanced Technology conducts rapid prototyping, advanced technology demonstrations, and advanced concept technology demonstrations of information and broadcast systems technology.  Includes planning, analyzing, evaluating, and production information systems capabilities and distribution\/dissemination broadcast systems capabilities.  It provides a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by SOF users.  This project also integrates efforts with each other and conducts technology demonstrations in conjunction with joint experiments and other assessment events.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  The project also addresses unique, joint special mission or area-specific needs for which prototypes must be developed on a rapid response basis, or are of sufficient time sensitivity to accelerate the prototyping effort of a normal acquisition program in any phase."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.242"
                },
                "CurrentYear": {
                    "val": "45.317"
                },
                "BudgetYearOne": {
                    "val": "46.356"
                },
                "BudgetYearOneBase": {
                    "val": "46.356"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "31.690"
                },
                "CurrentYear": {
                    "val": "45.317"
                },
                "BudgetYearOne": {
                    "val": "46.809"
                },
                "BudgetYearOneBase": {
                    "val": "46.809"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.448"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.453"
                },
                "BudgetYearOneBase": {
                    "val": "0.453"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.229"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.781"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other adjustments."
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.453"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.453"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:  \n\nFY 2012:   Net Increase of $1.448 million is due to a transfer of funds to the Small Business Innovative Research Program (-$0.781 million), and a reprogramming for higher command priorities ($2.229 million).\n\nFY 2013:  None.\n\nFY 2014:  Net Increase of $0.453 million is due to a realignment to higher command priorities (-$5.468 million) and  the approved consolidation of PE 1160402BB, PE 1160422BB ($5.045 million) and PE 1160472BB ($.870 million).\n\nSchedule:  None.\n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S200"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "974.173"
                        },
                        "PriorYear": {
                            "val": "31.690"
                        },
                        "CurrentYear": {
                            "val": "45.317"
                        },
                        "BudgetYearOne": {
                            "val": "40.888"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.888"
                        },
                        "BudgetYearTwo": {
                            "val": "41.611"
                        },
                        "BudgetYearThree": {
                            "val": "42.108"
                        },
                        "BudgetYearFour": {
                            "val": "43.010"
                        },
                        "BudgetYearFive": {
                            "val": "43.908"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for rapid prototyping, Advanced Technology Demonstrations (ATDs) and Joint Capability Technology Demonstrations.  It is a means for demonstrating and evaluating the utility of emerging\/advanced technologies in operationally relevant environments with Special Operations Forces (SOF) users.  This project integrates emerging technologies and presents them in technology demonstrations, in conjunction with joint experiments and other assessment events.  Evaluation results often facilitate the initiation of new programs and the insertion of appropriate technologies to acquisition programs.   The element also addresses unique, joint special mission or area-specific needs for which a few rapid prototypes must be developed on a responsive basis, or are of sufficient time sensitivity to accelerate prototyping efforts of a normal acquisition program in any phase.  Sub-projects within the Special Operations Special Technology Development effort include:  \n\n   •  Rapid Exploitation of Innovative Technologies (REITS).  This sub-project supports both top-down and bottom-up approaches for USSOCOM Components, Theater Special Operations Commands and Special Operations Task Forces to articulate innovative technology recommendations.  Concepts, ideas, and needs will be submitted to HQ USSOCOM for review and\/or approval as appropriate.  Technical activities in these areas will provide new operational capabilities and will mature technologies to better shape future SOF procurements.\n\n   •  Special Technology Experimentation Sub-Project.  This sub-project conducts a variety of tactical network test bed venues working with the Naval Postgraduate School.\n\n •  Special Technology Coalition Global Network Sub-Project.  This sub-project establishes a test-bed environment to validate operational architecture concepts; develops and evolves tactics, techniques, and procedures for a non-classified, coalition-centric, SOF communications network.\n\n •  Special Operations Special Technology Sub-Project.  This sub-project integrates emerging technologies and presents them in technology demonstrations, in conjunction with joint experiments and other assessment events.\n\n  • Tagging, Tracking, and Locating (TTL) Technologies Sub-Project.  TTL funds SOF unique Advanced Technology Demonstrations identified in the USSOCOM Capabilities Based Assessments.  TTL rapidly prototypes and expeditiously transitions projects from laboratory to acquisition Programs of Record\/operational use to address SOF capability deficiencies. \n\n  • National to Theater Transition Sub-Project.  Conduct additional testing required to transition items from national forces to theater forces. \n  \n  • Foliage Penetration Reconnaissance, Surveillance, Targeting and Engagement Radar (YMQ-18A Unmanned Aerial Vehicle).  Conducts planning, payload integration, air vehicle improvements, and training in support of multiple operational demonstrations to evaluate the military utility of the YMQ18A unmanned aerial vehicle.\n\n  • Classified Sub-Project (provided under separate cover).\n\n • The Special Communications Field Segment-Enterprise program includes organizations, practices, processes, services, networks, systems and subsystems that manage and provide clandestine exchange of information between elements (field-to-field, field-to-base, base-to-field).\n\n  • Signature Management Technology Demonstrator (details provided under separate cover)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rapid Exploitation of Innovative Technology (REITS) for SOF Sub-Project"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.228"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2012, REITS was executed only in Program Element 1160402BB.  Beginning in FY 2014, these funds will be returned to the Special Operations Special Technology Sub-Project, to more robustly support revolutionary technology development.  Continued additional demonstrations and evaluations of C4I technologies; warrior survivability improvements; and mobility, power and energy and mobile technology repair center projects.  Further developed and inserted into existing programs, advanced processing techniques and persistent surveillance.  Continued advanced development of signature reduction technologies.  Inserted lightweight armor and materials into existing acquisition efforts.  Continued to exploit technologies that reduce the load of the operator.   Inserted into existing programs advanced protection and visualization, and training systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.598"
                                            },
                                            "Text": {
                                                "val": "Continue to identify and develop technologies which can rapidly transition to support the warfighter with transition paths into programs of record or direct fielding.  Capabilities such as, but not limited to:  SOF mobility platform improvements, mobile communications applications, improved target engagement, improved materials, improved biometrics and forensics tools, non-traditional power and energy solutions, and improved electronic warfare solutions will be evaluated for development, prototyping, and limited field assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Technology Experimentation Sub-Project"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.250"
                                            },
                                            "Text": {
                                                "val": "Continued experimental efforts conducting a variety of tactical network test-bed venues; working with the Naval Postgraduate School."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.900"
                                            },
                                            "Text": {
                                                "val": "Conduct field experimentations at various venues to facilitate technology insertion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Technology Coalition Global Network Sub-Project"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Established a test-bed environment to validate operational architecture concepts; developed and evolved tactics, techniques, and procedures for a non-classified, coalition-centric, SOF communications network."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Operations Special Technology Sub-Project"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.837"
                                            },
                                            "Text": {
                                                "val": "Developed and inserted technology into existing programs.  Technologies include, but are not limited to, reduced signature profiles; improved weapons, lightweight armor and materials; alternative power systems; \"green\" sustainable energy devices; long duration, reduced size, high output power supplies; and technologies that reduce the load of the operator."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.666"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and insert technology into existing programs.  Technologies include, but are not limited to, reduced signature profiles; improved weapons; lightweight armor and materials; alternative power systems; eco-friendly sustainable energy devices; long duration, reduced size, high output power supplies; and technologies that reduce the load of the operator.  Initiate development of technologies supporting undersea mobility; develop ground mobility solutions for improved endurance and survivability.  Evaluate and develop sensors across the electromagnetic spectrum to meet operational requirements.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.781"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.781"
                                            },
                                            "Text": {
                                                "val": "Continues to develop and insert technology into existing programs.  Technologies include, but are not limited to, reduced signature profiles; improved weapons; lightweight armor and materials; alternative power systems; eco-friendly sustainable energy devices; long duration, reduced size, high output power supplies; and technologies that reduce the load of the operator.  Initiate development of technologies supporting undersea mobility; develop ground mobility solutions for improved endurance and survivability.  Evaluates and develops sensors across the electromagnetic spectrum to meet operational requirements.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record, and conduct field experimentations at various venues to facilitate technology insertion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging, Tracking, and Locating Technologies (TTL) Sub-Project"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.560"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Exploited and integrated recently-proven and emerging technologies for TTL and TTL-enabling systems. Continued projects toward maturity that are linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL Quick-Look Capabilities-Based Assessment (QL-CBA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.010"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Exploits and integrates recently-proven and emerging technologies for TTL and TTL-enabling systems. Continue projects toward maturity that are linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL Quick-Look Capabilities-Based Assessment (QL-CBA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.143"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.143"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Exploits and integrates recently-proven and emerging technologies for TTL and TTL-enabling systems. Continues projects toward maturity that are linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL Quick-Look Capabilities-Based Assessment (QL-CBA)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National to Theater Transition"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.909"
                                            },
                                            "Text": {
                                                "val": "Conducted additional testing and evaluation required on various equipment items being transitioned to the SOF Theater Forces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.993"
                                            },
                                            "Text": {
                                                "val": "Conduct additional testing and evaluation required on various equipment items being transitioned to the SOF Theater Forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.054"
                                            },
                                            "Text": {
                                                "val": "Conducts additional testing and evaluation required on various equipment items being transitioned to the SOF Theater Forces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Foliage Penetration Reconnaissance, Surveillance, Targeting and Engagement Radar (YMQ-18A Unmanned Aerial Vehicle)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.445"
                                            },
                                            "Text": {
                                                "val": "Conducted planning, payload integration, air vehicle improvements and training in support of multiple operational demonstrations to evaluate the military utility of the YMQ-18A unmanned aerial vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Classified Sub-Project"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.961"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.050"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.110"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.110"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Communications Field Segment - Enterprise (SPCOM)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "FY 2013 new start.  Starting in FY 2014 SPCOM will be executed in Program Element 1160474BB.   Initial focus will be on the development of transport and field segment devices for a special communications enterprise, as well as the development of means and methods (tradecraft) to provide near term impact to operators."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Signature Management Technology Demonstrator"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.800"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SF101"
                    },
                    "ProjectTitle": {
                        "val": "Aviation Engineering Analysis"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.876"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.876"
                        },
                        "BudgetYearTwo": {
                            "val": "0.890"
                        },
                        "BudgetYearThree": {
                            "val": "0.900"
                        },
                        "BudgetYearFour": {
                            "val": "0.918"
                        },
                        "BudgetYearFive": {
                            "val": "0.938"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides a rapid response capability to support SOF fixed wing aircraft and unmanned aircraft systems.  The purpose is to correct system deficiencies, improve asset life, and enhance mission capability through the means of feasibility studies, analysis of alternatives, pre-developmental risk reduction studies, and engineering analyses. This project provides the engineering required to improve the design and performance integrity of the aircraft support systems, sub-systems, equipment, and embedded computer software as they relate to the maintenance, overhaul, repair, quality assurance, modifications, materiel improvements, and service life extensions.  This project also conducts risk reduction studies, analyses, and demonstrations to support emerging, time critical weapons and sensor enhancements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aviation Engineering Analysis"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.876"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.876"
                                            },
                                            "Text": {
                                                "val": "Performs engineering studies, demonstrations, and analyses for fixed wing aviation SOF-unique equipment and missions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S225"
                    },
                    "ProjectTitle": {
                        "val": "Information and Broadcast Systems Adv Tech"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.045"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.045"
                        },
                        "BudgetYearTwo": {
                            "val": "5.129"
                        },
                        "BudgetYearThree": {
                            "val": "5.184"
                        },
                        "BudgetYearFour": {
                            "val": "5.295"
                        },
                        "BudgetYearFive": {
                            "val": "5.406"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts rapid prototyping of information and broadcast system technology.  This includes cyber capabilities that predict the best media channels to reach potential target audiences, data mining and information collections tools, propaganda and social behavior analytical tools, cultural analysis toolsets and emerging technologies that support the planning and analytical needs for the Military Information Support Operations (MISO) forces.  It provides a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by SOF users.  This project integrates efforts and conducts technology demonstrations in conjunction with joint experiments and other assessment events and performs market research on emerging technologies that support all phases of MISO.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  The project also addresses unique, joint special mission or area-specific needs.  Seeks technologies that will transform current MISO capabilities through two major objectives: 1) Exploit technologies capable of disseminating products to reach target audiences across a variety of media to include audiences in denied areas.  2) Automate and improve MISO planning and analytical capability through technologies that are integrated into SOF planning systems (Cultural Analysis, Targeting, Theme Development, Media & Product Selection, Distribution & Dissemination, and Measures of Effectiveness).  Develops software applications that increase the efficiency and shorten the timeline to get MISO dissemination packages approved.  Develops hardware\/software tools that facilitate the collaboration and sharing of information and other critical data.  \n\nMISO Modernization.  This initiative will initiate and continue development of emergent technologies available in the marketplace to transform and modernize MISO planning, analysis, development, broadcast, distribution, dissemination, and feedback capabilities. This initiative will also continue development of appropriate emerging technologies initially identified by ATDs and JCTDs to transition to acquisition programs. Technologies include: multi-frequency broadcast systems; digital broadcast capabilities; remote controlled electronic paper; near-real-time command and control of unattended MISO systems, especially in denied areas; focused\/beam speaker sound technologies; visual projection technologies; advanced commercial broadcast technologies including amplitude modulation (AM) and frequency modulation (FM) radio transmitters and antenna; television (TV) transmitter and antenna systems; internet and telephony dissemination and broadcast systems; technologies capable of disseminating MISO products to reach target audiences across a wide variety of media into denied areas; and technologies that automate and improve MISO planning and analytical capability through integrated capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MISO Modernization"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.045"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.045"
                                            },
                                            "Text": {
                                                "val": "Continues to develop and insert technology into existing programs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}