{
    "id": "76c640cad9f110dd2564a7f6155dc6c59d6ed9bb",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603828D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Experimentation"
        },
        "R1LineItemNumber": {
            "val": "64"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "28.160"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Joint Experimentation Program Element 0603828D8Z will transfer from OUSD AT&L to The Joint Staff in FY13."
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Experimentation (JE) Program Element (PE) (0603828D8Z) provides funding for the Department’s Joint Experimentation program—the Department’s primary effort for exploring non-materiel solutions to cover joint capability gaps in lieu of materiel solutions requiring new acquisition programs.  Consistent with strategic guidance, the JE program targets DoD’s highest priority joint capability gaps.  \nThe intent of the JE program is to enable trained, ready and adaptable joint forces, and improve capabilities of the current and future joint force.  The JE program focuses on producing new conceptual approaches and proposed solutions to combatant command and Service defined problems through the development of actionable joint force improvement recommendations in the critical considerations of joint doctrine, organization, training, materiel, leadership and education, personnel, facilities, and policy (DOTMLPF-P).  \nThe JE program primarily benefits combatant commanders and Services, and provides collateral benefits to DoD Agencies and the Office of the Secretary of Defense (OSD).  JE routinely provides indirect benefit to interagency and multinational partners and international organizations with whom the US participates during coalition operations.  \nThe JE Program is carried out by the JCD&E community, comprised of all combatant commands, the Services, the National Guard Bureau, the Joint Staff, OSD, and several DoD agencies.  The Joint Staff leads the JCD&E community.  Other participants in JE activities include a broad range of interagency partners as well as multinational, academic, and private sector agencies.  The Assistant Secretary of Defense, Research & Engineering (ASD(R&E)) within OSD helps provides oversight to ensure alignment with strategic guidance.  \nFlexibility is maintained in the JE Program to address emergent requirements identified by DoD leadership.  Joint experimentation is complementary to Service experimentation.  Where possible, the JCD&E community leverages Service experimentation to address joint challenges.   Joint\/Service experimentation is coordinated within the JCD&E community to cover gaps and pursue efficiency, and the results are shared throughout the community.    \nprojects are categorized by functional joint capability areas (JCAs) which help enable already-established functional capability boards to rigorously vet JE recommendations among subject matter matters throughout the joint community before those recommendations are approved by the Joint Requirements Oversight Council (JROC).  For FY12, these categories include Battlespace Awareness, Logistics, Building Partnerships, Command and Control, Force Application, Net-Centric and Protection."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "28.160"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "28.160"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "SummaryExplanation": {
                "val": "N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P808"
                    },
                    "ProjectTitle": {
                        "val": "Joint Experimentation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.160"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Joint Experimentation Program Element 0603828D8Z will transfer from OUSD AT&L to The Joint Staff in FY13."
                        },
                        "ProjectMissionDescription": {
                            "val": "General Description:  The FY 2012 (FY12) JCD&E program of work in addresses key mission areas identified in the 2010 Quadrennial Defense Review and highlighted in the Defense Planning Guidance.  Each Joint Capability Area had unique areas of focus:  \n\nBattlespace Awareness (BA):  The FY12 campaign Included capabilities and concepts required to succeed in preventing proliferation and countering weapons of mass destruction.   The scope of the work also includes experimentation to identify and evaluate enabling technologies that lengthen detection ranges and strengthen ISR and communications ties between special and general purpose forces.\n\nLogistics (LOG): Joint Force Commanders require responsive, agile logistics support to project force, sustain operations and ensure freedom of action wherever the force engages and in whatever form the engagement takes.  The FY12 JCD&E program of work in LOG addresses existing and projected mission critical capabilities and conceptual gaps required to project, sustain, and employ the joint force in all operations.  The scope of work includes experimentation to identify and evaluate enabling technologies and non-materiel solutions that create mechanisms to facilitate more rapid transfer of critical materiel.\n\nBuilding Partnerships (BP):  The FY12 campaign addresses projected mission critical capabilities and concepts required to build security capacity of partner states. The scope of the work includes security and engagement activities per the Capstone Concept for Joint Operations (CCJO) and experimentation to identify and evaluate enabling technologies to enhance US capability to increase the security capacity of partner states.  Specific focus areas for FY12 include:\n-Strengthen and institutionalize General Purpose Force capabilities in conducting security force assistance missions \n-Increase socio-cultural\/ human terrain awareness of the force \n-Increase information sharing capacity between US and partner states and within partner states \n-Develop collaborative planning and assessment tools to support of security force operations \n-Improve effective and efficient methods to provision logistical support to partner states\n\nCommand and Control (C2): The FY 2012 (FY12) JCD&E program of work in C2 includes projected mission critical capabilities and concepts required to effectively command and control the joint force. Specific focus areas for FY12 include experiments on secure, robust and reliable networks to provide responsive command and control in complex chaotic and degraded information environments to integrate and share information with a full range of partners\n\nForce Application (FA): Joint Force Commanders (JFCs) require improved kinetic or non-kinetic capabilities to maneuver and engage adversaries from political, strategic, operational, and tactical perspectives.  The FY 2012 JCD&E program of work in FA addresses projected mission critical capabilities and concepts required to deter and defeat aggression in anti-access\/area denial (A2\/AD) environments.  The scope of work includes experimentation to identify and evaluate enabling technologies that focus on electronic warfare, long range strike, and undersea superiority.\n\nNet-Centric: Joint Force Commanders require a framework for full human and technical connectivity and interoperability that allows all DOD users and mission partners to understand and act on information with confidence, and protects information from those who should not have it.  The FY 2012 JCD&E program of work in the Net-Centric JCA addresses projected mission critical capabilities and concepts required to deter and defeat aggression in anti-access and area denial (A2\/AD) environments.  The scope includes experimentation to identify and evaluate enabling technologies that focus assuring access to space and use of space-based assets.\n\nProtection (PR):  The FY 2012 JCD&E Program of Work (PoW) in PR addresses key capabilities and concepts related to force protection in all domains."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battlespace Awareness"
                                    },
                                    "Description": {
                                        "val": "Joint Experimentation in 2012 had significant impact on joint force development under the Battlespace Awareness JCA.  The Capstone Concept for Joint Operations-Joint Force 2020 will be tempo setting.  It will underlie joint development campaign plans going forward into FY13 and beyond.  The Joint Concept for Cyberspace is DoD’s first document that links an increasing number of strategy documents on cyber operations to how the future joint force will need to operate in the cyberspace domain.  JE initiatives in FY12 led to measurable improvements in surveillance management procedures and also produced a more functional perspective in addressing the assessment of persistent surveillance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.160"
                                            },
                                            "Text": {
                                                "val": "Capstone Concept for Joint Operations – Joint Force 2020\n\nConcept Intent: Articulates Chairman’s vision of future joint operations in order to guide joint force development towards Joint Force 2020. It also provides a foundation for Chairman’s Cross-Functional team focused on development Joint Force 2020.\n\nAccomplished in FY12: “CCJO – Joint Force 2020” published, providing a bridge from the new strategy to subordinate operating concepts and doctrine\n\nImpact:  TBD\n  \nJoint Integrated Persistent Surveillance (JIPS)\n\nIssue: The Joint Force Commander requires adequate capability to rapidly integrate and focus national to tactical collection assets to achieve persistent surveillance of a designated geographic area or a specific mission set\n\nAccomplished in FY12: \n-Updated definition of persistent surveillance in JP 1-02\n-Created online course on Integrated Persistent Surveillance via Joint Knowledge Online\n-Provided substantial input to complementary Commander’s Handbook for ISR Operations (J2-led)\n-Directly informed ISR management tool development (J2-led)\n-Refined joint accreditation criteria for Service training via JNTC\n\nImpact:\n-Timing of persistent surveillance-derived decision support provided to commanders is improved by 22%\n-Arrival-on-station timing of collection assets is improved by 15%\n-Initial asset utilization is improved by 5%\n-Established best practices for surveillance management that now integrate rather than deconflict multi-echelon planning and direction, thereby reducing redundancy and latency in both requirements and collection management\n-Changed the focus of assessment of persistent surveillance to being effectiveness-centric (i.e. satisfaction of decision support requirements) from being performance-centric (i.e. hours flown)\n-Over time, platform\/sensor\/analytical\/bandwidth requirements will be reduced (fewer needing to be deployed, operated, serviced\/fueled\/maintained, and protected) to fulfill a given information requirement set\n\nAssessing Deterrence Operations Experiment (ADOE)\nIssue: The employment of Joint Operational Command Centers to conduct ballistic missile defense (BMD) contingency and crisis action planning requires improvement to reduce intra- and inter-theater capability gaps\n\nAccomplished in FY12: \n-Developed a framework for ADO documenting gaps of “what  is done” and “what should be done” \n-Published a Joint Force Guide for ADO\n\nImpact: TBD\n\nJoint Concept for Cyberspace \n\nIssue: DoD is unable to achieve and sustain cyberspace superiority essential to support and enhance the current and future demands of joint operations at the time and place of the warfighter’s choosing, in order to assure mission accomplishment\n\nAccomplished in FY12: \n-Published the Joint Concept for Cyberspace V1.0\n-Established a list of required capabilities with a road map for cross-agency acquisition\/development strategies \n-Proposed a concept of operations that can be exercised in select future exercises such as Valiant Shield, Trident Warrior and Northern Edge\n\nImpact:  Published the bridge between DoD strategy and doctrine that determined future capabilities required for cyberspace superiority.\n\nMobile Maritime Domain Awareness (MDA) Modular Sensor System (MSS) (MDA-MSS)\n\nIssue: NORAD and USNORTHCOM, in coordination with US Southern Command and Joint Interagency Task Force South (JIATF-S), seeks to perform an experiment to demonstrate capabilities and emerging technologies to tackle current surveillance gaps and improve maritime awareness in the Caribbean.\n\nAccomplished in FY12:\n-Project initiated to produce baseline analysis of existing systems and operational methods, as well as new innovative technologies.\n\nImpact:  TBD, but it is expected that an enhanced and integrated surveillance capability, to include a collective surface coastal radar network in the Caribbean AOR, will provide wide-area surveillance tracking of potential maritime threats, in order to protect U.S. and allied equities and citizens in the region."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance of Joint Experimentation efforts is measured by successful development of:\n(1) objective assessment and validation of enhanced capabilities enabling the joint force commander to perform joint missions. \n(2) delivery of relevant, intellectually rigorous joint concepts to enhance or change Joint Doctrine. \n(3) confirmed transition of capability\/products from experimentation to force implementation through the DOTMLPF-P Change Recommendations (DCR) process.\n(4) identification of innovative integrated solutions and joint interoperability standards for Service and Agency capability developers to pursue through demonstration, acquisition and\/or employment. \n(5) resolution of specific joint concept and capability shortfalls delineated through the JCD&E experimentation campaign plan development process."
                        }
                    }
                }
            ]
        }
    }
}