{
    "id": "7dd190747996ca373c597dc52456878d88a270a1",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0207449F"
        },
        "ProgramElementTitle": {
            "val": "Command and Control (C2) Constellation"
        },
        "R1LineItemNumber": {
            "val": "160"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.075"
            },
            "CurrentYear": {
                "val": "18.086"
            },
            "BudgetYearOne": {
                "val": "7.329"
            },
            "BudgetYearOneBase": {
                "val": "7.329"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "45.490"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2014:  Project 675140, Joint Expeditionary Force Experiments (JEFX), was terminated"
        },
        "ProgramElementMissionDescription": {
            "val": "The Command and Control Constellation (C2C) is the sole Air Force program for defining, developing, and assessing integrated effects of global, theater and tactical level Air Force air, space, and cyber command and control (C2) capabilities in support of the joint warfighter.  The Air Force faces a complex future where conflict will range across a broad spectrum of operations and lethality.  The Air Force requires capabilities with the maximum possible flexibility to deal with the widest possible range of conflict.\n\nThe C2C is the enabling program element for C2 Integration\/Modernization.  The Air Force is working to establish a C2 framework and architecture to be used as a unifying vision of command and control for each of the services core functions.  C2C will support the defense strategy through: integration of air, space cyber and intelligence, surveillance, and reconnaissance (ISR) C2, through architectural analysis, prototyping, experimentation and innovation to develop cross-cutting solutions, and enable an improved \"sense-to-kill\" cycle time.  C2C innovations and experimentation provide strategic, operational, and tactical direction for Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) solutions to facilitate an integrated mission environment that supports C2 planning and execution for air, space, and cyberspace.  In-depth development and analyses of C2 operational, systems, and technical architectures are geared towards identifying capability gaps, identifying required \"to be\" information services, and evaluating C2 program planned improvements.  Through prototyping and experimentation, C2C integrates rapidly developing technologies to promote common standards, data sharing, and information services across Air Force and joint warfighting applications to support joint enterprise solutions. \n \nProject 675078, Horizontal Integration (HI) conducts DOTMLPF analyses and assessments to guide cross-cutting, C2 sub-enterprise and cyberspace investment decisions that integrate USAF capabilities into joint and coalition operations.  HI identifies, prioritizes, and develops requirements and horizontally integrated solution recommendations to ensure the latest technologies and information services are integrated into a cross cutting C2 system that enables integrated effects in all warfighter domains.  The HI strategy will be validated by Headquarters, Air Force (HAF) to ensure that initiatives are harmonized with the most urgent warfighter needs described by the C2 Capability Assessment Team (CAT) and C2 Core Function Master Plan (CFMP) and supporting the 2012 Air Force, Joint and Defense Strategies and Operational Concepts. Once validated, HI funds are applied toward identifying the most critical warfighter capabilities and ensuring they are horizontally integrated into both Air Force and joint C2 programs of record.\n\nProject 675140, Joint Expeditionary Force Experiments (JEFX) are agile and frequent innovation-focused experiments which lead to pre-fielded operational and technical assessments.  Constructive, live and virtual, operationally representative warfighter environments are created to support integration challenges which focus on critical C2 areas of interest that support the joint warfighter; including, C2 of ISR innovation that supports the air, space, and cyberspace domains.  JEFX provides the infrastructure and integration initiatives for experimentation with emerging operational concepts and attendant new technologies that fill operational gaps in Air Force capabilities to meet emerging and rapidly changing real world threats.  The JEFX strategy is validated and supported by the Commander, Air Combat Command (COMACC) and coordinated with Headquarters, Air Force (HAF) ensuring initiatives are harmonized with the most urgent warfighter needs and validated requirements described in the AF Core Function Master Plans (CFMP) and supported through MAJCOM Core function Lead Integrator (CFLI).  JEFX initiatives are based on emerging CONOPS and warfighter challenges, important enablers of innovation and transformation, which are designed to support the themes and demonstrate emerging Air Force capabilities to deploy and employ decisive air, space and cyberspace power in support of the Joint Force.  \n\nThis program is in Budget Activity 7, Operational System Development,  these budget activities include development efforts to upgrade systems currently fielded or have approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.254"
                },
                "CurrentYear": {
                    "val": "18.086"
                },
                "BudgetYearOne": {
                    "val": "16.808"
                },
                "BudgetYearOneBase": {
                    "val": "16.808"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.075"
                },
                "CurrentYear": {
                    "val": "18.086"
                },
                "BudgetYearOne": {
                    "val": "7.329"
                },
                "BudgetYearOneBase": {
                    "val": "7.329"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.821"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-9.479"
                },
                "BudgetYearOneBase": {
                    "val": "-9.479"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.346"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.525"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-9.479"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-9.479"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2012:  Project 675078, Horizontal Integration (HI), increased $3.346M to support Air Force enterprise horizontal integration efforts. \nIn FY 2014:  Project 675140, Joint Expeditionary Force Experiments (JEFX), was terminated, Horizontal Integration was reduced $1.126M due to higher Air priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675078"
                    },
                    "ProjectTitle": {
                        "val": "Horizontal Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.126"
                        },
                        "CurrentYear": {
                            "val": "8.477"
                        },
                        "BudgetYearOne": {
                            "val": "7.329"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.329"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "26.932"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Horizontal Integration (HI) develops an integrated mission environment that supports cross-cutting solutions across the air, space, and cyberspace command and control (C2) warfighter domain.  HI activities include:  requirements, architecture, systems engineering, technology development, risk reduction, prototyping, and transition.  These activities are required to:  identify, design, develop, experiment, and implement C2 solutions supporting operational requirements for warfighting integration and interoperability needs which are not the sole responsibility of a specific program of record.  \n\nThe nature of integrated and interoperable C2 warfighting capabilities span multiple platforms and domains.  These capabilities are routinely being adjusted to meet the changing requirements from the warfighting communities.  The HI project is uniquely designed to look across platforms and domains enabling the Air Force to respond to operator needs across the seams of individual systems.  These horizontal integration initiatives will be prototyped, assessed, appropriately captured in requirements documents and then transitioned to programs of record for production, fielding and sustainment.  \n\nSystems Engineering and analysis is the 'glue' that holds command and control constellation (C2C) elements together and closes the seams in the C2 architectures.  Capability analysis identifies areas where interoperability can be improved within the Air Force, as well as among joint services, and coalition partners.  Once capability issues are identified, they are prioritized and pilot initiatives are developed to provide solutions to the warfighter challenges to resolve the capability gaps.  The HI project also helps to competitively prototype integrated solutions against validated program requirements. \n\nThe benefits of these activities are two-fold:  the operational community is able to weigh the cost, risk, and performance trade-offs between enterprise solutions versus program centric solutions, and it supports competitive prototyping of all acquisition programs.  The synchronization of HI prototyping and program milestone requirements offers an effective environment for increasing interoperability while reducing the impact of this policy on multiple programs.  An infrastructure environment manages a continuous distributed operational environment that supports air, space, and cyberspace C2 and rapid acquisition, prototyping, development, integration, and fielding.  C2 initiatives may use this infrastructure to mature their development status prior to entry into JEFX for operational and technical suitability assessment. \n\nThe HI prototype performances are assessed for operational utility, and the most promising initiatives\/technologies will be matured and transitioned into weapon system configuration control baselines.  Requirement documents will be published and revised, and a requirements database and implementation plan identifying the most significant C2C net-centric integration issues will be updated to catalog the activities necessary to accomplish this integration. \n\nIn addition, this project supports concept exploration, program definition\/risk reduction efforts, and studies that support continuous improvements in C2. Guided by the MAJCOM-validated C2 capability gaps developed by the HI Capability Assessment Team annual process and the defense strategy to meet the evolving Anti-Access\/Area Denial (A2\/AD) threats to air, space and cyber C2 operations, these improvements include but are not limited to: integration of airspace and cross-domain synchronized operations,C2 of integrated air and missile defense, C2 of Air Force Forces and agile combat support, dynamic aerial network capabilities, and non-traditional ISR (NTISR), from 4th and 5th generation aircraft through processing and assessment, and interoperability with joint service, allied and coalition systems, C2 of personnel recovery, and air-sea battle. Activities also include studies and analysis to support both current program planning and execution, as well as future program planning.\n\nThis program is in Budget Activity 7, Operational System Development, these budget activities include development efforts to upgrade systems currently fielded or has approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Reqmts\/ CBP\/ Integrated Ops\/ C2 Framework"
                                    },
                                    "Description": {
                                        "val": "Requirements\/Capabilities Based Planning (CBP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Text": {
                                                "val": "Refined integrated air and missile defense (IAMD) C2 requirements.  Continued future C2 integration\/modernization strategy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Analyze, develop, and document emerging Air Force (AF) integrated Command and Control (C2) requirements. Continue future C2 integration\/\nmodernization strategy in a series of concept and\/or capability development and technology exploration activities designed to integrate C2 operations across air, space, and cyberspace domains. Continue refining IAMD C2 requirements. Develop concepts and capabilities in support of air sea battle concepts of operation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.006"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.006"
                                            },
                                            "Text": {
                                                "val": "Will analyze, develop, and document emerging Air Force (AF) integrated command and control (C2) requirements. Will continue future C2 integration\/modernization strategy in a series of concept and\/or capability development and technology exploration activities designed to integrate C2 operations across air, space, and cyberspace domains. Will continue to refine IAMD C2 requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Arch and SE"
                                    },
                                    "Description": {
                                        "val": "Architecture Development and Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.900"
                                            },
                                            "Text": {
                                                "val": "Continued technical expertise support of functional and engineering analyses within the C2 community. Specific emphasis was on air-ground modernization and C2 of ISR Integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.596"
                                            },
                                            "Text": {
                                                "val": "Continue functional and systems engineering analysis within the C2 community to flesh out technical architectures and their relationships to operational architectures within the warfighting environment. Specific focus areas and efforts depend on real world needs, C2 enterprise and C2 of cyber requirements with emphasis on airspace and C2 integration, NTISR, C2 of AFFOR, IAMD, 5th - 4th Generation Fighter Interoperability, Dynamic Aerial Networks, C2 of personnel recovery, and air-sea battle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.605"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.605"
                                            },
                                            "Text": {
                                                "val": "Will continue functional and systems engineering analyses within the C2 community to flesh out technical architectures and their relationships to operational architectures within the warfighting environment. Specific focus areas and efforts will depend on real world needs, C2 enterprise and C2 of cyber requirements, with emphasis on airspace and C2 integration, NTISR,  C2 of AFFOR, IAMD, 5th - 4th Generation Fighter Interoperability, Dynamic Aerial Networks, C2 of personnel recovery, and air-sea battle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis Integ and SE"
                                    },
                                    "Description": {
                                        "val": "Analysis Integration and Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.212"
                                            },
                                            "Text": {
                                                "val": "Completed analysis and integration efforts. Specific focus areas were tailored to real world needs, the C2 enterprise, and C2 of cyber requirements. Completed the analysis and transition of prototype capability developed in previous years."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "[This effort incorporated into other efforts.]"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "[This  effort incorporated into other efforts.]"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ops-Tech Analysis-Concept Dev't"
                                    },
                                    "Description": {
                                        "val": "Ops\/Tech Analysis and Concept Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.151"
                                            },
                                            "Text": {
                                                "val": "Completed the modernization of the Command and Control (C2) programs. Enabled a collaborative integrated operating environment (IOE) to present, plan, and execute AF capabilities in support of joint operations. Improved and completed real time information exchange through the planning and execution phases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "[This effort incorporated into other efforts.]"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "[This effort incorporated into other efforts.]"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HI Solutions Assessments"
                                    },
                                    "Description": {
                                        "val": "Horizontal Integration Solutions Assessment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.816"
                                            },
                                            "Text": {
                                                "val": "Continued the selection of HI initiatives for execution that fostered enterprise integration across C2 and C2 of cyber programs and supported the DoDI 5000.02 requirement for competitive prototyping. After candidates were solicited, the submissions were evaluated, and the selected initiatives were funded for execution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.299"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct annual selection of HI initiatives for new execution or continuation that will: a. foster enterprise integration across C2 and extend an IOE, b. support the DoDI 5000.02 requirements for competitive prototyping and c. aid in refining requirements. Key criteria are near-term warfighter impact and likelihood of transition. Potential initiatives will be evaluated and the selected initiatives will be funded for execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.119"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.119"
                                            },
                                            "Text": {
                                                "val": "Will continue to conduct an annual selection of HI initiatives for new execution or continuation that will: a. foster enterprise integration across C2 and extend an IOE, b. support the DoDI 5000.02 requirements for competitive prototyping and c. aid in refining requirements. Key criteria will continue to be near-term warfighter impact and likelihood of transition. Potential initiatives will be evaluated, and the selected initiatives will be funded for execution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management Administration (PMA)"
                                    },
                                    "Description": {
                                        "val": "Program Support Administration costs support management with engineering and technical for development and implementation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.347"
                                            },
                                            "Text": {
                                                "val": "Supported the acquisition program with engineering and technical support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.582"
                                            },
                                            "Text": {
                                                "val": "Continue to support the acquisition program with engineering and technical support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.599"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.599"
                                            },
                                            "Text": {
                                                "val": "Will continue to support the acquisition program with engineering and technical support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This project uses full and open competition for operational requirements document creation, systems engineering & architecture development, modeling & simulation and experimentation, joint interoperability\/integration, and horizontal integration approaches."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Requirements\/Capability Based Planning (CBP)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Langley AFB, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.884"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.884"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.384"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements\/Capability Based Planning (CBP)(2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.122"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.122"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.322"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Architecture Development and Systems Engineering\/ GAPS\/AWS Horizontal Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.466"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.152"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.152"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.768"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Architecture Development and Systems Engineering\/ GAPS\/AWS Horizontal Integration (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Langley AFB, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.740"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.501"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.501"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.241"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Architecture Development and Systems Engineering\/ GAPS\/AWS Horizontal Integration (3)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.390"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.952"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.952"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.342"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Analysis, Integration, and SE\/Capability Roadmaps (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.212"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.212"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tech Analysis and Concept Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.107"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.107"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tech Analysis and Concept Development (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.044"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.044"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Horizontal Integration Solution Assessment (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.972"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.631"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.631"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.703"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Horizontal Integration Solution Assessment (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Jacobs ETASS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.098"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.061"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.086"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.086"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.245"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Horizontal Integration Solution Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.049"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.138"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.402"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.402"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.589"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Spectrum"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.447"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.447"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support\/PMA-1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Quantech PASS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.247"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.247"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.248"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.248"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.742"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support\/PMA-2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Jacobs ETASS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.300"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support\/PMA-3"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.235"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.251"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.251"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.486"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207449F_BPAC_675078_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Requirements\/Capability Based Planning\/Integrated Ops\/C2 Framework"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Architecture and Systems Engineering (Arch and SE)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Analysis Integration and Systems Engineering"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ops-Tech Analysis and Concept Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Horizontal Integration (HI) Solutions"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675140"
                    },
                    "ProjectTitle": {
                        "val": "Joint Expeditionary Force Experiments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.949"
                        },
                        "CurrentYear": {
                            "val": "9.609"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "18.558"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2013, Project 675140, Joint Expeditionary Force Experiments, was terminated in order to meet higher Air Force priorities."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Expeditionary Force Experiments (JEFX) and supporting Limited Objective Experiments (LOEs) are warfighter integration and validation experiments that address operational challenges and are part of the Air Force (AF) command and control (C2) integration and experimentation enterprise. Activities include: evaluation of innovative solutions for C2 aspects of the AF integrated air and missile defense (IAMD) mission, Anti-Access\/Area Denial (A2\/AD) threats, dynamic aerial layer networking, 5th to 4th generation aircraft and 5th to 5th generation aircraft disparate tactical datalink (TDL) data translation capabilities Non-Traditional ISR (NTISR), Airspace Integration, Unit Level Agile Combat Support communication processes, as well as C2 Integration and Modernization for existing AF programs of record. JEFX provides continued integration and experimentation efforts across the AF C2 seams and programs in air, space and cyber domains as defined by CORONA, HQ AF, and the AF Command and Control Integration Center (AFC2IC).\n\nJEFX\/LOE activities explore significant capability gaps across the range of Air Force command and control (C2) by means of assessing Concept of Operations (CONOPS), tactics, techniques and procedures (TTPs) and materiel solutions. The activities address critical lessons learned from recent operations and the validated requirements described in the 2012 Air Force, Joint and Defense Strategies and Operational Concepts, the AF Core Function Master Plans (CFMP) and supported through MAJCOM Core Function Lead Integrator (CFLI). JEFX creates or leverages operationally representative-experiment enterprise warfighter environments to address joint and coalition warfighter gaps and shortfalls that demonstrate existing and emerging Air Force capabilities to deploy and employ decisive air, space and cyberspace power for the joint force commander and enable innovation and transformation. These unique missions are the major reason JEFX is an experiment and not simply a demonstration or exercise. Activities also include studies and analyses to support current program planning and execution, as well as future program planning.\n\nThis program is in Budget Activity 7, Operational System Development, these budget activities include development efforts to upgrade systems currently fielded or has approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Requirements Identification and SE"
                                    },
                                    "Description": {
                                        "val": "Spiral develop systems architecture, systems engineering, and integration of initiatives into a cohesive system of systems process"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.927"
                                            },
                                            "Text": {
                                                "val": "Continued support for plan and design activities.  JEFX 12 LOEs focused on the four issues outlined per CORONA Fall 2009 direction: 1) Lack AF-wide IAMD knowledge and emphasis on strategic to tactical; 2) Significant C-NAF organization & personnel deficiencies; 3) Lack exercise, experimentation & wargame oversight & fidelity; and 4) Obsolete C2 radars \/ sensors and C2 systems lack integration with joint partners. To address these issues, JEFX initiated integration of the BMD systems, other technology, and process initiatives into the AOC weapons system with the goal of full integration into the joint counter air mission capabilities. Initiated air sea battle concept as relevant operational scenario for JEFX 12."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.159"
                                            },
                                            "Text": {
                                                "val": "Continue integration and experimentation across Air Force (AF) C2 seams and programs in air, space and cyber domains as defined by CORONA, HAF, and AFC2IC. JEFX 2013 (JEFX 13) completes Integrated Air and Missile Defense (IAMD) efforts and begins providing some support for dynamic aerial layer networking, non-traditional intelligence, surveillance, reconnaissance (NTISR) and other C2 integration\/modernization activities to include requirements identification, systems engineering of initiatives and LOEs focusing on the integration of C2 services. Requirements validation established in MAJCOM-directed CFMP processes connecting warfighter needs to initiative identification. The experimentation team will perform either an operational utility and\/or a technical assessment feeding final experimentation products."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Plan and Design"
                                    },
                                    "Description": {
                                        "val": "Plan, design, coordinate, assess and report the JEFX experiments,  provide expertise to support initiative selection, acquisition, program management, communications and systems planning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.193"
                                            },
                                            "Text": {
                                                "val": "Continued support for plan and design activities.  JEFX 12 LOEs focused on the four issues outlined per CORONA Fall 2009 direction: 1) Lack AF-wide IAMD knowledge and emphasis on strategic to tactical; 2) Significant C-NAF organization & personnel deficiencies; 3) Lack exercise, experimentation & wargame oversight & fidelity; and 4) Obsolete C2 radars\/sensors and C2 systems lack integration with joint partners. To address these issues, JEFX initiated integration of the BMD systems, other technology, and process initiatives into the AOC Weapons System with the goal of full integration into the joint counter air mission capabilities. Initiated air sea battle concept as relevant operational scenario for JEFX 12."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.610"
                                            },
                                            "Text": {
                                                "val": "Developing internally-generated, stand-alone events employing simulation facilities, as necessary. Evaluating innovative solutions for C2 aspects of the AF Integrated Air and Missile Defense (IAMD) mission, Anti-Access\/Area Denial (A2\/AD) threats, dynamic aerial layer networking, 5th to 4th generation aircraft and 5th to 5th generation aircraft disparate tactical datalink (TDL) data translation capabilities NTISR, airspace integration, unit level agile combat support communication processes, as well as C2 integration and modernization for existing AF programs of record. Leverages AF and joint sponsored experimentation events (i.e. AGILE Fire, Trident Warrior, etc.) when and where feasible."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Develop Initiatives"
                                    },
                                    "Description": {
                                        "val": "Develop initiatives to introduce new technologies and operational capabilities into the Aerospace Expeditionary Force (AEF) Concept of Operations (CONOPS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.281"
                                            },
                                            "Text": {
                                                "val": "Continued support for plan and design activities.  JEFX 12 LOEs focused on the four issues outlined per CORONA Fall 2009 direction: 1) Lack AF-wide IAMD knowledge and emphasis on strategic to tactical; 2) Significant C-NAF organization & personnel deficiencies; 3) Lack exercise, experimentation & wargame oversight & fidelity; and 4) Obsolete C2 radars\/sensors and C2 systems lack integration with joint partners. To address these issues, JEFX initiated integration of the BMD systems, other technology, and process initiatives into the AOC weapons system with the goal of full integration into the joint counter air mission capabilities. Initiated  air sea battle concept as relevant operational scenario for JEFX 12."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.197"
                                            },
                                            "Text": {
                                                "val": "Leveraging existing government and commercial technologies that address a specific integration shortfall. These initiatives are developed by the HI portion of this program with specific interest in operational and\/or technical utility. Their requirements drive experiments supporting the programs of record by integrating incremental program improvements, select candidates for upcoming program selection, and field integration and other transition efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Define and Build Events"
                                    },
                                    "Description": {
                                        "val": "Implement architectural configuration, conduct M&S, install and test the communications infrastructure and execute the experiment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.209"
                                            },
                                            "Text": {
                                                "val": "Continued support for plan and design activities.  JEFX 12 LOEs focused on the four issues outlined per CORONA Fall 2009 direction: 1) Lack AF-wide IAMD knowledge and emphasis on strategic to tactical; 2) Significant C-NAF organization & personnel deficiencies; 3) Lack exercise, experimentation & wargame oversight & fidelity; and 4) Obsolete C2 radars \/ sensors and C2 systems lack integration with joint partners. To address these issues, JEFX initiated integration of the BMD systems, other technology, and process initiatives into the AOC weapons system with the goal of full integration into the joint counter air mission capabilities. Initiated the air sea battle concept as the relevant operational scenario for JEFX 12."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.057"
                                            },
                                            "Text": {
                                                "val": "Migrating JEFX program from a major venue to a series of LOE venues with focus on initiative integration and systems engineering.  Combining initiatives with Air Force and joint sponsored events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assessment and Transition"
                                    },
                                    "Description": {
                                        "val": "Transition successful JEFX-assessed, and Air Force approved, warfighting capabilities for fielding into an integrated C2 baseline."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Continued support for plan and design activities.  The JEFX 2012 LOEs focused on the four issues outlined per CORONA Fall 2009 direction: 1) Lack AF-wide IAMD knowledge and emphasis on strategic to tactical; 2) Significant C-NAF organization & personnel deficiencies; 3) Lack exercise, experimentation & wargame oversight & fidelity; and 4) Obsolete C2 radars\/sensors and C2 systems lack integration with joint partners. To address these issues, JEFX initiated integrated BMD systems, other technology, and processed initiatives into the AOC weapons system that allowed the integration into the joint counter air mission capabilities. Initiated the air sea battle concept as relevant operational scenario for JEFX 12."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.120"
                                            },
                                            "Text": {
                                                "val": "Continuing program transition under the JEFX Limited Objective Experiments (LOEs) from a long-lead plan to a near-term transition with the Programs of Record or initiative sponsor. Focusing upon the initiative's transition with validation through operational and technical assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management Administration (PMA)"
                                    },
                                    "Description": {
                                        "val": "Program Management Administration costs support management with engineering and technical for development and implementation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.239"
                                            },
                                            "Text": {
                                                "val": "Supported the acquisition program with engineering and technical support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.466"
                                            },
                                            "Text": {
                                                "val": "Continue to support the acquisition program with engineering and technical support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "JEFX supports evolutionary acquisition of multiple programs by providing venues and initiatives to experiment new and emerging technologies to be integrated into other systems-of-record. All contracts awarded through full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Requirements Identification and SE"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.518"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.854"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.372"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements Identification and SE (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.051"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.061"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.112"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements Identification and SE (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Spectrum"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.358"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.244"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.602"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Plan and Design"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.650"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Plan and Design (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.110"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Plan and Design (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L-3 Services"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hurlburt Field, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.843"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.043"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Develop Initiatives"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.639"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.743"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.382"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Develop Initiatives (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.367"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.202"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.569"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Develop Initiatives (2)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.252"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.527"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.170"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.320"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.180"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.215"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.395"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events (2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "98 RANWG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Nellis AFB, NV"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.125"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.115"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.240"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events (3)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.504"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.328"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.832"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Define and Build Events (4)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "46TS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.479"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Assessment and Transition"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.110"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Assessment and Transition (1)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.110"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Experiment Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Quantech PASS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.239"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.285"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.524"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Experiment Support (1)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.181"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.181"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207449F_BPAC_675140_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Requirements Identification and System Engineering"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Plan and Design"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop Initiatives"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Define and Build Events"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Assessment and Transition"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Experiments\/Product Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}