{
    "id": "80b28efa2717ea4db238aeb7e560997419e14d97",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603727D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Warfighting Program"
        },
        "R1LineItemNumber": {
            "val": "54"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.276"
            },
            "CurrentYear": {
                "val": "8.403"
            },
            "BudgetYearOne": {
                "val": "8.431"
            },
            "BudgetYearOneBase": {
                "val": "8.431"
            },
            "BudgetYearTwo": {
                "val": "8.643"
            },
            "BudgetYearThree": {
                "val": "8.910"
            },
            "BudgetYearFour": {
                "val": "9.056"
            },
            "BudgetYearFive": {
                "val": "9.232"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The level of resourcing for the Joint Warfighting Program (JWP) program reflects iterative reductions from efficiencies and budget reductions, which reduces the Department's ability to develop flexible responsive solutions to emerging war fighter needs. The OSD JWP account underwrites two related activities supporting development of the Department's joint warfighting capabilities.  In anticipation of constrained military budgets, there will be increased demand for JWP support as Combatant Commanders will be under pressure to refine their requests for supplementary capabilities to define their capability requirements, and identify potential solution options.  \n\nThe Joint Advanced Warfighting Program (JAWP) segment provides innovative and responsive analytic support on joint capability development serving the needs of joint capability clients.  It provides an independent source to examine potential remedies for mission capability gaps and can establish a framework for accelerated acquisition, subsequent field experiments, and capability demonstrations.  JAWP often represents the first effort to define alternative solutions across the range of Doctrine, Organization, Training, Material, Leadership and Personnel-Facilities.  JAWP resources sustain a small dedicated staff of civilian operation research analysts (currently hosted by the Institute for Defense Analysis – IDA).  Administered by the Joint Operations Support cell within OSD\/AT&L, the JAWP conducts an annual call for inputs from Combatant Command staffs elements that formulate Capability Gap assessments and technology based initiatives.  Project selection is undertaken in consultation with the OSD staffs serving AT&L and Policy and with elements of the Joint Staff. \n\nThe balance of JWP resources are dedicated to analytic support for joint capabilities and joint customers.  JWP provides a safety net for analytic support responding to emergent joint capability requirements and capability gaps.  Typical projects funded with JWP include translation of capability gap assessments into actionable military needs statements, identification of candidate solutions via experimentation, translation of solution concepts into field demonstrations, and remedy of joint capability gaps in partnership with Defense agents for doctrine changes and technology development.  JWP resources dedicated to direct support joint commands provides analytic expertise not normally allocated via formal staffing billets.  In this activity, JWP underwrites small grants to invigorate employment of experimentation and analysis, to formulate strategies to resolve joint capability gaps, and to stimulate participation in the Department enterprises for joint experimentation and joint capability development.  JWP resources also research and development of tools supporting joint commander analytic efforts."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.310"
                },
                "CurrentYear": {
                    "val": "8.403"
                },
                "BudgetYearOne": {
                    "val": "8.571"
                },
                "BudgetYearOneBase": {
                    "val": "8.571"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.276"
                },
                "CurrentYear": {
                    "val": "8.403"
                },
                "BudgetYearOne": {
                    "val": "8.431"
                },
                "BudgetYearOneBase": {
                    "val": "8.431"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.034"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.140"
                },
                "BudgetYearOneBase": {
                    "val": "-0.140"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY 2014 Internal Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.140"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.140"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other rogram Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.034"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 baseline adjustments support higher priorities in the departmant."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P727"
                    },
                    "ProjectTitle": {
                        "val": "Joint Warfighting"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.276"
                        },
                        "CurrentYear": {
                            "val": "8.403"
                        },
                        "BudgetYearOne": {
                            "val": "8.431"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.431"
                        },
                        "BudgetYearTwo": {
                            "val": "8.643"
                        },
                        "BudgetYearThree": {
                            "val": "8.910"
                        },
                        "BudgetYearFour": {
                            "val": "9.056"
                        },
                        "BudgetYearFive": {
                            "val": "9.232"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The OSD Joint Warfighting Program (JWP) account underwrites two related activities supporting development of the Department's joint warfighting capabilities.  In anticipation of constrained military budgets, there will be increased demand for JWP support as Combatant Commanders will be under pressure to refine their requests for supplementary capabilities.  \n\nThe Joint Advanced Warfighting Program (JAWP) segment provides innovative and responsive analytic support on joint capability development serving the needs of joint capability clients.  It provides an independent source to examine potential remedies for mission capability gaps and can establish a framework for accelerated acquisition, subsequent field experiments, and capability demonstrations.  JAWP often represents the first effort to define alternative solutions across the range of Doctrine, Organization, Training, Material, Leadership and Personnel-Facilities.  JAWP resources sustain a small dedicated staff of civilian operation research analysts (currently hosted by the Institute for Defense Analysis – IDA).  Administered by the Joint Operations Support cell within OSD\/AT&L, the JAWP conducts an annual call for inputs from Combatant Command staffs elements that formulate Capability Gap assessments and technology based initiatives.  Project selection is undertaken in consultation with the OSD staffs serving AT&L and Policy and with elements of the Joint Staff. \n\nThe balance of JWP resources are dedicated to analytic support for joint capabilities and joint customers.  JWP provides a safety net for analytic support responding to emergent joint capability requirements and capability gaps.  Typical projects funded with JWP include translation of capability gap assessments into actionable military needs statements, identification of candidate solutions via experimentation, translation of solution concepts into field demonstrations, and remedy of joint capability gaps in partnership with Defense agents for doctrine changes and technology development.  JWP resources dedicated to direct support joint commands provides analytic expertise not normally allocated via formal staffing billets.  In this activity, JWP underwrites small grants to invigorate employment of experimentation and analysis, to formulate strategies to resolve joint capability gaps, and to stimulate participation in the Department enterprises for joint experimentation and joint capability development.  JWP resources also research and development of tools supporting joint commander analytic efforts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Support for Joint Capability Analysis"
                                    },
                                    "Description": {
                                        "val": "JWP supports COCOMs by promoting the use of joint experimentation to address challenges specific to their theater or functional missions.  It aims to reinvigorate COCOM staff capabilities to employ rigorous analysis and experimentation methodologies in support of specific mission assignments. It allows COCOM staffs to identify capability gaps and explore potential solutions \"trial and error\" limited objective experiments experiment to understand a concept or technology that addresses a specific COCOM challenge."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.460"
                                            },
                                            "Text": {
                                                "val": "FY 2012 Output-\n-Initiated a pilot program with the Naval Post Graduate School to demonstrate a methodology through field experimentation that allows combatant commands to explore and identify capability performance parameters and attributes toward identifying potential solutions for capability gaps. The initial project included support to USNORTHCOM and USSOUTHCOM, and included the Department of Homeland Security.\n-USPACOM initiated an Integrated Cyber Operations project to allow for the coordination and synchronization of cyberspace operations with other war fighting domains.  The project, currently in its developmental phase, will allow USPACOM to develop, test and train on emerging cyber and electronic capabilities through experimentation, and in rigorous field validation during exercises.\n-In response to Defense Planning Guidance tasking to forge cooperative approaches to common security problems and reduce dependency on DoD, supported the development of an operational methodology and concept to describe the business practices with other U.S. Government agencies, the private sector and partner nations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.503"
                                            },
                                            "Text": {
                                                "val": "Continue the pilot program with the Naval Post Graduate School to demonstrate a methodology through field experimentation that allows combatant commands to explore and identify capability performance parameters and attributes toward identifying potential solutions for capability gaps in support of Combatant Commands.  Continue to provide resources to COCOMs to enable experimentation cells to employ joint experimentation that identifies and addresses regional capability gaps, explores potential solutions, and improves understanding of new technologies and concepts.  Empower the COCOM staffs to employ rigorous analysis and experimentation methodologies in support of their specific mission assignments, to assess their own needs critically and to examine viable capability gap solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.578"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.578"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources to COCOMs to enable experimentation cells to employ joint experimentation that identifies and addresses regional capability gaps, explores potential solutions, and improves understanding of new technologies and concepts.  Empower the COCOM staffs to employ rigorous analysis and experimentation methodologies in support of their specific mission assignments, to assess their own needs critically and to examine viable capability gap solutions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Advanced Warfighting Program (JAWP)"
                                    },
                                    "Description": {
                                        "val": "The Joint Advanced Warfighting Program (JAWP) segment provides innovative, responsive and timely analytic support on joint capability development serving the needs of Combatant Commanders.  It provides an independent source to examine potential remedies for mission capability gaps and can establish a framework for subsequent field experiments, capability demonstrations or accelerated acquisition.  JAWP often represents the first effort to define alternative solutions across the range of Doctrine, Organization, Training, Material, Leadership and Personnel-Facilities.  JAWP resources underwrite a small dedicated staff of civilian military operation research analysts (currently hosted by the Institute for Defense Analysis - IDA).  Administered by the Joint Operations Support cell within OSD\/AT&L, the JAWP conducts an annual call for inputs from Combatant Command staffs elements that formulate Capability Gap assessments and technology based initiatives.  Project selection is undertaken in consultation with the OSD staffs serving AT&L and Policy and with elements of the Joint Staff."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.816"
                                            },
                                            "Text": {
                                                "val": "FY 2012 Output- \n–Initiated a comprehensive survey of Department of Defense modeling & simulation (M&S) tools to identify and characterize campaign, and mission models. Delivered a framework that detailed models and analytical tools for Joint Staff and OSD(Policy) planners.\n-Analyzed and assessed the Integrated Gaming System to determine the needs of the combatant commands planners’ use of tools and gaming to support the Adaptive Planning and Execution (APEX) process.\n-Conducted an in-depth analysis of the Naval Post Graduate approach to field experimentation and capability demonstration and its applicability for combatant commands to leverage in order to identify and refine capability performance attributes for potential solutions to capability gaps.\n-Developed and assessed alternative joint US campaign-level courses of action relevant to four future defense planning scenarios in support of OSD(Policy).\n-In support of USAFRICOM, identified and analyzed how Somali pirate methodology to network and move, store and spend their money resources.\n-In support of USCENTCOM, analyzed the effectiveness of brigade-level activities using data from Regional South Command in Afghanistan focusing on non-kinetic activities including counter threat finance cells, biometrics, provincial reconstruction teams, and development assistance projects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.900"
                                            },
                                            "Text": {
                                                "val": "The Joint Advanced Warfighting Program (JAWP) segment will provide innovative, responsive and timely capability development pathways and recommendations for field experiments conducted by Combatant Commands, and approaches for rapid acquisition.  It will provide an independent source for enabling capability development suitable for joint experimentation undertaken by the joint Commands.  The findings of these investigative analyses frequently explore joint capability development via experiments and prototype demonstrations leading toward potential material solutions.  It will enable COCOMs to do experiments in the field that addresses regional capability gaps, explores potential solutions, and improves understanding of new technologies.  Empower the COCOM staffs to employ rigorous analysis methodologies in support of their specific mission assignments, to assess their own needs critically and to examine viable capability gap solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.853"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.853"
                                            },
                                            "Text": {
                                                "val": "The Joint Advanced Warfighting Program (JAWP) segment will provide innovative, responsive and timely capability development pathways and recommendations for rapid acquisition, field experiments conducted by Combatant Commands.  It will provide an independent source for enabling capability development suitable for joint experimentation undertaken by the joint Commands.  The findings of these investigative analyses frequently explore joint capability development via experiments and prototype demonstrations leading toward potential material solutions.  It will enable COCOMs to do experiments in the field that addresses regional capability gaps, explores potential solutions, and improves understanding of new technologies.  Empower the COCOM staff s to employ rigorous analysis and experimentation methodologies in support of their specific mission assignments, to assess their own needs critically and to examine viable capability gap solutions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance is measured through metrics including (1) objective validation of enhanced COCOM capabilities to perform joint missions in their assigned theaters and areas of responsibility, (2) documented delivery effective joint operational concepts, (3) confirmed production of refined and validated capability descriptions."
                        }
                    }
                }
            ]
        }
    }
}