{
    "id": "8b3d526468765724be362759a095d2dd3f08fc44",
    "meta": {
        "filename": "dod-2014_RDTE_2014_SOCOM_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.zzz_unzipped_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160478BB"
        },
        "ProgramElementTitle": {
            "val": "Soldier Protection and Survival Systems"
        },
        "R1LineItemNumber": {
            "val": "266"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "4.521"
            },
            "PriorYear": {
                "val": "2.647"
            },
            "CurrentYear": {
                "val": "4.263"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "11.431"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY 2014, this PE 1160478BB \"Soldier Protection and Survival Systems\" has been consolidated in SOCOM PE 1160431BB \"Warrior Systems.\"The \n\nNational Defense Authorization Act of 2010 directed a separate project (S385A) be created for ballistic protection efforts within the existing program element."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides for development, testing, and integration of specialized equipment to meet the unique soldier protection and survival requirements of Special Operations Forces (SOF).  Specialized equipment will improve survivability and mobility of SOF while conducting varied missions. These missions are generally conducted in harsh environments, for unspecified periods, and in locations requiring small unit autonomy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.971"
                },
                "CurrentYear": {
                    "val": "4.263"
                },
                "BudgetYearOne": {
                    "val": "3.890"
                },
                "BudgetYearOneBase": {
                    "val": "3.890"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.647"
                },
                "CurrentYear": {
                    "val": "4.263"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.324"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.890"
                },
                "BudgetYearOneBase": {
                    "val": "-3.890"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.247"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.077"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.890"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.890"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: \n\nFY 2012: Decrease of ( -$0.077) million is due to a funds transfer to Small Business Innovative Research and -($0.247) million was reprogrammed for higher command priorities.\n\nFY 2013: None.\n\nFY 2014:  Decrease of of -$3.890 million has been consolidated in SOCOM PE 1160431BB \"Warrior Systems.\"\nSchedule: None.\n\nTechnical: None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S385"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Protection and Survival Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.521"
                        },
                        "PriorYear": {
                            "val": "1.776"
                        },
                        "CurrentYear": {
                            "val": "3.383"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.680"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "• This project provides specialized equipment to meet the unique soldier protection and survival requirements of Special Operations Forces (SOF) to include: Army Rangers; Army Special Forces; Navy Sea, Air, Land (SEAL) teams; Navy Special Boat Units; Air Force Special Tactics Operators; and Marine Forces Special Operations Command.  Specialized equipment improves survivability protection from the environment and load bearing equipment to improve the mobility of SOF while conducting varied missions.  These missions are generally conducted in harsh environments, for unspecified periods and in locations requiring small unit autonomy. \n\n• SOF Personal Equipment Advanced Requirements (SPEAR) program provides for the research, development, testing and evaluation of a variety of individual and survival equipment to include: ballistic and environmental protective systems, combat uniforms, load carriage systems, communications headsets, and visual augmentation system (VAS) mounts.  NOTE: In compliance with the National Defense Authorization Act of 2010, resources to support ballistic protection efforts were moved from SPEAR to a separate project (S385A) beginning in FY 2012.\n\n• Tactical Combat Casualty Care (TCCC) provides medical devices, ancillary equipment and Casualty Evacuation (CASEVAC) sets for SOF. The CASEVAC program procures a suite of Food and Drug Administration approved medical items including,but not limited, to intraosseous infusion devices, patient monitoring and assessment devices, emergency airway kits, as well as devices that provide SOF the capability to support extraction, extrication,  mobility, transportation, and sustainment of casualties in forward areas.  This program fields tactical medical and CASEVAC capabilities with the intention to transition capabilities developed under the National Mission Force Tactical Medical Programs.  This capability provides significant ability to lessen battlefield losses by providing timely, critical lifesaving and evacuation capabilities to the forward-deployed SOF operators. \n\n• Radio Counter-Improvised Explosive Device (RC-IED) program provides SOF with the ability to counter current and future radio controlled improvised explosive devices threats used by terrorist networks.  NOTE: The RC-IED efforts were conducted in the program element 1160408BB.  The resources for these efforts were split beginning in FY 2013 to support the SOF theater force requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SPEAR"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.776"
                                            },
                                            "Text": {
                                                "val": "Continued Flame\/Blast characterization testing of environmental protection clothing systems [was delayed due to lack of performance of current material solutions, maturity of technology and to leverage dollars spent from other Services]. Continued increased thermal protective capabilities of the protective combat uniform and validation of pre-planned product improvements (P3I). Completed characterization effects of temperature on high loft textiles.  Continued development of lightweight\/high performance materials for personal and load carriage equipment.  Initiated testing of waterproof breathable materials.  Conducted investigating perceptual encapsulation and load effects on survivability and marksmanship.  Continued Radio Frequency, acoustics testing of Modular Integrated Communications Helmet individual communications headsets to enhance operator lethality and survivability.  Initiated testing and validation of test methodologies for safety belts and lanyards used to protect the operator during mobility operations.  Continued signature management testing in order to reduce operators’ visual signature on the battlefield."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.350"
                                            },
                                            "Text": {
                                                "val": "Provide continuation of profile refinement to support signature management, reactive fiber testing and material research for uniforms.  Develops a solicitation for an advanced maritime communications system.  Develop and test safety belt, lanyard efforts.  In addition, test of nano-coatings for water repellency for individual equipment.  Continue on-going prototype testing and research on load effects for survivability and marksmanship."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RC-IED"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.033"
                                            },
                                            "Text": {
                                                "val": "Provide for National Assessment Group test support to the  RC-IED program. Support system engineering, test and evaluation, test article acquisition, and market research of the RC-IED programs.  Maintain range effectiveness and currency, ensuring the ability to accurately test against current and emerging threat systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0607SPSS"
                                    },
                                    "Title": {
                                        "val": "Soldier Protection and Survival Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.262"
                                        },
                                        "CurrentYear": {
                                            "val": "15.153"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "50.415"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "• SPEAR primarily takes advantage of modified commercial off- the- shelf (COTS) or non-developmental items (NDI) through open competition.  The majority of SPEAR purchases are made with O&M.  \n\n• TCCCE CASEVAC takes advantage of COTS equipment and\/or NDI.  A Fixed Firm Price Indefinite Delivery\/Indefinite Quantity contract was awarded in the 4th quarter of FY 2011. \n\n• RC-IED - Resources support the completion of the FY 2011 initiated development and overall effectiveness and operational suitability testing of the SOF-Unique Next Generation Electronic Countermeasure (ECM) \/ Ground-Based, Counter Radio-Controlled Improvised Explosive Device Warfare (CREW) system."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SPEAR MICH Land\/Maritime Communication System"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.350"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.302"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.109"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".761"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Protective Combat Uniform (PCU)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.361"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.426"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.287"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Load Carriage System (LCS) and Backpacks"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.050"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".250"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Modular Glove System (MGS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".100"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Environmental Clothing Testing\/P3I"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.387"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.373"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".910"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Signature Management Profile Characterization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.300"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.249"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.391"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".940"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "LCS\/BAV\/Backpack Material and Prototype Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.187"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.160"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".447"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MGS Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".100"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Maritime Comms Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.310"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.266"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.276"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "National Assessment Group RC-IED Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "National Assesment Group"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirkland AFB, NM and Fort Bragg, NC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.033"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.033"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.576"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.576"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "SPEAR Protective Combat Uniform (PCU)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Reactive Fiber Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "PCU P3I"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Signature Management Profile Characterization"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Materials Research"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Modular Glove System"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Market Research, Lightweight Power for Active Heating"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR MICH Comms"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Market Research\/Interoperability Assessment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Maritime Comms Develop"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR LCS, Body Armor Vest (BAV and Backpacks)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "LCS\/BAV\/Backpack Material and Prototyping Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Safety Belt and Lanyard Test Methods"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Testing Water Repellant Nanocoatings"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Load Effects on Survivability"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RC-IED"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "NAG RC-IED Test Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S385A"
                    },
                    "ProjectTitle": {
                        "val": "Theater Body Armor and Associated Equipment"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.871"
                        },
                        "CurrentYear": {
                            "val": "0.880"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.751"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides specialized equipment to meet the unique soldier protection and survival requirements of SOF, to include: Army Rangers; Army Special Forces; Navy Sea, Air, Land (SEAL) teams; Navy Special Boat Units; Air Force Special Tactics Operators; and Marine Forces Special Operations Command. Specialized ballistic equipment improves survivability and load bearing equipment impacting the mobility of SOF while conducting varied missions. These missions are generally conducted in harsh environments, for unspecified periods and in locations requiring small unit autonomy. \n\nThis budget line enhances the SPEAR program by supporting body armor plates, soft armor, helmets, and eye protection.  It also provides for the research, development, and testing of a variety of body armor and personal protective equipment. Creation of a separate project for ballistic protection efforts was directed in the National Defense Authorization Act of 2010."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOF Personal Equipment Advanced Requirements (SPEAR)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.871"
                                            },
                                            "Text": {
                                                "val": "Conducted high elevation ammunition testing and threat validation to assess effectiveness of fielded armor systems.  Continued research on advanced NDI of body armor systems and material\/density exploitation in support of a next generation armor plate and helmet.  Conducted material testing and prototype evaluation of advanced body armor designs; baseline testing and development of specifications for a next generation helmet .  Conducted market survey and evaluation of transparent ballistic lens products in preparation for development of a future Special Operations Eye Protection capability. Conducted helmet behind armor effects ballistic testing to assess performance of a fielded helmet system. Performed laboratory testing of helmet sensor technology with a fielded helmet."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.880"
                                            },
                                            "Text": {
                                                "val": "Continue foreign ammunition testing and threat validation to assess armor effectiveness.  Continue the helmet design and blast studies. Conduct body armor material research and testing along with the soldier load analysis and on behind armor effects.    Conduct evaluation of transparent armor products which include ballistic and optical testing of transition lenses.  Initiate work on anti-fogging technologies and  continues development of low visibility eyewear to supportfuture Special Operations Eye Protection capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "SPEAR ballistic protection equipment takes advantage of modified commercial-off-the-shelf or non-developmental items acquired through full and open competition.  Currently these SPEAR purchases are made with O&M.  As USSOCOM requirements are different from those of the Services, items leveraged from industry are often on the cutting edge of technology and require substantial testing in the SOF environments.  Some SPEAR ballistic systems have transitioned to the U.S. Army, other services and other government agencies."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "N\/A."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Body Armor"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".300"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Laser Eye Protection"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".050"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Body Armor Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.568"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.380"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".948"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Lightweight Helmet Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.239"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".339"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Transparent Armor Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM-SSES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.064"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".114"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Body Armor (BA)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Market Survey (Pre-Solicitation)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Verification Testing (Pre-Validation)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Soldier Load Analysis Research and Perceptual Encapsulation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "BA Materials\/Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR Eye Protection"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Market Survey"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ballistic & Optical Development of Transition Lenses"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Anti-Fogging Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Low Visibility Eyewear"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPEAR Ballistic\/Life Support"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Threat Validation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Foreign Ammunition Exploitation Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Non-Destructive Inspection Development & Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Helmet Design Research"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Next Generation Helmet"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Next Generation Lightweight Materials"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Behind Armor Effects"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Slow Impact Research"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Material Development\/Analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Blast Research"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}