{
    "id": "8c05c7824eddc836f3ce42039ee82878c8e1e324",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DARPA_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603760E"
        },
        "ProgramElementTitle": {
            "val": "COMMAND, CONTROL AND COMMUNICATIONS SYSTEMS"
        },
        "R1LineItemNumber": {
            "val": "57"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "246.476"
            },
            "CurrentYear": {
                "val": "237.859"
            },
            "BudgetYearOne": {
                "val": "239.078"
            },
            "BudgetYearOneBase": {
                "val": "239.078"
            },
            "BudgetYearTwo": {
                "val": "216.950"
            },
            "BudgetYearThree": {
                "val": "231.448"
            },
            "BudgetYearFour": {
                "val": "263.980"
            },
            "BudgetYearFive": {
                "val": "260.951"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Command, Control and Communications Systems program element is budgeted in the Advanced Technology Development Budget Activity because its purpose is to demonstrate and evaluate advanced information systems research and development concepts.\n\nThe goals of the Command and Control Information Systems project are to develop and test innovative, secure architectures and tools to enhance information processing, dissemination and presentation capabilities for the commander.  This will give the commander insight into the disposition of enemy and friendly forces, a joint situational awareness picture that will improve planning, decision-making and execution support capability and provide secure multimedia information interfaces and assured software to \"on the move\" users.  Integration of collection management, planning and battlefield awareness programs is an essential element for achieving battlefield dominance through assured information systems.\n\nThe goals of the Information Integration Systems project are to take diverse data inputs from a variety of sources, efficiently disseminate the information, and perform distributed and dynamic all-source correlation and fusion to produce an integrated, geo-spatially referenced, battlefield database and knowledge-base.  The principal element of this project is assured communications using standard and non-traditional means, on and off the battlefield.\n\nThe goals of the Secure Information and Network Systems project are to develop and test emerging computer and network systems where the impact of the systems and the vulnerabilities of the systems are not kinetically based.  Computer and network security technologies arising from other projects will be further identified, developed, integrated, and tested."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "261.606"
                },
                "CurrentYear": {
                    "val": "237.859"
                },
                "BudgetYearOne": {
                    "val": "244.941"
                },
                "BudgetYearOneBase": {
                    "val": "244.941"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "246.476"
                },
                "CurrentYear": {
                    "val": "237.859"
                },
                "BudgetYearOne": {
                    "val": "239.078"
                },
                "BudgetYearOneBase": {
                    "val": "239.078"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-15.130"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.863"
                },
                "BudgetYearOneBase": {
                    "val": "-5.863"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-8.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-7.130"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-5.863"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.863"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Decrease reflects reductions for the SBIR\/STTR transfer and an internal below threshold reprogramming.\n\nFY 2014:  Decrease reflects completion of research efforts in the Command and Control Information Systems (CCC-01), and Secure Information and Network Systems (CCC-04) projects, partially offset by expanded efforts in the Information Integration project (CCC-02) and Project CCC-06."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CCC-01"
                    },
                    "ProjectTitle": {
                        "val": "COMMAND & CONTROL INFORMATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.815"
                        },
                        "CurrentYear": {
                            "val": "16.487"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Military operations since the end of the Cold War show theater-level command, control, communications, and intelligence\/information systems lack the ability to fully support operations in complex, time-critical environments.  Warfighters must be prepared for operations ranging from peacekeeping in urban centers to heavy battle actions in remote areas.  Current capabilities do not provide the commander with real-time, secure, situational awareness or the ability to orchestrate high-tempo planning, rehearsal, and execution.  The programs in this project are developing and testing innovative, secure architectures and tools to enhance information processing, dissemination, and presentation capabilities.  These will provide the commander with insight into the disposition of enemy and friendly forces, a joint situational awareness picture that will improve planning, decision-making, and execution, secure multimedia information interfaces, and software assurance to the warfighter \"on the move.\"  Integration of collection management, planning, and battlefield awareness are essential elements for achieving battlefield dominance through assured information systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ZETA"
                                    },
                                    "Description": {
                                        "val": "The ZETA program is exploring the aspects of novel physical devices, concepts, and techniques that leverage quantum physics for information technology.  Research in this area has the ultimate goal of demonstrating information technology components with radical improvements in power efficiency and\/or computational power relevant to military applications and opportunities.  The program will transition via industrial performers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.815"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated improved performance of quantum devices with reduced decoherence.\n-  Refined numerical models of quantum devices by including more physical processes in order to better understand their operation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.487"
                                            },
                                            "Text": {
                                                "val": "-  Perform small-scale demonstration of key physical devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resilient Command and Control (RC2)"
                                    },
                                    "Description": {
                                        "val": "The Resilient Command and Control (RC2) program developed a general framework and set of critical mission assurance capabilities to enable Commanders and their staffs to manage the array of C2 systems and architectures (sensor, communications, and information processing) used to conduct operations.  These adaptive, resilient C2 resource planning and re-planning capabilities enabled mission success in the face of C2 system outages.  Specific technologies developed under RC2 included advanced analysis, visualization, and planning tools that provided Commanders and their staffs with a dashboard to enhance situation awareness of the C2 architectures and understand the mission impact of outages.  The RC2 tools and technologies enabled operators to detect anomalous behavior via intuitive information displays; assess business function impact, including second- and third-order effects; and re-plan how the system can be used to achieve organizational goals and priorities.  A transition plan was developed with the Navy PEO C4I Maritime Tactical Command and Control program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Enhanced situational awareness tools by adding dynamic visualization capabilities.\n-  Conducted experiments with users at PACFLT.\n-  Investigated early transition opportunities with Navy PEO C4I Maritime Tactical Command and Control program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-02"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION INTEGRATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "125.106"
                        },
                        "CurrentYear": {
                            "val": "122.669"
                        },
                        "BudgetYearOne": {
                            "val": "137.213"
                        },
                        "BudgetYearOneBase": {
                            "val": "137.213"
                        },
                        "BudgetYearTwo": {
                            "val": "112.794"
                        },
                        "BudgetYearThree": {
                            "val": "133.078"
                        },
                        "BudgetYearFour": {
                            "val": "233.980"
                        },
                        "BudgetYearFive": {
                            "val": "247.451"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The success of military operations depends on timely, reliable, secure, and synchronized dissemination of command and control and relevant situational awareness information to every military echelon.  While wired communications and networks are fairly well developed, providing assured high-bandwidth mobile wireless capabilities that match or exceed commercial wired infrastructure is needed to meet the demands of military users.  The goal of the Information Integration Systems project is to develop and demonstrate technologies that will provide effective communications to U.S. forces.  Approaches to this goal include developing technologies that increase network capacity and scaling, enhance spectrum efficiency in congested spectrum, tolerate network degradation, provide man-made and natural electromagnetic interference mitigation, defeat network reconnaissance and surveillance, counter denial of service and other threats, and autonomously move relevant information from the cloud to the edge."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Communications Under Extreme RF Spectrum Conditions (CommEx)"
                                    },
                                    "Description": {
                                        "val": "The Communications Under Extreme RF Spectrum Conditions (CommEx) program will develop signal detection and reasoning technology that will allow radios to recognize interference and jamming attacks and then adapt to maintain communications, even in the presence of cognitive jammer attacks and dynamic interference of multiple cognitive network interactions.  The program will develop models of adversary, commercial, and friendly cognitive radios and implement those models in a reasoner that assesses, in real time, the current and future dynamics of the communications network.  Core technologies for operation in highly dynamic and\/or high jamming to signal environments will be developed to include: automated jamming waveform forensics; local environment assessment (time, space, frequency, polarization); technologies for addressing known attack strategies and interference properties; and antenna, signal processing, modulation, and network optimization technologies.  Based on predictions of the level of communication success compared to mission communication requirements, the reasoner within the cognitive radio will choose waveform selections\/configurations that best achieve mission objectives.  The reasoner will include the capability to analyze and select optimum frequency, waveform, and network configurations during all aspects of a mission.  The design effort will lead to new radio communication architectures, more robust radio communication networking, and better understanding of selection amongst interference avoidance and interference suppression strategies.  This program also seeks to enable communication between dispersed and distributed emitters and receivers to provide a multiplier in capacity for both locating emitters and assessing effectiveness of an electronic attack.  The CommEx technology is planned for transition to the U.S. Army, Air Force, and Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.253"
                                            },
                                            "Text": {
                                                "val": "-  Developed and demonstrated two cycles of government evaluated computer model simulations of spectrum analysis, reasoning about interference mitigation choices, interference mitigation, and reasoning update logic.\n-  Demonstrated algorithms to measure cognitive radio jammers and communication network behaviors that characterize state space and behavior of the jammers.\n-  Demonstrated ability of smart antenna technology to create deep nulls.\n-  Integrated live hardware into detailed experiments to assure that dynamic range, realistic multipath and clutter, and implementation-specific simulations are analyzed with sufficient rigor to assure performance in live hardware.\n-  Performed experiments and simulations that model legacy waveforms and interference sources not previously seen by the system. \n-  Developed hardware, firmware, and software using CommEx technologies, and corresponding application programming interfaces and drivers in the radio to understand and control system performance. \n-  Emulated hardware, firmware, and software using prototyping technologies, and developed corresponding application programming interfaces and drivers to understand and control system performance.\n-  Demonstrated distributed Multiple-Input Multiple-Output (MIMO) techniques for spatial beam control, interference mitigation, and communication range extension on testbeds."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.265"
                                            },
                                            "Text": {
                                                "val": "-  Perform third cycle of government performance evaluation for computer model simulations of spectrum analysis, reasoning about interference mitigation choices, interference mitigation, and reasoning update logic. \n-  Execute designs of system technologies to address the specific application(s) and platform(s) required for military operations. \n-  Perform laboratory experiments utilizing unknown attack strategies to validate developed mitigation techniques.\n-  Complete system design that addresses technology insertion within size, weight and power constraints.\n-  Utilize properties and limitations of existing jammer technologies to assess performance.\n-  Demonstrate the ability to learn and rapidly recognize behavior patterns of various types of attacks against advanced radios.  \n-  Perform laboratory experiments with brassboard and realistic communication systems to validate performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "-  Validate the size, weight, power, cost, and network overhead of systems that implement the principles developed in this program.\n-  Integrate the developed detailed technology and algorithms into specific hardware and platforms to assure that dynamic range, realistic multipath and clutter, and other implementation specifics can be integrated into communication system.\n-  Develop architecture to allow CommEx technology to be inserted into assessment platforms for military utility. \n-  Conduct field evaluations and demonstrations to determine military utility."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computational Leverage Against Surveillance Systems (CLASS)"
                                    },
                                    "Description": {
                                        "val": "Commercial Test and Measurement equipment has advanced greatly with the emergence of sophisticated cellular and wireless local area network technology and can be used to intercept, analyze and exploit our military communications signals.  The Computational Leverage Against Surveillance Systems (CLASS) program seeks new ways to protect our signals from exploitation by increasingly sophisticated adversaries and to do so in a way that can be maintained as commercial technology advances.  Three different techniques are being developed: 1) Waveform Complexity uses advanced communications waveforms that are difficult to recover without knowledge and understanding of the signals itself; 2) Spatial Diversity uses distributed communications devices and the communication environment to disguise and dynamically vary the apparent location of the signal; 3) Interference Exploitation makes use of the clutter in the signal environment to make it difficult for an adversary to isolate a particular signal.  The objective of the program is to make modular communications technology that is inexpensive to incorporate in existing and emerging radio systems (<$100 incremental cost) but pushes adversaries to need more than 1,000x our processing power - supercomputer-level processing power.  Another track of the program will extend the CLASS technology to provide Low Probability of Intercept (LPI) communications.  These techniques will reduce the detectability of communications signals by a factor of 1,000x beyond current capabilities.  Scalable performance will allow LPI techniques to better trade information rate for communications capacity.  Technologies from this program are planned to transfer to the U.S. Army (for ground system applications) and to USAF (for airborne applications)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.937"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of waveform complexity and interference exploitation technologies.\n-  Initiated the integrated circuit system integration process.\n-  Completed test bed development and evaluated the performance of candidate technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.200"
                                            },
                                            "Text": {
                                                "val": "-  Integrate hardware and firmware technology into volume integrated circuits.\n-  Develop test and application driver software for CLASS technology.\n-  Initiate development of modular CLASS products.\n-  Develop Low-probability of Detection\/Low-probability of Intercept (LPD\/LPI) signaling techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.000"
                                            },
                                            "Text": {
                                                "val": "-  Finalize design of CLASS RF and Modem integrated circuits.\n-  Integrate application driver software for CLASS technology.\n-  Produce modular CLASS products.\n-  Develop concepts for integrating CLASS technologies with aircraft antennas and communications equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Content-Based Mobile Edge Networking (CBMEN)"
                                    },
                                    "Description": {
                                        "val": "The CBMEN program's goal is to provide tactical warfighters operating at the edge with interactive, on-demand access to relevant information and a greater ability for real-time sharing of new operational content.  This content can include images, video, maps, situational awareness, and command and control information.  Advances in communications technologies are enabling high-capacity communications to the edge.  However, the current centralized or regional storage and dissemination of information presents reliability and capacity challenges with distributing relevant information to users at the edge.  Commercial industry has developed approaches to the autonomous dissemination of high demand information by using distributed servers and advanced networking and information database technologies, combined with highly-reliable fixed networking infrastructure with embedded complex information exploitation tools.  The commercial system is enabled by infrastructure (e.g. fiber optic networks) that is not available to the warfighter at the edge.  This program will leverage commercial technologies to develop, prototype, and demonstrate the networking technologies and information dissemination techniques needed to enable efficient and robust content distribution using dynamic, mobile, ad hoc military networks.  CBMEN will be installed and demonstrated on existing radios.  Capabilities from this effort will transition to the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.206"
                                            },
                                            "Text": {
                                                "val": "-  Developed base and objective metrics for scenarios and simulation development for program evaluation and analysis.\n-  Developed software architectures for distributed data dissemination and technologies for dynamic networks.\n-  Implemented a test and evaluation framework to enable quantitative evaluation of capabilities via emulated or over-the-air networks. \n-  Performed over-the-air testing of basic CBMEN software on military and commercial radio networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.831"
                                            },
                                            "Text": {
                                                "val": "-  Develop extended small unit scenarios for simulation and demonstration.\n-  Extend CBMEN software architecture for security and efficiency.\n-  Integrate hardware and software products to demonstrate CBMEN technologies in small unit scenario.\n-  Demonstrate limited content applications in a dynamic small unit mobile environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.363"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.363"
                                            },
                                            "Text": {
                                                "val": "-  Develop objective metrics for advanced scenarios and simulation development for program evaluation and analysis.\n-  Develop representative military small unit scenarios for simulations, over-the-air testing, and demonstration.\n-  Demonstrate CBMEN software for content naming, distribution, management, and security in a dynamic mobile environment.  \n-  Begin advanced development of CBMEN enabling technologies with increased scale, dynamics, and content rich applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Hotspots"
                                    },
                                    "Description": {
                                        "val": "Communications requirements are growing exponentially due to the proliferation of high-data rate sensors (full motion video), Unmanned Aerial Vehicles (UAVs), and the emergence of the Soldier\/Marine as both an operator and a sensor within military networks.  However, limited spectrum availability results in a large disparity between capacity need and availability.  Mobile Hotspots will develop an airborne high capacity data distribution network to interconnect groups of tactical users in a manner that is conceptually similar to the commercial tiered approach interconnecting cell towers and wireless hotspots.  Mobile Hotspots will exploit advances in millimeter-wave technology and airborne networking to develop a self-organizing, 1 Gbps mobility backbone formed from highly-directional communications links to interconnect mounted and dismounted warfighters, dispersed tactical operations centers, and intelligence, surveillance, and reconnaissance (ISR) assets.  Low size, weight and power designs will be integrated with commercial and military communications equipment and mounted on tactical UAVs and ground vehicles to provide network access to mobile users via infrastructureless hotspots that are compatible with existing radios.  The Mobile Hotspots program is targeted to transition to the Army and Marine Corps Expeditionary Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.980"
                                            },
                                            "Text": {
                                                "val": "-  Initialized development of gimbaled antennas, efficient high-power millimeter wave amplifiers, and airborne networking technologies.\n-  Began development of detailed system and network architecture designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.100"
                                            },
                                            "Text": {
                                                "val": "-  Explore steerable antenna concepts, self-organizing network protocols, and efficient power amplifier implementations in a network topology to include UAVs, dismounted soldiers, and mobile platforms.\n-  Explore variable data rates, signal processing and ad-hoc networking as a means to achieve extensions in range under varying environmental and weather conditions.\n-  Evaluate capabilities of critical technologies in ground-based laboratory and field evaluations.\n-  Create a system design for integration into a UAV pod and onto a tactical ground vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.450"
                                            },
                                            "Text": {
                                                "val": "-  Manufacture antenna, amplifier, modem, and networking hardware needed to implement a self-organizing network comprising at least five hotspot nodes interconnected by 1 gigabit per second point-to-point millimeter-wave links to form a mobility backbone.\n-  Integrate the Mobile Hotspots technology into pods for mounting on UAVs and tactical ground vehicles.\n-  Evaluate initial capabilities of the Mobile Hotspot prototype network and millimeter-wave mobility backbone in an initial ground-based field experiment.\n-  Identify and implement system and subsystem improvements in preparation for final field experimentation and flight tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wireless Network after Next (WNaN) and Advanced Wireless Networks for the Soldier (AWNS)"
                                    },
                                    "Description": {
                                        "val": "The Wireless Network after Next (WNaN) and Advanced Wireless Networks for the Soldier (AWNS) program goals are to develop and demonstrate technologies and system concepts that will enable densely deployed radio networks to compensate for limitations of the physical layer of a low-cost wireless node.  WNaN\/AWNS networks will manage node configurations and the topology of the network to reduce the demands on the physical and link layers of the network.  The technology created by the WNaN\/AWNS effort will provide reliable and available battlefield communications at low system cost.  This program will also improve the hardware, firmware, and software to allow the integration of the Joint Tactical Radio System (JTRS) Soldier Radio Waveform (SRW) for backward interoperability to legacy communication systems.  AWNS is also investigating the integration of Multi-User Detection (MUD) and Multiple-Input Multiple Output (MIMO) technology into the WNaN radio platform to position these technologies for transition into the WNaN radio node.  In addition, this effort will investigate Wireless Distributive Computing (WDC), Content Based Access (CBA), and smart antenna technology to enhance the network and node ability to understand the operating environment, mission concept of operations, and node responsibilities to assist in data processing, information dissemination, and accomplishment of military mission objectives.  In addition, this program will develop a low-cost handheld\/body wearable wireless node that can be used to form high-density ad hoc networks and gateways to the Global Information Grid.  This program will also develop robust networking architecture(s) and network technologies\/processes that will exploit high-density node configurations.  AWNS technology is planned for transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.531"
                                            },
                                            "Text": {
                                                "val": "-  Performed WNaN System Evaluation with the Army at Ft. Bliss National Integration Experiment 12.1.\n-  Developed and ported network software to a production-ready version of the WNaN radio. \n-  Integrated and demonstrated MUD and MIMO into the WNaN radio as standalone, single function capabilities to establish the feasibility of integrating these waveforms in the WNaN hardware.  \n-  Integrated Wireless Distributed Computing (WDC), Content Based Access (CBA), and associated networking functions to support transformation application functionality.\n-  Demonstrated smart antenna functions of beamforming and null steering.\n-  Developed image and full motion video encoding and decoding capability with robustness appropriate to wireless ad hoc networks.\n-  Developed algorithms and expanded performance capabilities to enable network scaling to >1,000 nodes.\n-  Performed experiments utilizing transformational applications within the WNaN node.\n-  Performed experiments to determine Dynamic Spectrum Access utility to share spectrum with other tactical communication systems.\n-  Developed V4 version of the WNaN radio."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.565"
                                            },
                                            "Text": {
                                                "val": "-  Integrate smart antenna capabilities into radio nodes.\n-  Demonstrate capability to integrate additional transformation applications in an integrated network environment.\n-  Integrate MIMO, WDC, advanced Dynamic Spectrum Awareness, and related technologies into the network capabilities to improve network performance, and increase network scalability without increasing spectrum need.\n-  Commence network integration evaluations and field experiments with Marine Corps, Army, Air Force, and Navy to establish feasibility and utility for transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete demonstration of network scaling to support brigade-level utility and scalability to a large numbers of nodes.\n-  Complete network integration evaluations and field experiments with Marine Corps, Army, Air Force, and Navy to establish feasibility and utility for transition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fixed Wireless at a Distance"
                                    },
                                    "Description": {
                                        "val": "Unlike commercial wireless communications, the military cannot count on a set of secure, fixed cell towers to establish wireless networks capable of receiving and distributing large amounts of data from distributed sources.  Rather, such communication must rely on approaches such as balloons and temporary communication towers that have a high logistical burden and are extremely vulnerable.  Building upon technologies investigated under other programs in this project, the Fixed Wireless at a Distance program will overcome these limitations by developing a re-locatable, long-range (10-100s of km) communication infrastructure that provides high-capacity (10s of megabits per second) data links from within a protected space.  The key innovation in this program is the use of a large number of rapidly deployable, distributed, ground-based antenna arrays that can form a coherent aperture for directional transmission and reception of information to\/from tactical wireless networks.  Program challenges include the fundamental limits (power and extent) of transmitter gain as well as the rapid and practical deployment of the ground-based arrays.  When completed, the Fixed Wireless at a Distance program will extend the reach of tactical communication systems by 10X without the need for vulnerable and costly infrastructure."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.100"
                                            },
                                            "Text": {
                                                "val": "-  Assess the fundamental limits of transmitter gain for a distributed ground-based wireless network.\n-  Initiate assessment of ground-based array to determine the required characteristics (number or antennas, spatial diversity, power) to enable 10X improvement in the range of tactical communication systems.\n-  Develop concepts for rapidly deploying and re-deploying antenna arrays.\n-  Develop networking concepts to allow legacy military Mobile ad-hoc networks to make effective use of Fixed Wireless infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "-  Build prototype infrastructure module supporting 4 channels divided between a legacy military waveform selected in the 2013 effort, and a CLASS extended range waveform.\n-  Develop and test networking software in a simulation environment to support mobile ad hoc communications with infrastructure.\n-  Measure network performance improvement, throughput and pervasiveness, comparing Mobile Ad Hoc Network with Gateway, and Fixed Wireless network protocol.\n-  Develop self-organizing communications software to automatically configure distributed communication systems without operator configuration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced RF Mapping"
                                    },
                                    "Description": {
                                        "val": "One of the key advantages on the battlefield is the ability to actively sense and manipulate the radio frequency (RF) environment, enabling reliable and assured communications, as well as effectively mapping and manipulating the adversary's communications in ways that defy their situational awareness, understanding, or response.  Current approaches are emitter-based, with the signal processing techniques focused on array and time-based processing for each emitter.  As the RF environment becomes more complex and cluttered, the number of collection assets and the required level of signal processing inhibits our capability to pervasively sense and manipulate at the precision (time, frequency, and space) required for effective action.  To address these and other shortfalls, the Advanced RF Mapping program will develop and demonstrate new concepts for sensing and manipulating the RF environment based on distributed rather than centralized collection.  This approach will take advantage of the proliferation of RF devices, such as radios and cell phones, on the battlefield.  To leverage these existing devices effectively, the program will develop new algorithms that can map the RF environment with minimal communication load between devices.  It will also develop approaches to exploit our precise knowledge of the RF environment and the distributed proximity of RF devices to provide reliable and assured communications for our warfighter as well as to infiltrate or negate our adversaries' communications networks.  Building upon technologies investigated within other programs in this project, the Advanced RF Mapping program will enable both offensive and defensive operations in complex RF environments.  Advanced RF Mapping technology is planned to transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.300"
                                            },
                                            "Text": {
                                                "val": "-  Establish baseline capabilities for RF collection from distributed devices in complex RF environments.\n-  Initiate the development of algorithms to exploit distributed RF collections and to produce a full environmental map of frequency and space as a function of time.\n-  Assess approaches to exploit RF environment knowledge and distributed RF devices to provide new capabilities to assess adversary networks and defend against hostile use of the RF spectrum."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop and deploy prototype networks employing over dozens of RF devices of different types for experimentation with the RF mapping technology.\n-  Demonstrate First Generation RF mapping capability with the goal to determine the majority of RF signals in tactically relevant VHF and UHF frequencies, using less than 10 devices per square mile while minimizing communications requirements between devices.\n-  Determine the performance improvement for signal detection and identification of RF mapping system over tactically relevant collection times.\n-  Improve RF collection capabilities to cover impaired tactical networks and limited device availability in tactical environments.\n-  Establish baseline capability for assessing hostile networks and defending against hostile use of the RF spectrum."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Highly Networked Force"
                                    },
                                    "Description": {
                                        "val": "A highly networked and enabled force increases efficiency, effectiveness, and safety by making relevant information available when it is needed and at the appropriate location (person\/platform\/system).  Accomplishing this depends on providing reliable wireless communications to all U.S. forces, platforms, and devices in all phases of conflict.  The Highly Networked Force program seeks to overcome key limitations of current technology to realize the fully network-enabled force by addressing issues such as: lack of coverage due to operation in challenged locations or loss of relays or links; lack of connectivity due to networks that cannot keep up with the high rate of change; and lack of assured connectivity due to the impact of misbehaving networks and devices.  Technologies developed under this program will be transitioned to the Services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate techniques to determine the integrity of communications nodes and subnetworks from both physical, network, and application-based information.\n-  Investigate methods to improve end user coverage through cooperation between overlapping heterogeneous networks or communication systems, and through new relay and physical layer designs.\n-  Investigate new routing, naming, and networking mechanisms optimized for addressing network outages and security needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a simulation model of enterprise-level heterogeneous networks appropriate for investigating the detection and attribution of misbehaving devices and subnetworks. \n-  Develop a wireless network supporting investigation of the new architectures and mechanisms to mitigate the effects of misbehaving devices and networks.\n-  Use the network and model for initial evaluation of the most promising approaches identified in the FY2013 investigations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scalable Millimeter-wave (MMW) Architectures for Reconfigurable Transceivers (SMART)"
                                    },
                                    "Description": {
                                        "val": "The Scalable Millimeter-wave (MMW) Architectures for Reconfigurable Transceivers (SMART) program, last funded in FY 2010, developed a new technology for producing very thin millimeter-wave array apertures and transceivers.  The technology development culminated in the demonstration of a large-sized coherent, active electronically-steerable array (AESA) with an output power density of 5W per square cm and a total layer thickness of less than 1cm.  The SMART technology approach resulted in a breakthrough in performance over conventional millimeter-wave approaches.  The 3-D multi-layer assemblies developed will greatly reduce AESA packaging complexity and enable very compact, low-cost, millimeter-wave, and radio frequency circuit \"building blocks\" to combine to form arbitrarily large arrays.  New capabilities, such as the ability to construct reconfigurable and\/or multi-band AESAs and other MMW circuits, will be enabled by this architectural approach.\n\nThe SMART program is transitioning through industrial producers of MMW radar and communication system components for DoD applications.  Additional funding in FY 2013 and FY 2014 is budgeted to facilitate this transitional work to move beyond laboratory demonstrations to a manufacturing environment consistent with high yield, volume capability, and advanced readiness levels while maintaining performance.  An additional goal is to demonstrate the ability to adapt to system-level requirements as obtained from applications such as air-to-air and satellite communications at MMW frequencies, such as serial addressable arrays and large aperture assembly."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Build a W-band (94 GHz) SMART phased array prototype with transmit \/ receive capability. Successfully demonstrate the prototype in the laboratory as a range test set."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate transition to wafer-scale array fabrication techniques to realize Technology Readiness Level 6 through process analysis and implementation of recommended improvements.\n-  Increase manufacturability of mm-wave communication arrays through increased throughput of batch-fabricated electronically steered arrays."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "100 Gb\/s RF Backbone"
                                    },
                                    "Description": {
                                        "val": "The increasing proliferation of video, voice, chat, and other important data-streams on the battlefield is driving a need for higher capacity, reliable, assured, and all-weather communications that are deployable on a wide range of air, ground, and maritime platforms.  The goal of this program is to demonstrate a 100 Gigabit-per-second (Gb\/s) radio frequency (RF) backbone that will meet the anticipated mid-term (within 3-10 years) wireless networking requirements of deployed military forces.  DARPA's hybrid Free Space Optical Experimental Network Experiment (FOENEX) system has broken the 10 Gb\/s wireless network boundary using free-space optical links, but all-weather Ku band components are currently limited to much less than 1Gb\/s capacity.  Furthermore, the hybrid optical\/RF system exhibits size, weight, and power consumption (SWaP) characteristics that preclude deployment on many SWaP-limited platforms.  Moving to a millimeter-wave (mmW) solution will provide high capacity as well as all-weather resiliency, yet presents technical challenges that include the generation of higher-order waveforms (beyond common data link), efficient power transmission, high-speed routing, and low-noise receivers.  This program will develop the constituent subsystems (waveform generation, efficient power amplifiers, and receivers) and spatial multiplexing architectures to construct an all-weather mmW 100 Gbps backbone at half the size, weight and power consumption of the current FOENEX system.  The 100 Gbps RF Backbone program is intended for transition to multiple Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop millimeter-wave waveforms with higher modulation constellation (i.e., QAM16) to achieve high spectral efficiencies.\n-  Identify promising approaches to achieving power transmission efficiency improvements at millimeter-wave frequencies.\n-  Identify promising low noise-figure receiver technologies for millimeter-wave frequencies.\n-  Identify candidate architectures, hardware, and algorithms for spatial multiplexing to achieve high spectral efficiencies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectrum Efficiency and Access"
                                    },
                                    "Description": {
                                        "val": "Current Presidential Initiatives, FCC Broadband Task Force, and Congressional legislation are working to transition large swaths of spectrum (up to 500 MHz) from Federal (DoD is the primary contributor) to civilian use for broadband telecommunications.  The DoD will need more data\/sensor capacity over the next decades and will therefore need new technology to operate with less spectrum.  The objective of this program is to investigate improvements in spectral reuse (spectrum sharing of sensor\/radar bands).  The program will leverage technical trends in cooperative sharing to exploit radar anti-jam and interference mitigation technologies that could enable spectrum sharing by allowing overlay of communications within the same spectral footprint.  The approach will include exploring real-time control data links between radars and communications systems, and developing the advanced waveforms and components to enable radars and communication networks to operate in close proximity.  The ultimate goal is to turn the DoD spectrum loss into a net gain of up to hundreds of MHz in capacity. Technology from this program will be made available to the DoD."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.400"
                                            },
                                            "Text": {
                                                "val": "-  Develop concepts and management policies for enabling radars and communications networks to share spectrum spatially and temporally.\n-  Develop models and simulation capability for research on spectrum sharing between radar and communications systems.\n-  Assess the limits on achievable spectral reuse between radar and communications in order to evaluate sharing concepts and implementations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Networking Protocol (MNP)"
                                    },
                                    "Description": {
                                        "val": "The Military Networking Protocol (MNP) program creates architectures, protocols and network controllers to enhance security and operation of networks.  MNP technologies enforce user authentication, manage network traffic, and automatically configure networks.  By enforcing user authentication, military network protocols provide full attribution of every device and track each device's network packets to provide full attribution down to the individual source of bad\/erroneous data or malicious activity.  MNP prioritization schemes will be controlled by various echelons to address changing mission requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.268"
                                            },
                                            "Text": {
                                                "val": "-  Conducted an initial system test and verification of the MNP architecture and protocols.\n-  Continued the refinement and design of the selected MNP architecture, protocols and network controllers.\n-  Increased the scale of the MNP test-bed for the final test and demonstration.\n-  Coordinated with transition partners to continue program participation and to finalize a transition plan and\/or memorandum of agreement for MNP technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.308"
                                            },
                                            "Text": {
                                                "val": "-  Conduct capstone demonstration for MNP system.\n-  Coordinate with Services for use in their information assurance\/computer network defense exercises."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical & RF Combined Link Experiment (ORCLE)"
                                    },
                                    "Description": {
                                        "val": "The Optical & RF Combined Link Experiment (ORCLE) program combined radio frequency (RF) and free space optical (FSO) communications as well as networking technologies that exploit the benefits of complementary path diversity.  This effort encompassed the extension of research into the FSO\/RF Internet Protocol-based Network system, called Optical RF Communications Adjunct (ORCA).  Using optical and RF communication techniques, ORCLE improved battlespace communications using a hybrid RF and FSO link in air-to-air-to-ground environments.  The central challenge was to enable optical communications bandwidth without giving up RF reliability, regardless of the weather.  ORCLE developed RF and FSO propagation channel analysis, coding techniques, and modeling to include weather, atmospherics, and aero-optics to provide the joint force commander assured high-data rate communications.  The technical objective was to prototype and flight demonstrate hybrid FSO\/RF air-to-air-to-ground links that combine the best attributes of both technologies and simulate hybrid network performance.  The ORCLE technology is transitioning to the Air Force and Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.931"
                                            },
                                            "Text": {
                                                "val": "-  Executed final testing of a 4 node network (3 air nodes and one ground node) to demonstrate hybrid high data rate FSO\/RF and advanced network capabilities that provide information data rates sufficient for current military needs and mission requirements.\n-  Validated the ability to provide the warfighter with low latency information for command and control as well as Intelligence, Surveillance, and Reconnaissance (ISR) requirements.\n-  Demonstrated network instantiation and user interfaces to allow high data rate command and control at multiple levels.\n-  Successful demonstration of a network's ability to break the 10 Gb\/s wireless network boundary using FSO links helped shape the network architecture for the 100 Gb\/s RF Backbone program also budgeted in Project CCC-02."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-04"
                    },
                    "ProjectTitle": {
                        "val": "SECURE INFORMATION AND NETWORK SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.932"
                        },
                        "CurrentYear": {
                            "val": "42.840"
                        },
                        "BudgetYearOne": {
                            "val": "21.120"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.120"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Computer and networking technologies have rapidly matured in the last decade with profound effect on the DoD and the nation.  The Secure Information and Network Systems project will develop and demonstrate computer and network systems suitable for use in contested cyber domains.  Examples of such domains include military networks, U.S. government enterprise networks, critical infrastructure, and embedded computing systems.  The project will develop, integrate, and test technologies for re-using software components, countering advanced persistent threats, and detecting compromise on enterprise networks.  Technologies will be developed using results generated in projects such as, but not limited to, DARPA's Information & Communications Program Element (PE 0602303E) for potential transition to the Services and Combatant Commands."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rapid Software Development using Binary Components (RAPID)"
                                    },
                                    "Description": {
                                        "val": "The Rapid Software Development using Binary Components (RAPID) program will develop a system to identify and extract software components for reuse in new applications.  The DoD has critical applications that must be ported to future operating systems.  In many cases, the application source code is no longer available requiring these applications to continue to run on insecure and out-dated operating systems, impacting day-to-day operations.  RAPID capabilities will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.177"
                                            },
                                            "Text": {
                                                "val": "-  Identified a baseline intermediary representative language specification for the RAPID system. \n-  Designed and prototyped the RAPID system architecture to enable functional identification and functional extraction.\n-  Demonstrated an initial set of extracted and recombined components on multiple systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.340"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate an automated proof-of-concept system showing identification, extraction, and combination of components.\n-  Complete the initial implementation of the user interface.\n-  Deliver initial resulting applications to USCYBERCOM."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.120"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.120"
                                            },
                                            "Text": {
                                                "val": "-  Use in red team training exercises to increase speed.\n-  Test the system on a representative set of applications supplied by military partners.\n-  Initiate end-to-end system transition to the Navy Cyber Warfare Development Group, SPAWAR Atlantic, USSTRATCOM, USCYBERCOM, and other commands."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Insider Threat (CINDER)"
                                    },
                                    "Description": {
                                        "val": "The Cyber Insider Threat (CINDER) program will develop technologies for identifying advanced cyber threat missions that may be currently ongoing within DoD and government interest systems and networks.  Current cyber defenses are primarily based on network and host intrusion detection and look for break-ins and abnormal behavior without context.  The CINDER program will build tools and techniques that apply mission templates of advanced cyber espionage onto seemingly normal internal system and network activity.  The program focuses on identifying ongoing adversary missions rather than a person, program, or particular piece of malware.  Through this CINDER will uncover ongoing advanced persistent cyber threats and espionage within our cyber environments.  Capabilities from this program will transition to DoD and the defense industrial base."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.755"
                                            },
                                            "Text": {
                                                "val": "-  Identified constraints for each class\/mission and demonstrated constraint detection methodologies.\n-  Quantified probability of detection and probability of false alarm as a function of adversary class and mission.\n-  Designed and built scalable prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.500"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate adversary missions and observables on targeted systems.\n-  Demonstrate cyber espionage detection capability on U.S. Government data sets.\n-  Evaluate avoidance and obfuscation tactics against mission template detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Finalize evaluation of adversary missions and observables on targeted systems.\n-  Finalize evaluation of avoidance and obfuscation tactics against mission template detection. \n-  Transition to identified national security partner."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-06"
                    },
                    "ProjectTitle": {
                        "val": "COMMAND & CONTROL INFORMATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "45.623"
                        },
                        "CurrentYear": {
                            "val": "55.863"
                        },
                        "BudgetYearOne": {
                            "val": "80.745"
                        },
                        "BudgetYearOneBase": {
                            "val": "80.745"
                        },
                        "BudgetYearTwo": {
                            "val": "104.156"
                        },
                        "BudgetYearThree": {
                            "val": "98.370"
                        },
                        "BudgetYearFour": {
                            "val": "30.000"
                        },
                        "BudgetYearFive": {
                            "val": "13.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "45.623"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "55.863"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "80.745"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "80.745"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details will be provided under separate cover."
                        }
                    }
                }
            ]
        }
    }
}