{
    "id": "8cf89998570893889a44775bceab6b14c0bf5980",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0305199D8Z"
        },
        "ProgramElementTitle": {
            "val": "Net Centricity"
        },
        "R1LineItemNumber": {
            "val": "227"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.528"
            },
            "CurrentYear": {
                "val": "21.190"
            },
            "BudgetYearOne": {
                "val": "21.602"
            },
            "BudgetYearOneBase": {
                "val": "21.602"
            },
            "BudgetYearTwo": {
                "val": "21.610"
            },
            "BudgetYearThree": {
                "val": "19.954"
            },
            "BudgetYearFour": {
                "val": "20.189"
            },
            "BudgetYearFive": {
                "val": "20.512"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "As a Department efficiency the ASD(NII) was disestablished on January 11, 2012.  Starting in FY2013 the funding in PE 0604771D8Z JTIDS associated with communications and information networks architecture, strategy and policy; and frequency spectrum analysis and management was transferred to this PE (PE 0305199D8Z Net Centricity) and aligned under the office of the DoD Chief Information Officer (DoD CIO).\n\nFunds will be used to provide technical, systems engineering and capability management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and affect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved systems performance and military operations. Emphasis is placed on the information transport, information assurance, net and spectrum management, command and control (C2) applications and services, information sharing capabilities, and enterprise services activities focused on the development, integration, testing and technical assessment of capabilities and applications in joint and coalition warfighter support environments.  Resources support collaborative efforts to demonstrate the interoperability and performance requirements of command, control, communication, computing network, and Information Infrastructure (C4&II) capabilities and programs.  This program is funded under Budget Activity 7, Operational System Development.  \n\n     This project provides the resources necessary to implement net centric processes and authoritative analytic methods that provide the capability to synchronize interdependent capabilities across all layers (ground, air, space) of the joint information environment architecture, to forecast and achieve a balance in supply and demand for network capacity, and field effective capabilities more rapidly and efficiently as an enabler for C4&II capabilities applications and services.  Resources are required to transform current networks into an operationally unified and architecturally diverse joint information environment that will provide end-to-end communications transport layer, computing networks, and mission application capabilities that are optimized and integrated with all other joint capability areas with a focus on the tactical edge faced with disconnected, intermittent, and latency (DIL) environments.  There will be technical assessments, modeling and simulation, and analysis of the Joint space communications layer, Joint aerial network layer, contested communications on the move, Position Navigation and Timing (PNT), and C2 mission application capabilities.  These funds develop the capability for the warfighter to manage and deconflict radio frequencies through ground, air, and space communication networks.  The funds will be used to develop and synchronize information assurance capabilities with other joint information environment capabilities to provide secure access to information and services (e.g. Cryptographic Modernization Management plan).  \n     In addition, funding will continue to be used to support the Defense Information System's Agency's (DISA) and Services' interoperable improvement efforts and processes in the development of common standards and protocols.  This effort includes initiating the Joint Interoperability Enhancement Process (IEP) that allows operators, engineers, and program managers to verify capabilities and identify issues in a design with Joint \/Allied units prior to system fielding, or with fielded systems to identify required systems changes for systems upgrade planning.  DISA and the Joint Forces Combatant Command lead the effort to transform the current standards and interoperability management tools to a common set of Joint network-enabled standards to ensure adherence to the Global Information Grid (GIG) enterprise-wide technical baseline and for implementation of future Tactical Data Link (TDL) capabilities. These joint standards, protocols, and processes will be used for implementation and testing to ensure the TDL capabilities are synchronized with the development and integration timelines of other planned network-enabled Global Information Grid (GIG) initiatives.  The threats to the networking waveforms and the Joint NC migration will also be looked at in cooperation with the Intelligence agencies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.432"
                },
                "CurrentYear": {
                    "val": "21.190"
                },
                "BudgetYearOne": {
                    "val": "21.778"
                },
                "BudgetYearOneBase": {
                    "val": "21.778"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.528"
                },
                "CurrentYear": {
                    "val": "21.190"
                },
                "BudgetYearOne": {
                    "val": "21.602"
                },
                "BudgetYearOneBase": {
                    "val": "21.602"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.096"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.176"
                },
                "BudgetYearOneBase": {
                    "val": "-0.176"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.096"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.176"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.176"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program Change Explanation:\nFY 2014: Service support contract efficiency -0.176 million."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "199"
                    },
                    "ProjectTitle": {
                        "val": "GIG Evaluation Facilities (GIG-EF) and GIG Enterprise-Wide Systems Engineering Advisory Activities"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.528"
                        },
                        "CurrentYear": {
                            "val": "21.190"
                        },
                        "BudgetYearOne": {
                            "val": "21.602"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.602"
                        },
                        "BudgetYearTwo": {
                            "val": "21.610"
                        },
                        "BudgetYearThree": {
                            "val": "19.954"
                        },
                        "BudgetYearFour": {
                            "val": "20.189"
                        },
                        "BudgetYearFive": {
                            "val": "20.512"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "As a Department efficiency the ASD(NII) was disestablished on January 11, 2012.  Starting in FY2013 the funding in PE 0604771D8Z JTIDS associated with communications and information networks architecture, strategy and policy; and frequency spectrum analysis and management was transferred to this PE and aligned under the office of the DoD Chief Information Officer (DoD CIO).\n\nFunds will be used to provide technical, systems engineering and capability management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and affect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved systems performance and military operations. Emphasis is placed on the information transport, information assurance, net and spectrum management, command and control (C2) applications and services, information sharing capabilities, and enterprise services activities focused on the development, integration, testing and technical assessment of capabilities and applications in joint and coalition warfighter support environments.  Resources support collaborative efforts to demonstrate the interoperability and performance requirements of command, control, communication, computing network, and Information Infrastructure (C4&II) capabilities and programs.  This program is funded under Budget Activity 7, Operational System Development.  \n\n     This project provides the resources necessary to implement net centric processes and authoritative analytic methods that provide the capability to synchronize interdependent capabilities across all layers (ground, air, space) of the joint information environment architecture, to forecast and achieve a balance in supply and demand for network capacity, and field effective capabilities more rapidly and efficiently as an enabler for C4&II capabilities applications and services.  Resources are required to transform current networks into an operationally unified and architecturally diverse joint information environment that will provide end-to-end communications transport layer, computing networks, and mission application capabilities that are optimized and integrated with all other joint capability areas with a focus on the tactical edge faced with disconnected, intermittent, and latency (DIL) environments.  There will be technical assessments, modeling and simulation, and analysis of the Joint space communications layer, Joint aerial network layer, contested communications on the move, Position Navigation and Timing (PNT), and C2 mission application capabilities.  These funds develop the capability for the warfighter to manage and deconflict radio frequencies through ground, air, and space communication networks.  The funds will be used to develop and synchronize information assurance capabilities with other joint information environment capabilities to provide secure access to information and services (e.g. Cryptographic Modernization Management plan).  \n     In addition, funding will continue to be used to support the Defense Information System's Agency's (DISA) and Services' interoperable improvement efforts and processes in the development of common standards and protocols.  This effort includes initiating the Joint Interoperability Enhancement Process (IEP) that allows operators, engineers, and program managers to verify capabilities and identify issues in a design with Joint \/Allied units prior to system fielding, or with fielded systems to identify required systems changes for systems upgrade planning.  DISA and the Joint Forces Combatant Command lead the effort to transform the current standards and interoperability management tools to a common set of Joint network-enabled standards to ensure adherence to the Global Information Grid (GIG) enterprise-wide technical baseline and for implementation of future Tactical Data Link (TDL) capabilities. These joint standards, protocols, and processes will be used for implementation and testing to ensure the TDL capabilities are synchronized with the development and integration timelines of other planned network-enabled Global Information Grid (GIG) initiatives.  The threats to the networking waveforms and the Joint NC migration will also be looked at in cooperation with the Intelligence agencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Net Centricity Plans and Accomplishments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.528"
                                            },
                                            "Text": {
                                                "val": "– Assessed aerial layer waveforms (Link-16, TTNT, CDL) for cost and complexity in implementation. Identified technologies and platform architectures to enable improved performance and lower technology insertion costs for advanced tactical data. \n– Completed JALN Analysis of Alternatives (AoA).  Directed DoD efforts to develop and test proposed JALN modifications and developing ATDL technologies with greater system throughput and performance in future operational environments; assessed Service plans to field systems to support JALN with ATDLs; and assessed any additional allied participation alternatives for JALN architectures and ATDL networks. Working with ASD(R&E), coordinated the planned technology developments to address communications shortfalls and ensure support of joint interoperable solutions that are technically effective and financially sound. Working with the services incorporated the ATDL and JALN recommendations to provide the warfighters with effective communication systems.\n– Continued the expansion of the TDL community participation including the incorporation of the ATDL with the associated gateway efforts and enhanced joint, allied and coalition partnership within the JTMP process to facilitate Joint TDL migration.\n– Further refined, developed and analyzed future capabilities for advanced waveforms and data links for terrestrial (line-of-sight) and satellite (beyond-line-of-sight) systems. This included detailed engineering analysis of new technologies, alternatives and interoperability \n– Continued to analyze and propose solutions for Generation 4 to 5 advanced data link interoperability.\n– Continued to model various coalition aerial networks, sowing interoperability between US aircraft in US only nets, US aircraft in coalition networks and allied aircraft.\n– Implemented the joint Interoperability Enhancement Process (IEP) to define and plan the expansion of TDL technologies to include tactical information integration and configuration management with Link 16, VMF, CDL and MADL; continued to develop policy-based network management preferred system concept and methodology for enterprise situational awareness.\n– Finalized the 2011 TDL migration plan and started draft of 2013 plan. Enhanced modeling and simulation capability to support data link technical and operational capability assessments including integration to other components of the GIG.  \n– Conducted JALN implementation analysis.  Provided datalink migration engineering support.  Conducted advanced waveform analysis of Gen 4\/5 aircraft.\n– Analyzed Gen 4-5 fighter\/bomber waveform modification (MADL).  Modeled advanced tactical datalinks.  Developed a MADL waveform standard specification.  Analyzed MADL and link 16 gateway capabilities.\n– Worked with the Intelligence, Surveillance, and Reconnaissance (ISR) community to define a set of non-duplicatve CDLs for joint use.\n– Provided pre-Milestone A technical assessment for “Developmental Planning” to ensure selection and development of solutions that are interoperable across the strategic and tactical boundaries in regards to Joint space communications layer, Joint aerial network layer, and contested communications on the move capabilities.\n– Built waveform roadmaps that provide a chronology of tactical communications waveforms and captures delivery of new approved waveforms as well as disestablishment\/migration of existing\/legacy waveforms.\n– Defined current network capacity, capability gaps and potential solutions (space, air, terrestrial) in the Combined Joint Operational Area (CJOA) to meet the demand of the Combined Joint Force (CJF) Commander.\n– Performed systems engineering analysis for technical baseline compliance, information assurance, and tactical networking.\n– Developed network management (NM) technical solutions to share NM data and execute control through all levels of DoD networks\n– Performed waveform migration analysis to select optimum waveforms for warfighter interoperability and DoD cost reduction\n– Provided technical solutions to integrate spectrum resources and optimize electromagnetic systems that use spectrum resources in the tactical environment.\n– Executed technical analysis on spectrally efficient technologies, sharing techniques, and regulatory alternatives to increase efficient use of spectrum technologies.\n– Assessed the services infrastructure requirements (and limitations) of implementing C2 functional services to operate from the tactical edge\n– Continued development of a Global Electromagnetic Spectrum Information System (GEMSIS),  transforming spectrum operations from a preplanned and static frequency assignment system into a responsive and agile capability to request, assign, allocate, and deconflict portions of the electromagnetic spectrum; providing an integrated approach to electromagnetic spectrum, enabling C2 access to spectrum situational information and providing spectrum efficiency and effectiveness enhancements to JTRS and integration of spectrum consideration to networking protocols.\n– Performed detailed feasibility studies, band analysis, operational impact studies and cost estimates in response to future domestic and global spectrum reallocations that might inhibit the DoD’s ability to complete its warfighting mission\n– Conducted joint network modeling and network design for Army, USMC, Air Force brigade, MEB and wing. Provided analysis of SATCOM systems in support of the RBSC effort. Conducted a MUOS alternative study to determine a technical solution for getting the most out of the MUOS payload side of the satellite through modifications at the NAF and with, ground terminal mods.  This effort included waveform options, cost and schedule impacts. \n– Performed cyber CND analysis for tactical networks, resiliency based satellite analysis, secure voice telephone modeling replacement, analysis to determine options for extending enterprise services to the tactical edge, current waveform capabilities and functions and evolutionary strategy for 2 MHz – 2 GHz.\n– Developed a common set of interface standards to minimize the network management complexity in tactical communication networks. Analyzed the use and feasibility of NET FPGA technology as a layer 3 solution for the Soldier Radio Waveform (SRW) as a future enhancement.  Conducted analysis and performance modeling for implementation on tactical networks,  Capabilities document to determine what can be removed to facilitate an alternative solution.\n– Provided technical analysis and developed trade-offs for evolution of C2 information sharing policies, strategies and functional requirements to support continued development and delivery of Coalition C2 and C2 Information Sharing capability metrics and mechanisms.. \n– Developed wireless architecture and advanced technologies analyses, technical analyses in waveform policy oversight, COMSEC\/TRANSEC guidance for spectrum dependent systems and spectrum technology radar analyses.\n– Provided technical analyses on network management to include cyber and spectrum issues and develop a network management strategy roadmap.\n– Provided engineering and technical expertise and analytic support for the Ten Year Plan and DoD Long-term Spectrum Strategy and spectrum relocation analyses.\n- Developed Engineering analysis, including secure voice conferencing, to support the total replacement of the Defense Red Switch Network (DRSN) in the DoD. \n- Network Management Working Group Ground Segment Analysis; Assessment of Software Defined Networking; Analysis of SRW Layer 3 Networking; Updates to DoD CIO Waveform Roadmap; Command Link Encryption for Commercial Satellites Brief; AJ-AS Modem Background Brief; INTELSAT UHF Interference Analysis – Review of MCEB Frequency Plan; Cyber Vulnerability Analysis of Wideband SATCOM Control\n- Performed systems engineering analysis to establish E2E system performance parameters for MUOS program.\n- Developed comprehensive technical risk assessment and mitigation approaches for MUOS program to meet operational performance requirements.\n- Assessed technical alternatives to better utilize WCDMA side of MUOS with legacy terminals.\n- Enforced implementation of ECDSA\/SHA-256 as PKI crypto. SW standard in MUOS program to maintain E2E interoperability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.190"
                                            },
                                            "Text": {
                                                "val": "– Determine strengths, weaknesses, and uses of waveforms; identify gaps not satisfied by currently planned waveforms; consider how new technologies will result in improved waveforms; support Waveform Roadmap effort;\n- Support technical analysis, architecture development, and systems engineering to support understanding the maturity of cloud computing standards and cloud computing best practices to ensure resiliency of the cloud computing environment to support operations; Identify how cloud services can be extended to the mission networks; \n- Assess tactical communications systems’ ability to support IPv6. \n- Conduct analyses and perform modeling and simulation to address issues with command and control systems, communications systems and networks; \n- Conduct cyber vulnerability analyses of communications systems and networks; \n- Conduct analyses and perform modeling and simulation to address SATCOM issues; \n- Conduct analyses and perform modeling and simulation to address DoD organizational messaging modernization.  Include materiel and non-materiel aspects.\n- Support analysis of security architectures and provide recommendations on policy for commercial mobile devices in the DoD to include support for secret and top secret data and voice communications, address interim solutions, route to final architecture, and technical options for integration\n- Refine the DoD radio strategy document and establish radio strategy working group with services to facilitate POM development for FY15 and out years.   \n- Update existing SATCOM synch matrices to reflect changes in POM 13 funding, emerging systems\/technology, and JALN AOA recommendations as appropriate.\n- Analyze PACOM gateway system requirements and proposed equipment suites including the number and types of equipment needed to meet the operational requirements. \n- Analyze DoD tactical radios to determine which radios are suitable for Suite B implementation\n- Conduct a study to determine the feasibility of implementing legacy narrowband SATCOM solutions on the MUOS payload\n- Develop policy documents to support crypto mod initiatives and crypto mod integration issues\n- Provide analysis and oversight for Crypto-solution management, policy development, and enforcement, Nuclear C2 systems evolution, and Crypto modernization for the general force.\n- Support JSCL AoA relative to wideband SATCOM architecture \n- Finalize and coordinate JIPM evolution and deployment strategy\n- Conduct technical analysis and policy support with emphasis on Coalition C2 and Multi-National Information Sharing (MNIS), including technical analysis of Coalition C2 functional requirements, strategic policy development and capability strategies addressed by the international community (inclusive of multilateral and bi-lateral engagements)    \n- Conduct technical analysis of selected Joint and Military Service C2 programs and initiatives to promote net-centric approaches for data, services and enterprise deployments \n- Provide technical analysis and support for C4&II related policies, plans, studies, governance and management, roadmaps, assessment reports, capabilities and numerous other initiatives.   \n- Provide technical assessments to inform and influence Future Mission Network (FMN) development and implementation activities.   \n- Provide technical analysis and support for the development of Common Mission Network Transport (CMNT) capability. Conduct Joint Network modeling and Network design for Army USMC, and Air Force Brigade, Marine Expeditionary Brigade (MEB), and USAF Wing.  \n- Provide analysis of the SATCOM systems in support of the RBSC effort \n- Conduct a MUOS alternative study (to determine a technical solution for getting the most out of the MUOS payload side of the satellite), NAF modifications, ground terminal modifications, waveform options, cost, and schedule impacts \n- Conduct analysis to determine requirements, feasibility, and availability of hand held MUOS terminals.\n- Conduct assessments to investigate feasibility, and availability of COT high efficiency WCDMA power amplifiers for MUOS hand held radios.\n- Provide technical analysis on network management to include cyber and spectrum issues. \n- Conduct wireless architecture and advanced technologies analysis.  Develop recommendations, reports, and communications policies\n- Conduct technical analysis to support waveform policy development and oversight\n- Conduct spectrum technology radar analysis and to develop Spectrum Technology Radar Roadmap\n- Conduct wireless communications architecture and policy analysis, and waveform policy analysis to inform Department-wide policies.\n- Provide technical development and analysis to the C4II Directorate for the evolution of  Multi-National Information Sharing programs,  related acquisition strategies, and functional requirements to support continued development of  C2 Information Sharing metrics and mechanisms to enhance capability strategies and C2 IS roadmap development.\n- Conduct follow-on JALN analysis with Joint Service JALN Council, oversee Service implementation efforts, initiate JALN capability Non-Recurring Engineering (NRE) development.\n- Expand IEP beyond Link 16 to incorporate VMF, MADL, and CDL\n- Publish Joint TDL Migration Plan (JTMP), start draft for 2014 JTMP, and develop DoD Instruction for TDL migration\n- Draft MIL-STDs for MADL and CDL to enhance interoperability and oversight of the communication systems\n- Conduct SOCOM Line of Sight (LoS) communications assessment\n- Conduct Advanced Ground \/ Air \/ Space assessments for: Generation 4 to Generation 5 Fighter\/bomber waveform modification analysis (Multifunction Advanced Data Link (MADL); Advanced tactical data link modeling; Develop a MADL waveform standard specification; analyze MADL and Link-16 gateway capabilities\n- Conduct analysis to update the Joint Command and Control technical and architectural artifacts and inform transition of Global Command and Control Family of Systems to a network enabled, joint information enterprise\n- Analyze approaches, potential costs and schedules to establish net-centric C2 capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.602"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.602"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts to determine strengths, weaknesses, and uses of waveforms; identify gaps not satisfied by currently planned waveforms; consider how new technologies will result in improved waveforms; support Waveform Roadmap effort; \n- Continue technical analysis, architecture development, and systems engineering to support understanding the maturity of cloud computing standards and cloud computing best practices to ensure resiliency of the cloud computing environment to support operations; Identify how cloud services can be extended to the mission networks; \n- Assess tactical communications systems’ ability to support IPv6; develop policies and implementation strategies to promote IPV6 use in tactical systems. \n- Conduct analyses and perform modeling and simulation to address issues with command and control systems, communications systems and networks\n- Conduct cyber vulnerability analyses of communications systems and networks \n- Conduct analyses and perform modeling and simulation to address SATCOM issues \n- Complete analyses and perform modeling and simulation to address DoD organizational messaging modernization.  Include materiel and non-materiel aspects.\n- Continue analysis of security architectures and provide recommendations on policy for commercial mobile devices in the DoD to include support for secret and top secret data and voice communications, address interim solutions, route to final architecture, and technical options for integration\n- Refine the DoD radio strategy document and establish radio strategy working group with services to facilitate POM development for FY16 and out years.   \n- Update existing SATCOM synch matrices to reflect changes in POM 15 funding, emerging systems\/technology, and JALN AOA recommendations as appropriate.\n- Refine PACOM gateway system requirements and proposed equipment suites including the number and types of equipment needed to meet the operational requirements. \n- Continue analysis of tactical radios to determine which radios are suitable for Suite B implementation\n- Continue analysis efforts to address the feasibility of implementing legacy narrowband SATCOM solutions on the MUOS payload.\n- Develop policy documents and implementation plans to support crypto mod initiatives and crypto mod integration issues\n- Provide analysis and oversight for Crypto-solution management, policy development, and enforcement, Nuclear C2 systems evolution, and Crypto modernization for the general force.\n- Support JSCL AoA follow-on efforts relative to wideband SATCOM architecture \n- Conduct analysis to optimize JIPM evolution and deployment\/implementaion strategy\n- Conduct technical analysis on Coalition C2 and Multi-National Information Sharing (MNIS), including technical analysis of Coalition C2 functional requirements, strategic policy development and capability strategies addressed by the international community (inclusive of multilateral and bi-lateral engagements).    \n- Conduct technical analysis of selected Joint and Military Service C2 programs and initiatives to promote net-centric approaches for data, services and enterprise deployments\n- Provide technical analysis and support for C4&II related policies, plans, studies, governance and management, roadmaps, assessment reports, capabilities and numerous other initiatives.   \n- Continue technical assessments to inform and influence Future Mission Network (FMN) development and implementation.   \n- Provide technical analysis and support for the development and implementation of the Common Mission Network Transport (CMNT) capability.\n- Conduct Joint Network modeling and Network design for Army USMC, and Air Force Brigade, Marine Expeditionary Brigade (MEB), and USAF Wing.  \n- Provide analysis of the SATCOM systems in support of the RBSC effort \n- Conduct follow-on analysis of the MUOS alternative study (to determine a technical solution for getting the most out of the MUOS payload side of the satellite), NAF modifications, ground terminal modifications, waveform options, cost, and schedule impacts \n- Continue analysis to refine requirements, feasibility, and availability of hand held MUOS terminals.\n- Continue assessments to investigate feasibility, and availability of COT high efficiency WCDMA power amplifiers for MUOS hand held radios.\n- Develop an implementation plan for MUOS specific Test & Certification test bed capability to support COTS vendor terminals to support MUOS system.\n- Provide technical analysis on network management to include cyber and spectrum issues.  \n- Conduct wireless architecture and advanced technologies analysis.  Develop recommendations, reports, and communications policies\n- Conduct technical analysis to support waveform policy development and oversight\n- Conduct spectrum technology radar analysis and to develop Spectrum Technology Radar Roadmap\n- Conduct wireless communications architecture and policy analysis, and waveform policy analysis to inform Department-wide policies.\n- Provide technical development and analysis to the C4II Directorate for the evolution of  Multi-National Information Sharing programs,  related acquisition strategies, and functional requirements to support continued development of  C2 Information Sharing metrics and mechanisms to enhance capability strategies and C2 IS roadmap development.\n- Conduct follow-on JALN analysis with Joint Service JALN Council, oversee Service implementation efforts, initiate JALN capability Non-Recurring Engineering (NRE) development.\n- Continue technical efforts to expand IEP beyond Link 16 to incorporate VMF, MADL, and CDL\n- Conduct technical and policy assessments to enable TDL migration\n- Conduct SOCOM Line of Sight (LoS) communications assessments\n- Conduct Advanced Ground \/ Air \/ Space assessments for: Generation 4 to Generation 5 Fighter\/bomber waveform modification analysis (Multifunction Advanced Data Link (MADL); Advanced tactical data link modeling; Develop a MADL waveform standard specification; analyze MADL and Link-16 gateway capabilities\n- Conduct analysis to refine the Joint Command and Control technical and architectural artifacts and inform transition of Global Command and Control Family of Systems to a network enabled, joint information enterprise\n- Provide studies and analysis of the Command and Control capability gaps to inform investment strategies.\n- Analyze approaches, potential costs and schedules to establish net-centric C2 capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "– PPBE related issue development and approval\n– Successful technical development and analysis of the CIO and DCIO C4IIC portfolio of programs and activities\n– Develop comprehensive risk assessment and mitigation approaches of the CIO and DCIO C4IIC portfolio of programs and activities"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Net Centricity"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.528"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "20.890"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "21.302"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "21.302"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FFRDC Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}