{
    "id": "8d71aac29e873ec4fbf0396989873c329172f26a",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA3_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Technology"
        },
        "R1LineItemNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.046"
            },
            "CurrentYear": {
                "val": "21.683"
            },
            "BudgetYearOne": {
                "val": "25.348"
            },
            "BudgetYearOneBase": {
                "val": "25.348"
            },
            "BudgetYearTwo": {
                "val": "22.188"
            },
            "BudgetYearThree": {
                "val": "21.319"
            },
            "BudgetYearFour": {
                "val": "21.632"
            },
            "BudgetYearFive": {
                "val": "22.058"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 increase for EW Countermeasure demonstrations."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates electronic warfare (EW) sensors and software intended to deny, disrupt, locate or destroy the enemy's command, control, and communications (C3) systems and intelligence, surveillance and reconnaissance assets. This PE matures both countermeasures (CM) and counter-countermeasures (CCM) to deny the enemy the use of their systems while protecting US assets from enemy deception and jamming. Project K15 matures and demonstrates capabilities to locate and exploit enemy communication systems including computer networks. Project K16 matures and demonstrates multifunctional EW capabilities (jamming) to enhance platform survivability and provide near real-time situational awareness to the commander through the detection, identification and geo-location of emitters of interest.\n\nWork in this PE is complimentary of PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), and PE 0603772A (Advanced Tactical Computer Science), and fully coordinated with PE 0603003A (Aviation Advanced Technology) and PE 0603313A (Missile and Rocket Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.640"
                },
                "CurrentYear": {
                    "val": "21.683"
                },
                "BudgetYearOne": {
                    "val": "22.598"
                },
                "BudgetYearOneBase": {
                    "val": "22.598"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.046"
                },
                "CurrentYear": {
                    "val": "21.683"
                },
                "BudgetYearOne": {
                    "val": "25.348"
                },
                "BudgetYearOneBase": {
                    "val": "25.348"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.594"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.750"
                },
                "BudgetYearOneBase": {
                    "val": "2.750"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.594"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.750"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.750"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "K15"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Comm Ecm Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.737"
                        },
                        "CurrentYear": {
                            "val": "9.799"
                        },
                        "BudgetYearOne": {
                            "val": "9.951"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.951"
                        },
                        "BudgetYearTwo": {
                            "val": "9.797"
                        },
                        "BudgetYearThree": {
                            "val": "9.477"
                        },
                        "BudgetYearFour": {
                            "val": "9.645"
                        },
                        "BudgetYearFive": {
                            "val": "9.828"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates sensor and software technologies to locate and identify modern tactical enemy and blue force (friendly) radio frequency (RF) communications, radars and computer networks and nodes. This project enables uninterrupted air and ground based intelligence collection and long range targeting operations in a hostile electromagnetic and cyber environment, and enables communications countermeasures (CM) and counter-countermeasures (CCM) to first intercept, identify, and locate tactical communications, then degrade threat-computer networks and their components.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Soldier, Ground and Air portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications - Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Offensive Operations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates integrated electronic attack (EA) and computer network operations (CNO) hardware and software to execute force protection (FP), EA, electronic surveillance (ES) and signals intelligence (SIGINT) missions in a dynamic, distributed and coordinated fashion. This results in the capability to engage a multitude of diverse multi-node, multi-waveform, multi-platform and cyber (internetworked computers) targets while maximizing overall network efficiency and effectiveness, and preserving blue force\/non-combatant communications. Work being accomplished under PE 0603270A\/project K16 and PE 0602270\/project 906 compliment this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.096"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued fabrication and coding of integrated networked electronic warfare (EW) technologies and techniques to address current and emerging threat priorities; completed network load balancing and resource management techniques to aid in this integration; refined and integrated real-time, on-the-move (OTM) direction finding \/ geolocation technologies; demonstrated EW technologies in a distributed Comms-EW mission at various levels of interoperability with network registered assets (e.g., coexistence, interoperation, and fully integrated) in conjunction with an existing FP mission. Demonstration scenario: an individual EW asset acquires three threat signals but is only able to address and defeat one of them due to constraints (e.g., power, bandwidth, or etc.). Because all three detections are reported to the network, other EW assets can address and defeat the two outstanding signals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate supporting messaging structures and human-machine interfaces to enable remote users to coordinate the planning and management of EW assets; finalize specifications and protocols to support the collaborative OTM EW functionality of future tactical EW systems; develop CYBER situation awareness functionality for non-traditional tactical EW\/Cyber assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.976"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.976"
                                            },
                                            "Text": {
                                                "val": "Will code and demonstrate protocol exploitation software and techniques that allow users to remotely coordinate, plan, control and manage tactical EW and Cyber assets; develop techniques to exploit protocols of threat devices not conventionally viewed as Cyber to expand total situational awareness by providing access to and control of adversary electronic devices in an area of operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stand-off Non-Cooperative Multi-Intelligence Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates hardware and software to conduct standoff intelligence, surveillance and reconnaissance in a three dimensional urban battlespace. The goal is to detect, identify, map and display personnel, RF devices and other anomalies located within structures and complex terrain to provide dismounted and remote users with real-time, immediate-area situational awareness. In FY13 and FY14 this effort supports Technology Enabled Capability Demonstration 3.b: Surprise\/Tactical Intelligence-Actionable Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.641"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated and demonstrated software, algorithms and techniques that provided stand-off sense-through-the-wall,  counter-cover\/concealment\/camouflage, and denial-and-deception as pre-planned product improvement increments into PEO Soldier\/PM Soldier Sensors & Lasers hand held devices; demonstrated target identification and discrimination technologies (e.g., RF measures and signals intelligence appliques, personnel detection and fused reporting) against select modern RF emitter threats, RCIEDs and other targets with low or indistinct emissions for both airborne and ground based platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Examine current and emerging RF threat discrimination and neutralization algorithms and hardware suites of disparate RF measurement and signals intelligence (MASINT) systems to design an integrated MASINT\/Multi-INT vehicle-mounted detection system that is fully interoperable with current electronic countermeasures; analyze and identify new waveforms, techniques and common hardware components needed to facilitate integration and modularity of an integrated multi-INT system; compose sensor cross cueing algorithms to increase the probability of detection of threat devices with low or indistinct emissions at greater standoff distances; extend detection capability to monitor multiple threat device emissions\/transmissions simultaneously."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.975"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.975"
                                            },
                                            "Text": {
                                                "val": "Will integrate MASINT\/Multi-INT vehicle mounted detection capability with soldier and airborne sensors (electro- optic\/infrared\/full motion video) to support higher fidelity standoff detection and targeting of threat emitters for small units; mature multi-platform cross cueing techniques and test multi-int detection and geolocation in a laboratory environment; mature algorithms to fuse multi source detection, geolocation and targeting data into a high fidelity common display and design and code a mechanism to ingest this data into DCGS-A for greater area situational awareness."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K16"
                    },
                    "ProjectTitle": {
                        "val": "Non-Commo Ecm Tech Dem"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.309"
                        },
                        "CurrentYear": {
                            "val": "11.884"
                        },
                        "BudgetYearOne": {
                            "val": "15.397"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.397"
                        },
                        "BudgetYearTwo": {
                            "val": "12.391"
                        },
                        "BudgetYearThree": {
                            "val": "11.842"
                        },
                        "BudgetYearFour": {
                            "val": "11.987"
                        },
                        "BudgetYearFive": {
                            "val": "12.230"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates non-communication, multi-functional electronic warfare (EW) capabilities that enhance the survivability of Army air and ground platforms and dismounted Soldiers. This project matures and demonstrates radio frequency (RF), infrared (IR) and electro-optical (EO) sensors and jamming sources to detect, locate, deceive, and neutralize (jam) booby traps, radar-directed target acquisition systems, target-tracking sensors, surface-to-air missiles (SAMs), air-to-air missiles (AAMs), and top-attack and electronically-fuzed munitions. This project also enables electronic support (ES) hardware and software to detect, identify and geolocate emitters of interest from an effective standoff distance to provide near real-time situational awareness.\n\nThis project supports Army science and technology efforts in the Command Control, Communications and Intelligence, Ground, Air and Soldier portfolios.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronic Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Aperture Infrared Countermeasures (DAIRCM) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates countermeasure technologies that provide platform protection and integrated cueing against electro-optically (EO),  infra-red (IR) and radio frequency (RF) guided threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.344"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted field demonstration of single modular, compact pointer tracker capability with a multiband laser jammer and an advanced 2-color missile warner capable of searching and defeating multiple engagements of enemy EO\/IR threats; demonstrated capability against a representative advanced infrared man-portable air defense system design; perform assessment on correlation algorithms and architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.193"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Modify the pointer tracker optics to broaden the wavelength coverage from near to mid-IR to allow for simultaneous jam and receive capability; integrate modified optics and design, code and integrate jam\/receive deconfliction algorithms into pointer tracker system; demonstrate closed-loop interrogation techniques against seekers in a hardware-in-the-loop laboratory environment; conduct limited field assessment of closed-loop interrogation techniques against simulated IR missiles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.012"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.012"
                                            },
                                            "Text": {
                                                "val": "Will modify IR jam\/receive deconfliction algorithms and interrogation techniques to develop cooperative countermeasures to protect multiple aircraft; integrate air threat detection and geo-location data with ground situational awareness to cooperatively defeat threats to both air and ground platforms; integrate miniature waveform generators, efficient high power amplifiers, and optical fiber signal distribution to add a low weight\/power RF jammer to Army rotorcraft; mature and leverage EO, IR and RF jammers for an integrated aircraft survivability architecture for more efficient jamming and reduced observable signature of the aircraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Tactical Radio Frequency Countermeasures (ATRFCM) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates integrated EW\/direction finding technologies that provide protection of air, ground and dismounts from emerging RF threats at standoff distances. Work accomplished under PE 0602120A\/project H15, PE 0602270A\/project 906, and PE 0603270A\/project K15 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.565"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a distributed, networked, multi-platform (air and ground) EW framework enabling the coordinated detection, geolocation, reporting, and engagement of multiple diverse threat waveforms;  demonstrated automatic synchronization of EW framework with blue force communications to deconflict threats from friendly forces for improved survivability and situational awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.191"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enhance software and firmware of advanced EW demonstration platform to implement and demonstrate coordinated detect\/defeat capability; demonstrate increased threat coverage and protection range offered by distributed, cooperative jamming capability for protection of convoys; develop dynamic, local area timing schemes to support simultaneous\/multi-function EW\/defensive electronic attack (EA) capabilities; design logic circuitry and associated software code to integrate electronic support (ES) and EA functionalities in a coordinated ES\/EA capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.762"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.762"
                                            },
                                            "Text": {
                                                "val": "Will modify and integrate previously matured techniques and develop new techniques, algorithms and waveforms for the detection, location and neutralization of RF threat devices; mature techniques to provide an integrated situational awareness picture and countermeasures against identified threats; improve interoperability between detection and neutralization systems with other systems on the platform such as communications, networking and global positioning system\/position navigation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat ID Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort augments and enhances existing light weight dismount and tactical vehicles systems to add real-time Combat Identification (CID) capabilities, along with embedded training, without significantly altering size, weight and power of current and emerging equipment packages. The focus is on making current systems and capabilities (weapon sites, radios, sensors, and etc.) multifunctional rather than adding stand-alone CID systems that would increase the burden on the Soldier. Work accomplished under PE 0602120A\/project H15 compliments this effort. In FY13and FY14 this effort supports Technology Enabled Capability Demonstration 3.b: Surprise\/Tactical Intelligence-Actionable Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Leveraged light vehicle demonstration to complete final waveform modifications and selected Software Radio Waveform interrogation approach for coding onto Joint Tactical Radio System platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate duel interrogation (laser\/RF with weapons orientation sensors) capability to increase probability of positive friend, enemy, neutral, non-combatant identification at increased ranges; modify wireless personal area network waveforms and soldier radio waveform to transmit RF position location information to existing mobile\/handheld displays; modify existing weapons system software to add audible, tactile and visual cues into weapon sight for display; improve CID training mode with electronic bullet capability for existing hardware to support both mission execution and training functions; exploit multiple sensor (infrared, RF, etc.) integration to support non-cooperative CID."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.123"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.123"
                                            },
                                            "Text": {
                                                "val": "Will complete component modifications to multifunction laser, site and weapon orientation module which are used to increase probability of positive friend, enemy, neutral non-combatant identification at increased ranges; conduct laboratory and limited field test to demonstrate modified wireless personal area network waveforms and Soldier radio waveforms, weapons orientation module and multifunction laser;  document and assess user feedback and make appropriate component and integration modifications; mature non-cooperative target identification techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EW Counter Countermeasures"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates hardware and software to counter emerging electronic warfare threats.  Work being accomplished under PE 0602270A\/project 906 compliments this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Will leverage technical assessments of a family of threat systems and conduct a full vulnerability assessment on these systems, generate potential mitigation strategies, determine associated CONOPs and employment scenarios; mature and optimize mitigation strategies that have the highest probability of success by demonstrating the feasibility of the proposed approached in the laboratory, leveraging threat system components, surrogates and modeling and simulation resources."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}