{
    "id": "8f35b36d33e74f1918cfdb935b3ff7029b8292cb",
    "meta": {
        "filename": "dod-2014_RDTE_2014_NAVY_BA1_3_RDTE_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605853N"
        },
        "ProgramElementTitle": {
            "val": "Management, Technical & Intl Supt"
        },
        "R1LineItemNumber": {
            "val": "147"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "56.441"
            },
            "CurrentYear": {
                "val": "32.782"
            },
            "BudgetYearOne": {
                "val": "76.585"
            },
            "BudgetYearOneBase": {
                "val": "76.585"
            },
            "BudgetYearTwo": {
                "val": "81.087"
            },
            "BudgetYearThree": {
                "val": "96.862"
            },
            "BudgetYearFour": {
                "val": "100.305"
            },
            "BudgetYearFive": {
                "val": "101.635"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "International Cooperative RDT&E: provide program management, execution, and support to implement a broad range of cooperative Naval Research and Development, Test and Evaluation initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations, and identify cooperative international opportunities, and improve coalition interoperability.  In addition, it develops coherent approaches, coordinating with partner nations, to sea-based missile defense, command, control, communications, computers and intelligence (C4I), and cooperative acquisition programs while also identifying technology to support the Global Maritime Partnership initiative.\n\nNaval War College Strategic Studies Support:  Provides research, analysis and gaming activities which serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, joint and interagency communities.  These efforts generate strategic and operational alternatives, quantitative analysis, war gaming and political military assessments, and provide recommendations regarding the formulation and execution of maritime options .  The War Gaming Department plans, designs, executes, analyzes and reports on the Navy's Title 10 war games.  These war games provide analytical input to the Navy's Strategic Plan, assessments of future concepts, and recommendations to the Navy's Quadrennial Defense Review, force design, and strategy process.  The War Gaming Department also designs, executes and analyzes war games for theater security cooperation plans and operational war fighting issues.  \n\nAssessment Program: The Navy Assessment Program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect war fighting capability trades and enterprise resources, identifies needs, gaps, and overlaps, and assesses alternative solutions to Joint needs.  The program supports both the development and use of modeling, simulation and analytically-based warfare and provides business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations (CONOPS), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Systems (Information Dominance); warfare systems (Sea Strike, Sea Shield, and Sea Basing) and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports \"A Cooperative Strategy for 21st Century Seapower 21\" as modified by the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring or reacting quickly should one occur to avoid negative impact to the United States.  It serves as an independent assessor providing a broad-view perspective across the Navy staff apart from resource sponsors, with an integrated look at both war fighting and war fighting support programs.  The program supports the world class modeling efforts to attain a level of Modeling and Simulation (M&S) capability that is world class and establishes the Navy as a leader in the Department of Defense (DoD) M&S community.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.  It develops tools and analytical methodologies that assist in evaluating Navy programs and provides technical leadership for the analysis functional area of Naval Modeling and Simulation.\n\nMid-Range Financial Improvement Plans: This project supports the Research Development Test & Evaluation, Navy (RDTEN) portion of the larger DoD and Navy-wide effort to implement the financial improvement plan.  Funding is for the sustainment of clean and auditable statements for RDTEN.\n\nOperations Integration Group:  Classified\n\nCHENG: Develops and implements architecture-based systems engineering processes, methods and tools that assure integrated and interoperable systems are delivered to the fleet.  This project provides the mission-oriented technical basis for implementing capability-based acquisition management within the Navy to engineer and field Navy and Marine Corps combat systems, weapon systems, and command, control, communications, computers and intelligence (C4I) programs that must operate as  family-of-systems (FoS) or system-of-systems (SoS).  The focus of this project is on identifying the functions, relationships, and connections between systems at both the force and unit level and across warfare mission areas, and encompasses three key elements:  Systems Engineering to provide the framework for making engineering decisions by war fighting capability at the FoS\/SoS level and supports consistent engineering and investment decision-making across Navy and Marine Corps programs within capability-based acquisition portfolios.  Naval Collaborative Engineering Environment development and implementation as a DON enterprise resource for Naval integration and interoperability information to enable collaboration and decision support among Fleet organizations, Program Executive Offices, Program Managers, Systems Commands, prime contractors, Resource\/Warfare Sponsors and Comptroller organizations.  Standards, Policies and Guidelines engineering and technical staff to implement DoN, Office of the Secretary of Defense (OSD) and Joint integration and interoperability and Anti-Tamper initiatives.\n\nNaval Research Laboratory (NRL)Facilities Modernization: This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "58.162"
                },
                "CurrentYear": {
                    "val": "32.782"
                },
                "BudgetYearOne": {
                    "val": "56.516"
                },
                "BudgetYearOneBase": {
                    "val": "56.516"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "56.441"
                },
                "CurrentYear": {
                    "val": "32.782"
                },
                "BudgetYearOne": {
                    "val": "76.585"
                },
                "BudgetYearOneBase": {
                    "val": "76.585"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.721"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "20.069"
                },
                "BudgetYearOneBase": {
                    "val": "20.069"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.616"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.105"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.589"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.589"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "20.658"
                                },
                                "BudgetYearOneBase": {
                                    "val": "20.658"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0149"
                    },
                    "ProjectTitle": {
                        "val": "International Coop RDT&E"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.915"
                        },
                        "CurrentYear": {
                            "val": "3.031"
                        },
                        "BudgetYearOne": {
                            "val": "4.316"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.316"
                        },
                        "BudgetYearTwo": {
                            "val": "4.149"
                        },
                        "BudgetYearThree": {
                            "val": "3.819"
                        },
                        "BudgetYearFour": {
                            "val": "3.897"
                        },
                        "BudgetYearFive": {
                            "val": "3.967"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Provides program management, execution, and support to implement a broad range of cooperative naval Research and Development, Test and Evaluation (RDT&E) initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations, identify cooperative international opportunities, and improve coalition interoperability.  In addition, it develops coherent approaches in coordination with combatant commanders (COCOMs), and appropriate partner nations, to sea-based missile defense, command, control, communications, computers and intelligence (C4I), and cooperative acquisition programs while also identifying technology to support the Global Maritime Partnership Initiative.\n\nThe project scope supports the strategic shift to the Pacific Region with emphasis on Maritime Domain Awareness (MDA) and Coalition Interoperability.  Relationships have been, and are being initiated with a greatly expanded and diverse group of maritime countries, particularly those with nascent and littoral navies.  The project was restructured internally to both maintain ongoing international relationships and projects, while preparing to facilitate support for a global network of maritime nations under MDA and Coalition Interoperability requirements. \n\nOngoing cooperative RDT&E programs, projects and exchanges are pursued to identify cooperative acquisition programs, enhance OCO efforts and MDA development, fill capability gaps, improve US\/coalition interoperability, and set standardization with international partners. Such efforts have resulted in:\n1. Negotiating and developing approximately 57 international RDT&E Agreements annually with allied and friendly nations;\n2. Executing approximately 300 Information Exchange Annexes (IEAs) with foreign partners;\n3. Improving IEA information dissemination with allied and friendly countries and within Department of the Navy (DoN);\n4. Coordinating Navy inputs to the Office of the Under Secretary of Defense (OUSD) Acquisition, Technology, and Logistics (AT&L) Foreign Comparative Test (FCT) Program, and Coalition Warfare Program (CWT) as well as the DoN Technology Transfer Security Assistance Review Boards (TTSARB). \n5. Represent the US Navy in Office of the Secretary of Defense (OSD) directed Armaments Cooperation Forums, including the Conference of NATO Armaments Directors' groups {NATO Naval Armaments Group (NNAG)}, and Senior National Representative-Maritime (SNR-M);\n6.  Funding of various international RDT&E support databases including Technical Project Officer (TPO), International Agreement Generators, Information\/Data Exchange Agreements, and Project Agreements\/Memorandums of Understanding;\n7.  Leading the Engineering and Scientist Exchange Program (ESEP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Coop RDT&E"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintained internal DoN international databases to support international cooperative activities and projects with allies. Assessed functional ability to integrate DoN international databases across OPNAV departments to improve leveraging of program dollars, fielding of better products and speeding delivery.\n\n- Continued to support Maritime Theater Missile Defense Forum that obtained $8.1M in R&D monies from Partner Nation contributions.The multi-lateral forum (9 Maritime Partner countries and the US Navy) entered into four international agreements (Battle Management Command, Control, Communications, Computers and Intelligence (BMC4I); Distributed Engineering Plant; Open Architecture; and Modeling and Simulation (M&S)). The Maritime Theater Missile Defense Forum has a goal of an at-sea capability demonstration in 2015.\n- Continued execution of approximately 300 Information Exchange Agreements\/Date Exchange Agreements (IEA\/DEA) with more than 30 countries.\n- Continued execution and support in placement of US Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP). \n- Continue to coordinate US Navy participation in OUSD(AT&L) Foreign Comparative Test (FCT) and the Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements.\n-Funded various evolving potential cooperative exchanges and projects contributing to Maritime Domain Awareness (MDA) and irregular warfare including Multi-Mission Aircraft (MMA), Broad Area Maritime Surveillance (BAMS), Submarine Littoral Weapons System, and Swimmer Engagement. Coordinated US Navy support to OUSD (AT&L) International Cooperation office.\n-Supported new CNO-Initiated Strategy Dialogue with Australia, including:  (1) Expeditionary Warfare Working Group (EWWG); (2) Above Water Working Group (AWWG); (3) Undersea Warfare Working Group (UWWG); (4) Communications & Information Warfare Working Group (CIWWG); and (5) Amphibious Operations Working Group (AOWG).  Supported NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs including harbor protection, electronic warfare, and Defense Against Terrorism (DAT) trials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.031"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY12."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.316"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.316"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY13."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Navy International Cooperative RDT&E project supports the implementation of many international cooperative program activities throughout the Department of the Navy (DoN) RDT&E communities. The project funds DoN participation in NATO and OSD lead Armaments Cooperation as well as DoN lead international cooperation that promotes coalition interoperability and set standards with international partners. The focused activities under this project maximize the DoN's efforts by leveraging international technologies and funding to fill capabilities gaps, gain access to foreign research and testing data, and avoid duplication of research and development efforts. The performance goals and metrics are, in cooperation with Maritime Partner nations, to set and harmonize requirements, utilize respective technologies, encourage financial contributions and facilities use, and support forums and work that reduce DoN funding requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "1767"
                    },
                    "ProjectTitle": {
                        "val": "Naval War Col Strategic Studies Supt"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.927"
                        },
                        "CurrentYear": {
                            "val": "3.473"
                        },
                        "BudgetYearOne": {
                            "val": "5.314"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.314"
                        },
                        "BudgetYearTwo": {
                            "val": "5.182"
                        },
                        "BudgetYearThree": {
                            "val": "4.828"
                        },
                        "BudgetYearFour": {
                            "val": "4.910"
                        },
                        "BudgetYearFive": {
                            "val": "4.998"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Naval War College (NWC) research, analysis and gaming activities serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, Joint and Interagency communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analysis, war gaming, political-military assessments, and provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Studies"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts research in strategic studies in response to tasking from the Secretary of the Navy (SECNAV), Chief of Naval Operation (CNO), Fleet Commanders, numbered Fleet Commanders, and Combatant Commanders.  NWC also hosts the activities of the CNO's Strategic Studies Group (SSG).  The CNO SSG is a select group of senior naval officers handpicked by the CNO, who report to him in the development of revolutionary warfighting and operational concepts, such as Sea Strike and FORCEnet."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.460"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conducted research and analysis projects and provided supporting events for the Office of the Chief of Naval\n  Operations (OPNAV), the numbered Fleets, Navy Component Commanders, and the Combatant Commanders.  \n- Conducted support for the OPNAV Staff on operational and strategic level of war tasked research projects.   \n- Conducted CNO SSG tasking from the CNO to SSG XXX to generate revolutionary operating and warfighting concepts for \n  maritime operations in the age of hypersonic and directed energy weapons.  Followed up on CNO and OPNAV actions\n  resulting from SSG XXVIX Final Report \"The Unmanned Imperative.\" \n- Conducted research into the Chinese Maritime capabilities and affairs in order to enhance understanding of global\n  developments and provided studies and advice for the CNO and the fleet. \n- Conducted research in support of the refresh to the Navy's Strategy \"Cooperative Strategy for the 21st Century\"."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.433"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct research and analysis projects and provide supporting events for OPNAV, the numbered Fleets, Navy Component\n  Commanders, and the Combatant Commanders.   \n- Continue to support the OPNAV Staff on tasked research projects.  \n- CNO SSG tasking from the CNO to SSG XXXI to generate revolutionary operating and warfighting concepts for future Navy\n  and maritime operations.  Following up on CNO and OPNAV actions resulting from SSG XXIX Final Report. \n- Conduct research into the Chinese Maritime capabilities and affairs in order to enhance understanding of global \n  developments and provide studies and advice for the CNO and the fleet. \n- Conduct research in support of the refresh to the Navy's Strategy \"Cooperative Strategy for the 21st Century.\""
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.484"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.484"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct research and analysis projects and provide supporting events for OPNAV, the numbered Fleets, Navy\n  Component Commanders, and the Combatant Commanders.   \n- Continue to support the OPNAV Staff on tasked research projects.  \n- CNO SSG tasking from the CNO to SSG XXXII to generate revolutionary operating and warfighting concepts for future \n  Navy and maritime operations.  Following up on CNO and OPNAV actions resulting from SSG XXX Final Report. \n- Continue to conduct research into the Chinese Maritime capabilities and affairs in order to enhance understanding of\n  global developments and provide studies and advice for the CNO and the fleet."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval War Gaming Support"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts strategic and operational war gaming and research for the Office of the Chief of Naval Operations (OPNAV), the numbered Fleets, Fleet Commanders, and the Combatant Commanders.  Each year, 50-60 major war games and associated events provide support to efforts that explore and analyze military, political, informational and economic aspects of differing strategic and operational scenarios and tactical imperatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.681"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to conduct over 40-45 major war games and related events in support of OPNAV, the numbered Fleets, and the \n  Combatant Commands.   \n- Continued to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continued to provide war \n  gaming expertise to other services' Title 10 war games. \n- Continued to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such \n  as MDA, Irregular Warfare, cyber, and C4ISR. \n- Continued to foster and sustain cooperative relationships with international partners through the use of war gaming, \n  research, and analysis. \n- Continued to conduct research supporting war games co-sponsored with Naval Warfare Development Command (NWDC) and the\n  US Joint Staff Command.  \n- Continued to conduct analytic research on maritime security cooperation planning for forward based fleets.  \n- Supported Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure\n  protection. \n- Continued to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for\n  implementation of Cooperative Strategy for 21st Century Seapower.   \n- Continued to conduct high level policy analytic research and gaming addressing Proliferation Security Initiatives for\n  the Office of the Secretary of Defense (OSD).   \n- Continued war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime \n  security, and sea control. \n- Continued International War Gaming in support of Maritime Security Cooperation and implementation of Cooperative \n  Strategy for 21st Century Seapower.  \n- Continued to conduct research and analysis on key operational challenges, such as theater anti-submarine Warfare,\n  maritime missile defense, global maritime security, maritime homeland defense, maritime domain awareness, and sea\n  basing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.598"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct 40-45 major war games and related events in support of OPNAV, the numbered Fleets, and the\n  Combatant Commands.   \n- Continue to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continue to provide war\n  gaming expertise to other services' Title 10 war games. \n- Continue to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such\n  as MDA, Irregular Warfare, cyber, and C4ISR. \n- Continue to foster and sustain cooperative relationships with international partners through the use of war gaming,\n  research, and analysis. \n- Continue to conduct research supporting war games co-sponsored with Naval Warfare Development Command (NWDC). \n- Continue to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for\n  implementation of Cooperative Strategy for 21st Century Seapower.   \n- Continue to conduct high level policy analytic research and gaming addressing Proliferation Security Initiatives for\n  the Office of the Secretary of Defense (OSD).   \n- Continue war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime \n  security, and sea control. \n- Continue International War Gaming in support of Maritime Security Cooperation and implementation of Cooperative\n  Strategy for 21st Century Seapower.  \n- Continue to develop educational materials for the Maritime Advanced Warfighting School.  \n- Continue to conduct research and analysis on key operational challenges, such as theater anti-submarine Warfare,\n  maritime missile defense, global maritime security, maritime homeland defense, maritime domain awareness, and sea\n  basing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.721"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.721"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct 55-60 major war games and related events in support of OPNAV, the numbered Fleets, and the \n  Combatant Commands.   \n- Continue to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continue to provide war\n  gaming expertise to other services' Title 10 war games. \n- Continue to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such \n  as MDA, Irregular Warfare, cyber, and C4ISR.\n- Continue to conduct research, analysis, and war gaming of emerging concepts, such as anti access and area denial and \n  air sea battle.\n- Continue to provide research, analysis, and war gaming in support of Navy and Marine Corps issues identified by the\n  Naval Board.\n- Continue to foster and sustain cooperative relationships with international partners through the use of war gaming,\n  research, and analysis. \n- Continue to conduct analytic research on maritime security cooperation planning for forward based fleets. \n- Continue to lead the effort to conduct analytical research in opeational concepts of Cyber Warfare. \n- Continue to advance the concept of cyber war gaming, including development of cyber Common Operational Picture\n- Continue to support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical \n  infrastructure protection and counter piracy. \n- Continue to conduct research supporting war games co-sponsored with Naval Warfare Development Command (NWDC).  \n- Continue to support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical\n  infrastructure protection.\n- Continue to support Fleet Commanders with high quality Course of Action Analysis and war games of operational plans.  \n- Continue to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for\n  implementation of Cooperative Strategy for 21st Century Seapower.   \n- Continue to conduct high level policy analytic research and gaming addressing Proliferation Security Initiatives for\n  the Office of the Secretary of Defense (OSD).   \n- Continue war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime \n  security, and sea control. \n- Continue to develop educational materials for the Maritime Advanced Warfighting School.  \n- Continue to provide direct support to Navy operational level programs, such as the maritime staff Operators Course,\n  Executive Leaders Operational Course, CFMCC Course, and JFMCC Course.\n- Continue to conduct research and analysis on key operational challenges, such as theater ASW, IAMD, global maritime\n  security, maritime homeland defense, MDA, and sea basing.    \n- Continue to conduct research, analysis, and gaming on current area denial and anti access issues confronting naval\n  forces.\n- Continue to develop advanced war gaming analytical methods and tools, such as the use of multi touch multi user\n  boards and web based applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfare Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) supports senior decision-makers from the Department of Defense, Department of the Navy, the numbered Fleets, Fleet Commanders and Combatant Commanders in reaching well-informed, objective decisions on strategic, operational and programmatic issues through collaborative research which integrates traditional research and analysis with advanced decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.272"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to conduct major decision events in support of the Office of the Chief of Naval Operations (OPNAV), the\n  numbered Fleets, Fleet Commanders, and the Combatant Commanders.  Projects were in direct support of warfighting\n  analysis requirements for numbered fleet commanders and were expanded to include the Commander Seventh Fleet (C7F)\n  with particular focus on India and the Indian Ocean. \n- Conducted analytical research on key strategic and operational challenges, such as maritime ballistic missile defense,\n  proliferation security initiative, global maritime security, maritime situational awareness, maritime operations\n  headquarters, interconnectivity, and multi-service force deployment.   \n- Continued additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Conducted research targeted at the strategic and policy level decision making within China.\n- Continued to provide direct support to NWC student research groups and war gaming. \n- 20-30 major decision are conducted in support of these efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.325"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the\n  Combatant Commanders.  Projects are in direct support of warfighting analysis requirements for numbered fleet \n  commanders and are expanded to include Commander Seventh Fleet (C7F) with particular focus on India and the Indian\n  Ocean.   \n- Conduct analytical research on key strategic and operational challenges, such as maritime ballistic missile defense, \n  proliferation security initiative, global maritime security, maritime situational awareness, maritime operations\n  headquarters, interconnectivity, and multi-service force deployment.   \n- Continue additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Conduct research targeted at the strategic and policy level decision making within China. \n- Continue to provide direct support to NWC student research groups and war gaming. \n- 25-30 major decision events will be conducted in support of these efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the\n  Combatant Commanders.  Projects are in direct support of warfighting analysis requirements for numbered fleet\n  commanders and are expanded to include Commander Seventh Fleet (C7F) with particular focus on India and the Indian\n  Ocean.   \n- Conduct analytical research on key strategic and operational challenges, such as maritime ballistic missile defense,\n  proliferation security initiative, global maritime security, maritime situational awareness, maritime operations\n  headquarters, interconnectivity, and multi-service force deployment.   \n- Continue additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Conduct research targeted at the strategic and policy level decision making within China. \n- Continue to provide direct support to NWC student research groups and war gaming. \n- 30-40 major decision events will be conducted in support of these efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NWC Student Research Projects"
                                    },
                                    "Description": {
                                        "val": "Selected top performing Naval War College (NWC) students to conduct focused research and analysis of current and future strategic and operational challenges and tactical imperatives.  These students are organized under the supervision of the Mahan Scholars Program and the Halsey Group Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conducted focused research, analysis and war gaming of current and future strategic\/operational challenges and\n  tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups continued to conduct focused research, analysis and free-play war gaming of current and future\n  operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial\n  efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM)\n  and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continued in those areas\n  above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering\n  information denial and missile defense at the theater joint operational level.    \n- Conducted research for the Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.117"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct focused research, analysis and war gaming of current and future strategic\/operational challenges \n  and tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future\n  operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial\n  efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM)\n  and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continue in those areas\n  above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering\n  information denial and missile defense at the theater joint operational level.    \n- Continue to conduct research for the Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.117"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.117"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct focused research, analysis and war gaming of current and future strategic\/operational challenges\n  and tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future\n  operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial\n  efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM)\n  and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continue in those areas\n  above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering\n  information denial and missile defense at the theater joint operational level.    \n- Continue to conduct research for the Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Headquarters \/ Maritime Operations Center (MOC) Analysis"
                                    },
                                    "Description": {
                                        "val": "Formerly JFMCC\/Worldwide Naval Component Commanders (WNCC). Naval War College (NWC) conducts research and analysis at the operational level of war, including direct support for the Maritime Headquarters (MHQ) and Maritime Operations Centers (MOC), as well as Combined\/Joint Forces Maritime Component Commander (C\/JFMCC) activities.  These activities include support for concept and doctrine development of numbered fleet war games, exercises, education, research and analysis.  NWC is responsible for development of Professional Military Education for Naval Component Commanders and Numbered Fleet Staff personnel, and the Numbered Fleet Commander, including education and research initiatives in support of concept of operations development, training and C\/JFMCC advisory and assist team."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Researched\/developed educational products to enhance the activities and operational capability of the C\/JFMCC,\n  including conducting the US and international-based course materials.\n- Researched\/developed methods to improve direct support for the Numbered Fleet Commanders, including education,\n  exercise development and execution, planning methods\/means, assessment processes, and real-time execution of directed\n  tasks.\n- Researched\/developed specific MOC-related planning and assessment tools for the Commander, FOURTH Fleet in response\n  to Haiti contingency.\n- Provided assist team visits in support of analysis and definition of maritime operational processes, including\n  execution battle management, tasking subordinates, operational level planning and operational\/effects assessment. \n- Continued research into the required competencies for Maritime Staff Operations Course for officer and enlisted\n  personnel to successfully operate at the operational level of war.\n- Researched and developed educational products on maritime matters at the Operational Level of War (OLW) to better\n  prepare officers and senior enlisted personnel to effectively serve in operational staff assignments in Maritime\n  Operations Centers (MOC) at 3 or 4 star operational headquarters, or represent maritime planning efforts while\n  serving in other service, joint or combined liaison billets.\n- Developed methods to improve Naval War College's mission to provide a continuum of Joint Professional Military\n  Education and support operational commanders through enhanced education and training.  Included improved methods to\n  familiarize students with operational and Navy theory, concepts, doctrine, organizations, capabilities,\n  responsibilities, functions, planning and execution processes techniques and practices.\n- Provided subject matter expertise for concept and doctrine development of numbered fleet war games, exercises,\n  education, research and analysis. \n- Provided research and analysis of senior mentor and executive leadership development within maritime headquarters.  \n- Conducted research and analysis in competencies and manpower capabilities at the operational level of war, including\n  direct support for objective manpower resource data and decision making tools at operational level maritime\n  headquarters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.612"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.612"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "All activities:\n- Remain credible, relevant and focused through continued development of MOC processes, doctrine and edcucational\n  products.\n\nMaritime Staff Operators Course (MSOC):\n- Expand research into the required competencies for Maritime Staff Operations Course for officer and enlisted\n  personnel to successfully operate at the operational level of war.\n- Actively participate in creation and review of existing and emerging doctrine, and  have active involvement in\n  the development of evolving operational level issues.\n- Incorporate more interactive technologies for staff collaboration while conducting distributed operations.\n- Conduct research in advanced adaptive intelligence, information warfare, and other advanced decision-support tools,\n  including adapting Spiral-developed systems into the MOC classroom environment. \n- Continue research to improve coalition-related MOC education programs for International Officers and senior\n  officers (continued improvements).  Includes support for MAWS and alignment with all other operational level\n  education at NWC and other Service educational facilities.\n- Examine gaps in education at the OLW; develop COI to close same gaps (Information management\/knowledge management,\n  et al). \n\nAssist and Assess Team (AAT):\n- Expand research and analysis into integrating lateral and vertical operations of Commander, TENTH Fleet MOC with\n  operations at existing numbered fleet MOCs, USFFC and US Pacific Fleet, as well as upward to the new USCYBERCOM and\n  downward to subordinate CTFs and commands.\n- Conduct research and analysis into potential methods for integration of information operations (to include cyber\n  operations) with traditional kinetic joint fires operations.  Cyber operations (network attack, defense, and\n  exploitation) present unique challenges due to the global nature of the domain, the potential effects on other MOCs\n  and the importance of alignment for effective strategic communication.\n- Conduct research into how Navy units worldwide can support Commander, TENTH Fleet in the execution of the full\n  spectrum of information and cyber operations. \n- Provide tailored assistance to Commander, TENTH Fleet and Commanders of other MOCs to communicate results of above \n  research and analysis efforts and to strengthen staff knowledge of joint information operations planning, execution,\n  and assessment.\n\nJoint\/Combined Forces Maritime Commanders Course (J\/CFMCC):\n- Continue development\/research in national and international implications of maritime commander leadership roles, and\n  development of new flag course curriculum accordingly.\n- Research in the impacts of transition from contract to government employee support for senior mentors regarding  \n  implementation of CNO's priorities on operational level leadership and flag academics."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This project provides research, analysis and war gaming to meet the needs of the Secretary of the Navy, the Chief of Naval Operations, and Fleet Commanders.  Performance is measured in terms of both the quantity and quality of war games, analysis and the extent to which demand for war games and research products can be accommodated within funding levels.  Results of research products and war games are evaluated through customer feedback and the extent to which findings are incorporated into follow-on research and practical applications such as Navy doctrine, operational tactics, and programming decisions made during the Planning, Programming, Budgeting & Execution (PPBE) process."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2098"
                    },
                    "ProjectTitle": {
                        "val": "Navy Postgraduate School (NPS) Studies Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "14.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.000"
                        },
                        "BudgetYearThree": {
                            "val": "14.000"
                        },
                        "BudgetYearFour": {
                            "val": "14.000"
                        },
                        "BudgetYearFive": {
                            "val": "14.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Navy Postgraduate School (NPS) research and analysis activities serve as a focal point, stimulus, and major source of strategic, tactical and operational thought within the Navy communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analyses, technical developments and assessments, and political-military assessments, and they provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States.  Research will be conducted to support graduate students theses determination and completion as part of Faculty projects.  These research activities also serve as a means for OPNAV Resource Sponsors and Major Commands to have analysis and decision support research conducted in the uses of the applied, soft, and hard sciences in solving diverse and complex resource allocation and strategic issues facing the Navy today and envisioned in the future."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Faculty and Student Studies, Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Navy Postgraduate School (NPS) supports senior decision-makers from the Department of the Navy, the Office of the Chief of Naval Operations, Budget Submission Offices and Fleet Commanders in reaching well-informed, objective decisions on strategic, operational and programmatic issues through collaborative research which integrates traditional research and analysis with advanced decision support tools.  Student Theses will be an integral part of this program in support of the critical analysis and research conducted by the Faculty."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This is not a new program.  This effort was previously funded with operating funds and was determined to more appropriately be R&D."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This Project provides funding to support continuing need for studies and analysis to meet the needs of the Secretary of the Navy, the Chief of Naval Operations, Resource Sponsors, Major Commands and Fleet Commanders.  Performance is measured in terms of both the quantity and quality of the studies, research and analysis products that can be accommodated within funding levels. Results of research products are evaluated through customer feedback and the extent to which findings are incorporated into follow-on research and practical applications such as Navy doctrine, operational tactics, and programming decisions made during the Planning, Programming, Budgeting & Execution (PPBE) process.  This project supports research of both Naval Postgraduate School faculty and students,"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2221."
                    },
                    "ProjectTitle": {
                        "val": "JT Mission Assessment Studies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "30.222"
                        },
                        "CurrentYear": {
                            "val": "10.484"
                        },
                        "BudgetYearOne": {
                            "val": "23.102"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.102"
                        },
                        "BudgetYearTwo": {
                            "val": "28.162"
                        },
                        "BudgetYearThree": {
                            "val": "25.527"
                        },
                        "BudgetYearFour": {
                            "val": "28.026"
                        },
                        "BudgetYearFive": {
                            "val": "28.577"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Navy Assessment Program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect war fighting capability trades and enterprise resources, identifies needs, gaps, and overlaps, and assesses alternative solutions to Joint needs.  The program supports both the development and use of modeling, simulation and analytically-based warfare and provides business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations, Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance Systems (Information Dominance); warfare systems (Sea Strike, Sea Shield, and Sea Basing) and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports \"A Cooperative Strategy for 21st Century Seapower 21\" as modified by the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring or reacting quickly should one occur to avoid negative impact to the United States.  It serves as an independent assessor providing a broad-view perspective across the Navy staff apart from resource sponsors, with an integrated look at both war fighting and war fighting support programs.  The program supports the world class modeling efforts to attain a level of Modeling and Simulation (M&S) capability that is world class and establishes the Navy as a leader in the Department of Defense M&S community.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.\n\nBeginning in FY 2014, this project also includes funding for Concept Formulation (CONFORM) efforts.  This is a shift of funding from PE 0605152N, Studies and Analysis Support, Project 2092, Naval Warfare Studies.  CONFORM for ships, boats and unmanned maritime vehicles must be continuously exercised to remain viable. It takes years to train competent practitioners, and knowledge currency is quickly lost without practice. Evolving threats and technologies drive concepts (and the tools, processes, and skills needed to produce them) towards obsolescence without constant attention. Capability Based Assessments and Analysis of Alternatives (AoA) timelines are insufficient for establishing potential material solution cost versus capability relationships without significant concept formulation work beforehand. Active collaboration between the Office of the Chief of Naval Operations requirement sponsors, Program Offices, and the various System Command (Naval Sea Systems Command, Naval Air Systems Command and Space and Naval Warfare Systems Command) engineers is critical for fully exploring the trade space by conducting analysis for affordability, effectiveness and risk.  \nThe majority of Total Ownership Cost (TOC) is locked into a design before it is even a program. In the later stages of a program it becomes much more costly to make changes that will significantly impact TOC. Investment up front in concept design can have a high payoff in TOC reduction over the life of a platform class.\nThis project funds concept development engineering, mission effectiveness analysis, and other analyses for formulation of future surface ship and associated platform force structure along with development of the tools to accomplish these efforts. Advanced platform concept studies and systems technology assessments will be conducted as will the development and upgrade of concept design and engineering tools, methods, and criteria.\nOutputs include concept costing and performance parameterization for comparative assessment against capability objectives and synthesis to quantify overall (Fleet) capabilities. These products (expressions of cost vs. capability) will serve as the basis of requirements and Joint Capabilities Integration and Development System analysis, define the trade space for AoA efforts, and underpin discussion of force architecture\/structure during Quadrennial Defense Review, Long Range Shipbuilding Strategy builds, and Joint Requirements Oversight Council reviews.\nCapabilities-Based Assessment (CBA) is the Joint Capabilities Integration and Development System (JCIDS) analysis process that includes three phases: Functional Area Analysis (FAA), Functional Needs Analysis (FNA), and Functional Solution Analysis (FSA). The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval warfighting capabilities and force structure needed to support the Joint Requirements Oversight Council (JROC)\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Standard Scenarios with Warfare and Warfare Support Analyses"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.518"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Developed, updated, and maintained detailed level Navy Standard scenarios based on Defense Planning Guidance (DPG).  \n-Developed alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Developed, updated, and maintained analytic baselines for the Major Combat Operations (MCO) based on DPG. \n-Developed a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.  \n-Developed Measures of Performance (MOPs) and Measures of effectiveness (MOEs) and recommended appropriate modeling\/methodology to support analyses.  \n-Developed scenarios and operational concepts based on government inputs that are sufficiently detailed for use in Naval and Joint campaign analyses.  \n-At the mission level, scripted operational situations (OPSITS) or tactical situations (TACSITS) for use in effectiveness analyses in specific warfare mission areas.\n-Developed details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.802"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to update and maintain detailed level Navy Standard scenarios based on Defense Planning Guidance (DPG).  \n-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi Service Force Deployment Plans.\n-Maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.\n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in Naval and Joint campaign analyses.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses, and provide input to operational situations or tactical situations for use in effectiveness analyses in specific warfare mission areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.274"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.274"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Develop and continue to update and maintain detailed level Navy Standard scenarios based on DPG.-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Develop, update, and maintain analytic baselines for the MCO based on DPG. \n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Develop and continue to maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data were defined and traceable to government approved\/provided source material.  \n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses.  \n-At the mission level, script OPSITS or TACSITS for use in effectiveness analyses in specific warfare mission areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Capability Based Assessments with Campaign Mission Analyses Analytical and Technical Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.071"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Performed collaborative assessment with capability sponsors. \n-Proactively participated in Capability Sponsors' Integrated Process Teams. \n-Presented opposing analytically-based points of view to the Chief of Naval Operations (CNO) and Navy senior leadership. \n-Provided analytically-based decision recommendations to CNO for both war fighting and support areas. \n-Developed CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum (POM). \n-Assessed capability sponsors' products for senior leadership decision forums. \n-Conducted Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Conducted Overseas Contingency Operation (OCO) Capabilities-Based Assessments (CBAs) that provide a rapid and scalable process to utilize a Concept of Operation, develop investment strategy, and a capability roadmap. \n-Conducted Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Conducted independent assessment of Anti-Submarine Warfare. \n-Conducted weapons safety and sea basing capability assessments. \n-Conducted Intelligence, Surveillance, and Reconnaissance (ISR) and Meteorological and Oceanographic (METOC) assessment to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support Major Combat Operations (MCOs), the Overseas Contingency Operation (OCO), and intelligence preparation of the environment for both MCOs and OCO. \n-Performed Capabilities-Based Assessments (CBAs) to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Performed rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminate complex warfare issues which support decision-making in the Planning, Programming, Budgeting Execution process. \n-Performed analyses and provide technical and engineering support, including joint campaign analysis that examine the ability to counter a range of coordinate threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determine system capabilities; conducted analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and responded to transition to war and contingency operations. \n-Conducted cost analyses, cost-effectiveness analyses, and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum (POM) or Warfare Capability Plan. \n-Developed innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Provided rigorous business case assessments of complex issues relating to the war fighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Performed analyses for accreditation of models, use estimate cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.406"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to assess capability sponsors' products for Navy senior leadership decision forums. \n-Continue to perform collaborative assessment with capability sponsors. \n-Continue to proactively participate in Capability Sponsors' Integrated Process Teams. \n-Continue to present opposing analytically-based points of view to the Chief of Naval Operations (CNO) and Navy senior leadership. \n-Continue to provide analytically-based decision recommendations to CNO for both war fighting and support areas. \n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and POM. \n-Continue to assess capability sponsors' products for senior leadership decision forums. \n-Continue to conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Continue to conduct Overseas Contingency Operation (OCO) Capabilities-Based Assessments (CBAs) that provide a rapid and scalable process to utilize a Concept of Operation, develop investment strategy, and a capability roadmap. \n-Continue to conduct Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Continue to conduct independent assessment of Anti-Submarine Warfare. \n-Continue to conduct weapons safety and sea basing capability assessments. \n-Continue to conduct Intelligence, Surveillance, and Reconnaissance (ISR) and Meteorological and Oceanographic (METOC) assessment to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support Major Combat Operations (MCOs), the Overseas Contingency Operation (OCO), and intelligence preparation of the environment for both MCOs and OCO. \n-Continue to perform Capabilities-Based Assessments (CBAs) to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminate complex warfare issues which support decision-making in the Planning, Programming, Budgeting Execution process. \n-Continue to perform analyses including joint campaign analysis that examine the ability to counter a range of coordinate threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determine system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Continue to conduct cost-effectiveness analyses and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum (POM) or Warfare Capability Plan. \n-Continue to develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Continue to provide rigorous business case assessments of complex issues relating to the war fighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Continue to use estimate cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.501"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.501"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Perform collaborative assessment with capability sponsors. \n-Proactively participate in Capability Sponsors' Integrated Process Teams. \n-Present opposing analytically-based points of view to the CNO and Navy senior leadership. \n-Provide analytically-based decision recommendations to CNO for both war fighting and support areas. \n-Develop CNO investment strategy recommendations and assessments for Program Review and POM. \n-Assess capability sponsors' products for senior leadership decision forums. \n-Conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Conduct OCO CBAs that provide a rapid and scalable process to utilize a Concept of Operation, develop investment strategy, and a capability roadmap. \n-Conduct Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Conduct independent assessment of Anti-Submarine Warfare. \n-Conduct weapons safety and sea basing capability assessments. \n-Conduct ISR and METOC assessment to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Perform CBAs to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminate complex warfare issues which support decision-making in the Planning, Programming, Budgeting Execution process. \n-Perform analyses and provide technical and engineering support, including joint campaign analysis that examine the ability to counter a range of coordinate threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determine system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Conduct cost analyses, cost-effectiveness analyses, and analyses of new technologies in support of Sponsor Program Proposal, Navy POM or Warfare Capability Plan. \n-Develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Provide rigorous business case assessments of complex issues relating to the war fighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Perform analyses for accreditation of models, use estimate cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Campaign Analysis-Modeling and Simulation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.772"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Developed and maintained common baselines from which campaign excursions and mission-level analyses are executed. \n-Identified, developed, and improved data and modeling. \n-Led Navy's participation in the Office of the Secretary of Defense (OSD)\/Joint Staff analytic agenda, baseline development, and collection of data. \n-Provided coordination across the Navy. \n-Brokered agreements upon assumptions, Concept of Operations (CONOPS), scenarios, and data. \n-Led campaign analysis for the Office of the Chief of Naval operations (OPNAV). \n-Conducted modeling and simulation support for ongoing Office of the Chief of Naval operations (OPNAV) missile defense analysis requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.951"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue Navy's participation in Office of the Secretary of Defense (OSD)\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Continue to provide coordination across the Navy.\n-Continue to broker agreements upon assumptions, Concept of Operations (CONOPS), scenarios, and data.\n-Continue to lead campaign analysis of OPNAV.\n-Maintain common baselines from which campaign excursions and mission-level analyses are executed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.702"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.702"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Develop and maintain common baselines from which campaign excursions and mission-level analyses are executed. \n-Identify, develop, and improve data and modeling. \n-Lead Navy's participation in the OSD\/Joint Staff analytic agenda, baseline development, and collection of data. \n-Provide coordination across the Navy. \n-Broker agreements upon assumptions, CONOPS, scenarios, and data. \n-Lead campaign analysis for OPNAV. \n-Conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OSD\/Joint Staff Study Analysis and Assessment with Investment Strategy Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.102"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Coordinated and led the OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhance Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Provided overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance. \n-Provided analytically-based decision recommendations to the OPNAV for joint war fighting and support areas. \n-Conducted net assessments and provided independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Served as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Provided the lead requirements and acquisition for OPNAV. \n-Coordinated and led Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Participated in OSD and Joint Staff (JS) analysis assessment and provided structure for coordination across the Navy. \n-Coordinated and supported Joint Analytical Model Improvement Program. \n-Developed new analytic techniques for informing resource allocation decisions; conducted all campaign and warfare mission-level analyses and developed investment strategy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.067"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to coordinate OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhance Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Continue to provide overarching Planning, Programming, Budgeting, and Execution System (PPBES) analyses and guidance. \n-Continue to provide analytically-based decision recommendations to OPNAV for joint war fighting and support areas. \n-Continue to conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Continue to serve as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Continue to coordinate and lead Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Continue to develop new analytic techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.712"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.712"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Coordinate and lead OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhance Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Provide overarching PPBES analyses and guidance. \n-Provide analytically-based decision recommendations to OPNAV for joint war fighting and support areas. \n-Conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Serve as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Provide the lead requirements and acquisition for OPNAV. \n-Coordinate and lead Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Participate in OSD and JS analysis assessment and provided structure for coordination across the Navy. \n-Coordinate and support Joint Analytical Model Improvement Program. \n-Develop new analytic techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "World Class Modeling, Simulation, and Capability Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.780"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Developed and improved the Navy's analyses and assessment capabilities through innovative, concise, and credible Modeling and Simulation (M&S) to help optimize Navy programs, investment decisions, and policies across the Office of the Chief of Naval Operations (OPNAV) enterprise.\n-Focused on integrated analysis capabilities that cut across business and program accounts.  Specific efforts included: Field the Cyber Force Structure model that balances operational risks and deployment costs across cyber personnel, network architecture, operational procedures, and cyber security portfolio options.  \n-Developed medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.  \n-Integrated the components of ship readiness (operational, maintenance, etc.) into a Planning, Programming, Budget and Execution (PPBE) Performance-Pricing model with ship scheduling and optimization capability.  \n-Delivered interim version of Synthetic Theater Operations Research Model (STORM) with expanded logistic capabilities critical to United States Navy and United States Marine Corps.  \n-Improved air warfare models to include airborne electronic attack capabilities developed in FY11. \n-Delivered interim Integrated Air and Missile Defense mission model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.716"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.716"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Address the one-year backlog of Modeling and Simulation (M&S) efforts due to the lack of FY13 funding. Specifically modeling or analysis gaps that have been corporately deemed critical to improving POM decision-making.\n-Develop and improve analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement include mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Focus on integrated analysis capabilities that cut across business and program accounts.  Specific efforts will address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CONFORM"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.462"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.462"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct ship, boat and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs). Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n- Collaborate with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level. Warfare Systems effectiveness assessment tools will be continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems. Additionally, collaboration with aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands will refine fleet level requirements.\n- Refine platform concept stage cost analysis tools to predict cost better in areas where weight-based algorithms may not be appropriate. It will continually enhance tools to estimate total ownership cost more accurately at the ship and weapons system concept development stage. Conduct cost estimates in support of future concept design exploration, CBA, and AoA efforts. Further develop Cost Estimating Relationships (CERs) to accommodate emerging technologies incorporated in future platforms. Develop cost estimating tools which incorporate emerging technologies applicable to future platforms.\n- Conduct future force structure concept formulation. Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired. Among the areas to be examined are interoperability concepts, force architecture impact studies, Long Range Shipbuilding Schedule (LRSS) support, and operational employment concept studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Mission Assessment Studies"
                                    },
                                    "Description": {
                                        "val": "CBA - The CBA is the JCIDS analysis process that includes three phases: the FAA, the FNA, and the FSA. The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval war fighting capabilities and force structure needed to support the JROC\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.479"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue CBA efforts. Initiate CBA's supporting future Naval capability requirements for next generation shipbuilding, aviation and weapon systems.  Provide analysis support for development of the Integrated Sponsor Program Proposal supporting Guidance to develop the force direction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY12 CBA efforts. Provide analysis support for development of the Integrated Sponsor Program supporting Guidance to Develop the Force Direction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.735"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.735"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY13 CBA efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis of Alternatives for Anti Surface Warfare Capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct analysis of alternatives for Offensive Anti-Surface Warfare (OASUW) capabilities, based on analysis plan and kill chain linkages assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OASUW Pre-Milestone A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The additional funds in FY12 are required to initiate OASUW pre-Milestone A requirements to continue material solution analysis to ensure compliance with statutory and regulatory requirements of this pre-Major Defense Acquisition Program effort. Efforts to be performed in support of OASUW requirements include analysis to support development of the Technology Development Document, Capabilities Development Document, and Technical Demonstration documentation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A.\nN\/A\nN\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goal is to conduct analysis to support the Navy decisions needed to turn strategy and guidance into the Fleet needed within acceptable risk.\nThe May 2007 revision of the Joint Chiefs of Staff's Joint Capabilities Integration and Development System (JCIDS) instruction (CJCSI 3170.01F) requires a Capabilities-Based Assessment (CBA) to assess new requirements. A CBA instruction has been developed by the Chief Navy Office's warfare integration office that prescribes a procedure and structure to this warfighting requirements generation process (JCIDS). A CBA is required to address and validate capability shortfalls or gaps as defined by combatant commanders. It is an analytical process that includes three phases: the Functional Area Analysis, the Functional Needs Analysis, and the Functional Solution Analysis. This process is designed to address future warfighting requirements and analysis needs and improve the quality of Analysis of Alternatives. CBA supports Navy programming decisions and provides the means to develop the analytic underpinning to support the determination of Naval capabilities and force structure recapitalization investments required to fulfill the Maritime Strategy.\n-The overall goal is to conduct analysis to support the Navy decisions needed to turn strategy and guidance into the Fleet needed within acceptable risk. METRIC: Risks are balanced\nacross capability that delivers the right capabilities within the resources available to Navy. Navy Assessment Program supports the development of platform specific studies and\nCapability-Based Assessments, an analytical effort resulting in Functional Area Analysis, Functional Needs Analysis, and Functional Solutions Analysis. Efforts provide added\nanalytical rigor relative to program's maturation under the Joint Capabilities, Integration, and Development System and support warfare integration initiatives.\n-Navy Standard Scenarios with Warfare and Warfare Support Analyses: Goal: To ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics,\ncapabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved source material.\nMETRIC: Consistency with other ongoing analyses as directed, develop Measures of Performance and Measures of Effectiveness and recommend appropriate modeling\/methodology to\nsupport analysis. Models\/methodology used reflect study objects, level of fidelity required and time constraints.\n-Capability Based Assessments with Campaign Mission Analyses Analytical and Technical Support: Goal: To provide analyses and technical and engineering support including, but not\nlimited to, joint campaign analysis that examines the ability to counter a range of coordinated threat capabilities, high level tradeoffs between service capabilities, or impact of largescale\narchitecture, force structure of modernization decision; mission-level effectiveness analyses to determine system capabilities; analyses of alternative force structures to determine\nability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations; cost-effectiveness and analyses; Acquisition Category\nProgram Office and Systems Command assessments; and analyses of new technologies. METRIC: Develop analysis plans; determine proposed alternatives for analysis; and research\nperformance data on current and future threats, coalition and own force systems; perform technology investigations and forecasts; develop or obtain cost data for current or planned\nsystems; develop and use Cost Estimating Relationships to determine cost for conceptual or future systems for which no cost data is available; identify analysis assumptions, limitations\nand uncertainties; use established models or develop new models or methodologies to perform analyses; and interpret and analyze results.\n-Campaign Analysis-Modeling and Simulation: Goal: Develop and maintain a standard set of models for use in warfare analyses and analyses performed to support Planning Strategy\nthat work at the campaign, mission, and engagement levels. METRIC: A combination of model design statements, model study reports, system specifications, updated model reports,\nmodel\/database documents, model verification and validation plans, code, and Plan of Action and Milestones reports developed or updated that encompass all aspects of Sea Power 21\nto include at a minimum air, land, sea, and Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance.\n-Joint Assessments and Integration and Investment Strategy Development: Goal: Conduct assessments to determine shortfalls and redundancies in existing or planned operational or\nsupport capabilities; identify key issues including deficiencies in war fighting capability; determine priorities for needed capabilities; assesses affordability of high payoff systems\nand technologies; assess effectiveness and affordability of alternative force structures; and formulate investment strategies. Continue development and refinement of Navy program\nplanning to determine the war fighting wholeness and cost effectiveness of alternative Navy strategies. METRIC: Identify shortfalls and redundancies in existing or planned capabilities.\nDetermine the impact of variations in warfare systems and architectures in threat, U.S. and combined forces and strategies. Provide engineering and analytic support for the assessment\nand transition of technology for use in the Investment Strategy.\n-World Class Modeling (WCM), Simulation, and Capability Analysis: Goal: Development of new models or model upgrades to meet requirements identified by the WCM requirements\nprocess that support the Program Objective Memorandum decision-making process, with the goal of creating a state-of-the art set of models for use in warfare and warfare support\nanalyses. METRIC: Develop model design documents, model study reports, system specifications, updated model reports, model documentation, model verification and validation\nplans, code, Plan of Action and Milestones reports, and technical reports."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3025"
                    },
                    "ProjectTitle": {
                        "val": "Mid-Range Financial Improvement Plans"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.212"
                        },
                        "CurrentYear": {
                            "val": "0.647"
                        },
                        "BudgetYearOne": {
                            "val": "0.879"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.879"
                        },
                        "BudgetYearTwo": {
                            "val": "0.890"
                        },
                        "BudgetYearThree": {
                            "val": "0.840"
                        },
                        "BudgetYearFour": {
                            "val": "0.870"
                        },
                        "BudgetYearFive": {
                            "val": "0.886"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "One of DoD's and Navy's priority goals is to gain a clean and auditable financial statement.  The Office of the Secretary of Defense (OSD) Comptroller, in his 8 August 2003 memorandum, directed the Military Departments and Defense Agencies, in coordination with the Defense Finance and Accounting Service (DFAS), to prepare a comprehensive mid-range financial improvement plan to identify measurable steps to ensure each material line is auditable, and ensure all major deficiencies are resolved.  \n\nThis project supports the Research, Development, Test and Evaluation, Navy (RDT&E,N) portion of the larger DoD and Navy-wide effort to implement the Financial Improvement Plan (FIP).  Corrective actions required to resolve known deficiencies and determine resource requirements (people and systems) are being identified."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mid-Range Financial Improvement Plans"
                                    },
                                    "Description": {
                                        "val": "Decrease from FY12 to FY13 due to reduced level of effort for audit readiness and sustainment phase of FIP.\nIncrease from FY13 to FY14 due to increased effort for audit assertion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.212"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued performing obligation validations ensuring accuracy.\n- Continued eliminating problem disbursements older than 120 days, narrowing to 60 days, and potentially narrowing even further.\n- Continued to be proactive in executing the first and second phases (discovery and correction) of the Office of Management and Budget Circular No. A-123 process which requires Federal agencies to take responsibility for conducting a rigorous assessment of internal controls over financial reporting.\n- Continued to participate in the Navy Financial Management Office (FMO) segment testing which includes Reimbursable Work Order (RWO) Grantor, RWO-Performer, and Funds Distribution and Reporting.\n- Supported the Statement of Budgetary Resources (SBR) assertion with Naval Audit Service FY 2012"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.647"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY12."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.879"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.879"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY13."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Financial records are compliant in accordance with the Chief Financial Officers Act."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3039"
                    },
                    "ProjectTitle": {
                        "val": "CHENG"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "16.047"
                        },
                        "CurrentYear": {
                            "val": "12.725"
                        },
                        "BudgetYearOne": {
                            "val": "18.631"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.631"
                        },
                        "BudgetYearTwo": {
                            "val": "18.392"
                        },
                        "BudgetYearThree": {
                            "val": "17.337"
                        },
                        "BudgetYearFour": {
                            "val": "17.693"
                        },
                        "BudgetYearFive": {
                            "val": "18.010"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Develops and implements architecture-based systems engineering processes, methods and tools that assure integrated and interoperable systems are delivered to the fleet.  This project provides the mission-oriented technical basis for implementing capability-based acquisition management within the Navy to engineer and field Navy and Marine Corps combat systems, weapon systems, and command, control, communications, computers and intelligence (C4I) programs that must operate as  family-of-systems (FoS) or system-of-systems (SoS).  The focus of this project is on identifying the functions, relationships, and connections between systems at both the force and unit level and across warfare mission areas, and encompasses three key elements:  Systems Engineering to provide the framework for making engineering decisions by war fighting capability at the FoS\/SoS level and supports consistent engineering and investment decision-making across Navy and Marine Corps programs within capability-based acquisition portfolios.  Naval Collaborative Engineering Environment development and implementation as a DON enterprise resource for Naval integration and interoperability information to enable collaboration and decision support among Fleet organizations, Program Executive Offices, Program Managers, Systems Commands, prime contractors, Resource\/Warfare Sponsors and Comptroller organizations.  Standards, Policies and Guidelines engineering and technical staff to implement DoN, Office of the Secretary of Defense (OSD) and Joint integration and interoperability and Anti-Tamper initiatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Standards, Policy, and Guidelines"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.285"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY11"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.436"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY12"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.982"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.982"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY13"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval System Engineering Resource Center (NSERC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.420"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY11"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.909"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY12"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.805"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.805"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY13"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.342"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY11"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY12"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.844"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.844"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY13"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Standards, Policy, and Guidelines: - Alignment of SPGs across the Naval Enterprise and with OSD and Joint organizations will support standard acquisition implementation and improve compatibility and interoperability thereby lowering development and maintenance costs across programs\t\t\t\t\t\t\t\t\t\t\t\t\n- Aggregating systems for the purpose of conducting certification and accreditation and consolidating mandatory documentation for aggregations versus individual systems will optimize (cost tradeoffs and focus on high priority issues) certifications, reduce paperwork and associated costs, and put attention on systems engineering, IA, and ISPs for systems in their aggregated operational state vice just the individual system development state.   Document costs for major programs are $1 to $3.5 Million per system.  An aggregation may include 15 or more systems with four or more being major systems.  Aggregation presents a high potential for Return on Investment.\t\t\t\t\t\t\t\t\t\t\t\t\n- NR-KPP processes will clarify requirements and capabilities (including their metrics) that acquisition programs need to develop systems.  This clarification will eliminate guesses in terms of operational needs, thereby reducing the risk of program failure and reducing program and life-cycle costs.\t\t\t\t\t\t\t\t\t\t\t\t\nNaval Collaborative Engineering Environment (NCEE): Number of customers\/ users.\t\t\t\nPercentage of time the tool is available.\t\t\t\t\t\t\t\t\t\nNumber of tools integrated into the system.\t\t\t\t\t\t\t\t\t\t\t\t\nSystems Engineering:\t\t\t\t\t\t\t\t\t\t\t\t\nReviews and comment on all ACAT I system engineering plans presented to ASN (RDA) within 30 days of receipt to provide system engineering and system of system system engineering guidance to the Acquisition Program Manager.\t\t\t\t\t\t\t\t\t\t\t\t\nReview 80% of the MDAP Gate reviews held in FY10 to provide software acquisition process improvement guidance, system of systems engineering guidance and integration and interoperability management guidance to the Acquisition Program Managers."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3330"
                    },
                    "ProjectTitle": {
                        "val": "Naval Research Laboratory (NRL) Facilities Modernization"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.118"
                        },
                        "CurrentYear": {
                            "val": "2.422"
                        },
                        "BudgetYearOne": {
                            "val": "2.393"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.393"
                        },
                        "BudgetYearTwo": {
                            "val": "2.367"
                        },
                        "BudgetYearThree": {
                            "val": "15.566"
                        },
                        "BudgetYearFour": {
                            "val": "15.969"
                        },
                        "BudgetYearFive": {
                            "val": "16.257"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This is a new project that started in FY12."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NRL Facilities Modernization"
                                    },
                                    "Description": {
                                        "val": "Critical Science and Technology research cannot be sustained or succeed in deteriorated facilities.  World class research can only be accomplished in facilities that are at a minimum \"adequate\", but preferably \"state-of-the-art.\"  Due to their advanced age and deterioration, funds are planned to restore\/modernize various laboratory facilities at the Naval Research Laboratory."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.118"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initial year of a concerted effort to modernize electronics science and technology laboratories, equipment, and specialized facilities.  Existing NRL buildings will be renovated in order to relocate critical electronics S&T equipment and specialized laboratories from space that has reached a significant level of maintenance and operational disruption and failure due to advanced age (45 year old building) and inability to sustain and modernize with scientists and researchers in place."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.422"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY12."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.393"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.393"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY13."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "None"
                        },
                        "PerformanceMetrics": {
                            "val": "Restoration and modernization of the laboratory facilities will begin in a phased approach until completion."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3363"
                    },
                    "ProjectTitle": {
                        "val": "PACOM Initiative"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "7.950"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.950"
                        },
                        "BudgetYearTwo": {
                            "val": "7.945"
                        },
                        "BudgetYearThree": {
                            "val": "14.945"
                        },
                        "BudgetYearFour": {
                            "val": "14.940"
                        },
                        "BudgetYearFive": {
                            "val": "14.940"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This funding is for a classified effort."
                        },
                        "ProjectMissionDescription": {
                            "val": "This funding is for a classifies effort."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PACOM Initiative"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This is a classified initiative."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This funding is for a classified effort."
                        },
                        "PerformanceMetrics": {
                            "val": "This funding is for a classified effort."
                        }
                    }
                }
            ]
        }
    }
}