{
    "id": "90ebe8c31e1e8247434037e004f56f92069a588c",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA6_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605712A"
        },
        "ProgramElementTitle": {
            "val": "Support of Operational Testing"
        },
        "R1LineItemNumber": {
            "val": "147"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "68.311"
            },
            "CurrentYear": {
                "val": "67.789"
            },
            "BudgetYearOne": {
                "val": "55.504"
            },
            "BudgetYearOneBase": {
                "val": "55.504"
            },
            "BudgetYearTwo": {
                "val": "54.301"
            },
            "BudgetYearThree": {
                "val": "54.197"
            },
            "BudgetYearFour": {
                "val": "54.594"
            },
            "BudgetYearFive": {
                "val": "53.721"
            }
        },
        "ProgramElementNote": {
            "val": "Army consolidated three Test and Evaluation Command Headquarters, Army Test and Evaluation Command (ATEC), Developmental Test Command (DTC), and Army Evaluation Center (AEC).  As a result of this consolidation, ATEC aligned all requirements for the Operational Test Command (OTC), subordinate command to ATEC, under one Program Element. Funds reprogrammed effective FY2014."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element provides the resources to operate the Army's operational test directorates located at Fort Hood, TX; Fort Bragg, NC; Fort Bliss, TX; Fort Huachuca, AZ; and Fort Sill, OK; all managed by the Operational Test Command (OTC), a subordinate command of the Army Test and Evaluation Command (ATEC).  Project V02 currently provides support for the one Test and Evaluation Coordination Offices (TECO) located at Fort Leonard Wood, MO and one Infantry Support Cell at Fort Benning, GA.  TECOs previously located in Fort Lee, VA and Fort Knox, KY have been consolidated in Fort Benning, GA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "68.678"
                },
                "CurrentYear": {
                    "val": "67.789"
                },
                "BudgetYearOne": {
                    "val": "62.737"
                },
                "BudgetYearOneBase": {
                    "val": "62.737"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "68.311"
                },
                "CurrentYear": {
                    "val": "67.789"
                },
                "BudgetYearOne": {
                    "val": "55.504"
                },
                "BudgetYearOneBase": {
                    "val": "55.504"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.367"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-7.233"
                },
                "BudgetYearOneBase": {
                    "val": "-7.233"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.367"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-7.233"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.233"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "ATEC Joint Tests And Follow-On Test & Eval"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.276"
                        },
                        "CurrentYear": {
                            "val": "4.565"
                        },
                        "BudgetYearOne": {
                            "val": "0.162"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.162"
                        },
                        "BudgetYearTwo": {
                            "val": "0.152"
                        },
                        "BudgetYearThree": {
                            "val": "0.141"
                        },
                        "BudgetYearFour": {
                            "val": "0.143"
                        },
                        "BudgetYearFive": {
                            "val": "0.146"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Army consolidated three Test and Evaluation Command Headquarters, Army Test and Evaluation Command (ATEC), Developmental Test Command (DTC), and Army Evaluation Center (AEC).  As a result of this consolidation, ATEC aligned all requirements for Joint Tests and Follow-On Test and Evaluations, under one Program Element. Funds reprogrammed effective FY2014."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the Army's direct costs of planning and conducting Multi-service Tests and Evaluations (MOTE) for which there is no Army Project Manager (PM) and Army requirements for Joint Test and Evaluation (JT&E).  These are required to evaluate concepts and address needs and issues that occur in joint military environments and provide information required by Congress, Office of the Secretary of Defense, the Unified Commands, and the Department of Defense components relative to joint operations.  This project also funds Follow-on Test and Evaluation (FOTE), as necessary.  FOTE may be required after a full production decision to assess system training and logistics, to verify correction of deficiencies identified during earlier testing and evaluation, and to ensure that initial production items meet operational effectiveness, suitability and supportability thresholds.  There has been a shift of focus for items funded by this project due to continuing operations in the US Central Command (CENTCOM).  Traditional system workload has dropped off and has been replaced by rapid fielding initiatives.  In response to this shift, the Army Test and Evaluation Command (ATEC) has established a forward operational assessment team in theater and a rapid response cell.  These groups facilitate MOTE, JT&E, and FOTE events in the rapid environment.  Traditional acquisition requirements are expected to return to normal when operations in Iraq and Afghanistan wind down."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint operational testing and evaluation."
                                    },
                                    "Description": {
                                        "val": "Joint operational testing and evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.024"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided funding to support OCO task force requirements (TDY, Civ Pay and associated overhead expenses)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.035"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provides funding to support OCO task force requirements (TDY, Civ Pay and associated overhead expenses)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.162"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.162"
                                            },
                                            "Text": {
                                                "val": "All operational costs for HQ ATEC will now be charged to Program Element 0605898AM65"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Service Operational Test and Evaluation\/Follow-on testing and evaluations"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.252"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to Fund Integrated broadcasting service spiral enterprise T&E"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Will continue to Fund Integrated broadcasting service spiral enterprise T&E"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "V02"
                    },
                    "ProjectTitle": {
                        "val": "ATEC Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "64.035"
                        },
                        "CurrentYear": {
                            "val": "63.224"
                        },
                        "BudgetYearOne": {
                            "val": "55.342"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.342"
                        },
                        "BudgetYearTwo": {
                            "val": "54.149"
                        },
                        "BudgetYearThree": {
                            "val": "54.056"
                        },
                        "BudgetYearFour": {
                            "val": "54.451"
                        },
                        "BudgetYearFive": {
                            "val": "53.575"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Army consolidated three Test and Evaluation Command Headquarters, Army Test and Evaluation Command (ATEC), Developmental Test Command (DTC), and Army Evaluation Center (AEC).  As a result of this consolidation, ATEC aligned all requirements for the Operational Test Command (OTC), subordinate command to ATEC, under one Program Element. Funds reprogrammed effective FY2014."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Operational Test Command (OTC) conducts operational tests required by public law that provide significant data to the Army decision-makers on key Army systems and concepts.  This project finances recurring costs for the Operational Test Command that are essential for conducting realistic and continuous testing in the critical areas of equipment, doctrine, force design and training.  These recurring costs include civilian pay, requirements for test support contracts, temporary duty, supplies and equipment.  This project funds requirements for the Operational Test Command's eight test directorates and one support activity located at Fort Hood, TX; Fort Bragg, NC; Fort Sill, OK\/Ft. Bliss, TX; and Fort Huachuca, AZ. The primary mission of these test directorates is to perform detailed planning, execution, and reporting of Initial Operational Test and Evaluation (IOTE), and Force Development Test and Experimentation (FDTE). Project V02 currently provides support for the one Test and Evaluation Coordination Offices (TECOs) located at Fort Leonard Wood, MO and one Infantry Support Cell at Fort Benning, GA.  TECOs previously located in Fort Lee, VA and Fort Knox, KY have been consolidated in Fort Benning, GA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Test Command (OTC) Activities"
                                    },
                                    "Description": {
                                        "val": "Operational costs including: civilian pay, support contracts, temporary duty, supplies and equipment for subordinate elements of the Operational Test Command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "51.521"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Operational costs included civilian pay, support contracts, temporary duty, supplies and equipment for subordinate elements of the Operational Test Command."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "52.728"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Operational costs include civilian pay, support contracts, temporary duty, supplies and equipment for subordinate elements of the Operational Test Command."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "55.342"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "55.342"
                                            },
                                            "Text": {
                                                "val": "Operational costs will include civilian pay, support contracts, temporary duty, supplies and equipment for subordinate elements of the Operational Test Command."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational cost for HQ ATEC activities"
                                    },
                                    "Description": {
                                        "val": "Operational costs for HQ ATEC including: civilian pay, support contracts, temporary duty, supplies and equipment for non-AMHA (Army Management Headquarters Activity) HQ ATEC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.514"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Operational costs for HQ ATEC included civilian pay, support contracts, temporary duty, supplies and equipment for non-AMHA (Army Management Headquarters Activity) HQ ATEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.496"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Operational costs for HQ ATEC include civilian pay, support contracts, temporary duty, supplies and equipment for non-AMHA (Army Management Headquarters Activity) HQ ATEC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}