{
    "id": "95a5df505dc0e3ac02d222ddb730bb5915d7c83a",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA6_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605898A"
        },
        "ProgramElementTitle": {
            "val": "Management HQ - R&D"
        },
        "R1LineItemNumber": {
            "val": "154"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "17.480"
            },
            "CurrentYear": {
                "val": "18.524"
            },
            "BudgetYearOne": {
                "val": "54.175"
            },
            "BudgetYearOneBase": {
                "val": "54.175"
            },
            "BudgetYearTwo": {
                "val": "53.907"
            },
            "BudgetYearThree": {
                "val": "55.153"
            },
            "BudgetYearFour": {
                "val": "56.479"
            },
            "BudgetYearFive": {
                "val": "43.416"
            }
        },
        "ProgramElementNote": {
            "val": "Army consolidated three Test and Evaluation Command Headquarters: Army Test and Evaluation Command (ATEC), Developmental Test Command (DTC), and Army Evaluation Center (AEC).  As a result of this consolidation, ATEC aligned all requirements under one Program Element. Funds reprogrammed effective FY2014."
        },
        "ProgramElementMissionDescription": {
            "val": "This project provides funding for the salaries and related personnel benefits for the authorized civilian personnel positions that provide for the management functions and the technical direction of the U.S. Army Test and Evaluation Command (ATEC) mission located at Aberdeen Proving Ground, Maryland.  ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, assessments and experiments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter. \n\nThis project includes staff\/management functions of resource management, safety, security, environmental, strategic planning and information\/technology support for command-wide databases in support of the developmental, evaluation and operational test mission with technical direction to the Army Evaluation Center (AEC), Aberdeen Proving Ground, Maryland, to the Operational Test Command (OTC), Fort Hood, Texas and to the seven Major Range and Test Facility Base (MRTFBs) and one non-MRTFB test range:  Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; Dugway Proving Ground (DPG), Utah; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; White Sands Missile Range (WSMR), New Mexico; Yuma Proving Ground (YPG), Arizona; Cold Regions Test Center (CRTC), Fort Greely, Alaska; and Tropic Regions Test Center (TRTC) at various locations, as well as for Redstone Test Center (RTC) Redstone Arsenal, Alabama. This is the operating budget for ATEC Headquarters, which provides technical direction for the annual execution of over 3,300 developmental tests; more than 110 operational events; and more than 1,100 documents supporting acquisition programs.  ATEC has an authorized workforce of more than 9,500 workyears, and a $2.0 billion program.\n\nThis project also funds the salaries of civilian employees conducting Test and Evaluation early involvement, evaluation and test design missions and associated personnel support\/sustainment costs including: temporary duty, professional training, supplies, and equipment.  This project does not finance test facility operations, test instrumentation or test equipment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.530"
                },
                "CurrentYear": {
                    "val": "18.524"
                },
                "BudgetYearOne": {
                    "val": "18.681"
                },
                "BudgetYearOneBase": {
                    "val": "18.681"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.480"
                },
                "CurrentYear": {
                    "val": "18.524"
                },
                "BudgetYearOne": {
                    "val": "54.175"
                },
                "BudgetYearOneBase": {
                    "val": "54.175"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.050"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "35.494"
                },
                "BudgetYearOneBase": {
                    "val": "35.494"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.050"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "35.494"
                                },
                                "BudgetYearOneBase": {
                                    "val": "35.494"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "M65"
                    },
                    "ProjectTitle": {
                        "val": "Army Test and Evaluation Command (ATEC)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.480"
                        },
                        "CurrentYear": {
                            "val": "18.524"
                        },
                        "BudgetYearOne": {
                            "val": "54.175"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.175"
                        },
                        "BudgetYearTwo": {
                            "val": "53.907"
                        },
                        "BudgetYearThree": {
                            "val": "55.153"
                        },
                        "BudgetYearFour": {
                            "val": "56.479"
                        },
                        "BudgetYearFive": {
                            "val": "43.416"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Army consolidated three Test and Evaluation Command Headquarters: Army Test and Evaluation Command (ATEC), Developmental Test Command (DTC), and Army Evaluation Center (AEC).  As a result of this consolidation, ATEC aligned all requirements under this one Program Element. Funds reprogrammed effective FY2014."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funding for the salaries and related personnel benefits for the authorized civilian personnel positions that provide for the management functions and the technical direction of the U.S. Army Test and Evaluation Command (ATEC) mission located at Aberdeen Proving Ground, Maryland.  ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, assessments and experiments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter. \n\nThis project includes staff\/management functions of resource management, safety, security, environmental, strategic planning and information\/technology support for command-wide databases in support of the developmental, evaluation and operational test mission with technical direction to the Army Evaluation Center (AEC), Aberdeen Proving Ground, Maryland, to the Operational Test Command (OTC), Fort Hood, Texas and to the seven Major Range and Test Facility Base (MRTFBs) and one non-MRTFB test range:  Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; Dugway Proving Ground (DPG), Utah; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; White Sands Missile Range (WSMR), New Mexico; Yuma Proving Ground (YPG), Arizona; Cold Regions Test Center (CRTC), Fort Greely, Alaska; and Tropic Regions Test Center (TRTC) at various locations, as well as for Redstone Test Center (RTC) Redstone Arsenal, Alabama. This is the operating budget for ATEC Headquarters, which provides technical direction for the annual execution of over 3,300 developmental tests; more than 110 operational events; and more than 1,100 documents supporting acquisition programs.  ATEC has an authorized workforce of more than 9,500 workyears, and a $2.0 billion program.\n\nThis project also funds the salaries of civilian employees conducting Test and Evaluation early involvement, evaluation and test design missions and associated personnel support\/sustainment costs including: temporary duty, professional training, supplies, and equipment.  This project does not finance test facility operations, test instrumentation or test equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian labor and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                    },
                                    "Description": {
                                        "val": "Civilian labor and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funded authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.524"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funds authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "47.993"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "47.993"
                                            },
                                            "Text": {
                                                "val": "Will Fund authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Early Involvement"
                                    },
                                    "Description": {
                                        "val": "Supports the Commanding General's early involvement initiative which positions acquisition certified liaison officers at 2 Joint and 9 Army Program Executive Offices (PEO), TRADOC\/ARCIC, REF, JIEDDO, and RDECOM.  Assigned personnel provide continuous support to materiel and combat developers from the inception of their programs.  The early involvement of LNOs supports the sections of the ATEC Mission Essential Task List (METL) that apply to ongoing contingency operations.  ATEC performance continues to meet 120 day rapid equipping requirement set by the CSA. Liaison officers continue to enable ATEC to sustain rapid, flexible T&E support in the evaluation of Rapid Initiative Systems, Counter IED systems, and Urgent Material Releases.  Effort results in cost savings, cost avoidance and critical design efficiencies being identified early in a system's development, thereby avoiding more expensive product improvement programs later in a system's life cycle.  T&E efficiency gains continue to be realized through early identification of instrumentation, modeling and simulation tools, and other resources needed for testing, as well as making more efficient use of data from developmental testing and experiments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.747"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.747"
                                            },
                                            "Text": {
                                                "val": "Will continue support of the Commanding General's early involvement initiative which positions acquisition certified liaison officers at 2 Joint and 9 Army Program Executive Offices (PEO), TRADOC\/ARCIC, REF, JIEDDO, and RDECOM.  Prior to FY14, funds were programmed in Program Element 0605716A302."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Operational Testing and Evaluation"
                                    },
                                    "Description": {
                                        "val": "This project funds the Army's direct costs of planning and conducting Multi-service Tests and Evaluations (MOTE) for which there is no Army Project Manager (PM) and Army requirements for Joint Test and Evaluation (JT&E).  These are required to evaluate concepts and address needs and issues that occur in joint military environments and provides information required by Congress, Office of the Secretary of Defense, the Unified Commands, and the Department of Defense components relative to joint operations.  This project also funds Follow-on Test and Evaluation (FOTE), as necessary.  FOTE may be required after a full production decision to assess system training and logistics, to verify correction of deficiencies identified during earlier testing and evaluation, and to ensure that initial production items meet operational effectiveness, suitability and supportability thresholds.  There has been a shift of focus for items funded by this project due to continuing operations in the US Central Command (CENTCOM).  Traditional system workload has dropped off and has been replaced by rapid fielding initiatives.  In response to this shift, the Army Test and Evaluation Command (ATEC) has established a forward operational assessment team in theater and a rapid response cell.  These groups facilitate MOTE, JT&E, and FOTE events in the rapid environment.  Traditional acquisition requirements are expected to return to normal when operations in Iraq and Afghanistan wind down."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.435"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.435"
                                            },
                                            "Text": {
                                                "val": "Will provide funding to support task force requirements (TDY, Civ Pay and associated overhead expenses), Multi-Service Operational Test and Evaluation\/Follow-on testing and evaluations and will continue to Fund Integrated broadcasting service spiral enterprise T&E.  Prior to FY14, funds were programmed in Program Element 0605712A001."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}