{
    "id": "9f8f6b8bdae9142f46e8f7328a5e5393d6e1e539",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA4_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603782A"
        },
        "ProgramElementTitle": {
            "val": "WARFIGHTER INFORMATION NETWORK-TACTICAL - DEM\/VAL"
        },
        "R1LineItemNumber": {
            "val": "64"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "177.122"
            },
            "CurrentYear": {
                "val": "278.018"
            },
            "BudgetYearOne": {
                "val": "272.384"
            },
            "BudgetYearOneBase": {
                "val": "272.384"
            },
            "BudgetYearTwo": {
                "val": "325.584"
            },
            "BudgetYearThree": {
                "val": "97.886"
            },
            "BudgetYearFour": {
                "val": "71.000"
            },
            "BudgetYearFive": {
                "val": "21.699"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2014\nInc 2 PB 2013 $5.999\nInc 2 PB 2014 $1.100\nFunding for Inc 2 in FY 2014 was reduced because of changes in the test schedule.\n\nInc 3 PB 2013 $76.252\nInc 3 PB 2014 $271.284\nDelta  $195.032\nFunding for Inc 3 in FY 2014 increased to support the updated schedule of the Development Test (DT), New Equipment Training (NET) and Limited User Test (LUT). Inc 3 will provide production representative hardware for the DT\/NET\/LUT for the Inc 3 configuration items to include JC4ISR radio, antenna and WIN-T Communications Payload (WCP) for the air tier."
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Acquisition Executive (DAE), through the Nunn-McCurdy certification process, certified a restructured WIN-T program on June 5, 2007.  The certification Acquisition Decision Memorandum (ADM) stated that the Army will restructure the WIN-T Major Defense Acquisition Program (MDAP) to absorb the former Joint Network Node (JNN) Network program.  It further stated that the restructured program will consist of four Increments: Inc 1, Inc 2, Inc 3, and Inc 4.\n\nWIN-T is key to the Army's Network Modernization program. The WIN-T program's focus is to design, develop, produce and field the Future Modular Force transport network, while leveraging mature technologies that can enhance the Current Modular Force to operate in an emerging noncontiguous environment. \n\nInc 2 (PE 643782\/367) FY 2014 funds will support the Follow-on Production Award.\n\nInc 3 (PE 643782\/372) FY 2014 funds will continue the Engineering Manufacturing Development (EMD) phase."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "185.819"
                },
                "CurrentYear": {
                    "val": "278.018"
                },
                "BudgetYearOne": {
                    "val": "82.251"
                },
                "BudgetYearOneBase": {
                    "val": "82.251"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "177.122"
                },
                "CurrentYear": {
                    "val": "278.018"
                },
                "BudgetYearOne": {
                    "val": "272.384"
                },
                "BudgetYearOneBase": {
                    "val": "272.384"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.697"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "190.133"
                },
                "BudgetYearOneBase": {
                    "val": "190.133"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-8.697"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.899"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.899"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "195.032"
                                },
                                "BudgetYearOneBase": {
                                    "val": "195.032"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "367"
                    },
                    "ProjectTitle": {
                        "val": "Win-T Increment 2 -Initial Networking"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.821"
                        },
                        "CurrentYear": {
                            "val": "2.786"
                        },
                        "BudgetYearOne": {
                            "val": "1.100"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.100"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "21.508"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Warfighter Information Network Tactical (WIN-T) Increment 2 provides the Army with initial On-The-Move (OTM) networking capability.  The Increment 2 network retains capabilities delivered by WIN-T Increment 1 and by leveraging proven Government and Commercial technologies, adds greater network throughput and automated  Network Management to optimize  planning (to include spectrum use), initialization, monitoring and troubleshooting. WIN-T Increment 2 extends the network in maneuver Brigade Combat Teams (BCTs) to Company level for the first time.  Using equipment mounted on combat platforms, WIN-T Increment 2 delivers a mobile capability that reduces reliance on fixed infrastructure and allows key leaders to move on the battlefield while retaining Situational Awareness and Mission Command capabilities. Using the Highband Networking Radio, with the Highband Networking Waveform and high performance antennas, the WIN-T Increment 2 Line-of-Sight network offers an adaptive 30 Megabit per second (Mbps) aggregate throughput to key leaders in their Command Post or in their vehicle. The WIN-T Increment 2 network is self-forming, which means that it automatically creates transmission paths based on terrain and environmental conditions; and self-healing, meaning that the paths will automatically re-route traffic to complete network transactions and calls even if one or more nodes break down or loses connectivity.  This offers greater network reliability and better end-to-end connectivity than traditional point-to-point networks.   WIN-T Increment 2 introduces the network management capability needed to keep the mobile and dispersed forces networked together through automated planning, initialization, monitoring, and troubleshooting.  Finally, WIN-T adopts  \"Colorless Core\" technology that encrypts both classified and unclassified user information in the network and minimizes the number of users on the \"core\" of the network.  The Colorless Core allows commanders to utilize the tactical network without fear of the enemy intercepting information. Colorless Core is a technical insertion in the WIN-T Increment 1b network which enables information sharing between Increment 1b and Increment 2.\n\nThe WIN-T Increment 2 capabilities are identified for fielding to Armored, Infantry, and Stryker BCTs and Division Headquarters.  The Point of Presence and the Tactical Communications Node have both satellite and Line-of-Sight communication capability.  The Soldier Network Extension provides satellite communication only.  The Point of Presence and the Tactical Communications Node are deployed at Division, Brigade and Battalion echelons. The Soldier Network Extension serves as the S3 vehicle at Battalion level and is also deployed down to Company level.  \n\nWIN-T Increment 3 mature technologies will be inserted into Increment 2 units."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Testing and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.083"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "WIN-T Increment 2 provided government test support for New Equipment Training, Cold Region Test, Force Development Test and Experimentation (FDT&E), Initial Operational Test (IOT) as well as the support required for the Full Rate Production Decision Review."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "WIN-T Increment 2 will support First Unit Equipped  and Follow-On Test and Evaluation (FOT&E), Initial Operational Capability (IOC) and Full Rate Production Decision Review."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.033"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.033"
                                            },
                                            "Text": {
                                                "val": "WIN-T Increment 2 will support follow-on production award."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Increment 2 continues the development of Inc 2 system hardware and software development."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.067"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.067"
                                            },
                                            "Text": {
                                                "val": "Support for the Follow-on Production Award."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "System Engineering and Program Management Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.738"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Program Management support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.203"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Program Management support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WIN-T Inc 2"
                                    },
                                    "Title": {
                                        "val": "Procurement"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "761.105"
                                        },
                                        "CurrentYear": {
                                            "val": "731.068"
                                        },
                                        "BudgetYearOne": {
                                            "val": "680.438"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "680.438"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "598.230"
                                        },
                                        "BudgetYearThree": {
                                            "val": "548.960"
                                        },
                                        "BudgetYearFour": {
                                            "val": "154.606"
                                        },
                                        "BudgetYearFive": {
                                            "val": "200.959"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Defense Acquisition Executive (DAE), through the Nunn-McCurdy certification process, certified a restructured WIN-T program on June 5, 2007.  The certification Acquisition Decision Memorandum (ADM) stated that the Army will restructure the WIN-T Major Defense Acquisition Program (MDAP) to absorb the former Joint Network Node (JNN) Network program.  It further stated that the restructured program will consist of four Increments: Incs 1, 2, 3, and 4.\n\nInc 2 fields new capabilities to the current force.  Inc 2 accomplishes this with planned early fieldings of mature technologies from Inc 3.  Inc 2 will be upgraded with technology from Inc 3 in the form of technology inserts. A Follow-on Test and Evaluation (FOTE) will be conducted in FY2013 followed by a Full Rate Production (FRP) decision review.  There is no plan to rebuy and replace Inc 2 with Inc 3. These technical inserts will upgrade the Inc 2 architecture to include the following elements: Joint Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (JC4ISR) radio, Highband Radio Frequency Unit Multiband Terrestrial antenna (HRFU-MT) (Dual band C\/Ku), and Network Operations (NetOps) Build 3.0.  The JC4ISR radio and antenna upgrades will be placed in the Tactical Communication Node (TCN) v1, Point of Presence (PoP) v1, and Tactical Relay Tower(TR-T) v1 and will upgrade those configuration items to TCN v1A, PoP v1A, and TR-T v1A.  The Inc 3 production program will also provide retrofits to Inc 2 fielded units.  Inc 3 will tech-insert the  Modular Communications Node Advanced Enclave (MCN-AE) to all the Inc 2 units.  Inc 3 will also provide the JC4ISR radio and antenna retrofits for the Inc 2 units procured before FY2016 and for TR-T inserts to ensure interoperability.  Increment 3 introduces the air tier through the use of Unmanned Aerial Systems (UAS) and a Top Secret Sensitive Compartmented Information (SCI) Local Area Network (LAN) with a port for National Security Agency intranet (NSAnet)."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "25.878"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.738"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.203"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Platform Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "19.641"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WIN-T EMD Contract"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics C4 Systems Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Taunton, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "138.598"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.067"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.067"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Engineering Services adn Research Studies"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics C4 Systems Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Taunton, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.086"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Modeling & Simulation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "51.709"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.083"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.583"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.033"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.033"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Increment 2 NET"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Cold Region Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Force Development Test and Experimentation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operational Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Delivery Order Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "First Unit Equipped"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Follow-On Test and Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operating Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FRP Decision Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Rate Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Delivery Order 2 Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Follow-on Production Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Delivery Order 3 Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Delivery Order 4 Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Army Decision Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production Qualification Test - Contractor"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Follow-on Operational Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Army Integrated Program Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Operational Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "372"
                    },
                    "ProjectTitle": {
                        "val": "WIN-T Increment 3 - Full Networking"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "167.301"
                        },
                        "CurrentYear": {
                            "val": "275.232"
                        },
                        "BudgetYearOne": {
                            "val": "271.284"
                        },
                        "BudgetYearOneBase": {
                            "val": "271.284"
                        },
                        "BudgetYearTwo": {
                            "val": "325.584"
                        },
                        "BudgetYearThree": {
                            "val": "76.378"
                        },
                        "BudgetYearFour": {
                            "val": "71.000"
                        },
                        "BudgetYearFive": {
                            "val": "21.699"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Warfighter Information Network Tactical (WIN-T) Increment 3 (Inc 3) provides full network mobility and introduces an additional Line-of-Sight link using an airborne platform, building on the capabilities of previous WIN-T Increments. WIN-T Inc 3 connects all users to each other from theater down to the maneuver company level, to Joint and multinational elements, and to the Defense Information System Network (DISN).  WIN-T Inc 3 is key to the Army's Network Modernization program. It provides a leap forward in network capacity with improved system reliability and robustness, made possible by the new Highband Networking Waveform (HNW) version 3.0 embedded on the Joint Command, Control, Communications, Computers, Intelligence, Surveillance (JC4ISR) radios. The technology advances in the combination of the JC4ISR radios and HNW will provide a throughput capability four times greater than currently fielded networking radios.  The Air Tier implementation of the JC4ISR radios and HNW 3.0 will offload significant amounts of traffic from satellites with reduced operating cost to the Army, freeing satellite bandwidth and providing the Commander the ability to allocate bandwidth resources at the critical point on the battlefield. WIN-T Inc 3 Network Operations (NetOps) software provides the on the move capability to meet the Global Information Grid (GIG) NetCentric Vision including Information Assurance and Network Centric Enterprise Services with mature planning, monitoring, and controlling capabilities; additionally implementation of the WIN-T Inc 3 NetOps solution supports the Army's NetOps convergence goals. WIN-T Inc 3 mature technologies will be inserted into WIN-T Inc 2 units."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Increment 3 Engineering Manufacturing Development (EMD) continues development of Inc 3 system, hardware and software development, prototype manufacturing of test assets for the Inc 3 system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "149.531"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increment 3 continued the detailed design, prototype development and conducted Engineering Manufacturing and Development (EMD) testing of Air Tier using WIN-T Communications Payload."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "245.171"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increment 3 completes detailed design of network architecture, waveform, radio, Aerial Tier Payload and continues software coding of waveform and Network Operations. Conducts Critical Design Review (CDR) and continues integration of aerial tier payload with Grey Eagle Unmanned Aerial System and purchases long lead items for Limited User Test (LUT) prototypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "234.494"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "234.494"
                                            },
                                            "Text": {
                                                "val": "Increment 3 begins integration of LUT prototypes. Completes software code for Network Operations, completes software integration and testing of waveform, completes integration and testing of aerial tier payload on Grey Eagle Unmanned Aerial System which provides Air Worthiness Certification. Inc 3 begins platform integration and development of training materials and technical manuals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support Cost"
                                    },
                                    "Description": {
                                        "val": "Technical Enginnering Services and Research Studies"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.714"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technical Enginnering Services and Research Studies"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.799"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technical Enginnering Services and Research Studies"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.878"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.878"
                                            },
                                            "Text": {
                                                "val": "Technical Enginnering Services, Research Studies and NIE testing support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Testing and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.718"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increment 3 completed Aerial Tier payload testing on surrogate aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.119"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increment 3 continues analysis of multi node network. Conducts component level development tests and continues testing of Network Operations Build and Modular Communications Node  Advanced Enclave (MCN-AE) for insertion of mature technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.079"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.079"
                                            },
                                            "Text": {
                                                "val": "Increment 3 continues planning for LUT. Design and develop test plans in support of LUT. The Government will conduct Air Worthiness Testing of Aerial Tier payload on Grey Eagle Unmanned Aerial System. Continue annual testing of the Network Operations Builds. Conduct HNW 3.0 parameter analysis using simulator and develops multi-node emulator to support future scalability simulation work."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "Provides System Engineering and Program Management Support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.338"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued System Engineering and Program Management Support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.143"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues System Engineering and Program Management Support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.833"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.833"
                                            },
                                            "Text": {
                                                "val": "Continues Program Management Support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Inc 3"
                                    },
                                    "Title": {
                                        "val": "Procurement"
                                    },
                                    "Funding": {
                                        "BudgetYearTwo": {
                                            "val": "236.510"
                                        },
                                        "BudgetYearThree": {
                                            "val": "412.946"
                                        },
                                        "BudgetYearFour": {
                                            "val": "740.768"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1851.317"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Defense Acquisition Executive (DAE), through the Nunn-McCurdy certification process, certified a restructured WIN-T program on June 5, 2007.  The certification Acquisition Decision Memorandum (ADM) stated that the Army will restructure the WIN-T Major Defense Acquisition Program (MDAP) to absorb the former Joint Network Node (JNN) Network program.  It further stated that the restructured program will consist of four Increments: Incs 1, 2, 3, and 4.\n\nAn evolutionary acquisition strategy is being utilized to provide for the timely insertion of new technologies into Army communication systems by adhering to the basic principles of the DoD Modular Open Systems Approach (MOSA).  This allows the Army to keep pace with changing commercial technology and maintain required interoperability with other joint, strategic and commercial standards-based networks. Building on previous increments, Inc 3 provides better connectivity and greater network access via JC4ISR radio and antenna, Network Centric Waveform (NCW), Highband Networking Waveform (HNW) version 3.0, and integrated Network Operations. It manages, prioritizes, and protects information through NetOps while reducing organizational and operational support. It ensures communications interoperability with Joint, Allied, Coalition, Current Force, and Commercial voice and data networks. Inc 3 shall be interoperable with the other WIN-T increments while maintaining interoperability with the Army currently fielded transport systems. The technologies in Inc 3 have matured to a level that provide significant capability enhancement over the current network.  Inc 3 technology is being tested and released over time and, once proven; Inc 3 technology will be available for insertion into WIN-T Increment 1 and Increment 2.  \n\nThe ADM of May 18, 2009 approved an initial Acquisition Program Baseline (APB) for Inc 3. A follow-on Increment 3 ADM on July 31, 2009 permitted the obligation of remaining FY2009 Research, Development, Test and Evaluation (RDT&E) funds to resource EMD efforts including development of the Joint Command, Control, Communications, Computer, Intelligence, Surveillance and Reconnaissance radio (JC4ISR) to support the air-tier capability. A revised ADM was approved on October 22, 2010. Inc 3 received approval for program restructure at the October 31, 2011 Army Configuration Steering Board (CSB). Efforts in accordance with the restructured program are performed under the current Engineering Manufacturing Development (EMD) contract. A Follow-on EMD contract is anticipated to be awarded in 3QFY13 followed by a Critical Design Review (CDR) in 4QFY13. A Production Readiness Review (PRR) is scheduled for 2QFY16 leading to a Milestone C decision in 3QFY16."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "73.532"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "12.338"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "14.143"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "19.833"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "19.833"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Increment 3 Engineering Manufacturing and Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics C4 Systems Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Taunton, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "659.050"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "138.189"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "212.782"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "234.494"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "234.494"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Inc 3 Data Rights"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Harris GCSD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Melbourne, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.417"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.417"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Platform Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.800"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.925"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "32.389"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Engineering Services and Research Studies"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics C4 Systems Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Taunton, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "18.249"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.714"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.799"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.878"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.878"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Testing and Modeling & Simulation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.108"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.718"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.119"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.079"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.079"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Follow-on EMD Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Critical Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development Test\/New Equipment Training\/Limited User Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production Readiness Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Delivery Order 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Delivery Order 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production Qualification Test - Contractor"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production Qualification Test - Government"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Logistics Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "New Equipment Training"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}