{
    "id": "a3e1a8e412c174b078ffc27956f210a69900d79a",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604771D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Tactical Information Distribution System (JTIDS)"
        },
        "R1LineItemNumber": {
            "val": "123"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "16.775"
            },
            "CurrentYear": {
                "val": "20.688"
            },
            "BudgetYearOne": {
                "val": "19.475"
            },
            "BudgetYearOneBase": {
                "val": "19.475"
            },
            "BudgetYearTwo": {
                "val": "20.498"
            },
            "BudgetYearThree": {
                "val": "18.168"
            },
            "BudgetYearFour": {
                "val": "17.983"
            },
            "BudgetYearFive": {
                "val": "18.333"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The level of resourcing for the Joint Tactical Information Distribution System (JTIDS) program reflects iterative reductions from efficiencies and budget reductions, which reduces the Department's ability to develop flexible responsive solutions to emerging war fighter needs. \n\nThe Common Joint Tactical Information funding line responds to the Department's requirement for joint and combined network-enabled tactical data link (TDL) capabilities and for communications which meet net-centric standards to ensure interoperability and seamless integration with joint communication systems. It will be used to assess and promote competition across TDLs DoD-wide and to provide acquisition oversight of TDL-related activities such as CDL waveforms, Joint Aerial Layer Network (JALN) narrowband TDL gateways, Multifunction Advanced Data Link (MADL) and datalink roadmaps to guide future investments. This funding line provides resources for acquisition support and management oversight of critical command, control, communications (C3) and non-intelligence space capabilities as the Department migrates to netcentric operations. Funds will be used to provide technical, systems engineering and acquisition management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and to effect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved weapons systems performance and military operations. Resources will be allocated for architecture design and development, portfolio management, enterprise-wide systems engineering and operational impact analyses related to C3 and non-intelligence space systems. They will also be used to provide expertise required for exercising technical direction over design, performance and cost parameters of key systems and their dependencies. The goal of this funding is to eliminate redundancy, reduce time to the field, evaluate projects and concepts for adherence to net-centric guidelines, minimize performance and operational risk of developing and fielding complex major systems which rely on networks and supporting applications, ensure program dependencies are documented and included in acquisition decisions and address interoperability requirements, gaps and best value technical solutions. Typical deliverables associated with the instantiation of net-centric capabilities for these mission areas include network and vulnerability assessments, migration plans, investment strategies, roadmaps and technical guidance documentation.  \n\nThis budget line was transferred from DoD Chief Information Officer management oversight to that of the Under Secretary of Defense (Acquisition, Technology and\nLogistics) as part of the disestablishment of the Assistant Secretary of Defense for Networks and Information Integration (ASD(NII)) and the associated transfer to\nUSD (AT&L) of the Deputy Assistant Secretary of Defense for Communications, Command and Control and Cyber (DASD C3 & Cyber.) Transfer of this DASD to\nUSD(AT&L) conveys the critical technical, systems engineering and program management oversight division of the former ASD(NII) to AT&L where engineering and acquisition expertise is resident. It capitalizes on each organization’s performance and reduces technical and operational risk in the Department’s acquisition processes by incorporating recognized, solid experience in the application of best practices to the development and fielding of net-centric capabilities which support major systems and weapons deployment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.775"
                },
                "CurrentYear": {
                    "val": "20.688"
                },
                "BudgetYearOne": {
                    "val": "17.296"
                },
                "BudgetYearOneBase": {
                    "val": "17.296"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.775"
                },
                "CurrentYear": {
                    "val": "20.688"
                },
                "BudgetYearOne": {
                    "val": "19.475"
                },
                "BudgetYearOneBase": {
                    "val": "19.475"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.179"
                },
                "BudgetYearOneBase": {
                    "val": "2.179"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.608"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.608"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other FY14 Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.429"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.429"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "1. FY 2014 increase is consistent with continuing the successful delivery of technical system engineering and acquisition management oversight of the Department’s joint and combined network-enabled tactical data link capabilities and communications to ensure interoperability and integration with joint communication systems. \n\n2. Reductions taken to support other program priorities within the USD(AT&L)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "771"
                    },
                    "ProjectTitle": {
                        "val": "Link-16 Tactical Data Link (TDL) Transformation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.775"
                        },
                        "CurrentYear": {
                            "val": "20.688"
                        },
                        "BudgetYearOne": {
                            "val": "19.475"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.475"
                        },
                        "BudgetYearTwo": {
                            "val": "20.498"
                        },
                        "BudgetYearThree": {
                            "val": "18.168"
                        },
                        "BudgetYearFour": {
                            "val": "17.983"
                        },
                        "BudgetYearFive": {
                            "val": "18.333"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This budget line was transferred from DoD Chief Information Officer management oversight to that of the Under Secretary of Defense (Acquisition, Technology and Logistics) as part of the disestablishment of the Assistant Secretary of Defense for Networks and Information Integration (ASD(NII)) and the associated transfer to USD (AT&L) of the Deputy Assistant Secretary of Defense for Communications, Command and Control and Cyber (DASD C3 & Cyber.)  Transfer of this DASD to USD(AT&L) conveys the critical technical, systems engineering and program management oversight division of the former ASD(NII) to AT&L where engineering and acquisition expertise is resident. It capitalizes on each organization’s performance and reduces technical and operational risk in the Department’s acquisition processes by incorporating recognized, solid experience in the application of best practices to the development and fielding of net-centric capabilities which support major systems and weapons deployment. Reduced FY12 and outyear JTIDS funding resulted in the postponement of critical efforts to the FY13 and beyond time-frame.\n\nThe Common Joint Tactical Information funding line responds to the Department's requirement for joint and combined network-enabled tactical data link (TDL) capabilities and for communications which meet net-centric standards to ensure interoperability and seamless integration with joint communication systems. It will be used to assess and promote competition across TDLs DoD-wide and to provide acquisition oversight of TDL-related activities such as CDL waveforms, Joint Aerial Layer Network (JALN) narrowband TDL gateways, Multifunction Advanced Data Link (MADL) and datalink roadmaps to guide future investments. This funding line provides resources for acquisition support and management oversight of critical command, control, communications (C3) and non-intelligence space capabilities as the Department migrates to netcentric operations. Funds will be used to provide technical, systems engineering and acquisition management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and to effect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved weapons systems performance and military operations. Resources will be allocated for architecture design and development, portfolio management, enterprise-wide systems engineering and operational impact analyses related to C3 and non-intelligence space systems. They will also be used to provide expertise required for exercising technical direction over design, performance and cost parameters of key systems and their dependencies. The goal of this funding is to eliminate redundancy, reduce time to the field, evaluate projects and concepts for adherence to net-centric guidelines, minimize performance and operational risk of developing and fielding complex major systems which rely on networks and supporting applications, ensure program dependencies are documented and included in acquisition decisions and address interoperability requirements, gaps and best value technical solutions. Typical deliverables associated with the instantiation of net-centric capabilities for these mission areas include network and vulnerability assessments, migration plans, investment strategies, roadmaps and technical guidance documentation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Common Joint Tactical Information Initiatives"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.775"
                                            },
                                            "Text": {
                                                "val": "–  Advanced Ground\/Air\/Space Assessment: Performed technical assessments for the Resilient Basis for Satellite Communications in Joint Operations study. This provided end-to-end performance metrics concerning satellite communications (SATCOM) systems in scintillated and anti-jam conditions for different military campaigns and scenarios. Likewise performed a requirements trade and platform integration assessment for eXtended Data Rate (XDR) terminals and a technical evaluation of viable SATCOM options in 2016 and 2028 in degraded environments due to cyber\/kinetic issues.\n–  SATCOM Analysis and Optimization: Provided performance, cost, and risk analysis of ongoing SATCOM programs such as UFO, DSCS, WGS, MUOS, AEHF and EPS.  Identified risk mitigation approaches.\n–  Integrated Master Schedule Environment (IMSE):  Significantly increased IMSE capability to include command and control, as well as major defense acquisition programs for supporting acquisition events such as IPT\/OIPT\/DAES reviews and to evaluate the impact on capability deliveries based on key acquisition milestones, test events and production decisions. \n–  Ground\/Air\/Space Network Performance:  Assessed aerial layer waveforms (Link 16, TTNT, CDL) for lowering cost and complexity in implementation and to harmonize tactical datalinks and ISR networks. Provided technical risk assessments for waveform implementation (WNW, SRW, SINCGARS, HNW) and ground force IP routing network architectures. \n– QCDI Model Extension:  updated the model’s typical data rates to a range, distribution, and\/or agent based time variant representation to account for variations among users within a class. \n– Aerial Networks Roadmaps: Developed roadmaps to guide the evolution of aerial networks so that DoD takes full advantage of 5th generation fighters and the force multiplier effects of networking aircraft. Address air-air high capability transport and air-air tactical and air-ground\/air-space domains.\n– Ground Networking Roadmaps: Developed roadmaps to guide the evolution of ground networking radios and waveforms. Addressed  lower echelon and brigade\/backbone domains.\n– SATCOM Common Systems Roadmap: Developed roadmaps to guide the evolution of SATCOM common systems for a more resilient gateway infrastructure with lower operating costs and the ability to reprovision resources within minutes vice days and hours. Address gateway evolution and resource management domains.   \n– C2 Capability Planning, Technical Development and Reference Model:  Established tracking mechanisms to assess C2 data implementation cost and progress and funded secure data tagging to support Joint C2 and Adaptive Planning and Execution (APEX). Conducted technical reviews to refine implementation approaches for C2 net-centric data services and strategies. Established APEX-based capabilities-based and technical reference architectures.\n– Tactical Exchange Data Service JCTD:  Executed this JCTD to expand the DoD net-centric data strategy implementation into the tactical and operational levels. \n– C2 Studies and Analyses:  Developed plan of action and milestones to implement JC2 capability AoA recommendations. \n–  C2 Capability Planning and Implementation Analysis:  Developed a plan of action and milestones to implement the Joint C2 Modernization Plan.\n–  C2 Research: Sponsored the 17th annual International Command and Control Research and Technology Symposium (ICCRTS) meeting that brought together members of the technical and operational C2 communities from government, academia, and industry to create and disseminate knowledge relevant to the theme of 'Agile C2.'  The state of the art of Agile C2 systems engineering and practices were studied including concepts, principles, processes, and metrics to meet the unique challenges associated with the provision of a robust secure networked C2 infrastructure.\n–  Space Control and C2 Space Portfolio:  Provided technical expertise, systems engineering to support acquisition and planning decisions, cost and schedule variance discovery and internal reviews; Drafted Enterprise Strategy & Roadmap for Space Control; Developed Space C2 Data strategy.\n–  Space Situational Awareness: Provided technical expertise, systems engineering to support acquisition and planning decisions, cost and schedule variance discovery and internal reviews; Conducted technical analysis of Space Fence Program; Conducted and published Cascading Debris Analysis and strategy report; Completed Space Situational Awareness Cooperation Strategy and Analysis.\n–  Strategic Space Environment:  Provided analysis in support of decisions affecting DoD and IC space portfolios.\n–  OCX Deep Dives:  Conducted technical analysis on the replacement for the GPS Ground command and control System, OCX, and recommended technical approaches for developing this capability and its associated should cost estimates.\n–  Environmental Monitoring: Developed a “Day without Weather” Phase II analysis to examine the impacts to military operations given the loss of various Environmental Monitoring\/METOC capabilities; completed DoD inputs into Federal Plan for Meteorological Services and Supporting Research; developed Space Weather S&T Strategy; developed DMSP Follow-on Strategy & Integrated Schedule.\n–  Space Access: Provided technical expertise, systems engineering to support acquisition and planning decisions; Developed Space S&T Test Strategy; developed DoD Space Access Strategy\/Roadmap; conducted technical assessment of alternative propulsion capabilities.\n–  PNT Mission Assurance (MA): Provided analysis, assessments and policy formulation towards the development, acquisition, procurement, deployment\/fielding, and operation of all DoD GPS PNT and NAVWAR systems.\n–  Rapid Acquisition of Capabilities for Cyberspace Operations: In response to Section 933 of the FY 2011 NDAA, developed processes for rapid acquisition of capabilities for cyberspace operations. Described these processes and the proposed Cyber Investment Management Board (CIMB) in the Section 933Report to Congress which was submitted to Congress in March 2012."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.688"
                                            },
                                            "Text": {
                                                "val": "–\tJoint Tactical Network Center: Provide comprehensive technical assessments of waveform enhancement strategies for SRW, WNW, MUOS and TTNT. Analyze requirements of new waveforms, achievable throughput, scalability, anti-jam, LIP\/LPD and spectral efficiency performance characteristics. Evaluate software communications architectures for relevance and support for waveform portability.\n–\tBeyond Line of Sight (BLOS) Analysis and Systems Engineering: Provide architectural guidance and technical analysis for BLOS communications in contested and denied environments consisting of a combination of SATCOM and aerial communications. Assess communications performance in anti-jam, anti-access area denial environments.  Improve ability to predict performance of network architectures and technologies and assess performance of directional apertures. \n–\tProtected SATCOM AoA Technical Expertise: Provide analytic framework for assessing protected SATCOM options in support of AoAs and for use in Satellite Emulation Tools for modeling AEHF performance.\n–\tAerial Networks Roadmaps and Systems Engineering: Develop and maintain roadmaps to guide the evolution of aerial networks so that DoD takes full advantage of 5th generation fighters and the force multiplier effects of networking aircraft. Maintain roadmaps for air-air high capability transport and air-air tactical domains.  Develop roadmaps to address air-ground\/air-space domain. Evaluate Army, Navy, Air Force system architectures for alignment with aerial networks roadmaps. Develop detailed risk reduction and technology maturation investment plans to accelerate fielding of advanced TDLs to 5th generation fighters.\n–\tJTRS Waveform Assessments: Assess waveforms (WNW, SRW, SINCGARS, HNW) for implementation and provide recommendations for ground force IP routing network architectures and interoperability with coalition partners. Provide technical risk analyses and test review recommendations for lowering cost and complexity and for ensuring tactical data link and ISR networks harmonization. \n–\tMIDS-JTRS TTNT: Provide program assessments to evaluate cost, schedule and technical progress for developing the MIDS-J radio. Assess efforts to insert the TTNT version 7 waveform into this radio. Assess TTNT software development, target performance characteristics and test plans to verify performance. Evaluate the acquisition strategy and core material to inform MDA decision making.\n–\tGround Networking Roadmaps: Develop and maintain roadmaps to guide the evolution of ground networking radios and waveforms.  Maintain roadmaps for lower echelon and brigade\/backbone domains.  Develop roadmap to address ground to space domain. Analyze Army and Marine system architectures for brigade and MEB networks to align with roadmaps.\n–\tMUOS AoA Support:  Conduct MUOS follow-on study to determine potential courses of action for replacing the MUOS system in 2025. Develop study plan, architectural alternatives, detailed blue force demand profiles, threat laydowns and cost models as well as desired requirements for future narrowband access waveforms and trade-off impacts on cost\/performance of future terminals.\n–\tMaritime Networks:  Develop roadmaps to guide the evolution of maritime radios, waveforms and networks. Address LOS ship-ship, ship-air and ship-space domains. Identify essential components, enabling technologies, program technology insertion opportunities and key investment decisions to achieve affordability and performance objectives.\n–\tAirborne Maritime Fixed (AMF) JTRS:  Assess the AMF program to include the risk of vendor selected radios. Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of the network effects of a WNW airborne node.\n–\tMUOS System End-to-End Integration: Develop comprehensive systems engineering, test and terminal certification plans. Assess military standard\/specifications and interface control documents for configuration management. Engineer the system to minimize efforts required to certify new MUOS end user terminals. \n–\tSATCOM Common Systems Roadmap: Maintain roadmaps to guide the evolution of SATCOM common systems for a more resilient gateway infrastructure with lower operating costs and the ability to reprovision resources within minutes vice days and hours. Address gateway evolution and resource management domains. Develop a plan for integrating teleport, STEP and service gateway RF heads.\n- ISR SATCOM Requirements: Begin transition of ISR communications from leased commercial SATCOM to MILSATCOM assets. Assess and quantify ISR satellite communications demand and throughput requirements.  Develop a business case and transition plan, in coordination with USD(I), for investments in Military Ka-band capable terminals to enable transition from OCO funded leased SATCOM to the WGS military satellite constellation.    \n–\tQuantitative Capability Delivery Increments (QCDI)\/FLOWNET: Develop and implement updates to QCDI and FlowNET models to include NxN demand and conduct analyses of future end-to-end networks residing in surface, aerial and space layers.\n–\tNetwork Integration Exercise (NIE) Technical Assessments:  Conduct analyses of the technical maturity, performance and interoperability of products and systems undergoing evaluation in the Army’s NIE. Evaluate the validity of formal test data from DoD sources and assess whether the data produce an accurate portrayal of the product and system’s capability. Recommend prioritized courses of action with emphasis on best cost\/performance delivery to the warfighter.\n–\tCyber Investment Management: Synchronize and coordinate cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provide support of the Cyber Investment Management Board and develop implementation guidance and associated direction.\n–\tJoint C2 Portfolio Management: Support development, integration and test activities across the services, agencies and COCOMs and deliver the FY15-19 version of the Joint C2 Sustainment and Modernization Plan.\n–\tAdaptive Planning and Execution (APEX):  Provide management oversight of APEX acquisition activities and authoritative data sources as the APEX technical integrator. Update the APEX technical architecture to include logistics and intelligence planning. Update APEX data architecture and standards and develop technical and systems standards for APEX framework for application across DoD. \n–\tC2 Data: Provide technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Update the C2 data model and standards (C2 Core) for component implementation. Update the C2 Authoritative Data Source roadmap and develop a C2 data architecture.\n–\tJoint C2 Architecture: Provide the technical expertise necessary to update the Joint C2 Objective Architecture and FY15 Joint C2 Transition Architecture.\n–\tC2 Technical Analysis: Provide technical analysis for the development of C2 Capability Delivery Increments to guide the evolution of joint and service C2 programs and functional requirements. Synchronize C2 development efforts with Defense Intelligence Information Enterprise efforts, develop initial C2 CDI roadmap and update the C2 CDI roadmap with linkages to ISR programs for intelligence-operations information sharing. \n–\tC2 Research: C2 Theory is significantly ahead of the practice and more effort needs to be made to \"operationalize\" the theory within DoD.  This will be done by embracing the CJCS Mission Command leadership philosophy, with C2 Agility as the enabling framework for understanding and managing C2, as well as for implementing robust Mission Command. As a result, closer ties will be formed among the C2 research, analysis and operational communities and to enhance the state of C2 practice significantly. \n–\tFriendly Force Tracking\/ Combat Identification: Assess and provide recommendations for achieving Mode 5 IFF IOC in 2014 and FOC in 2020. Finalize US\/ NATO Mode 5 IFF releasability policy. Provide technical support to NATO C3B Capability Panel on Combat Identification. Ensure that NATO Standardized Agreement (STANAG) 4193 incorporates changes necessary for compatibility \/ interoperability with DoD Mode 5 technical standards.\n–\tSpace Situational Awareness: Conduct Geo SSA architectural analysis in support of space surveillance telescope decisions and technical assessment of Alternative Sources of GEO SSA. Conduct technical analysis on emerging and existing technologies and capabilities that could be used to implement the GEO SSA strategy. Develop technology roadmaps and investment strategies. SST Technical Assessment Analysis & Assessment of DoD Use of Foreign\/Non-traditional SSA Sensors; implement DoD SSA data strategy.\n–\tSpace Control\/Space C2: Conduct Space Protection Architectural Analysis; Implement Enterprise Strategy & Roadmap for Space Control Mission area through 2025.\n–\tSpace Access: Conduct net centric review\/technical assessment of Spacelift Range; Develop Space Ranges Roadmap & Enterprise Strategy for capabilities through 2025 Conduct technical assessment and net centric review of DoD Satellite Operations (SATOPS) enterprise.\n–\tEnvironmental Monitoring: Develop DoD inputs for annual Federal Plan for Meteorological Services and Supporting Research; Lead METOC Data Denial Implementation team; Conduct analysis in support of Defense Weather AoA; conduct assessment of USG weather satellite common ground system compliance with DoD Data Denial requirements; DoD Lead on Antarctic treaty activities at McMurdo Station, Antarctica; develop METOC data strategy; develop DoD National Space Weather Strategy.\n–\tNon-Intelligence Space Programs Technical Assessments: Conduct non-intelligence space program reviews on net-centric attributes to include data strategies, systems engineering, risks and mitigations. Support milestone decisions for weather satellite follow-on, JMS, Launch Vehicle New Entrants, AFSCN, SST and SSBS follow-on activities. \n–\tPNT Technical Assessments:  Conduct reviews of all phases of the GPS enterprise programs to increase the likelihood of a successful MGUE MS B in FY14 so that DoD is compliant with congressional mandates. Assess high risk areas and develop mitigation strategies for cost effective delivery of capabilities. Provide a roadmap for better synchronization of PNT programs and capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.475"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.475"
                                            },
                                            "Text": {
                                                "val": "–  C4ISR Acquisition: Provide technical assessments and programmatic recommendations across C4ISR functional areas to address interoperability gaps and work early in the systems engineering and development processes to minimize gaps as systems are delivered and updated.\n–  ACDI\/FLOWNET: Conduct an analysis in an approved A2AD scenario to understand investments in communications capabilities and ensure synchronization of the space, aerial, surface and terminal segments in order to provide communications in degraded communications environments. Conduct detailed analysis on Army TBCT tactical networks as well as extensions into airborne network structures to validate quantitatively the performance and projected benefits of different waveforms and networks.\n–  Onboard Processing of ISR Sensor Data:  Assess how communications link demand can be reduced through onboard processing of ISR sensor data to include storage, compression and automated filtering. Quantify benefits that could be achieved relative to reduced spectrum demand or commercial SATCOM leases, terminal upgrades and MILSATCOM constellation upgrade costs.\n–  MUOS Follow On System AoA:  Based on the results of FY13 activities, conduct an AoA to initiate development of investment and acquisition strategies and consider trade space segment versus terminal costs and the impact on end-to-end performance. Determine requirements for future narrowband access waveforms and trade-off impacts on cost\/performance of future terminals. Analyze MUOS follow on alternatives in A2AD scenarios against sophisticated jamming adversaries.\n–  Tactical Network Cyber Vulnerability Assessments:  Perform cyber vulnerability assessments on control systems for WIN-T Inc 3, AEHF, WGS, MUOS, Teleport and key technologies with wide use across tactical networks. Review system design documents, control plans, remote management control ports and methods. Recommend corrective actions to specific communications and networks programs to address cyber vulnerabilities and to inform milestone decisions.\n–  Dismounted Tactical Edge Mobile Applications:  Characterize current performance (bandwidth, latency, jitter, persistence0 of disadvantages intermittent low bandwidth tactical links based on measured SRW and narrowband SATCOM performance.  \n–  Ground\/Air\/Space integrated Networks Performance Assessment:  Facilitate the development and analysis of waveform capabilities. Evaluate new waveform technologies, wireless communications waveform development and management. Perform technical assessments of onboard processing on UAS systems to reduce demand for communications link bandwidth and identify accelerated methods to achieve certified test data for non-developmental products.\n–  C2 Portfolio: Update the C2 Strategic Plan (FY14-19) based on results of the next QDR and Chairman’s Joint Force 2020. Update the DoD C2 Implementation Plan (FY14-19) to achieve goals and objectives of the DoD C2 Strategic Plan.\n–  C2 Research: Provide conceptual foundation, metrics and empirical evidence to operationalize Agile C2. Provide technical support to US participation in NATO and other international C2 research efforts.\n–  Acquisition Management: Provide technical assistance in developing IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.\n–  Cyber Investment Management: Synchronize and coordinate cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provide support of the Cyber Investment Management Board and develop implementation guidance and associated direction.\n–  Space Access: EELV New Entrant Strategy\/Technical Assessment & Cost Benefit Analysis\/Potential AoA for EELV follow-on; implement National Security Space Access & Space Range Roadmap; conduct SATOPS Modernization AoA; provide technical Oversight\/AFSCN Modernization Implementation; conduct AFSCN Event Driven Net Centric Review\/Technical Assessment.\n–  Environmental Monitoring: Develop DoD inputs for annual Federal Plan for Meteorological Services and Supporting Research; Lead METOC Data Denial Implementation team; Develop METOC\/Weather Enterprise Strategy and Roadmap implementing results of Defense Weather Analysis of Alternatives (AoA); conduct assessment of USG weather satellite common ground system compliance with DoD Data Denial requirements; DoD Lead on Antarctic treaty activities at McMurdo Station, Antarctica; implement METOC data strategy; implement DoD National Space Weather Strategy\n–  Space Control\/Space C2\/SSA: Complete GEO SSA Architectural\/Cost-Benefit Analysis; conduct Analysis & Assessment of DoD Use of Foreign\/Non-traditional SSA Sensors; Develop & publish Policy for use of civil and international sources of SSA data in military operations; conduct Joint Space Operations Center (JSpOC) Mission System (JMS) NCR\/Technical Assessment; conduct CCS NCR\/Technical Assessment; implement Space Protection Architectural analysis\/Cost Benefit Analysis recommendations; Update Enterprise Strategy & Roadmap for Space Control Mission Area.\n–  Non-Intelligence Space Programs Technical Assessments: Conduct non-intelligence space program reviews on net-centric attributes to include data strategies, systems engineering, risks and mitigations. Support milestone decisions for programs including weather satellite follow-on, JMS, Launch Vehicle New Entrants, AFSCN, SST and SSBS follow-on activities.\n–  PNT Programs Technical Assessments:  Conduct deep dive technical analyses to understand all phases of the GPS enterprise programs. Review PNT programs for data strategies, systems engineering, risks and mitigations in support of milestone decisions. \n–  PNT Portfolio Management:  Implement PNT Assurance Investment Strategy and Roadmap. Implement NAVWAR Investment Strategy and Roadmap as well as material in support of major program milestones and internal OSD reviews.\n–  PNT NATO and Allied Interoperability: Ensure PNT capabilities are interoperable and supportable with other relevant commercial, civil and military Allied systems. Chair NATO Navigation Warfare (NAVWAR) working group, oversee foreign military sales and other technical interchange with allies regarding PNT, GPS and NAVWAR technologies. Provide technical expertise for bilateral and multilateral activities in NATO NC3B.\n–  PNT Strategy: Develop enterprise level acquisition strategies & policies in relation to PNT. Oversee implementation and compliance of the GPS Security Policy and develop international agreements to ensure US forces maintain global access."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In executing JTDL tasking, existing cost-plus contracts will be utilized.\n-Driven reviews in support of the JCIDS, acquisition and PPBE processes."
                        },
                        "PerformanceMetrics": {
                            "val": "Enterprise-Wide Alignment:  Accelerate DoD information age transformation to increase the effectiveness and efficiency of the warfighting, intelligence and business missions.\nMeasures:\n-  Timely development and issuance of policy and guidance\n-  Instantiation of enterprise-wide system engineering for the Global Information Grid across DoD\n\n\nPortfolio Management:  Provide for the timely and effective delivery of key Net-Centric capabilities through portfolio management\nMeasures:\n-  Key milestones completed for major net-centric acquisitions \n-  Number of major systems through net-centric event"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "16.775"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "20.688"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "19.475"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "19.475"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}