{
    "id": "b46fc2906e605ae1cf846d24a1645d8e49fc8ad5",
    "meta": {
        "filename": "dod-2014_RDTE_2014_SOCOM_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.zzz_unzipped_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160472BB"
        },
        "ProgramElementTitle": {
            "val": "SOF Information and Broadcast Systems Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "74"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "14.142"
            },
            "PriorYear": {
                "val": "4.797"
            },
            "CurrentYear": {
                "val": "4.959"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0"
            },
            "TotalCost": {
                "val": "23.898"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY2014, this Program Element (PE) 1160472BB, SOF Information and Broadcast Systems Advanced Technology has been consolidated into SOCOM PE 1160402BB, Special Operations Advanced Technology Development."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) conducts rapid prototyping, advanced technology demonstrations, and advanced concept technology demonstrations of information and broadcast systems technology.  Includes planning, analyzing, evaluating, and production information systems capabilities and distribution\/dissemination broadcast systems capabilities.  It provides a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by Special Operations Forces (SOF) users.  This PE integrates efforts with each other and conducts technology demonstrations in conjunction with joint experiments and other assessment events.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  The PE also addresses unique, joint special mission or area-specific needs for which prototypes must be developed on a rapid response basis, or are of sufficient time sensitivity to accelerate the prototyping effort of a normal acquisition program in any phase."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.924"
                },
                "CurrentYear": {
                    "val": "4.959"
                },
                "BudgetYearOne": {
                    "val": "5.045"
                },
                "BudgetYearOneBase": {
                    "val": "5.045"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.797"
                },
                "CurrentYear": {
                    "val": "4.959"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.127"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.045"
                },
                "BudgetYearOneBase": {
                    "val": "-5.045"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.127"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-5.045"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.045"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:   \n\nFY 2012:  Decrease of $0.127 million is due to a transfer of funds to Small Business Innovative Research.\n\nFY 2013:  None.\n\nFY 2014:  Decrease of $5.045 million is due to beginning in FY2014, this Program Element (PE) 1160472BB has been consolidated into SOCOM PE 1160402BB.\n\nSchedule:  None.  \n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S225"
                    },
                    "ProjectTitle": {
                        "val": "SOF Information and Broadcast Systems Adv Tech"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.142"
                        },
                        "PriorYear": {
                            "val": "4.797"
                        },
                        "CurrentYear": {
                            "val": "4.959"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "23.898"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts rapid prototyping of information and broadcast system technology.  This includes cyber capabilities that predict the best media channels to reach potential target audiences, data mining and information collections tools, propaganda and social behavior analytical tools, cultural analysis toolsets and emerging technologies that support the planning and analytical needs for the Military Information Support Operations (MISO) forces.  It provides a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by SOF users.  This project integrates efforts and conducts technology demonstrations in conjunction with joint experiments and other assessment events and performs market research on emerging technologies that support all phases of MISO.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  The project also addresses unique, joint special mission or area-specific needs.  Seeks technologies that will transform current MISO capabilities through two major objectives: 1) Exploit technologies capable of disseminating products to reach target audiences across a variety of media to include audiences in denied areas.  2) Automate and improve MISO planning and analytical capability through technologies that are integrated into SOF planning systems (Cultural Analysis, Targeting, Theme Development, Media & Product Selection, Distribution & Dissemination, and Measures of Effectiveness).  Develops software applications that increase the efficiency and shorten the timeline to get MISO dissemination packages approved.  Develops hardware\/software tools that facilitate the collaboration and sharing of information and other critical data.  \n\nMISO Modernization.  This initiative will initiate and continue development of emergent technologies available in the marketplace to transform and modernize MISO planning, analysis, development, broadcast, distribution, dissemination, and feedback capabilities. This initiative will also continue development of appropriate emerging technologies initially identified by ATDs and JCTDs to transition to acquisition programs. Technologies include: multi-frequency broadcast systems; digital broadcast capabilities; remote controlled electronic paper; near-real-time command and control of unattended MISO systems, especially in denied areas; focused\/beam speaker sound technologies; visual projection technologies; advanced commercial broadcast technologies including amplitude modulation (AM) and frequency modulation (FM) radio transmitters and antenna; television (TV) transmitter and antenna systems; internet and telephony dissemination and broadcast systems; technologies capable of disseminating MISO products to reach target audiences across a wide variety of media into denied areas; and technologies that automate and improve MISO planning and analytical capability through integrated capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MISO Modernization"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.797"
                                            },
                                            "Text": {
                                                "val": "Distributed audio media analysis capabilities from MIS enterprise and developed internet dissemination methods. Began development of Distributable Audio Media (DAM)\/Scatterable Media (SM) prototype that will confirm viability of capability, automated production capabilities of DAM\/SM, and mass recording capability of DAM\/SM.\n\nPrototyped an enterprise environment for MISO Soldiers that automates the planning process of the seven phases of MISO while integrating various software tools to assist the operator in each of the seven phases.  \n\nCreated a cultural information data sharing system to holistically display trends in MISO atmospherics while exponentially increasing the ability to collaborate, communicate, share, and store information.  \n\nThe automated MISO planning tool SAVANT, has transitioned and is installed on all the MISOB Medium Production Center family of systems.  SAVANT is also used as a training tool for new operators at the Special Warfare Center and School."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.959"
                                            },
                                            "Text": {
                                                "val": "Continue to transition previously developed technologies to programs of record."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC1"
                                    },
                                    "Title": {
                                        "val": "Military Information Support Operations"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.142"
                                        },
                                        "CurrentYear": {
                                            "val": "27.417"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "31.559"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}