{
    "id": "b96439864f9c1bcdc9c54cab20ccc0c2ac7afd0d",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605013A"
        },
        "ProgramElementTitle": {
            "val": "Information Technology Development"
        },
        "R1LineItemNumber": {
            "val": "117"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "35.714"
            },
            "CurrentYear": {
                "val": "51.463"
            },
            "BudgetYearOne": {
                "val": "68.814"
            },
            "BudgetYearOneBase": {
                "val": "68.814"
            },
            "BudgetYearTwo": {
                "val": "69.166"
            },
            "BudgetYearThree": {
                "val": "63.497"
            },
            "BudgetYearFour": {
                "val": "40.558"
            },
            "BudgetYearFive": {
                "val": "35.814"
            }
        },
        "ProgramElementNote": {
            "val": "Increase supports Army Contract Writing and Management System (ACWMS), the Army's strategy for a single enterprise-wide contract writing and management solution that will meet the Army current critical functional contract writing requirements and can expand to meet future functional needs.  The Army goal is to streamline Acquisition, Technology and Logistics (AT&L) end-to-end business processes; reduce operating, maintenance and support costs; decrease, and where applicable, mitigate the number of existing and future interfaces; support financial auditability; and promote and improve efficiencies when integrating with existing Enterprise Resource Planning (ERPs) solutions.  This is consistent with Undersecretary of Defense, Acquisition, Technology and Logistics Memorandum; Department of Defense (DoD) Functional Contract Writing and Administration, 21 October 2011 which directed that no new contracts were to be input into the DoD legacy Standard Procurement System (SPS) after 30 September 2015 and that all use of SPS would cease on 30 September 2017.  Funds are to perform all requisite activities to concurrently develop pre-Milestone A\/B documentation and perform pre-solicitation\/source selection activities expected of a projected ACAT IAM program in order to meet the USD AT&L timelines."
        },
        "ProgramElementMissionDescription": {
            "val": "Supports efforts to plan, design, develop, and test information technology solutions to fulfill the Army's Warfighter Support Mission and accommodate changing Army requirements while fulfilling future Army needs.  Provides for development and acquisition of Combat Service Support (CSS) and business information technology solutions to help arm, sustain, fix, move, train and man the force.  Completed development\/acquisition efforts will also enhance sustaining base functions and power projection capabilities and facilitate global messaging and electronic data interchange (EDI).  Ongoing development efforts support multiple functional areas including logistics, personnel, transportation, training, medical\/health protection, and sustaining base."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.065"
                },
                "CurrentYear": {
                    "val": "51.463"
                },
                "BudgetYearOne": {
                    "val": "48.172"
                },
                "BudgetYearOneBase": {
                    "val": "48.172"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "35.714"
                },
                "CurrentYear": {
                    "val": "51.463"
                },
                "BudgetYearOne": {
                    "val": "68.814"
                },
                "BudgetYearOneBase": {
                    "val": "68.814"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.649"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "20.642"
                },
                "BudgetYearOneBase": {
                    "val": "20.642"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.669"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "20.642"
                                },
                                "BudgetYearOneBase": {
                                    "val": "20.642"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "099"
                    },
                    "ProjectTitle": {
                        "val": "Army Human Resource System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.288"
                        },
                        "CurrentYear": {
                            "val": "0.705"
                        },
                        "BudgetYearOne": {
                            "val": "0.591"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.591"
                        },
                        "BudgetYearTwo": {
                            "val": "0.749"
                        },
                        "BudgetYearThree": {
                            "val": "0.725"
                        },
                        "BudgetYearFour": {
                            "val": "0.684"
                        },
                        "BudgetYearFive": {
                            "val": "0.684"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Army Human Resource System (AHRS) is the Army's system of systems that provides commanders the necessary personnel information to make informed decisions on mobilized military personnel resources (both Active Duty and Reserve Component). The implementation of AHRS requires the development of an authoritative Army Corporate database to support the eventual migration to Integrated Personnel and Payroll System-Army (IPPS-A). However, major elements of AHRS are not planned to be subsumed into IPPS-A.  AHRS consists of three major components:\n - Electronic Military Personnel Office (eMILPO) provides the U.S. Army with a reliable, timely, and efficient mechanism for performing Army personnel actions and managing strength accountability.  The application provides visibility of the location, status, and skills of Soldiers both from a high level (tope of the system) and a unit level (bottom of the system).  eMILPO delivers enhanced performance to the Soldier, providing superior data accuracy, and a more intuitive web-based approach resulting in increased productivity, quality, timeliness, security, and user satisfaction.  It re-hosted the USC Title 10 functionality, formerly resident in the Standard Installation Division Personnel System-3 (SIDPERS) application, for migration to IPPS-A.  Selected elements of eMILPO will need to be operated in parallel with IPPS-A until\/unless IPPS-A is able to absorb all eMILPO functionality.\n- Deployed Theater Accountability System (DTAS) is a personnel accountability system that enables the Combatant Commanders (COCOM) to meet Title 10 personnel accountability responsibilities.  DTAS is residing on the Secret Internet Router Network (SIPRnet) and accounts for military and civilian personnel in a deployed theater by unit, day and location supporting force tracking and deployed Operations Tempo (OPTEMP) tracking.  DTAS is a persistent system and will continue to exist Integrated Personnel and Pay System - Army (IPPS-A) migration.\n - The Tactical Personnel System (TPS) is a stand-alone system that supports personnel accountability for task organization\/manifests and jump manifests used by tactical units.  The system interfaces with DTAS, allowing Soldiers to be loaded into DTAS in mass upon arrival in theater.  TPS will continue to exist Integrated Personnel and Pay System - Army (IPPS-A) migration.\n-Personnel Transformation (PT)- Enterprise Service Bus (ESB)- The Army's Enterprise Service Bus (ESB) provides a data integration service in which data can be extracted from the legacy human resource systems and transferred to DIMHRS.  The ESB will be a middleware application which will  provide a single interface to and from DIMHRS from the Army Legacy Systems.  The ESB will provide the infrastructure for the integration of new and existing applications by allowing systems and applications to easily exchange information across different environments and platforms.  It will also form the information bridge between IPPS-A, the Army Legacy Systems, and external systems to create more streamlined systems in support of the military mission and personnel transformation goals. \n\n FY14 funding procures GoArmy Ed. GoArmy Ed is an Army continuing Education System (ACES) program that provides the virtual gateway to request Tuition Assistance (TA) online, anytime for classroom, distance learning, and online college courses.  GoArmy Ed is a dynamic online portal that automates many of the paper-based processes historically conducted in-person at Army Education Centers.  GoArmyEd includes automated registration tools that enforce TA policies and procedures.  GoArmyED is used by Soldiers to pursue their post secondary educational goals: Army Education Counselors to provide educational guidance; and Colleges to deliver degree and course offerings and to report Soldier progress.\n\nModernization initiatives address GoArmyEd functionality gaps by automating and improving business process functions to mitigate the integration of additional users and business rules from the Reserve Component.  GoArmyEd is the Army's enterprise education solution.  The integration of the Reserve Component exceeds the current capability of education counselors.  Education benefits are paramount to recruiting and retention of quality Soldiers and Families."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AHRS"
                                    },
                                    "Description": {
                                        "val": "Funding will support Post Deployment Software Support (PDSS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.288"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Engineering Change Packages (ECPs)\/System Change Packages (SCPs) Interim Change Packages (ICPs) in support of eMILPO and DTAS\n\nGoArmy Ed automated manual course enrollments and created a feature that allows for annual review vs. individual course enrollments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.705"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GoArmy Ed will add functionality, continue automation of manual business processes, integration of DA Civilians and a new Data Warehouse."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.591"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.591"
                                            },
                                            "Text": {
                                                "val": "GoArmy Ed will add functionality, continue automation of manual business processes, integration of DA Civilians and a new Data Warehouse."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "STACOMP"
                                    },
                                    "Title": {
                                        "val": "STACOMP"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "83.765"
                                        },
                                        "CurrentYear": {
                                            "val": "110.158"
                                        },
                                        "BudgetYearOne": {
                                            "val": "115.736"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "115.736"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "154.492"
                                        },
                                        "BudgetYearThree": {
                                            "val": "141.811"
                                        },
                                        "BudgetYearFour": {
                                            "val": "132.431"
                                        },
                                        "BudgetYearFive": {
                                            "val": "96.344"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "AHRS - ACES"
                                    },
                                    "Title": {
                                        "val": "AHRS - Army Continuing Education Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.185"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "12.185"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "GoArmy Ed - The program manager makes extensive use of Integrated Product Teams (IPTs).  Sub-elements of the acquisition (engineering and design, logistics planning, testing, etc.) are intensively managed by integrated teams of government and contractor personnel.  Task performance is tracked against the Work Breakdown Structure (WBS) and resources allocated to each task are adjusted based on performance against the WBS.  GoArmy Ed contractual efforts are acquired on a firm fixed price basis on existing contractual vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AHRS - ECPs\/SCPs\/ICPs"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Hewlit Packard"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "88.051"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AHRS - Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Hewlit Packard"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "50.635"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.088"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Go Army ED"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "IBM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.705"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.591"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.591"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Go Army Ed Support\/Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "184"
                    },
                    "ProjectTitle": {
                        "val": "Installation Support Modules"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.407"
                        },
                        "CurrentYear": {
                            "val": "2.096"
                        },
                        "BudgetYearOne": {
                            "val": "1.734"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.734"
                        },
                        "BudgetYearTwo": {
                            "val": "2.251"
                        },
                        "BudgetYearThree": {
                            "val": "2.210"
                        },
                        "BudgetYearFour": {
                            "val": "2.054"
                        },
                        "BudgetYearFive": {
                            "val": "2.091"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "INSTALLATION SUPPORT MODULES (ISM) consists of four standardized, web based, custom-developed enterprise wide applications that integrate essential installation business practices and processes throughout the Army, to meet Army Force Generation (ARFORGEN) Brigade Combat Team readiness and deployment requirements.  Three modules support human resources business functions (In\/Out-Processing, Transition Processing, and Personnel Locator); the fourth module, Central Issue Facility (CIF) supports management of over $9.000 million combatant Organizational Clothing and Individual Equipment inventory.  The web server architecture is fully internet protocol capable and allows soldiers ready access to their records and commanders and logisticians access to information affecting readiness of combat organizations. \n  \nCoalition Warfighter Interoperability Demonstration (CWID) is a mandated Joint program that requires participation by the US Army to explore near-term technologies that support Joint and Coalition Warfare Interoperability.  Funding is to facilitate Coalition Force interoperability research and development and to comply with CJCSI 6230.2 date 30 April 05.  \n\nArmy Behavioral Health Integrated Data Environment (ABHIDE) will be the U.S. Army Center for Health Promotion and Preventive Medicine (CHPPM) Suicide Registry.  Data relating to suicides and suicides attempts are collected and stored in a in disparate, non-related databases that cross the domains of medical, personnel and law enforcement.   ABHIDE will provide the capability of integrating the non-related and dispersed data from the separate sources into a single comprehensive database to support both retrospective and predictive analysis.  The information obtained will be used to conduct epidemiological surveillance, identify trends in behavior patterns and identify potential indicators for suicidal tendencies supporting the mitigation of future suicide attempts across all phases of Army service.\n\nISM Core funding is essential for supporting demands to research and develop improved systems to provide for soldier safety and inventory reduction without risking readiness. Supports research and development to comply with Dept of Defense Instruction 8320.4 Serialized Item Management.  Applications to use commercial off the shelf wireless bar code equipment to ensure inventory accuracy throughout 154 warehouses in worldwide locations potentially reduces operating costs by $500.000 million. \n\nFunding for CWID will continue to facilitate Coalition Force interoperability research and development. Funding for ABHIDE will continue development of the system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Independent Verification and Validation (IV&V) Testing"
                                    },
                                    "Description": {
                                        "val": "Independent Verification and Validation (IV&V) Testing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.063"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Required Independent Verification and Validation (IV&V) Testing"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.064"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Required Independent Verification and Validation (IV&V) Testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.067"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.067"
                                            },
                                            "Text": {
                                                "val": "Required Independent Verification and Validation (IV&V) Testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Post-Deployment Software Support (PDSS) - Engineering Change Packages (ECPs)\/System Change Packages (SCPs)"
                                    },
                                    "Description": {
                                        "val": "Post-Deployment Software Support (PDSS) - Engineering Change Packages (ECPs)\/System Change Packages (SCPs):  Develop or enhance software to meet the requirements of the soldier and installation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.095"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Planned: Continue with COTs extension of bar coding to meet DoD requirements for Individual Unit Identification (IUID) and tracking of OCIE in the CIF module to insure soldiers get the right equipment they need to execute their assigned mission as they progress through ARFORGEN cycles.  IUID ensures the best stocks are issued to achieve an equipping balance based on CSA guidance to build enduring readiness while providing the soldier with the safest equipment possible.  Specifically will expand Automated Identification Technology to the CIF application to comply with DoD IUID policy; continue to add self service functions to the CIF through Army Knowledge on Line; improve compliance with personal privacy safeguards to mask social security numbers and other personal information; add OCIE logistical data from National Guard systems and create a common data base to reduce duplicate ordering and increase utilization of existing stocks; improves asset visibility; and add automation of soldier test scoring when taking the Armed Forces Classification Test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.321"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Planned: apply commercial off the shelf e-Signature software to existing applications to reduce soldier wait time for processing signatures from 30 minutes per transaction to under one minute.  Funds are also intended to upgrade core systems hardware to improve overall efficiency. Current equipment was installed in 2002 and is inadequate for forcasted workloads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.313"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.313"
                                            },
                                            "Text": {
                                                "val": "Planned:  testing of commercial off the shelf software for best fit to improve the use of wireless bar code equipment in Central Issue Facility warehouses.  Current total inventory is over $9,000.000 million; estimated savings by reducing the possibility of excess purchases is $500.000 million."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Coalition Warfighter Interoperability Demonstration (CWID)"
                                    },
                                    "Description": {
                                        "val": "Coalition Warfighter Interoperability Demonstration (CWID)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.091"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Coalition Warfighter Interoperability Demonstration (CWID) is a mandated Joint program that requires participation by the US Army to explore near-term technologies that support Joint and Coalition Warfare Interoperability.  Funding is to facilitate Coalition Force interoperability research and development and to comply with CJCSI 6230.2 date 30 April 05."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Behavioral Health Integrated Data Environment"
                                    },
                                    "Description": {
                                        "val": "Army Behavioral Health Integrated Data Environment (ABHIDE) will be the U.S. Army Center for Health Promotion and Preventive Medicine (CHPPM) Suicide Registry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Army Behavioral Health Integrated Data Environment (ABHIDE) will be the U.S. Army Center for Health Promotion and Preventive Medicine (CHPPM) Suicide Registry.  Data relating to suicides and suicides attempts are collected and stored in a in disparate, non-related databases that cross the domains of medical, personnel and law enforcement.  ABHIDE will provide the capability of integrating the non-related and dispersed data from the separate sources into a single comprehensive database to support both retrospective and predictive analysis.  The information obtained will be used to conduct epidemiological surveillance, identify trends in behavior patterns and identify potential indicators for suicidal tendencies supporting the mitigation of future suicide attempts across all phases of Army service."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.711"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Army Behavioral Health Integrated Data Environment (ABHIDE) will be the U.S. Army Center for Health Promotion and Preventive Medicine (CHPPM) Suicide Registry.  Data relating to suicides and suicides attempts are collected and stored in a in disparate, non-related databases that cross the domains of medical, personnel and law enforcement.  ABHIDE will provide the capability of integrating the non-related and dispersed data from the separate sources into a single comprehensive database to support both retrospective and predictive analysis.  The information obtained will be used to conduct epidemiological surveillance, identify trends in behavior patterns and identify potential indicators for suicidal tendencies supporting the mitigation of future suicide attempts across all phases of Army service."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.354"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.354"
                                            },
                                            "Text": {
                                                "val": "Army Behavioral Health Integrated Data Environment (ABHIDE) will be the U.S. Army Center for Health Promotion and Preventive Medicine (CHPPM) Suicide Registry.  Data relating to suicides and suicides attempts are collected and stored in a in disparate, non-related databases that cross the domains of medical, personnel and law enforcement.  ABHIDE will provide the capability of integrating the non-related and dispersed data from the separate sources into a single comprehensive database to support both retrospective and predictive analysis.  The information obtained will be used to conduct epidemiological surveillance, identify trends in behavior patterns and identify potential indicators for suicidal tendencies supporting the mitigation of future suicide attempts across all phases of Army service."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BE4162"
                                    },
                                    "Title": {
                                        "val": "MACOM AUTOMATION SYSTEMS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "59.645"
                                        },
                                        "CurrentYear": {
                                            "val": "30.836"
                                        },
                                        "BudgetYearOne": {
                                            "val": "63.331"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "63.331"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "63.597"
                                        },
                                        "BudgetYearThree": {
                                            "val": "55.643"
                                        },
                                        "BudgetYearFour": {
                                            "val": "55.009"
                                        },
                                        "BudgetYearFive": {
                                            "val": "55.631"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Installation Support Modules is in Post Deployment Software Support (PDSS).  The present concept calls for the use of full and open competition to implement enhancements as defined by the Functional Proponent, Army Chief Information Officer (CIO)\/G-6."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Army Behavioral Health Integrated Data Environment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.588"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.158"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.711"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.354"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.354"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Post-Deployment Solfware Support (PDSS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.146"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.095"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.321"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.313"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.313"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Coalition Warfighter Interoperability Demonstration (CWID)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.091"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.091"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Independent Verification and Validation (IVV) Testing"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GDIT Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.984"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.063"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.064"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.067"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.067"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "193"
                    },
                    "ProjectTitle": {
                        "val": "Medical Communications For Combat Casualty"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.366"
                        },
                        "CurrentYear": {
                            "val": "4.285"
                        },
                        "BudgetYearOne": {
                            "val": "3.636"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.636"
                        },
                        "BudgetYearTwo": {
                            "val": "4.648"
                        },
                        "BudgetYearThree": {
                            "val": "4.697"
                        },
                        "BudgetYearFour": {
                            "val": "4.557"
                        },
                        "BudgetYearFive": {
                            "val": "1.172"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Medical Communications for Combat Casualty Care (MC4) System provides multipliers to the medical force structure through the acquisition of information technology solutions for the deployable medical forces.  The MC4 System fulfills the requirements highlighted in United States Code: Title 10, Subtitle A, Part II, Chapter 55, Section 1074f, mandating the proper documentation of deployed service members' medical treatment to include pre- and post-deployment screening and its associated medical surveillance.  The MC4 System interfaces Force Health Protection and medical surveillance information with Army Mission Command information technology systems.  The MC4 System supports other soldier protection initiatives by providing data for analyses which can be used for identification and development of critical soldier support systems such as body armor, improved helmets, traumatic brain injury protection and trauma reduction.  Current MC4 Program efforts are focused on system engineering, testing, integration, and fielding automation infrastructure for Army users of the Theater Medical Information Program-Joint (TMIP-J) suite of software.  Effort has also been initiated to integrate MC4 with the Army CIO Network 2020 and Common Operating Environment (COE) and as a program of record in the Mobile\/Handheld Computing Environment Working Group.  Funding provides engineering, developmental testing, and integration of information management\/information technology to support Force Health Protection in accordance with the Army Equipment Modernization Plan.\n\nFY 2014 Base funding will be used for the engineering effort required to provide the Defense Health Information Management System (DHIMS) TMIP-J software on the Army platform, as well as the engineering effort for other Army unique capability.  Activities include:\n--Test augmentation to include development testing of TMIP, and other Army unique software capabilities\n--All other testing to include operational, security, acceptance of TMIP and other software products\n--Integration testing of all DHIMS\/TMIP, any follow-on tactical electronic medical record, and other software systems on the MC4 baseline electronic medical record system\n--Research of technologies to integrate software into Army future information infrastructure, such as exploration of virtualization for MC4\n--Evaluation of hardware technology obsolescence and solutions\n--Evaluation and testing of technology upgrades to include capabilities identification through market surveys and demonstrations\n--Evaluation of new health care capabilities not provided by DHIMS\/TMIP, e.g. telehealth\n--Test and evaluation of new capabilities and how well they work in the combat theater\n--Lab site studies with technology and scenarios\n--Interfaces with other systems, e.g. Nett Warrior and FBCB2"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Technical Support"
                                    },
                                    "Description": {
                                        "val": "Engineering and Technical Support for P3I and System Upgrades, Systems Integration, and Software Support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.561"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Engineering and Technical Support for Planned Upgrades and System Updates, Systems Integration, and Software Support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.716"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Engineering and Technical Support for Planned Upgrades and System Updates, Systems Integration, and Software Support.  Evaluation of virtualization and telehealth solutions to support Army current and future information infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.601"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.601"
                                            },
                                            "Text": {
                                                "val": "Engineering and Technical Support for Planned Upgrades and System Updates, Systems Integration, and Software Support.  Continued evaluation and development of virtualization, interface\/integration with Common Operating Environment, and telehealth solutions to support Army current and future information infrastructure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MC4 Information Assurance (IA) Testing"
                                    },
                                    "Description": {
                                        "val": "Ensures IA compliance through Army security testing and submission, accreditation, IAVA patches and interfaces with other systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.502"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Ensured IA compliance through Army security testing and submission, accreditation, IAVA patches and interfaces with other systems.  Researched Data At Rest solutions for MC4 systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.523"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Ensures IA compliance through Army security testing and submission, accreditation, IAVA patches and interfaces with other systems.  Evaluation of fielded systems for compliance with configuration baseline as approved.  Implement Data At Rest on MC4 systems to ensure system receives Authority to Operate.  Conduct security testing in planned upgrade of MC4 system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.532"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.532"
                                            },
                                            "Text": {
                                                "val": "Ensures continuing IA compliance through Army security testing and submission, accreditation, IAVA patches and interfaces with other systems.  Conduct security testing in next planned upgrade of MC4 system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PMO Testing Support"
                                    },
                                    "Description": {
                                        "val": "Test augmentation to include DHIMS\/TMIP-J and other Army unique software capabilities by outside agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.831"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Test augmentation to include DHIMS\/TMIP-J and other Army unique software capabilities by outside agencies.  Security testing of MC4 system by Information Security Evaluation Command to renew Authority to Operate.  Joint Interoperability Test Command provided test support to MC4 systems with interface to other systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.542"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Test augmentation to include DHIMS\/TMIP-J and other Army unique software capabilities by outside agencies.  Planned upgrade will require Army Medical Department Board (testing), Army Test and Evaluation Command and Joint Interoperability Test Command to provide Operational Assessment and Multi-services Operational Test and Evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.551"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.551"
                                            },
                                            "Text": {
                                                "val": "Test augmentation to include DHIMS\/TMIP-J and other Army unique software capabilities by outside agencies.  Testing will include next planned upgrades."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MC4\/TMIP Integration and Testing"
                                    },
                                    "Description": {
                                        "val": "Development testing of DHIMS\/TMIP-J Increment 2 (all releases); Lab site studies with technology and scenarios; Integration testing of software systems on the MC4 baseline system; test and evaluation of new capabilities for combat theater functionality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.472"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported development testing of DHIMS\/TMIP-J Increment 2 Release 2; conducted lab site studies with technology and scenarios; performed integration testing of MC4 system update; tested and evaluated new capabilities for combat theater functionality."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.504"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and test DHIMS\/TMIP-J Increment 2 Release 2 on the MC4 baseline system; Lab site studies with technology and scenarios; test and evaluation of new capabilities for combat theater functionality to include virtualization and telehealth.  Support development testing of DHIMS\/TMIP-J Increment 2 Release 3."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.952"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.952"
                                            },
                                            "Text": {
                                                "val": "Integrate and test DHIMS\/TMIP-J Increment 2 Release 3 on the MC4 baseline system; Lab site studies with technology and scenarios; test and evaluation of new capabilities for combat theater functionality."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA SSN MA8046"
                                    },
                                    "Title": {
                                        "val": "OPA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "32.675"
                                        },
                                        "CurrentYear": {
                                            "val": "22.899"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.867"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.867"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "23.734"
                                        },
                                        "BudgetYearThree": {
                                            "val": "24.123"
                                        },
                                        "BudgetYearFour": {
                                            "val": "24.540"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.527"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA PE 432612"
                                    },
                                    "Title": {
                                        "val": "OMA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.945"
                                        },
                                        "CurrentYear": {
                                            "val": "2.406"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.500"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.436"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.495"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.554"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.550"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The MC4 Program supports a number of Army Medical Information Technology\/Communications initiatives. The near and mid-term focus of the MC4 program is to engineer, design, integrate, test, acquire and field the Army automation infrastructure capabilities supporting fielding of the Theater Medical Information Program-Joint (TMIP-J) integrated software application suite and other Army requirements.  The MC4 hardware is procured as Commercial-off-the-Shelf (COTS) components.  Since TMIP software is a major component of the MC4 System, the MC4 Program will deliver capabilities in increments, recognizing the need for future system updates and Planned Upgrades.  The MC4 Program continues to work with the user community to continually define and refine additional requirements and match them with available technologies to provide the user enhanced capabilities.  These enhanced capabilities will be provided to the user at the earliest possible date.  This approach yields the most operationally useful and supportable capability in the shortest time possible with Cost As an Independent Variable.  Moreover, this approach provides an initial capability with the explicit intent of delivering improved and updated capability in subsequent updates and Planned Upgrades.  This evolutionary development approach will be accomplished through a rapid prototyping process that will progress the system from its current functional capabilities to fully integrated objective capabilities.  Appropriate commercial technology enhancements (e.g. advances in operating systems, voice activated technology, etc) will be incorporated into MC4 products and systems as they become available.  Each MC4 System component will undergo a full range of developmental testing to include software unit testing, integration testing, interoperability testing and software qualification testing. The MC4 system updates and Planned Upgrades will continue to undergo follow-on testing."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Funding (Prior Years) in Program Management Operations includes direct pay of PMO government employees, TDY, training, supplies, etc. in direct support of RDTE effort.  At Milestone C, Program Management Operations efforts were moved to another appropriation."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Prog Mgmt Operations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PMO"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.405"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Information Assurance activities moved from ISEC to L3 in FY12; FY14 new competitive contract award planned"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering & Tech Spt\/Information Assurance (b)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3 (was Titan)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.088"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.063"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.239"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering & Tech Spt\/Information Assurance (new contract)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.133"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Information Assurance"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ISEC Support"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.783"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "FY14 new competitive contract award planned."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMO Testing Spt"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC\/AMEDD Board\/JTIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.212"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.831"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.542"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.551"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.551"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MC4\/TMIP System Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3 Communications"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Frederick MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.238"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.472"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.504"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MC4\/TMIP System Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "John Hopkins University (JHU) Applied Physics Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "32.124"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MC4\/TMIP System Engineering (new contract)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.952"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.952"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "MC4 Development\/Integration Testing for TMIP-J I2R2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MC4\/TMIP-J I2R2 MOT&E"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MC4\/TMIP-J I2R2 FD Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MC4 Development\/IntegrationTesting for TMIP-J I2R3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MC4\/TMIIP-J I2R3 MOT&E"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MC4\/TMIP-J I2R3 FD Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "474"
                    },
                    "ProjectTitle": {
                        "val": "ENTERPRISE TRANSMISSION SYSTEMS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.546"
                        },
                        "CurrentYear": {
                            "val": "2.506"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Combat Service Support (CSS) Automated Information System Interface (CAISI) is a high-data-rate wireless system that provides sensitive information (SI) and is the backbone for logistics connectivity down to individual Combat Service Support (CSS) computer systems located within the sustainment area.  The CAISI design effort focuses on integrating Commercial Off-The-Shelf (COTS) equipment from various manufacturers to create a standard deployable set of communications equipment.  Current CAISI equipment is being fielded with new equipment training to logistics units Army-wide.  Maintenance support is provided at depot-level with additional support at forward repair activities.  Computer based training, on-line refresher training and technical support is also provided for CAISI users.  CAISI employs a deployable wireless LAN infrastructure linking Army Logistics Information Systems (LIS) computers in a 7 square-kilometer area using wireless bridging.  CAISI design incorporates full lifecycle sustainability features to ensure reliability and supportability in full spectrum operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CAISI system testing, evaluation, and IAVM efforts"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.546"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Test, evaluate, and support Information Assurance Vulnerability Management (IAVM) compliance and technical support requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.506"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct tests, evaluations, and support Information Assurance Vulnerability Management (IAVM) compliance and technical requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA, BD3512"
                                    },
                                    "Title": {
                                        "val": "CAISI"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.376"
                                        },
                                        "CurrentYear": {
                                            "val": "10.500"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "26.876"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA, 423612"
                                    },
                                    "Title": {
                                        "val": "OMA, 423612"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.424"
                                        },
                                        "CurrentYear": {
                                            "val": "5.620"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "9.044"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Acquisition strategy will be to obtain engineering support, as well as applicable hardware and software to enhance current CAISI capabilities. Funding provides functional assesment, technical support and integration of IA requirements. Integral to this strategy is the imperative of developing the capability for inserting and integrating emerging technologies into CAISI 2.0."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Research, modification\/integration and testing of CAISI 2.0."
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ISEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Technical\/Integration Support"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "25.401"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.910"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Office Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Springfield, VA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "SETA Contractor Support"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.641"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.906"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.814"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.361"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Research, modification\/integration and testing of CAISI 2.0."
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ISEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Technical\/Integration Support"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "25.620"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.995"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "CAISI Software Licenses Integration and Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "738"
                    },
                    "ProjectTitle": {
                        "val": "AcqBiz"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.254"
                        },
                        "CurrentYear": {
                            "val": "14.837"
                        },
                        "BudgetYearOne": {
                            "val": "12.368"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.368"
                        },
                        "BudgetYearTwo": {
                            "val": "7.463"
                        },
                        "BudgetYearThree": {
                            "val": "6.630"
                        },
                        "BudgetYearFour": {
                            "val": "8.003"
                        },
                        "BudgetYearFive": {
                            "val": "7.070"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "PM AcqBusiness establishes and sustains the family of IT business systems that support the business of Army acquisition.  PM AcqBusiness consists of a family of IT solutions, COTS products, decision support tools and web services that are integrated through a common architecture. Whenever possible, PM AcqBusiness provides access to external enterprise tools and services from other business domains, Army, OSD and DISA and does not duplicate those capabilities.  PM AcqBusiness establishes the enterprise level investment control, portfolio management and requirements visibility which is the heart of IT business system transformation in Army Acquisition.  PM AcqBusiness provides Army Acquisition practitioners with a consistent set of unique business tools, web services, and decision support tools which provides visibility of authoritative data, consistency in business process, more timely support to acquisition decisions and enterprise control over IT investments.  The enterprise tools provided via PM AcqBusiness enables the reduction and eventual elimination of stovepipe and redundant tools that exist in the domain today.  PM AcqBusiness provides an environment that will enable a standard capability to allow access to disparate Acquisition Domain data sources.  PM AcqBusiness will provide role-based access to authoritative data sources and services.  In addition, PM AcqBusiness provides a framework for information providers to publish their data and provide their services to authorized users."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Design, Development, and Test"
                                    },
                                    "Description": {
                                        "val": "This effort supports the ultimate integration of the AcqBusiness Portfolio"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.140"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Analysis and Design, Development, Test and Integration of AcqBusiness Portfolio."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.760"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Analysis and Design, Development, Test and Integration of AcqBusiness Portfolio."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.636"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.636"
                                            },
                                            "Text": {
                                                "val": "Analysis and Design, Development, Test and Integration of AcqBusiness Portfolio."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "This effort provides program management in support of the AcqBusiness Portfolio."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Program Management"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.077"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Program Management"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.732"
                                            },
                                            "Text": {
                                                "val": "Program Management"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OMA"
                                    },
                                    "Title": {
                                        "val": "OMA APE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.238"
                                        },
                                        "CurrentYear": {
                                            "val": "11.871"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.062"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.062"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.281"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.036"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.112"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Product Manager AcqBusiness was established to acquire a centrally managed and funded suite of standard net-centric business capabilities in order to provide Army acquisition practitioners the data visibility necessary to optimize the acquisition of supplies, services, and materiel for the Warfighter.  PM AcqBusiness is using an evolutionary acquisition strategy to acquire the capabilities in order to realize benefits early and reduce risk.  The full range of PM AcqBusiness Service Oriented Architecture (SOA) services will be achieved through an evolutionary implementation of individual components.  Each service is designed to federate cleanly with and leverage the capabilities provided by other SOA environments by leveraging an open-standards based approach to design.  Each PM AcqBusiness SOA service will implement new functionality, and may or may not utilize other already published SOA services.  Each service capability will be tested and then made available to consumers throughout the acquisition community and the Army.  This approach minimizes the cost incurred for testing the system, as well as minimizes release transition impacts on users.  PM AcqBusiness is using an evolutionary acquisition approach, incorporating the use of commercial-off-the-shelf (COTS) hardware and software, and custom developed software to meet Army requirements.  In this approach, the maintenance release will be streamlined to expedite the fielding of a particular PM AcqBusiness software fix or upgrade.  Maintenance releases will be installed on an \"as needed\" basis after testing and approval by PM AcqBusiness.  This approach minimizes the time required to deliver new capabilities to users.  The PM AcqBusiness acquisition approach embraces the tenets of Subtitle III of Title 40, U.S.C. (Formerly the Clinger-Cohen Act of 1996).  As such, the PM AcqBusiness is: (1) performing Business Process Reengineering (BPR) in advance of development of AcqBusiness capabilities.  AcqBusiness is primarily about changing how the acquisition business functions are done in the Army; (2) encouraging the purchase of commercial products and innovations from private industry;  (3) involving potential suppliers of SOA technology early in the requirements generation process; (4) employing outsourcing wherever possible; and (5) acquiring the AcqBusiness capabilities in interoperable modules, leveraging the evolutionary acquisition approach."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Government"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.989"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.114"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.077"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.732"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.732"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Analysis and Design, Development, Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz, Allen and Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Springfield"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "41.523"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.140"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.760"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.636"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.636"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Increment Six IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment Seven IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Major or Minor Release FY13"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Major or Minor Release FY14"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Major or Minor Release FY15"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Major or Minor Release FY16"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Major or Minor Release FY17"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Major or Minor Release FY18"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M05"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise Army Workload & Performance Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.817"
                        },
                        "BudgetYearOne": {
                            "val": "0.701"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.701"
                        },
                        "BudgetYearTwo": {
                            "val": "0.850"
                        },
                        "BudgetYearThree": {
                            "val": "0.795"
                        },
                        "BudgetYearFour": {
                            "val": "0.759"
                        },
                        "BudgetYearFive": {
                            "val": "0.773"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The General Fund Business Enterprise System (GFEBS) is a Major Automated Information System (MAIS) program and completing the developmental phase. It will follow the DoD Business Enterprise Architecture which is aligned to the mandated Federal Enterprise Architecture. GFEBS was implemented to fulfill the needs and comply with the Federal Financial Management Improvement Act (FFMIA), The Chief Financial Officers Act of 1990, the Government Performance and Results Act of 1993, the Government Management Reform Act of 1994, and the Clinger-Cohen Act of 1996 and to fulfill the stated mission of the Assistant Secretary of the Army for Financial Management and Comptroller (ASA(FM&C)). GFEBS will replace financial systems operating in excess of 30 years including the Standard Finance Systems (STANFINS) and other costly feeder systems which do not allow the Department of Defense (DoD) or the U.S. government to achieve an unqualified opinion on its financial statements. GFEBS will become the Department of the Army's new core financial management system for administering its General Fund. GFEBS was developed using a commercial off-the-shelf (COTS) Enterprise Resource Planning (ERP) system that is certified by the Chief, Financial Officer Council (CFOC) and provides the six core financial functions. GFEBS will allow tactical commanders to make informed decisions on a virtually real time system.\n\nOn 1 October 2008, GFEBS deployed to Wave 1 end users at Fort Jackson Garrison, Defense Finance Accounting Service (DFAS) Indianapolis, Indiana and several other organizations. On 1 April 2009, GFEBS deployed to Wave 2 users at Fort Benning, Fort Stewart, DFAS Rome and several other organizations. Wave 3 deployed in October FY10, Wave 4 in January of FY11, Wave 5 in April 2011 and Wave 6 in July 2011. GFEBS is currently fielded to approximately 38,000 trained end users and the last development software release, Release 1.4.4, was fielded to all users in December 2011.  Each fielded release subsumes the previous release keeping all deployed sites executing under the same GFEBS release. The Full Deployment Decision was received by the Milestone Decision Authority on 24 June 2011.  In FY12 GFEBS deployed the remaining waves, 7-8, which encompass the remainder of the Active Army, Army Reserves, Army National Guard and select defense agencies. The Information Technology Development Project M05 provides GFEBS the ability to develop and build reports to meet auditability mandates and to accomplish efforts which enhance the GFEBS system with new reports and interfaces requiring technology development. It provides RDT&E funding to support evolutionary delivery of emerging capabilities.  Although the GFEBS baseline increment has received a full deployment decision, with the increase in users, new requirements emerge which were not necessarily included in the original scope but may provide a significant enhancement to the system, improve processes or may optimize a sub-element."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System Development"
                                    },
                                    "Description": {
                                        "val": "Software and architecture development"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.817"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Product development"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.701"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.701"
                                            },
                                            "Text": {
                                                "val": "Software and architecture development"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Solfware and architecture development"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.701"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.701"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.701"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.817"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T04"
                    },
                    "ProjectTitle": {
                        "val": "USMEPCOM TRANSFORMTION - IT MODERNIZATION"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.643"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Virtual Interactive Processing System (VIPS) will modernize and automate the Information Technology (IT) capabilities for qualifying Applicants into the Military Service during wartime, peacetime, and mobilization.  VIPS will enable a responsive, flexible and efficient means to qualify Applicants to meet manpower resource requirements for the uniformed Services, Coast Guard, and National Guard routine and contingency operations.  VIPS will be the future accessioning system to be used by the US Military Entrance Processing Command (USMEPCOM) which serves as the single entry point for determining the physical, aptitude, and conduct qualifications of candidates for enlistment.  VIPS will provide the capability to electronically acquire, process, store, secure, and seamlessly share personnel data across the Accessions Community of Interest (ACOI).  When fully implemented, VIPS will reduce the cycle time required to induct enlistees to meet the needs of Homeland Defense, reduce the number of visits to the Military Entrance Processing Stations (MEPS), reduce manual data entry errors, and reduce attrition through better pre-screening practices.  The implementation of a Service Oriented Architecture (SOA) approach will enable accession data to be securely available to applicants and ACOI partners such as Recruiting and Training Commands, Defense Manpower Data Center (DMDC), Military Health System, Human Resource Management (HRM), and Defense Travel Management Office (DTMO).  VIPS will support compliance with DoD direction for a net-centric environment and take advantage of automated data capture technology, e.g., medical equipment with the capability to capture and electronically transmit exam results.  The accessioning system of the future will be location independent, virtually paper-free, and automated to assist with bringing the right people at the right time to operational commanders.  On November 1, 2008, the DoD Business Transformation Agency (BTA) assumed program lead."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Project Support"
                                    },
                                    "Description": {
                                        "val": "Funding will support the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.643"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Virtual Interactive Processing System (VIPS) will modernize and automate the Information Technology (IT) capabilities"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Funding for Procurement, Operations, Maintenance, and most of Research Development Test and Evaluation for VIPS moved in FY10-13 to DoD Business Transformation Agency."
                        },
                        "AcquisitionStrategy": {
                            "val": "VIPS will be acquired using a full and open competitive contracting strategy using performance based contracting and will include  Earned Value Management (EVM).  BTA's VIPS Program Office will employ rigorous cost controls using a comprehensive risk management program to ensure development and deployment of a managed solution that meets USMEPCOM and ACOI requirements and fulfills identified capability gaps."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Funding for Management Services for VIPS moved in FY10-13 to DoD Business Transformation Agency."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contractor PM Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.400"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.400"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Continued development FY13 and out moved to DoD BTA; funds not shown here."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Research and Prototype"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Gartner, Virginia"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.145"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.145"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Research and Prototype"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CNI, Illinois"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.699"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.699"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Small Business Innovative Rearch \/Small Busiiness Technology Transfer Program"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.443"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.443"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "This RDT&E will be used by USMEPCOM for continued project transformation support of VIPS."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Transformation Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.322"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.643"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.350"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Transformation Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Bearing Point, Illinois"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.560"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.560"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Funding for Test and Evaluation for VIPS moved in FY10-13 to DoD Business Transformation Agency."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JTIC, MD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.163"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.163"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T05"
                    },
                    "ProjectTitle": {
                        "val": "Army Business System Modernization Initiatives"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.210"
                        },
                        "CurrentYear": {
                            "val": "26.217"
                        },
                        "BudgetYearOne": {
                            "val": "49.784"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.784"
                        },
                        "BudgetYearTwo": {
                            "val": "53.205"
                        },
                        "BudgetYearThree": {
                            "val": "48.440"
                        },
                        "BudgetYearFour": {
                            "val": "24.501"
                        },
                        "BudgetYearFive": {
                            "val": "24.024"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Adapt\/improve\/install\/field government off the shelf (GOTS), commercial off the shelf (COTS), and new software to perform various tasks in a networked environment such as data warehousing, force management, personnel, installation and environmental databases and applications to support Business System Transformation and Installation Management.\n\nThe Army Human Resources Command (HRC) has two efforts for which RDT&E will be applied.  One is to prepare those systems for subsumption be the Integrated Personnel and Pay System(IPPS-A).  The other is to disconnect and upgrade those systems not being subsumed by IPPS-A.  Many systems have delayed upgrade do to the planned release of DIMHRS.   Systems that will be targeted by HRC to prepare for IPPS-A subsumption or upgrade are the Automated Orders and resources System (AORS), Army Selection Board System (ASBS), Data Base Administration Suite of System (DBA), Enlisted Distribution and Assignment system (EDAS), Enlisted Promotion Model (EPM), Enterprise Service Bus (ESB), Human Resource Command User Registration System (HURS), Integrated Total Army Personnel Database (ITAPDB), Officer Selection Support System (OSSS), Reserve Statistics Accounting System\/Reserve Component Common Personnel Data System (RSAS\/RCCPDS), Senior Enlisted Promotions Model (SEPM), Single Evaluation Processing System (SEPS), Soldier Management System Webified Suite of System (SMSWEB), Total Army Personnel Data Base - Active Enlisted (TAPDB-AE), Total Army Personnel Data Base - Active Officer (TAPDB-AO), Total Army Personnel Data Base - Active Reserve (TAPDB-AR), Total Officer Personnel Management Information System (TOPMIS), Total Officer Personnel Management Information System II (TOPMIS II), Keystone Request\/Retain System, and the Interactive Personnel Electronic Records Management System (iPERMS).\n     \nThe Program Planning Budget (PPB)- Business Operating System (BOS) will standardize and better integrate the transactional automated information systems used in the HQDA level programming and budgeting processes.  These systems are core to the PPBE business processes of the HQ for gathering programmatic requirements, balancing resources and delivering the Army's program budget to OSD.  This project is streamlining programming and budgeting processes and significantly improving strategic analysis capabilities.  The project is architecting, reengineering, streamlining and consolidating HQDA systems, feeder data base systems, and streamlining the associated processes.  These improvements will improve capability, eliminate redundancies and reduce overall cost of operations.  The PPB BOS project is complementary to the Army's General Fund Enterprise Business System (GFEBS) program.   It includes a new effort in FY14, the Army Contract Writing System, a replacement for the DoD Standard Procurement System (SPS).\n\nArmy Contract Writing System is the Army's strategy for a single enterprise-wide contract writing and management solution that will meet the Army's current critical functional contract writing requirements and expand to meet future functional needs.  The Army's goal is to streamline Acquisition, Technology and Logistics (AT&L) end-to-end business processes; reduce operating, maintenance and support costs; decrease, and where applicable, mitigate the number and complexity of existing and future interfaces; support financial auditability; as well as promote and improve efficiencies when integrating with existing Enterprise Resource Planning (ERP) solutions.  This is consistent with Under Secretary of Defense, Acquisition, Technology and Logistics Memorandum; Department of Defense (DoD) Functional Contract Writing and Administration dated 21 October 2011, which directed that no new contracts were to be input into the DoD legacy Standard Procurement System (SPS) after 30 September 2015 and that all use of SPS would cease on 30 September 2017.  Funds are to perform all requisite activities to concurrently develop pre-Milestone A\/B documentation and perform pre-solicitations\/source selection activities expected of a projected ACAT IAM program in order to meet the USD AT&L timeline.  \n\nWill field the full operating capability of the Army Mapper system, which is the Army Geospatial data base of record and the HQDA repository for all Installation & Environment related geo-spatial data systems. \n\nThe Law Enforcement Advisory Program (LEAP), formerly known as the Criminal Information Management System (CIMS), is a collection of mission essential information technology (IT) systems within the Criminal Investigation Command (CIDC) and the Office of the Provost Marshal General (OPMG). USACIDC and OPMG has been tasked by the Army Health Promotion\/Risk Reduction (HP\/RR)task force to develop and integrate a unified, comprehensive enterprise program \/ system that shall house Classified and Unclassified - Law Enforcement Sensitive (LES) data which shall leverage existing and future Army LE enterprise information technology (IT) assets and other external data sources providing a full range of law enforcement functions to support business objectives and mission.  This new comprehensive enterprise system will be known as the Army Law Enforcement Reporting and Tracking System (ALERTS) and shall provide US Army LE stakeholders the enhanced capability to rapidly and efficiently manage a variety of LE and criminal intelligence \n(CrimIntel) functions; as well as a broader range of senior executive reporting requirements.  \n\nThe Laboratory Information Management System (LIMS) is a web-based software system used at the Defense Forensics Science Center (DFSC), formerly known as the United States Army Criminal Investigation Laboratory (USACIL) at Fort Gillem, GA for the management of casework and tracking of all evidence received and processed.  The DFSC requires RDT&E funding to complete the configuration, installation and validation of additional LIMS modules in support of forensics (to include the Materials Management,Equipment Management, Proficiency Testing, Training and Crime Scene support); and, to support the development, configuration and implementation of an Expeditionary Forensics Laboratory Information Management System (eLIMS)  in theater.  The eLIMS is the conduit between the deployed labs and the laboratory located at Ft. Gillem.  The eLIMS would provide the forensic analysts with the ability to collect, track, store and analyze evidence collected from battlefield crime scenes at required competency levels of testing and calibration.  It will allow the results to be electronically maintained and transmitted to the permanent physical lab at Ft. Gillem, Ga.\nIn addition, the system would afford the analysts electronic access to shared case management and evidence databases at the LAB from their deployed positions.  At the current configuration of LIMS from CONUS locations, transmission of case related information can be processed in real time; however, transmission of case related information in theater takes\napproximately 1-2 hours.  If requirements are not funded, the DFSC will not be able to complete and implement the additional forensic modules for the core LIMS or develop and implement the eLIMS for the deployable labs. The stated objective will be delayed, resulting in a less than efficient process for handling of cases in theater and an inability to meet acceptable levels of turnaround time for casework."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Business System Modernization Initiatives"
                                    },
                                    "Description": {
                                        "val": "The Army Human Resources Command (HRC) modernization requirements will add new capabilities to legacy IT systems that support human resource functions such as organization and position management, training, and employment.  The PPB BOS system standardize and integrate the transactional information systems used in the Headquarters Department of Army (HQDA)  Programming and Budgeting processes.   The program is streamlining programming and budgeting business processes and significantly improving strategic analysis capabilities.  The PPB BOS architecture reengineers, streamlines, and consolidates HQDA systems and financial feeder systems; aligns to the DoD Business Enterprise Architecture (BEA); implements powerful business intelligence analytical tools to support strategic planning, programming, and budgeting within HQDA; and provides access to GFEBS funds management and execution data through system interfaces with required SFIS compliancy integral to the PPB BOS data model.  The LEAP program will provide criminal intelligence querying and reporting capabilities in compliance with regulatory and policy standards for Army Law Enforcement regarding investigation of felony crimes.  LEAP will captures criminal case investigative information regarding incidents, location descriptors, entities (name, social security number, rank, title, physical characteristics, sex, birth place, and date), agent assignment, crime description and identifiers, statements, property data, laboratory tests; verifies and stores this data for criminal intelligence purposes: and reports this information to the proper authorities from the Division Commanding Officer to the United States Grand Jury.  The system will extract necessary data for consolidation and input to Defense Incident-Based Reporting System (DIBRS) monthly reports, National Incident-Based Reporting System (NIBRS) monthly reports and the Defense Clearance and Investigations Index (DCII) daily updates.  The LIMS system will automate business processes that support the forensic examiners. These processes include, but are not limited to, analytics, materials management, management reporting, Freedom of Information Act requests (FOIA), legal discovery request, court preparation and outsource processing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.210"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete development of the enterprise-level PPB BOS application throughout HQDA and the transfer of budget data to the Army?s financial enterprise resource system, the General Enterprise Business System.  Start the development, configuration, and implementation of the Law Enforcement Advisory Program (LEAP) and the Laboratory Information Management System (LIMS) to support the administrative requirements for law enforcement management within the Criminal Investigation Command (CIDC).   Army Human Resources Command will update and add new capabilities to several IT systems currently in sustainment, which includes the Army Selection Board system, the Officer Selection Support system, the Promotion Point Worksheet, and the Go Army Education system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.217"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Army Human Resources Command will update and add new capabilities to several IT systems currently in sustainment and prepare systems for subsumption by the Integrated Personnel and Pay system (IPPS-A) and disconnect and upgrade those systems not being subsumed by IPPS-A."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.550"
                                            },
                                            "Text": {
                                                "val": "Will continue deployment and final fielding of the enterprise-level PPB BOS application throughout HQDA and the transfer of budget data to the Army's financial enterprise resource system, the General Fund Enterprise Business System.  Will develop the Army Contract Writing System.  Will field the full operating capability of the Army Mapper system, which is the Army Geospatial data base of record and the HQDA repository for all Installation & Environment related geo-spatial data systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Contract Writing System (ACWS)"
                                    },
                                    "Description": {
                                        "val": "ACWS is the Army strategy for a single enterprise-wide contract writing and management solution that will meet the Army's current critical functional contract writing requirement and can expand to meet future functional needs.  The Army's goal is to streamline Acquistion, Technology and Logistics (AL&T) end-to-end business processes; reduce operating, maintenance and support costs; decrease, and where applicable, mitigate the number of existing and future interfaces."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.234"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.234"
                                            },
                                            "Text": {
                                                "val": "FY14 funds will be used to award a systems integrator contract and begin engineering\/development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Modernize IT legacy systems across Army IT domains by adapting\/improving government off the shelf (GOTS), commercial off the shelf (COTS), and new software development to perform various tasks in a networked environment. These efforts include Soldier Management System (SMS), the Army Strategic Readiness Update (ASRU), Law Enforcement Advisory Program (LEAP), the Laboratory Information Management System (LIMS), Program Planning Budget Execution (PPBE) - Business Operating System (BOS), Automated Orders and Resources System (AORS), Army Selection Board System (ASBS), Data Base Administration Suite of System (DBA), Enlisted Distribution and Assignment system (EDAS), Enlisted Promotion Model (EPM), Enterprise Service Bus (ESB), Human Resource Command User Registration System (HURS), Integrated Total Army Personnel Database (ITAPDB), Officer Selection Support System (OSSS), Reserve Statistics Accounting System\/Reserve Component Common Personnel Data System (RSAS\/RCCPDS), Senior Enlisted Promotions Model (SEPM), Single Evaluation Processing System (SEPS), Soldier Management System Webified Suite of System (SMSWEB), Total Army Personnel Data Base - Active Enlisted (TAPDB-AE), Total Army Personnel Data Base - Active Officer (TAPDB-AO), Total Army Personnel Data Base -Active Reserve (TAPDB-AR), Total Officer Personnel Management Information System (TOPMIS), Total Officer Personnel Management Information System II (TOPMIS II), KEYSTONE Retain System, Army Contract Writing System (ACWS), Army Mapper, and the Interactive Personnel Electronic Records Management System (iPERMS).\n\nACWS strategy is to perform all requisite activities to concurrently develop pre-milestone A\/B documentation and perform pre-solicitation\/source selection activities expected of a projected ACAT IAM program in order to meet the USD AT&L timelines for building a contract writing system to replace legacy contract systems to include the Standard Procurement System (SPS)."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "FY14 includes an increase (included in the PPBOS Product Develoment line) for development of the Army Contract Writing Management System ($30 Million in FY14).The Under Secretary of Defense, Acquisition, Technology and Logistics directed that the Standard Procurement System (SPS) be decommissioned by FY17, with no new contracts being written by the SPS software effective FY15. ACWMS will replace SPS. In order for the Army to meet appropriate legislative mandates, the new capability will provide improved functionality in general contract writing and contract administration while seamlessly operating in the NIPR, SIPR, CONUS, OCONUS, and in low\/no bandwidth environments. In addition, the replacement capability will produce data that is trackable and auditable by the Army designated finance account system(s) and will be in compliance with the Secretary of Defense’s mandate for implementing internal controls to facilitate full financial audit readiness and accountability."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PRODUCT DEVELOPMENT FOR KEYSTONE RETAIN SYSTEM, i-PERMS PRODUCT DEVELOPMENT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "M&RA\/G-1"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "ARLINGTON, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.154"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.417"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.978"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PPBOS PRODUCT DEVELOPMENT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OAA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FORT BELVOIR, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.930"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.930"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.820"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "41.736"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "41.736"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "IPPS-A SUPPORT COSTS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "HRC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FORT KNOX, KY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.752"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.863"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.742"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "25.119"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HRC SYSTEMS\nKEYSTONE, IPERMS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "HRC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FORT KNOX, KY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.683"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.683"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ARMY MAPPER"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.365"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.365"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.365"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Law Enforcement Advisory Program(LEAP)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ACC\/NCR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Quantico, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.677"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}