{
    "id": "bc78d4a047f38f823a69e700e4e63ecaf7aed7ac",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA6_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605805A"
        },
        "ProgramElementTitle": {
            "val": "Munitions Standardization, Effectiveness and Safety"
        },
        "R1LineItemNumber": {
            "val": "152"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "53.530"
            },
            "CurrentYear": {
                "val": "46.763"
            },
            "BudgetYearOne": {
                "val": "53.340"
            },
            "BudgetYearOneBase": {
                "val": "53.340"
            },
            "BudgetYearTwo": {
                "val": "59.215"
            },
            "BudgetYearThree": {
                "val": "48.646"
            },
            "BudgetYearFour": {
                "val": "46.837"
            },
            "BudgetYearFive": {
                "val": "38.803"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2014:  Funds realigned to other higher priority requirements."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element supports continuing technology investigations.  It provides a coordinated tri-service mechanism for the collection and free exchange of technical data on the performance and effectiveness of all non-nuclear conventional munitions and weapons systems in a realistic operational environment.  It provides for NATO interchangeability testing (F21); Joint munition effectiveness manuals used by all services; development of standardization agreements (STANAGS) and associated Manuals of Proof and Inspection (MOPI); operation of the North American Regional Test Center (NARTC); evaluation of demilitarization methods for existing conventional ammunition (F24); evaluation of useful shelf life, safety, reliability and producibility of pyrotechnic munitions; and improvement of explosives safety criteria for DOD munitions via the DOD Explosives Safety Board (857).  Pyrotechnic Reliability and Safety (296) supports pyrotechnic research, development and testing to identify, characterize and resolve reliability, safety, storage and manufacturing issues that impact production availability and field use of pyrotechnics.  Project 296 will result in the development and demonstration of new, safe, reliable and environmentally acceptable munitions.  Munitions Survivability and Logistics (297) will make Army units more survivable by applying technologies to reduce the sensitivity of munitions to unplanned stimuli (e.g. bullet impacts, fragment impacts, fast cook off, slow cook off, sympathetic detonation, shaped charge jets) and by testing and demonstrating munitions logistics system solutions that prevent or minimize catastrophic explosive events and accelerate ammunition resupply.  Project 297 also supports the Army Insensitive Munitions (IM) Board's reviews.  The Army Explosives Safety Management Program (858) was established in FY01. The U.S. Army Technical Center for Explosives Safety uses the funds in this project to evaluate current explosives safety standards and develop new, scientific and risk-based standards to meet U. S. Army explosives requirements.  The Life Cycle Pilot Program (LCPP) (859) will assess production base capabilities and needs over the acquisition life cycle of various munitions and will address the producibility of ammunition including the transition to type classification and production, and the ability of the production base to cost effectively produce quality products on schedule.  The Fuze Technology Integration program (862) will improve performance and lower the costs of existing proximity fuzes and enable new applications in submunitions and medium caliber fuzes, addressing advanced proximity fuze sensor technology, Micro-electromechanical Systems (MEMS), Safety and Arming (S&A) technology, and Electronic S&A (ESA) technology for smart munitions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "57.054"
                },
                "CurrentYear": {
                    "val": "46.763"
                },
                "BudgetYearOne": {
                    "val": "64.477"
                },
                "BudgetYearOneBase": {
                    "val": "64.477"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "53.530"
                },
                "CurrentYear": {
                    "val": "46.763"
                },
                "BudgetYearOne": {
                    "val": "53.340"
                },
                "BudgetYearOneBase": {
                    "val": "53.340"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.524"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-11.137"
                },
                "BudgetYearOneBase": {
                    "val": "-11.137"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.524"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-11.137"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.137"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "296"
                    },
                    "ProjectTitle": {
                        "val": "Close Combat Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.643"
                        },
                        "CurrentYear": {
                            "val": "2.248"
                        },
                        "BudgetYearOne": {
                            "val": "4.219"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.219"
                        },
                        "BudgetYearTwo": {
                            "val": "6.305"
                        },
                        "BudgetYearThree": {
                            "val": "2.786"
                        },
                        "BudgetYearFour": {
                            "val": "2.728"
                        },
                        "BudgetYearFive": {
                            "val": "2.796"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project will support research, development and testing to identify, characterize and resolve reliability, safety, storage and manufacturing issues that impact production availability and field use of demolitions, grenades, shoulder launched munitions, mines and mine clearing charges and pyrotechnics, including training realism.  Project will result in the development and demonstration of new, safe, reliable and environmentally acceptable munitions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Heavy Metal Mitigation in Illuminants"
                                    },
                                    "Description": {
                                        "val": "Heavy metals (barium and\/or perchlorate) have toxic effects on soldiers as well as workers in the manufacturing process. This project is to replace toxic oxidizers in green signals and reduce potential health hazards."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.265"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete tests and type classify."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmentally Benign Smoke HHS (Hand Held Signals) (M126A1)"
                                    },
                                    "Description": {
                                        "val": "This program will address the health concerns in the smoke HHS (Hand Held Signals)  by leveraging smoke technology developed through Engineering Qualification Test (EQT) funding for the Battlefield Effect System (BES) and M18 smoke grenade."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.401"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.401"
                                            },
                                            "Text": {
                                                "val": "A smoke HHS (Hand Held Signals) that meets the current requirements while not having the hazardous chemical components.  Conduct system verification testing. Safety - Reduce toxic effects on Soldiers.  Safety & Efficiency - Reduce health hazards produced by industrial base, i.e.: mixing of Vat yellow 4 die, benzanthorne, and napthalene composition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Grenade Fuze Sychronization Effort"
                                    },
                                    "Description": {
                                        "val": "Program effort to adapt a M201 Fuze body with an interchangable Pyrotechnic delay cartridge that can be utilized as an M228, M208 or M213 Fuze.  Program is a product effeciency which would significantly reduce manufacturing cost of fuzes, logistic burden, and engineering support cost while reducing critical inspections and pull force requirements across all grenades."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "One Fuze across multiple grenades at a much lower cost.  Preliminary design and drawings are available from the FTI (Fuze Technology Integration) and this would be a follow on effort to verify the production readiness and grenade integration impacts across multiple programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Discriminating Passive Infrared Sensor (PIR) for the M4A1 Selectable Lighweight Attack Munition (SLAM)"
                                    },
                                    "Description": {
                                        "val": "The M4A1 SLAM has four modes of operational engagement of its vehicle targets.  One of the modes is a Side-Attack Mode which utilizes the SLAM's built-in passive infrared (PIR) sensor to detect the thermal signatures of passing vehicles to trigger and fire its explosively formed penetrator (EFP) warhead to defeat the target.  If the current US Landmine Policy were to exceed to the Ottawa Convention Treaty, then the existing M4A1 SLAM's PIR feature will render the SLAM non-compliant to the Ottawa restrictions.  The current PIR design does not have the ability to discriminate between vehicle and personnel when a potential target is detected. Without a replacement PIR design, the SLAM will lose one of its four operation modes to engage vehicle targets and unable to meet all of its intented missions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "A successful new PIR sensor design with the ability to detect and discriminate between vehicles and personnel will provide the benefit for the system to meet the Ottawa Convention restrictions. This SLAM will be able to retain its Side-Attack Mode function for off-road side attack engagement of passing vehicles using its PIR sensor as the primary detection means of the potential target."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nano Technology for Small HHS (Hand Held Signals)"
                                    },
                                    "Description": {
                                        "val": "Leverage nano technology to reduce the ammunition logistical burden (reduce size and weight of current HHS (Hand Held Signals) while maintaining current performance).  Reduce size and weight that soldier has to carry while maintaining capability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.534"
                                            },
                                            "Text": {
                                                "val": "Reduces logistical burden and decreases weight load that soldier have to carry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Countermeasure Improvements (LA14, LA15, MG62, L410)"
                                    },
                                    "Description": {
                                        "val": "This program covers the upgrade of Army aircraft countermeasures to maintain effectiveness against the ever evolving threat.  It covers the M206, M211\/M212 series of flares, the M839 chaff cartridge, and the M796\/BBU-35 impulse cartridge.  Goals are to increase overall decoy effectiveness, decrease observability, and optimize performance for the various rotory and fixed wing Army aircraft."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.565"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY13 efforts is to increase overall decoy effectiveness, decrease observability, and optimize performance for the various rotory and fixed wing Army aircraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dual Payload (M206)"
                                    },
                                    "Description": {
                                        "val": "Add an extended source (Infrared Cloud) material to the M206 Flare. Justification: Test data has shown single flare effectiveness can be increased with the addition of an extended IR (Infrared) source.  Impact: increased number of countermeasure dispenses and reduce logistical burden."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.012"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.012"
                                            },
                                            "Text": {
                                                "val": "M206 countermeasure flare effectiveness will be improved by adding Special Material.\nPerformance - Increased effectiveness by doubling the countermeasure engagements that can respond to missile threat. \nPerformance & Efficiency - Increases mission flight profiles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Degradable Chaff & Low Frequency Chaff (M1\/M839)"
                                    },
                                    "Description": {
                                        "val": "Develop chaff that will: \n1) After dispense, lose its RF (Radio Frequency) component.  2) Disperse and bloom rapidly with minimal clumping and birdnesting even when used at low speeds from a hovering helicopter.  3) Enhance coverage in the low frequency range.  4) Type classify RR170 Chaff for Army use.  Justification:   the long persistence of Chaff causes interference with fire control and air traffic control radar.  Impact: chaff will continue to interfere with control and tracking radar, limiting its use in the field and training."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.817"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.817"
                                            },
                                            "Text": {
                                                "val": "The operationally degradable chaff will address operational and training issues with chaff persistence. \nPerformance - Increase frequency coverage where current Chaff lacks.  \nPerformance - Reduction of clumping and birdnesting will make the chaff more effective. \nSafety - Reduce interference with Traffic Control radars and aircraft radar systems. \nEnvironmental - Mitigates impact to farm animals that eat active dipoles after chaff deployment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Demolition Initiator Packaging - Skin Pack (MDI DODICS)"
                                    },
                                    "Description": {
                                        "val": "Current spool design is bulky, hard to conceal in urban environments and has potential for tangling.  This project will develop a lighter, easily deployable and more reliable deployment method.  It will have the added advantage of being compatible with Explosive Ordnance Disposal robotics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.133"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Test and type classify new packaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.055"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.055"
                                            },
                                            "Text": {
                                                "val": "Shocktube Technical Data Package (TDP) validation.\nSolar Radiation Test & Storage Temperature.\nNew TDP (MIL-DTL SPEC) will be created."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chaff Performance Improvements"
                                    },
                                    "Description": {
                                        "val": "Increase effectiveness against advanced missile threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.113"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop chaff cuts to improve effectiveness against current and new threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Observable Ignition for Counter Measure Flares (LA15)"
                                    },
                                    "Description": {
                                        "val": "Enhance aircraft survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.174"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Use low visibility ignition composition for M212 Countermeasure Flare."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmentally Benign Smoke Hand Held Signals (L306, L307, L311, L312, L314)"
                                    },
                                    "Description": {
                                        "val": "This program will address the health concerns in the smoke HHS (Hand Held Signals) by leveraging smoke technology developed through Environmental Quality Testing and M18 smoke grenade.  Current configuration has hazardous components in the smoke composition and cannot be procured."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.395"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY13 efforts are to leverage smoke technology developed through Environmental Quality Testing and M18 smoke grenade.  Current configuration has hazardous components in the smoke composition and cannot be procured."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmentally Benign Colored Smoke Formulations - M18 Red\/Violet Smoke Grenades (G950\/G955)"
                                    },
                                    "Description": {
                                        "val": "The project addresses Army Environmental Requirements and Technology Assessments requirement (AERTA) PP-3-02-4 and Environmentally Sustainable Energetics Workshop List of Concerns PGP-09-02 for the removal of sulfur and hazardous dyes from current formulations.  New formulations will replace the sulfur based red and violet M18 formulations for all future production.  \nJustification:  AERTA requirement  \nImpact:  Without change to the formulation, User will continue to be exposed to potention inhalation hazard."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.296"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY13 efforts addresses AERTA requirement AERTA PP-3-02-4 and Environmentally Sustainable Energetics Workshop List of Concerns PGP-09-02 for the removal of sulfur and hazardous dyes from current formulations.  New formulations will replace the sulfur based red and violet M18 formulations for all future production."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "M84EI,M240EI,M102EI Qualification and TC of Army Owned Stun Grenade Design (GG09, GG18, GG19)"
                                    },
                                    "Description": {
                                        "val": "Qualify already developed Government owned design which will reduce hardware unit cost and will provide additional benefits with an environmentally friendly and enhanced safety design for the Tactical and Reloadable Practice Stun Hand Grenade.  Impact: Future competitive contracting strategy using a performance specification will be pursued incurring a high risk of delayed award and considerable expense to qualify a different contractor owned design. Potential exsists for environmental hazards to continue to affect manufacturing training sites and theater."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.162"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Qualify already developed Government owned design which will reduce hardware unit cost and will provide additional benefits with an environmentally friendly and enhanced safety design for the Tactical and Reloadable Practice Stun Hand Grenade.  Impact: Future competitive contracting strategy using a performance specification will be pursued incurring a high risk of delayed award and considerable expense to qualify a different contractor owned design. Potential exsists for environmental hazards to continue to affect manufacturing training sites and theater."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MK3A2 Replacement, Concussion Grenade Optimization Effort"
                                    },
                                    "Description": {
                                        "val": "This effort incorporates modern materials and insensitive explosives to provide a safer, producible concussion grenade. Use of the MK3A2 Offensive grenade has been suspended due to age and safety issues. The current MK3A2 can expose the Soldier to toxic levels of asbestos. War fighters cannot safely employ the offensive grenade. Alternate munitions such as the M84 do not satisfy User needs for incapacitation of the enemy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.316"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalize the redesign of the MK3A2 grenade;perform residual tests to justify the ECPs required to update the TDPL (Technical Data Package List); update associated documents (SDZ (Surface Danger Zone), FHC (Final Hazard Classification) etc.); Justification: There is current funding to remove the existing safety hazard (asbestos) in the MK3A2.  In addtion, the User has stated this capability is still required.  Impact: If not funded, the MK3A2 redesign would not occur and the safety Hazard would still exist. In additon, no new MK3A2s would be allowed to be manufactured to the old TDP (Technical Data Package)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "1) Fabrication of Multi Cavity Die and proveout.  2) Fuze and Packaging procurement.  3) Injection molding of 250 grenades.  4) LAP and Marking of grenades.  5) Engineering level testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dual Payload M206 Aircraft Countermeasure Flare\/ Pyro (L410)"
                                    },
                                    "Description": {
                                        "val": "M206 countermeasure flare effectiveness will be improved by adding extended source (Infrared Cloud) material. Benefit include increased effectiveness and doubling the countermeasure engagements that can respond to missile threat."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.676"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Add a extended source (Infrared Cloud) material to the M206 Flare. Justification: Test data has shown single flare effectiveness can be increased with the addition of an extended IR source.  Impact: contunued reduced number of countermeasure solutions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency (RF) Remote Activation Munitions (RAM)"
                                    },
                                    "Description": {
                                        "val": "A low cost Type B RF-RAMS receiver will be designed, prototyped, tested and be made available for production and fielding.  The current RF-RAMS Type B receiver contract cost is approximately $5,700 in quantities above 930. The goal of this effort is to update the existing receiver design and implement improved manufacturing processes to reduce the cost.  The low cost Type B receiver will integrate several manufacturing and producibility improvements to reduce production costs from approximately $5,700 to a production unit cost goal of less than $1,500."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.796"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY12 efforts are to integrate several manufacturing and producibility improvements to reduce production costs from approximately $5,700 to a production unit cost goal of less than $1,500."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "297"
                    },
                    "ProjectTitle": {
                        "val": "Mun Survivability & Log"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.490"
                        },
                        "CurrentYear": {
                            "val": "9.572"
                        },
                        "BudgetYearOne": {
                            "val": "14.463"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.463"
                        },
                        "BudgetYearTwo": {
                            "val": "15.546"
                        },
                        "BudgetYearThree": {
                            "val": "10.861"
                        },
                        "BudgetYearFour": {
                            "val": "9.034"
                        },
                        "BudgetYearFive": {
                            "val": "6.399"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the future force by making Army units more survivable through the investigation, testing and demonstration of munitions logistics system improvements that prevent or minimize catastrophic explosive events and accelerate ammunition resupply.  Key thrusts are munitions storage area survivability, Insensitive Munitions (IM) technology integration and compliance, ammunition management and asset visibility, weapon system rearm, munitions configured load enablers and advanced packaging and distribution system enhancements.  Within each thrust, a broad array of solutions will be identified, tested, and evaluated against developed system measures of effectiveness.  Optimum, cost effective solutions that enable the rapid projection of lethal and survivable forces will be demonstrated.  The early stages of force deployment are especially critical.  Theater ammunition storage areas are vulnerable and present the enemy with lucrative targets.  These areas and distribution nodes contain the only available munitions stocks in theater.  Loss of these munitions could cripple the force, jeopardize the mission, and result in high loss of life.  This project mitigates vulnerabilities and ensures a survivable fighting force."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Munitions Predictive Life"
                                    },
                                    "Description": {
                                        "val": "This program will demonstrate technologies and algorithms that can help assess munitions serviceability based upon aggregate environmental exposures, system cycling and munition degradation models. This program will provide life cycle management tools for risk mitigation strategies, while reducing testing, inspection & surveillance required and improving weapon system reliability & and warfighter effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.369"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed installation of environmental monitoring equipment that will collect data to determine the correlation between simulated and actual temperatures experienced by ammunition at the pallet, container, and item level in open storage, ISO containers, and earth covered magazines. Conducted testing of initial low cost, passive, credit card sized device prototypes that can record and display the temperature exposure history of an ammunition item at the packaging, or pallet level."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.726"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Collect environmental data and develop algorithmic models that will relate temperature conditions seen at the container and item level to those seen at the pallet level for improved reliability forecasting and more cost effective sensor placement. Demonstrate a shock\/vibration sensor reliability device powered by vibration induced energy.  Conduct analysis of reliability documentation for an initial two ammunition families in databases and identify reliability and risk threshold levels. Complete final testing of passive credit card sized temperature sensors and conduct demonstration. Down-select embedded propellant reliability sensor candidate and calibrate it to enable real-time monitoring of the effects of environmental exposure on ammunition propellant stability\/reliability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.470"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.470"
                                            },
                                            "Text": {
                                                "val": "Complete environmental data collection and validate algorithmic models that that can accurately estimate the temperature exposure of munitions based on location, storage area type, and munition type. Based on reliability and risk threshold levels developed from ammunition database analysis, develop algorithmic procedures that can be applied periodically to evaluate reliability and risk and determine functionality inspection requirements for two ammunition families. Conduct accelerated aging of propellant and calibrate and verify the embedded propellant reliability sensor."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Containerization Program"
                                    },
                                    "Description": {
                                        "val": "This program will demonstrate next generation packaging, with standardized dimensions\/interfaces, that considers unit of issue, permits easy reconfiguration and that is reusable, nestable, automation friendly, and survivable. This new packaging (Ammoblocks) will permit the safe packing and shipping of more and different types of ammo together in user tailored loads; facilitate rapid, less labor intensive reconfiguration and resupply; and facilitate automation upgrades of load\/assemble\/pack and battlefield resupply operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.303"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed analysis of life cycle logistics system impact of Ammoblocks, completed prototype design of container integrated locking mechanism."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.785"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop concepts and designs for flexible ammunition palletized load unitization techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Fabricate hardware and test designs for flexible ammunition palletized load unitization techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Munitions Packaging"
                                    },
                                    "Description": {
                                        "val": "This program will demonstrate upgrades to existing  packaging components and materials to improve legacy ammunition survivability. These upgrades will enhance ammunition survivability and reliability, improve field ammunition operations, and improve packaging producibility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed dynamic modeling analysis of prototype design of High Density Polyethylene (HDPE) cylindrical containers as replacements for current 120mm tank and 120mm\/81mm mortar packaging. Completed prototype fabrication and conducted verification testing of an improved security seal for rectangular ammunition containers.. Conducted test and evaluation of pressure sensitive adhesive label samples and finalized standard specification and Technical Data Package for use on ammunition packaging. Completed concept development of low-cost ammunition bandoleers utilizing inexpensive synthetic non-woven materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.929"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate prototypes and conduct engineering testing of HDPE cylindrical containers as replacements for current 120mm tank and 120mm\/81mm mortar packaging. Complete design, fabricate prototypes, and complete engineering testing of low cost ammunition bandoleers. Complete user evaluation and transition of improved security seals for rectangular ammunition containers. Design, test, and evaluate plastic sealed pouches for 5.56mm ammunition  that will reduce production costs and improve container volume usage efficiency.  Conduct a market survey of and develop a test plan for non-copper based Environmental Protection Agency registered preservatives for wood packaging materials that if validated will increase the quantity and types of preservative available and reduce ammunition life-cycle costs. Define a data collection plan and review existing ammunition packaging test requirements and procedures to determine whether they are appropriate or they can be updated to provide potential cost savings for current and future packaging product improvement programs. Conduct an evaluation of the ability of solar reflective matte finish paint to reduce the impact of solar heating on ammunition and ammunition packaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Text": {
                                                "val": "Finalize design and conduct field demonstration of HDPE cylindrical containers as replacements for current 120mm tank and 120mm\/81mm mortar packaging and transition. Conduct an operational demonstration of improved prototype low cost ammunition bandoleers and transition. Conduct testing of non-copper based Environmental Protection Agency registered preservatives for wood packaging materials.  Complete evaluation of packaging test requirements and develop recommendations for any potential changes identified. Complete life cycle testing of ammunition containers coated with a solar reflective matte finish paint and develop a performance specification. Develop the design of a plastic polymer container for 5.56mm ammunition containers to be used in conjunction with plastic sealed ammunition pouches to reduce packaging weight and production costs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Insensitive Munitions (IM) Integration Program"
                                    },
                                    "Description": {
                                        "val": "Demonstrate multiple IM technologies and integrate into end item(s) to improve munitions survivability and warfighter safety. IM Technologies, using State-of-the-Art materials, will be developed in the areas of warhead, propulsion and propellants, explosives, packaging, and barriers. In addition, modeling and simulation will be used to reduce development and testing costs.  Efforts will increase the number of IM compliant ammunition items fielded to mitigate munitions reaction to unplanned stimuli  such as fire, fragments, cook-off, bullets, adjacent munitions reaction (sympathetic detonation), and shape charge jet attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.935"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "An Insensitive Munitions (IM) explosive main fill to replace Composition H6 explosive in the 40 lb Cratering Charge was transitioned to Project Manager (PM)-Close Combat Systems (CCS), and final tests are being performed.  Continued developing an IM Flexible Explosive formulation for demolition charges. The 40mm ammunition IM Multiple Technology Integration program integrated and conducted IM testing and sequential rough handling for the 40mm M430 Cartridge to include warhead, packaging, and cartridge case venting IM technologies.  This will provide a system level IM solution for the 40mm High Explosive Dual Purpose (HEDP) Cartridge to be transitioned to PM-Maneuver Ammunition Systems (MAS) in Fiscal Year (FY) 13. Initiation testing was completed of pressed Insensitive Munitions eXplosive (IMX)-104  to replace Polymer Bonded eXplosive PBXW-14, an auxiliary charge that is currently being used in the 81mm, 120mm, and 60mm mortars. Propulsion and Warhead venting technology was tested and transitioned to the 120mm M934 High Energy Mortar round program.  Performed modeling and simulation to validate IM container modification for the 120mm mortar to mitigate reaction to fast, or slow heating in the logistical configuration.  IM warhead venting, packaging, and barrier technologies were developed for the 105mm Artillery ammunition and an IM logistic assessment was performed to determine affects of new technologies.  Optimized the Sealed Seam (SS) container venting technology and performed IM testing for the PA161 and PA103A2 containers used in the Modular Artillery Charge Systems (MACS).   IM testing was conducted to validate IM packaging modification for Hand Held Signals that will be transitioned to PM-CCS in FY13."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.371"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform, for the 105mm Artillery Round, multiple IM integration  tests to validate IM technologies: Cartridge Case, Packaging, and Projectile Venting, Barriers, and Explosive fill.   Perform sequential rough handling testing and transition to the PM an IM enhanced Modular Artillery Charge Systems (MACS) container with Sealed Seam Venting Technology.  Transition to PM an IM enhanced packaging solution for the family of Hand Held Signals. Transition to PM an IM enhanced 40mm HEDP Cartridge incorporating  multiple IM venting technologies.  Develop and demonstrate multiple IM explosives to replace the Composition B explosive in the M67 Grenade and N-5 explosive in the Light Weight (LW) 30mm Cartridge.  In addition, packaging IM technology will be demonstrated for, M67 Grenade and LW 30mm ammunition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.632"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.632"
                                            },
                                            "Text": {
                                                "val": "Transition to PM-Combat Ammunition Systems (CAS) an IM enhanced 105mm Artillery Round with IM technology for cartridge case, packaging, projectile, and barriers. Transition to PMs IM explosives, venting technologies, and packaging for the M67 grenade and 30mm M789 Cartridge.  Develop IM high energy boosters for multiple applications.  Develop multiple lab scale tests to predict IM system level responses for energetics.  Develop novel IM venting mechanisms using preloaded springs, melt rings, bi-metallic fastening, and eutectic materials for the active and passive venting of warheads and propulsion systems.  Apply the Sealed Seam Technology to multiple ammunition containers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ammo Provider"
                                    },
                                    "Description": {
                                        "val": "This program demonstrates technologies that will assure a survivable munitions logistics system by increasing distribution velocity and protecting ammo storage areas. Technologies areas to be investigated include ammunition asset visibility (including environmental sensors, marking technologies, and supply chain modeling), ammunition management (including improvements in stockpile surveillance and condition based management), sustainment (including pre-configured loads (soldier to unit size), field ammo reconfiguration capability, robotic handling, and improved load building capability ), and force protection (including site planning software and field storage protection)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.627"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed integration of transportation asset load planning capability with the ammunition igloo storage optimization software tool. Completed testing of the Joint Modular Intermodal Container (JMIC) interface plate for Container Roll-on roll-Off Platforms (CROP) and the CROP with integrated JMIC restraint system. Completed design evaluation of a low-cost one-time use disposable air delivery pallet that will alleviate the problem of the loss of many Air Force 463L pallets during tactical logistics operations. Designed, fabricated, and tested a robust delivery speedbag that will permit the quick and efficient delivery of small, un-damaged, easily portable bundles of supplies down a rope from a hovering helicopter.  Conducted testing and evaluation of a dunnage on demand system that will provide inner pack cushioning materials for the repack and retrograde of ammunition on the battlefield.  Down-selected an ammunition compatible robotic manipulator, integrated with a robotic arm and demonstrated capability to robotically open and close containers in a tactical environment as part of a human augmentation system for field ammunition operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.761"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop re-warehousing plan generation capability and integrate into the ammunition igloo storage optimization software tool and integrate the system with the Logistics Management Program (LMP) for data feed of inventory assets. Complete safety testing and user demonstration of the helicopter delivered robust supply speedbag. Complete testing and evaluation of the dunnage on demand system for improved battlefield retrograde. Complete system integration and conduct testing of a munitions environmental health monitoring system that monitors temperature, humidity, and shock experienced to provide instant ammunition readiness status to soldiers. Develop test load configurations and evaluation criteria for assessing the propagation potential and degree of violence expected when tactical ammunition configured loads are subjected to various unplanned combat stimuli."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.761"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.761"
                                            },
                                            "Text": {
                                                "val": "Demonstrate stock rotation planning and scheduling capability of the ammunition igloo storage optimization software tool. Complete testing of a munitions environmental health monitoring system and transition. Develop requirements for integrating ammunition configured load building software into the Ammunition Logistics Management Accountability System to provide the soldier an automated capability to rapidly plan ammunition loads on conveyances. Complete modeling and simulation of the reaction of tactical ammunition configured loads to unplanned stimuli, use results to develop and integrate Configured Load Building Tool software sub-routine to modify load out configurations for improved safety and survivability. Complete market survey of commercial airbags for use as a replacement for wood dunnage in ammunition shipping containers and conduct performance testing of leading candidates."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "857"
                    },
                    "ProjectTitle": {
                        "val": "DoD Explosives Safety Standards"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.105"
                        },
                        "CurrentYear": {
                            "val": "2.268"
                        },
                        "BudgetYearOne": {
                            "val": "4.096"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.096"
                        },
                        "BudgetYearTwo": {
                            "val": "2.344"
                        },
                        "BudgetYearThree": {
                            "val": "2.339"
                        },
                        "BudgetYearFour": {
                            "val": "2.297"
                        },
                        "BudgetYearFive": {
                            "val": "2.297"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program supports the Research, Development, Test, and Evaluation efforts of the DoD Explosive Safety Standards Board.  It supports explosive safety effects research and testing to quantify hazards and to develop techniques to mitigate those hazards in all DoD manufacturing, testing, transportation, maintenance, storage, disposal of ammunition and explosives operations, and also to develop risk based explosives safety standards.  Results are essential to the development and improvement of quantity-distance standards, hazard classification procedures, cost effective explosion-resistant facility design procedures, and personnel hazard\/protection criteria."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "TM-51300"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.375"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed improved tri-service design procedures and improved computer codes for explosion-resistant structures.  Initiate preparation of revised tri-service manual TM-51300."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop improved tri-service design procedures and improve computer codes for explosion-resistant structures.  Initiate preparation of revised tri-service manual TM-51300."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.683"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.683"
                                            },
                                            "Text": {
                                                "val": "Will develop improved tri-service design procedures and will improve computer codes for explosion-resistant structures.  Initiate preparation of revised tri-service manual TM-51300."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collect and analyze"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.275"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Collected and analyzed airblast\/fragment\/thermal data for revising DoD, NATO hazard classification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.279"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Collect and analyze airblast\/fragment\/thermal data for revising DoD, NATO hazard classification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.682"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.682"
                                            },
                                            "Text": {
                                                "val": "Will collect and analyze airblast\/fragment\/thermal data for revising DoD, NATO hazard classification."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive and Munitions Tests"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed improved explosives and munitions tests and characterization data.  Specifically, developed improved gap tests for rocket motors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.491"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop improved explosives and munitions tests and characterization data.  Specifically, develop improved gap tests for rocket motors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.683"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.683"
                                            },
                                            "Text": {
                                                "val": "Wil develop improved explosives and munitions tests and characterization data.  Specifically, will develop improved gap tests for rocket motors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Safety Guidelines"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.275"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed improved DoD and NATO explosives safety guidelines for munitions storage, explosives and field operation facilities.  Prepared revised Dod 6055.9-STD and 4145.26M."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.279"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop improved DoD and NATO explosives safety guidelines for munitions storage, explosives and field operation facilities.  Prepare revised Dod 6055.9-STD and 4145.26M."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.682"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.682"
                                            },
                                            "Text": {
                                                "val": "Will develop improved DoD and NATO explosives safety guidelines for munitions storage, explosives and field operation facilities.  Will prepare revised Dod 6055.9-STD and 4145.26M."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Safety Database"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.425"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted other hazards analyses and expand\/automate explosives safety databases.  Developed improved Explosives Safety Mishap Analysis Module with links to accident reports."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct other hazards analyses and expand\/automate explosives safety databases.  Develop improved Explosives Safety Mishap Analysis Module with links to accident reports."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.683"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.683"
                                            },
                                            "Text": {
                                                "val": "Will conduct other hazards analyses and expand\/automate explosives safety databases.  Will develop improved Explosives Safety Mishap Analysis Module with links to accident reports."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis Tools"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.336"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and improved risk based analysis tools for explosives safety.  Developed sequence of operations prototype."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.409"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and improve risk based analysis tools for explosives safety.  Develop sequence of operations prototype."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.683"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.683"
                                            },
                                            "Text": {
                                                "val": "Will develop and improve risk based analysis tools for explosives safety.  Will develop sequence of operations prototype."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "858"
                    },
                    "ProjectTitle": {
                        "val": "Army Explosives Safety Management Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.679"
                        },
                        "CurrentYear": {
                            "val": "0.596"
                        },
                        "BudgetYearOne": {
                            "val": "0.556"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.556"
                        },
                        "BudgetYearTwo": {
                            "val": "0.661"
                        },
                        "BudgetYearThree": {
                            "val": "0.653"
                        },
                        "BudgetYearFour": {
                            "val": "0.642"
                        },
                        "BudgetYearFive": {
                            "val": "0.648"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project establishes, validates or modifies explosives technical safety requirements per Army Regulation 385-64, Ammunition and Explosives Safety Standards.  Project activities promote RDT&E of new and innovative explosives safety technologies that improve the survivability of Army personnel, facilities, and equipment as well as improve the health, safety and welfare of the general public."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Risk based explosives safety criteria"
                                    },
                                    "Description": {
                                        "val": "Development of risk based explosives safety criteria that will aid commanders and safety personnel in the transition from regulation to risk management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.164"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted critical explosives tests which provided additional development of risk based explosives safety criteria."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.142"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue explosives testing and support of hazard research and exposure consequences."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.141"
                                            },
                                            "Text": {
                                                "val": "Continue explosives testing and support of hazard research and exposure consequences."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development of enhanced protective structure designs"
                                    },
                                    "Description": {
                                        "val": "Develop enhanced protective structure designs that improve the survivability of Army personnel, facilities and equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.264"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted critical explosives tests to improve protective structure designs to aid in survivability of Army assets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.212"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue explosives testing and support for improving protective construction designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Continue explosives testing and support for improving protective construction designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development of explosive safety tools"
                                    },
                                    "Description": {
                                        "val": "Develop explosive safety tools for use by Army personnel. Explosive safety tools allow commanders and safety personnel to make explosive safety decisions using risk management methodologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.251"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported an improved risk management tool, which incorporates explosives test data to improve explosive safety risk management decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.242"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.215"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.215"
                                            },
                                            "Text": {
                                                "val": "Continue development of new methods and tools for risk assessment to improve explosive safety risk management decisions.  ."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "859"
                    },
                    "ProjectTitle": {
                        "val": "Life Cycle Pilot Process"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.865"
                        },
                        "CurrentYear": {
                            "val": "3.562"
                        },
                        "BudgetYearOne": {
                            "val": "4.561"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.561"
                        },
                        "BudgetYearTwo": {
                            "val": "5.148"
                        },
                        "BudgetYearThree": {
                            "val": "5.128"
                        },
                        "BudgetYearFour": {
                            "val": "5.080"
                        },
                        "BudgetYearFive": {
                            "val": "5.465"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the implementation of the Single Manager for Conventional Ammunition (SMCA) Industrial Base Strategic Plan through technology investigations, model based process controls, pilot prototyping, and industrial assessments.  It will assess life cycle production capabilities required for all ammunition families, address design for manufacturability to facilitate economical production, identify industrial and technology requirements, and address the ability of the production base to rapidly and cost effectively produce quality products.  Cost Reduction is an important part of the Life Cycle Pilot Process (LCPP).  LCPP provides the resources to prototype critical technologies and develop the knowledge base to establish cost effective, environmentally safe and modern production processes in support of the Munitions Industrial Base transformation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Cost Thrust Area"
                                    },
                                    "Description": {
                                        "val": "This thrust area seeks out new opportunities to reduce overall manufacturing costs of ammunition and ammunition components.  RDTE efforts will review and analyze legacy manufacturing processing for opportunities to integrate new technology and lean manufacturing processes to reduce cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.810"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Projects include the following: develop a pilot scale process for purifying Ammonium Nitrate Solution (ANSOL) in the waste stream resulting from insensitive explosive manufacture.  Initiate application of Advanced Cluster Energetics (ACE) Fluid Energy Mill (FEM) on High Melt Explosives (HMX) based Coated Explosive Material (CXM) formulations. Evaluate Environmentally Benign Colored Smoke.  Completed ultrasound melt cast monitoring process for mortars and residual solvent reduction in propellants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue work on ANSOL purification, ACE FEM on HMX formulations and Environmentally Benign Colored Smoke."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.181"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.181"
                                            },
                                            "Text": {
                                                "val": "Evaluate new technology for legacy processes to reduce overall production costs for the Army."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Single Point Failures"
                                    },
                                    "Description": {
                                        "val": "Project thrust area efforts will employ manufacturing technologies to address Single Point Failures (SPFs).  These projects are part of the overall strategy to reduce the number of SPFs in the National Technology Industrial Base (NTIB).  Additionally, thrust area efforts address ammunition manufacturing capability shortfalls.  This area leverages RDTE accomplishments and product knowledgement to satisfy manufacturing requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Projects include continued work on pilot scale production of energetic SPFs, transition of RD1333 lead azide process to industry, lab scale process for spherodial propellant and pilot scale process for manufacture of Tetra Nitro Carbazole (TNC).  Investigated boron powder and Akardite SPFs and develop risk mitigation plans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.469"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete lab scale manufacturing process for single base spherodial propellant and start development of a process for double base spherodial propellant.  Complete pilot process for TNC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.458"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.458"
                                            },
                                            "Text": {
                                                "val": "Continue development of manufacturing technology and processes for SPFs.  Efforts will address source of supply problems within the NTIB."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturing Technology for Industrial Base Transformation"
                                    },
                                    "Description": {
                                        "val": "Project thrust area identifies and develops technologies that can be utilized at multiple government and private ammunition manufacturing locations to transform the NTIB."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.836"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Projects include completion of manufacturing technology for high precision components.  Initiate projects on application of metal casting technology to improve explosive casting quality, use of ultrasound analyzer for process control in explosives manufacturing, Surface-Enhanced Raman Spectroscopy technology for sensing explosives in waste streams and bi-metal reactor for treating insensitive munitions waste streams."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.043"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue work on application of metal casting technology to improve explosive casting quality, use of ultrasound analyzer for process control in explosives manufacturing, Surface-Enhanced Raman Spectroscopy technology for sensing explosives in waste streams and bi-metal reactor for treating insensitive munitions waste streams."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.922"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.922"
                                            },
                                            "Text": {
                                                "val": "Investigate potential technologies to transform key manufacturing processes in the NTIB.  Continue investigations, develop and document manufacturing technology for transition to the NTIB."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "862"
                    },
                    "ProjectTitle": {
                        "val": "Indirect Fire And Fuze Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.467"
                        },
                        "CurrentYear": {
                            "val": "2.554"
                        },
                        "BudgetYearOne": {
                            "val": "8.625"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.625"
                        },
                        "BudgetYearTwo": {
                            "val": "9.540"
                        },
                        "BudgetYearThree": {
                            "val": "9.830"
                        },
                        "BudgetYearFour": {
                            "val": "9.475"
                        },
                        "BudgetYearFive": {
                            "val": "4.224"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program will identify, mature, and integrate new technologies into current fuzing and safe and arm devices. This program will implement these technologies into fuzing systems to preclude obsolescence, maximize standardization, enhance performance, and improve the safety and exportability of existing munitions. The program addresses two major areas: (1) risk mitigation and (2) block upgrades. Risk mitigation efforts will evaluate and demonstrate second sources for fuzing systems that may reduce cost by providing competition, and maintain production when sources or parts are no longer available. It will also allow for the performance enhancement of current ammunition items by conducting studies of major fuze components to detect and identify latent defects. The second major area is block upgrades, which will evaluate and perform studies on improvements to fuzes; increase commonality of fuze components and requirements. Block upgrades will enable the introduction of the latest technologies into fuzing, keep the fuzing design current to avoid obsolescence issues, and add capabilities. \n\nThis program will also identify, mature, and integrate new technologies for enhanced lethality, range extension and standardization to improve target engagement effectiveness; increase reliability, safety, and exportability; and reduce taxpayer costs including elimination of sole source supply of indirect fires ammunition materials as well as studies and evaluations of such technology solutions in comparison to current stock pile indirect fire conventional munitions and their associated production processes. Additionally, environmental impacts of legacy propellants, explosives and metal parts will be studied. Replacement of hazardous materials such as Ammonium Perchlorate, Diphenylamine, Lead, etc. and addition of propellant anti-tubewear additives will remain a focus. This program support the standardization and interoperability of legacy and new production ammunition to maximize munitions battlefield interchangeability\/compatibility between 52 and 39 caliber guns under the auspices of the international Joint Ballistics Memorandum Of Understanding (JBMOU) as well as rifled and smooth-bore mortars. Maximizing standardization, interchangeability, and exportability will potentially increase FMS sales of US products to maintain domestic production and economies of scale."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Indirect Fire & Fuze ARDEC Support."
                                    },
                                    "Description": {
                                        "val": "Risk Mitigation: Evaluating second source for Digital Signal Processor for the M734A1 fuze, evaluating new battery and electronics sources for current inventory fuzes. Evaluate Micro Electro-mechanical Systems (MEMS) component alternatives to increase sources of supply and lower cost; affects 40mm HEPD grenade munitions. Block Upgrades: Successfully demonstrated Zig-Zag safety design for Common Mortar training fuze for 60, 81, and 120mm mortars, and forwarded the design to Office of the Project Manager for Combat Ammunition Systems (PM CAS) to qualify the design.  Determined that Proximity Sensor can fit analytically in existing 30mm HEDP M789 round and continuing to fabricate fuze components. Successfully demonstrated increased sensitivity of 30mm M759 fuze, and performing engineering test. Investigate drop in proximity upgrades for current airburst fuzing for mortar, artillery and other munitions. Evaluate proximity sensor upgrades for M734A1. Prototyping a mortar common Safe and Arm device for M734A1 and M783 rounds. Performing a study on commonality of fuze components and requirements across all hand grenades (M67, M84, and M18). Tested several iterations of the Turbine Alternator (T\/A) on the M734A1\/M783 mortar fuze to survive high G gun launch environments, and provided a final design to PM CAS for final qualification testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.274"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Indirect Fire & Fuze ARDEC Support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.955"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Indirect Fire & Fuze ARDEC Support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.958"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.958"
                                            },
                                            "Text": {
                                                "val": "Indirect Fire & Fuze ARDEC Support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Indirect fire & Fuze PM CAS Support"
                                    },
                                    "Description": {
                                        "val": "Indirect Fire: \n(FY12) Completed demonstration of IMX104 as Comp B explosive fill replacement for 81mm HE. Activities included ballistic testing including firing tables, safety, reliability and performance. Completed Replacement of Diphenylamine (DPA) Stabilizer by Akardite-2 in Ball Powder® Propellants. Activities included completion of long term stability study and transition to production qualification testing. (FY14-15) Maturation, Validation, and Risk Reduction of enhanced lethality technology to improve effectiveness and eliminate sole source HF-1 steel in indirect fires. Activities include studies, evaluations and demonstrations of alternative technologies, materials and processes. Maturation, Validation, and Risk Reduction of candidate nonlethal, nontoxic multispectral smoke technologies identified by the Techbase and SBIR programs to eliminate hazardous smoke in indirect fires screening missions. Activities include studies, evaluations and demonstrations of alternative technologies, materials and processes. Joint NATO\/Allied Cannon Munitions Interchangeability Risk Reduction of battlefield interchangeability\/compatibility of munitions and associated enabling technologies between 52 and 39 caliber 155mm guns. Activities include ballistic testing including firing tables, safety, reliability and performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.742"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Indirect fire & Fuze PM CAS Support"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.667"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.667"
                                            },
                                            "Text": {
                                                "val": "Indirect fire & Fuze PM CAS Support"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "155mm Extended Range Base Bleed Sys Maturation\/Risk Reduction"
                                    },
                                    "Description": {
                                        "val": "Indirect Fire: (FY12-13) Completed the Maturation & Risk Reduction of 155mm Extended Range Base Bleed System with a maximum range of 30km when fired from a 39 caliber 155mm cannon. The ignition of the base bleed system is critical to the performance of the system and maturation of the ignition system will improve the existing stockpile of extended range artillery projectiles. Activities included developing an engineering baseline of the currently fielded base bleed system, improvements to the base bleed grain formulation and boat tail shape, optimization of the igniter system with the improved grain formulation and the test and validation of completely modern, cost effective and producible base bleed system to validate improvements in reliability, accuracy and overall performance and corresponding integration planning to transition these improvements into 155mm programs of record."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.451"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "155mm Extended Range Base Bleed System\n Maturation & Risk Reduction"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.599"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "155mm Extended Range Base Bleed System\n Maturation & Risk Reduction"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F21"
                    },
                    "ProjectTitle": {
                        "val": "Direct Fire Technology and NATO Ammo Eval"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.787"
                        },
                        "CurrentYear": {
                            "val": "9.782"
                        },
                        "BudgetYearOne": {
                            "val": "7.032"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.032"
                        },
                        "BudgetYearTwo": {
                            "val": "8.749"
                        },
                        "BudgetYearThree": {
                            "val": "6.259"
                        },
                        "BudgetYearFour": {
                            "val": "5.351"
                        },
                        "BudgetYearFive": {
                            "val": "3.367"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program assures complete interchangeability of direct fire ammunition and weapons among all NATO countries with all of the associated logistic, strategic and tactical advantages. Project involves development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the NATO North American Regional Test Center (NARTC). The program also includes warhead improvements and capability insertions to enhance lethality and effectiveness of existing cartridges.\n\nFY 2014 funds will continue to maintain the NARTC and support NATO standardization of direct fire caliber ammunition for battlefield interchangeability. Additionally, this funding will be used to support direct fire ammunition ranging from small caliber ammunition, 40mm grenade, medium caliber cannon ammunition and large caliber ammunition enhancements to effectiveness, survivability, accuracy and general improvements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Lead Free Ammo - Propellant Optimization"
                                    },
                                    "Description": {
                                        "val": "Develop optimized spherical propellant for reduced muzzle signature, fouling and chamber pressure. Cartridges containing alternate flash suppressants and deterrents will be manufactured and tested to determine optimum propellant composition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.863"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Executed task order award with propellant manufacturer to investigate improvements in flash suppression technology, fouling, short barrel applications, temperature stability, and potential Diphenylamine replacements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete contractor and government analysis and optimized propellant testing of improved flash suppression technology. Initiate 5.56mm optimization study and testing of temperature stability technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Complete contractor and government analysis for optimized propellant testing of improved flash suppression and barrel wear technology. Evaluate improvements that reduce hazardous materials in manufacturing, small caliber propellant optimization studies and testing of temperature stability technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Observable Traced Projectiles"
                                    },
                                    "Description": {
                                        "val": "Tracers have a number of drawbacks; largely they give away the position of the shooter during firing. Advancement in technology has improved tracer technology which potentially eliminates, mitigates short falls of current tracers and improves safety and soldier survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initial investigations of multiple candidate technologies. Produce small samples of candidate materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.772"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.772"
                                            },
                                            "Text": {
                                                "val": "Continue engineering prototype manufacturing, development, and testing. Downselect to most promising candidates conducting engineering studies to improve manufacturing readiness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lightweight Ammunition"
                                    },
                                    "Description": {
                                        "val": "Investigate alternate cartridge case materials for cost and weight savings over conventional brass cartridge cases."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.020"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improve producibility of manufacturing equipment and test alternate designs and processes for lightweight cartridge cases and refine implementation cost."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Down select alternative lightweight cartridge case technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.275"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.275"
                                            },
                                            "Text": {
                                                "val": "Continue to develop down selected technology candidates. Work jointly with other services towards common solutions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "New Ammo Design Qualification & NATO Mission Support"
                                    },
                                    "Description": {
                                        "val": "This program assures complete interchangeability of small caliber and automated cannon-caliber ammunition and weapons among all NATO countries with all of the associated logistic, strategic and tactical advantages."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.432"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support NARTC Test operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support NARTC Test operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Support NARTC Test operations"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "M433 Warhead Improvement"
                                    },
                                    "Description": {
                                        "val": "40mm: Improve lethality (fragmentation) of the M433 grenade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.156"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed optimization and testing of integrated M433 with new warhead design. Increase manufacturing readiness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.691"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developmental test and validation of increased fragmentation warhead design and integrated ballistic testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Qualification of improved M433 cartridge."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Practice Spotter Technology Insertion"
                                    },
                                    "Description": {
                                        "val": "Training Cartridge with impact initiated spotting charge. Goal is visible signature upon impact under all conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.294"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated and optimized a design, and conducted a design evaluation test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.991"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Qualification testing and approval for use."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "Improve the design to facilitate high volume production, facilitize for and produce a design verification sample."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved M789 Lethality, Warhead fragmentation improvement"
                                    },
                                    "Description": {
                                        "val": "Improve M789 warhead fragmentation for lethality by utilizing fragmentation sleeves, scoring or other technologies within the warhead to promote more efficient fragmentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.216"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improved M789 warhead for increased fragmentation lethality by utilizing fragmentation sleeves within the warhead to promote designed fragmentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integration of improved shear liner, increase in manufacturing readiness, and conduct integrated ballistic test."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Incorporate the best design into the M789 warhead and perform testing to support an air worthiness release.  Provide warheads with shear liners for a combined lethality demonstration with the Proximity sensor."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DBX-1 Lead free replacement for Lead Azide"
                                    },
                                    "Description": {
                                        "val": "Integrate environmentally friendly lead free primary explosives into M789. Demonstration in this form factor will enable transition to other munitions of larger size."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.324"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated DBX-1 performance through explosive train testing, explosive sensitivity testing and energetic output testing which leads to the go forward decision."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate environmentally friendly lead free primary explosives into M789."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Metastable Intermolecular Composite (MIC) Primer, Lead free primer"
                                    },
                                    "Description": {
                                        "val": "Integrate environmentally friendly lead free primary explosives within the primer of the M789, remove lead Styphnate."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.432"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Explosive material qualification and primer functionality testing to ensure cartridge and propulsion functionality are ready for integration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved .300 caliber sniper ammunition"
                                    },
                                    "Description": {
                                        "val": "Improve .300 caliber sniper ammunition to provide increased capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct market research, develop concepts and down select."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Refine and evaluate cartridge design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "120mm Fuze Safety Improvement"
                                    },
                                    "Description": {
                                        "val": "Initiate efforts to incorparate a second independant safety into the fuze for current 120mm high explosive ammunition."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Focus will be on modifying fuze to meet current safety standards. Initiate design efforts to incorporate a pressure switch into the current fuze for the M830 and M830A1. Additional efforts will also be required to address obsolescence issues associated with the fuze."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extruded Propellant"
                                    },
                                    "Description": {
                                        "val": "Design, develop, and demonstrate a series of improved propellants for small caliber ammunition such as 5.56mm and 7.62mm using traditional extruded propellant processing technology."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.510"
                                            },
                                            "Text": {
                                                "val": "Model interior ballistics and develop new formulations for 7.62mm and 5.56mm, focusing on improved performance through lower variability, erosivity, and increased range via higher velocity at acceptable pressures. Develop pilot scale manufacturing process, produce samples, and demonstrate performance in subscale development testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Caliber Ammunition Training Range Impact Reduction Engineering Study"
                                    },
                                    "Description": {
                                        "val": "Perform an engineering study on the feasibility of reducing the surface danger zone of small caliber training ammunition while maintaining a ballistic match to the combat ammunition out to maximum effective range of the combat ammunition. The results of the study will assist in establishing the baseline requirements for future training ammunition."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.075"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.075"
                                            },
                                            "Text": {
                                                "val": "Conduct literature search, develop and run models and simulations, perform material analysis, conduct market survey, prepare recommended requirements and prepare program proposals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Door Breeching Engineering Study"
                                    },
                                    "Description": {
                                        "val": "Perform an engineering study on the feasibility reducing size and mass of current standoff door breeching capability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.150"
                                            },
                                            "Text": {
                                                "val": "Conduct hardware search, purchase industry samples and test against standard target set."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F24"
                    },
                    "ProjectTitle": {
                        "val": "Conventional Munitions Demil"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.494"
                        },
                        "CurrentYear": {
                            "val": "16.181"
                        },
                        "BudgetYearOne": {
                            "val": "9.788"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.788"
                        },
                        "BudgetYearTwo": {
                            "val": "10.922"
                        },
                        "BudgetYearThree": {
                            "val": "10.790"
                        },
                        "BudgetYearFour": {
                            "val": "12.230"
                        },
                        "BudgetYearFive": {
                            "val": "13.607"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Conventional Munitions Demilitarization technology program supports the Single Manager for Conventional Ammunition (SMCA) responsibility per Department of Defense Instruction (DoDI) 5160.68 to plan, program, budget and fund a Joint Service research and development (R&D) program for developing capability and capacity, technology and facilities to support the SMCA mission to demil and dispose of conventional ammunition stored in the SMCA Resource, Recovery and Disposition Account (B5A) for all the Military Services.  The program goals include SMCA efforts to increase efficiencies and effectiveness to reduce the demil stockpile; reduce processing costs including packaging, handling and crating; and increase capacity through improved demil capabilities and processes.  Project F24 includes activities: (1) to support a requirements process to focus investments, assess capabilities, analyze alternatives, and recommend and implement R&D projects; (2) to sustain product and process improvement and support for existing capabilities; (3) to develop or improve demil methods and processes related to advance the primary demilitarization dore thrust areas of destruction, disassembly, removal, resource recovery and recycling, and waste stream treatment; (4) to ensure safe and environmentally acceptable demil operations; (5) to transition or transfer activities of technologies\/projects from the techbase centers or to United States Army depots or plants performing demil; and (6) to mitigate risk and close-out project activities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Destruction"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on destruction of munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.629"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed munitions cryofracture demil facility support for Low Rate Initial Production (LRIP).  Continued support of the ammonium perchlorate rocket motor destruction at Letterkenny Munitions Center with rocket motor segmenting design and rocket motor burns tests.  Conducted a business case analysis for static detonation chamber.  Installed mobile plasma treatment system upgrade components.  Initiated the design and fabrication of cryofracture adaptation to demil of rockeye munitions at McAlester Army Ammunition Plant (MCAAP).  Initiated the design of a prototype scale decineration process for cartridge actuated devices\/ propellant actuated devices (CADS\/PADS).  Completed project closeout activities of cryo plasma project.  Continued with the design, fabrication, and testing of bomb, live unit (BLU) rockeye cryofracture at MCAAP."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.422"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the ammonium perchlorate rocket motor destruction at Letterkenny Munitions Center with rocket motor segmenting design and complete the final facility design.  Complete plasma ordnance disposal system layaway.  Initiate study on universal closed disposal for shaped charges.  Test and prove out the design of cryofracture adaptation to demil of rockeye munitions.  Complete installation of components for rockeye demil at MCAAP and initiate testing.  Conduct mobile plasma treatment system comprehensive performance test, demonstration\/ validation.  Continue evaluation of a decineration process for CADS\/PADS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.411"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.411"
                                            },
                                            "Text": {
                                                "val": "Conduct phase I integration testing for ammonium perchlorate rocket motor destruction and complete rocket motor segmenting.  Evaluate results of universal closed disposal testing.  Complete evaluation of decineration process at Tooele Army Depot (TEAD).  Initiate study of double base grain rocket motor demil facility.  Complete evaluation of rockeye demil process at MCAAP.  Initiate phase II project on other-Service missile demil."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resource Recovery and Recycling (R3)"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing existing methods of munitions R3."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.712"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed facilitization of Improved Conventional Munitions (ICM) R3 and conducted demonstration\/validation. Completed magnesium recovery LRIP.  Completed design and fabricated improvements for autoclave Insensitive Munition Explosives (IMX).  Completed high pressure water washout for press loaded ammunition. Initiated induction heating of ICM R3 line.  Completed project closeout activities of nitroguanidine recovery project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.920"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate magnesium recovery LRIP.  Fabricate, install and test upgrades to high pressure water wash out line at Hawthorne Army Depot (HWAD).  Complete test, fabrication and facilitization for ICM R3 line induction heating. Complete ICM R3 LRIP."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Initiate design of automated transfer of grenades for ICM R3 line.  Complete installation and proveout of high pressure water washout line at HWAD.  Initiate recovery of usable large bomb bodies from meltout operations.  Conduct LRIP on high pressure water washout."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Removal"
                                    },
                                    "Description": {
                                        "val": "This effort develops technology to remove propellant and energetics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.230"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated pilot phase of removal of cast-cured insensitive munitions (IM) explosives study.  Initiated phase II equipment design for red phosphorous removal from smoke grenades project.  Completed fabrication of process improvements for insensitive munitions explosive (IMX) 101 autoclave process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.480"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.480"
                                            },
                                            "Text": {
                                                "val": "Fabricate components for red phosphorous demil line.  Integrate red phosphorus demil line into phosphoric acid recovery plant at Crane Army Ammunition Activity (CAAA).  Implement process changes from IMX-101 autoclave project to the MCAAP autoclave process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Waste Stream Treatment"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on handling waste streams from munitions items."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.013"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated study on energetics waste streams as dual use fuel cell feed stream."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.325"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate study for Rotary Kiln Productivity Improvement.  Continue dual use evaluation of energetics wastes as a feed stream for fuel cells."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.715"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.715"
                                            },
                                            "Text": {
                                                "val": "Fabricate upgraded Pollution Abatement System for Rotary Kilns from Improvement program.  Apply process efficiency changes to the environment permitting process for the Rotary Kiln Productivity Improvement Project."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Munitions Disassembly"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.910"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to develop a disassembly process for family of scatterable mines (FASCAM) demil.  Completed prototype detail design of BLU-97 disassembly process at HWAD.  Continued system testing on demil by induction heating meltout system (DIHMES).  Completed study for solvent based recovery of hexachloroethane from munitions.  Developed kit for flexible munitions residue inspection system to add 120mm mortar cartridges. Completed closeout of ultrasonication of energetics project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.514"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue prototype detail design and complete subscale testing of BLU-97 disassembly process at HWAD.  Initiated wash waterline improvements and completed DIHMES demonstration and validation.  Closeout acid digestion project."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.682"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.682"
                                            },
                                            "Text": {
                                                "val": "Continue support of FASCAM demil.  Continue fabrication and installation of BLU-97 disassembly process.  Complete LRIP for DIHMES."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}