{
    "id": "bff84379b56f1142f692d6e66f5b37156e9b380b",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604321A"
        },
        "ProgramElementTitle": {
            "val": "ALL SOURCE ANALYSIS SYSTEM"
        },
        "R1LineItemNumber": {
            "val": "82"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.400"
            },
            "CurrentYear": {
                "val": "5.694"
            },
            "BudgetYearOne": {
                "val": "4.839"
            },
            "BudgetYearOneBase": {
                "val": "4.839"
            },
            "BudgetYearTwo": {
                "val": "7.238"
            },
            "BudgetYearThree": {
                "val": "2.411"
            },
            "BudgetYearFour": {
                "val": "1.367"
            },
            "BudgetYearFive": {
                "val": "1.390"
            }
        },
        "ProgramElementNote": {
            "val": "FY14: $1.410M Increase in B51 aligned funds with the current stage of the MFLTS program acquisition lifecycle.\n      $0.940M Increase in B41 aligned funds with the current stage of the CHARCS program acquisition lifecycle."
        },
        "ProgramElementMissionDescription": {
            "val": "The All Source Analysis System (ASAS) provided US Army commanders at all echelons from battalion to Army Service Component Command (ASCC) with automated support to the management and planning, processing and analysis, and dissemination of intelligence, counterintelligence, and electronic warfare. ASAS provided the means to enhance the commander's timely and comprehensive understanding of enemy deployments, capabilities, and potential courses of action. The system used standard joint and Army protocols and message formats to interface with selected National, joint, theater, and tactical intelligence, surveillance, and reconnaissance systems and preprocessors and Army, joint, and coalition battle command systems. The ASAS Family of Systems migrated into the Distributed Common Ground System-Army (DCGS-A) program and Army is using it as the initial platform to provide accelerated DCGS-A capabilities to the force. \n\nThe Counterintelligence (CI) and Human Intelligence (HUMINT) Automated Reporting and Collection System (CHARCS) is the Army's CI and HUMINT tactical collection and reporting system.  CHARCS provides automation support for information collection, reporting, investigations, source & interrogation operations and document exploitation. The CHARCS automation architecture extends from the individual HUMINT team soldier or CI agent to the Corps Analysis and Control Element (ACE).  CHARCS reports digital data such as maps, overlays, images, video, biometrics, scanned documents and audio files.  These media are transmitted through secure networks and interfaces with the Distributed Common Ground Systems-Army (DCGS-A) for detailed analysis and creation of finished intelligence products.  Collection and reporting teams at Military Intelligence (MI) battalions and their operational managers are equipped with one of two CHARCS systems.  The first is the AN\/PYQ-8 Individual Tactical Reporting Tool (ITRT) which provides collection and processing devices for individual HUMINT team member or CI agents.  The second is the AN\/PYQ-3 CI\/HUMINT Automated Tool Set (CHATS) which provides the team leader (who normally directs 3-5 team members) tools to process and manage team-collected information and a robust set of devices such as printers, scanners, cameras and audio recorders to assist the collection mission.  The CHATS is also used by Operational Management Team (OMT) (who normally directs 5-10 collection and reporting teams).  Each CHATS has an associated Mission Support Peripheral Sets and Kits (MS-PSK) or Collection Peripheral Sets and Kits (C-PSK). \n\nThe Machine Foreign Language Translation System (MFLTS), formerly Sequoyah, develops, fields, and sustains a basic automated foreign speech and text translation capability for Army tactical systems to augment and compliment limited human linguistic resources.  These integrated automated translation capabilities will be applicable across three different system configurations; a hand-held\/wearable portable device, a laptop\/mobile device, and in a networked\/web-enabled system.  The software modules will translate English from a prioritized list of languages in a prioritized collection of domains (e.g. medical, intelligence, base security).  MFLTS will be interoperable with Commercial Off-The-Shelf (COTS) or Government Off-The-Shelf (GOTS) automation equipment to include the Distributed Common Ground System-Army (DCGS-A), Nett Warrior (NW), and Counterintelligence Human Intelligence Automated Reporting and Collection System (CHARCS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.405"
                },
                "CurrentYear": {
                    "val": "5.694"
                },
                "BudgetYearOne": {
                    "val": "2.489"
                },
                "BudgetYearOneBase": {
                    "val": "2.489"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.400"
                },
                "CurrentYear": {
                    "val": "5.694"
                },
                "BudgetYearOne": {
                    "val": "4.839"
                },
                "BudgetYearOneBase": {
                    "val": "4.839"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.005"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.350"
                },
                "BudgetYearOneBase": {
                    "val": "2.350"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.005"
                                },
                                "BudgetYearOne": {
                                    "val": "2.350"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.350"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "B41"
                    },
                    "ProjectTitle": {
                        "val": "CI\/HUMINT Software Products (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.102"
                        },
                        "CurrentYear": {
                            "val": "1.319"
                        },
                        "BudgetYearOne": {
                            "val": "2.165"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.165"
                        },
                        "BudgetYearTwo": {
                            "val": "1.710"
                        },
                        "BudgetYearThree": {
                            "val": "1.327"
                        },
                        "BudgetYearFour": {
                            "val": "1.367"
                        },
                        "BudgetYearFive": {
                            "val": "1.390"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Counterintelligence (CI) and Human Intelligence (HUMINT) Automated Reporting and Collection System (CHARCS) is the Army's CI and HUMINT tactical collection and reporting system. CHARCS provides automation support for information collection, reporting, investigations, source & interrogation operations and document exploitation. The CHARCS automation architecture extends from the individual HUMINT team soldier or CI agent to the Corps Analysis and Control Element (ACE). CHARCS reports digital data such as maps, overlays, images, video, biometrics, scanned documents and audio files. These media are transmitted through secure networks and interfaces with the Distributed Common Ground Systems-Army (DCGS-A) for detailed analysis and creation of finished intelligence products. Collection and reporting teams at Military Intelligence (MI) battalions and their operational managers are equipped with one of two CHARCS systems. The first is the AN\/PYQ-8 Individual Tactical Reporting Tool (ITRT) which provides collection and processing devices for individual HUMINT team member or CI agents. The second is the AN\/PYQ-3 CI\/HUMINT Automated Tool Set (CHATS) which provides the team leader (who normally directs 3-5 team members) tools to process and manage team-collected information and a robust set of devices such as printers, scanners, cameras and audio recorders to assist the collection mission. The CHATS is also used by Operational Management Team (OMT) (who normally directs 5-10 collection and reporting teams). Each CHATS has an associated Mission Support Peripheral Sets and Kits (MS-PSK) or Collection Peripheral Sets and Kits (C-PSK).\n\nThe C-PSK provides specialized collection component capabilities to support CI\/HUMINT collection missions as an addition to the CHATS and ITRT. C-PSK capabilities are commercial-off-the-shelf (COTS) technologies and include video and camera equipment, global positioning system (GPS), voice recording device and infrared strobe lights. The MS-PSK provides specialized collection component capabilities to support CI\/HUMINT collection missions as an addition to the AN\/PYQ-3 (CHATS). MS-PSK capabilities are COTS technologies and include night vision photography & video, binocular, captured materiel tracking, Document & Media Exploitation (DOMEX), Digital Media Forensics software, Document Exploitation (DOCEX) software, and will interface with a handheld biometric capability for identification.\n\nFY2014 Base amount of $2.165 million will fund the CHARCS software increased performance, service packs, Information Assurance & Vulnerability Assessment (IAVA) and Defense Intelligence Agency (DIA) security updates and compliance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RDTE: Continue security and accreditation, increased software performance and hardware integration testing of CHARCS software."
                                    },
                                    "Description": {
                                        "val": "Funds software testing, development and maintenance, and systems testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.102"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "$.102 million funded additional tests of the CHARCS V1.4 baseline software, increased software performance, service packs, IAVA and DIA security updates and compliance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.319"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY2013 Base amount of $1.319 million funds additional tests of the CHARCS V1.4 baseline software, increased software performance, CHARCS web-based capability, service packs, IAVA and DIA security updates and compliance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.165"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.165"
                                            },
                                            "Text": {
                                                "val": "FY2014 Base amount of $2.165 million will fund development and testing of CHARCS software increased performance service packs, IAVA and DIA security updates and compliance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CI HUMINT AUTO REPRTING AND COLL (C"
                                    },
                                    "Title": {
                                        "val": "BK5275"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.493"
                                        },
                                        "CurrentYear": {
                                            "val": "7.077"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.169"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.169"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.392"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.604"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.782"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.914"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Program capability documentation was updated to include Capabilities Development Document (CDD) Increment 2 requirements in CHARCS Capabilities Production Document (CPD) Increment 1, Revision 1, which was signed 6 September 2012.   CHARCS is a post-Milestone C program.  Product Director (PD) CHARCS is leveraging SEC CECOM and RDEC software engineering services to increase current capabilities and provide a web-enabled version of the CHARCS software.  PD CHARCS will utilize competitively-awarded Task and Delivery Orders on Indefinite Deliverable, Indefinite Quantity contract vehicles to procure hardware and provide services.  CHARCS software requires development to keep pace with evolving capability requirements, Defense Intelligence Agency and Information Assurance & Vulnerability Assessment (IAVA) compliance, and to meet JROC approved requirements documented in the CHARCS CPD Increment 1, Revision 1. PD is continuously evaluating and assessing existing Commercial-off-the-shelf (COTS), Government-off-the-shelf (GOTS), and Quick Reaction Capabilities (QRC) that support CHARCS CPD Increment 1, Revision 1."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management - PD CHARCS Government Acquisition Mgmt - Direct Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ASPO\/PD CHARCS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.790"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.790"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CHARCS Software Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM Software Engineering Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.988"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.219"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CHARCS Software Management\/Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.045"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.045"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CHARC Software Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Army"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.520"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.520"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DOMEX Tools"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "National Ground Intelligence Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charlottesville, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.100"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.100"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Acquisition and Engineering Services- Program Office Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI Technologies, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chantilly, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.857"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support and Interoperability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CTSF,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Hood, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.612"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test Support and Interoperability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Army"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Operational Test \/ Security Accreditation Testing \/ HW Integration Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.234"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.102"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Security Accreditation Collateral"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Monmouth, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.381"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Safety release"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Monmouth, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.035"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "V1.4 Government Acceptance Testing (GAT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CHARCS Interoperability Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "B51"
                    },
                    "ProjectTitle": {
                        "val": "Machine - Foreign Language Translation System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.298"
                        },
                        "CurrentYear": {
                            "val": "4.375"
                        },
                        "BudgetYearOne": {
                            "val": "2.674"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.674"
                        },
                        "BudgetYearTwo": {
                            "val": "5.528"
                        },
                        "BudgetYearThree": {
                            "val": "1.084"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Machine Foreign Language Translation System (MFLTS), formerly Sequoyah, develops, fields, and sustains a basic automated foreign speech and text translation capability for Army tactical systems to augment and compliment limited human linguistic resources. These integrated automated translation capabilities will be applicable across three different system configurations; a hand-held\/wearable portable device, a laptop\/mobile device, and in a networked\/web-enabled system. The software modules will translate English from a prioritized list of languages in a prioritized collection of domains (e.g. medical, intelligence, base security). MFLTS will be interoperable with Commercial Off-The-Shelf (COTS) or Government Off-The-Shelf (GOTS) automation equipment to include the Distributed Common Ground System-Army (DCGS-A), Nett Warrior (NW), and Counterintelligence Human Intelligence Automated Reporting and Collection System (CHARCS).\n\nFY14 Base RDTE dollars in the amount of $2.674 million supports the Engineering and Manufacturing Development (EMD) Phase providing deployable automated translation software."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development and Engineering"
                                    },
                                    "Description": {
                                        "val": "Development and integration of Critical Technology Elements (CTE) of Automated Speech Recognition (ASR), Optical Character Recognition (OCR), and Machine Language Translation Translation Engine (MLT TE) software"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.019"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development and integration of Critical Technology Elements (CTE) of Automated Speech Recognition (ASR), Optical Character Recognition (OCR), and Machine Language Translation Translation Engine (MLT TE) software"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.308"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuing development and integration of Critical Technology Elements (CTE) of Automated Speech Recognition (ASR), Optical Character Recognition (OCR), and Machine Language Translation Translation Engine (MLT TE) software"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.481"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.481"
                                            },
                                            "Text": {
                                                "val": "Will continue development and integration of Critical Technology Elements (CTE) of Automated Speech Recognition (ASR), Optical Character Recognition (OCR), and Machine Language Translation Translation Engine (MLT TE) software"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation of MFLTS Capabilities"
                                    },
                                    "Description": {
                                        "val": "Testing of the automated language translation capabilities using established metrics, collected standard data sets, and standardized objective validation process"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Tested the automated language translation capabilities using established metrics, collected standard data sets, and standardized objective validation process"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.881"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Testing of the automated language translation capabilities using established metrics, collected standard data sets, and standardized objective validation process"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PD Support and Management Services"
                                    },
                                    "Description": {
                                        "val": "Program Support and Matrixed services at other Government activities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.179"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to provide program support and matrixed services at other Government activities"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.186"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuing to provide program support and matrixed services at other Government activities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.193"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.193"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide program support and matrixed services at other Government activities"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Machine Foreign Language Tran"
                                    },
                                    "Title": {
                                        "val": "B88605"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "2.924"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.924"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.997"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "5.921"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The MFLTS Technology Development (TD) Phase developed an open software architecture prototype using full and open competition that allowed the addition, upgrade and replacement of translation system components for integration into existing Programs. During the Engineering and Manufacturing Development (EMD) Phase, the program will integrate technology demonstrated during the TD Phase to meet Key Performance Parameters (KPPs).  This includes the requirement to meet an Interagency Language Roundtable (ILR) level of 1 for three speech translation modules and an ILR level of 1+ for two text translation modules in hand-held\/wearable portable, laptop\/mobile, and networked\/web-enabled system configurations.  Following a Milestone C decision, a full and open competition production contract will be issued to integrate and field the latest MFLTS capabilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.171"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.179"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.186"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.193"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.193"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development Contract"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon BBN"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cambridge, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.554"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.446"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.718"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.877"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.877"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.062"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.573"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.590"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.604"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.604"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation Activities"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "USA Test and Eval Command"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.881"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Collection"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Research Laboratory"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Adelphi, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.308"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.308"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Initial Capability - MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Capability - EMD Phase"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Preliminary Design Review (PDR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Capability - Limited Deployment (LD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EUT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Capability - MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}