{
    "id": "cad1f7fa6554a5652a83bf4ed45b10d03930af86",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DSCA_RDTE_JustificationBook_Defense_Security_Cooperation_Agency_PB_2014.zzz_unzipped_RDTE_JustificationBook_Defense_Security_Cooperation_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Security Cooperation Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605127T"
        },
        "ProgramElementTitle": {
            "val": "Regional International Outreach (RIO) - Partnership for Peace Information Management System (PIMS)"
        },
        "R1LineItemNumber": {
            "val": "183"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Security Cooperation Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "2.090"
            },
            "PriorYear": {
                "val": "2.106"
            },
            "CurrentYear": {
                "val": "3.238"
            },
            "BudgetYearOne": {
                "val": "3.270"
            },
            "BudgetYearOneBase": {
                "val": "3.270"
            },
            "BudgetYearTwo": {
                "val": "2.292"
            },
            "BudgetYearThree": {
                "val": "2.361"
            },
            "BudgetYearFour": {
                "val": "2.402"
            },
            "BudgetYearFive": {
                "val": "2.432"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Regional International Outreach (RIO) - Partnership for Peace (PfP) Information Management System (PIMS) is an Office of the Secretary of Defense (OSD) initiative.  The primary focus of the program is a common information technology platform (GlobalNET) to improve international partner outreach and collaboration efforts in a federated environment. A federated environment – characterized by the capacity of DoD institutions to directly share participants and content across proprietary community websites - fosters networks of partner influencers and enables better use of DoD resources through collaboration among the Regional Centers for Security Studies, PfP and international partners, other DoD educational institutions and communities as required. The program uses a spiral methodology (making available capabilities as developed), to speed the delivery of open source collaboration technologies the user community. The Defense Security Cooperation Agency (DSCA) oversees execution of the research and development of the GlobalNET effort and its operations, and ensures that the program addresses DoD security cooperation requirements in the context of defense, interagency, and international information sharing and collaboration needs.\n\nThe GlobalNET effort focuses on improving collaboration, supporting outreach efforts, and enabling communication among the Regional Centers for Security Studies, the Combatant Commanders, the DSCA, OUSD (Policy), North Atlantic Treaty Organization’s (NATO) Military Cooperation Division (MCD), the PfP Consortium of Defense Academies, PfP Partner countries, and other designated DoD institutions and communities. It provides DoD and international partner security practitioners a platform to share information, communicate and collaborate, and improve administrative activities. It also provides the ability to form collaborative communities of interest around security issues. GlobalNET facilitates information sharing and knowledge management concepts in accordance with U.S. policy. PIMS, as a part of the NATO Enlargement Facilitation Act of 1996, implements the Congressional endorsement for the modernization of Defense capabilities in eligible PfP countries relative to their telecommunications infrastructure.  RIO-PIMS provides allies and partner countries the ability to collaborate in critical cooperative activities that underpin the spirit of the PfP program.  The program supports PfP coalition initiatives through development of distributive collaboration tools to support aspects of U.S. and NATO-approved PfP cooperative activities.  This support is important to achieve the interoperability\/integration outlined in the Guidance for the Employment of the Force.  RIO-PIMS supports internet-based education and collaboration, exercise simulations, and training center requirements. \n\nThe Regional Centers Person\/Activity Management System (RCPAMS) provides an integrated student and activities management framework that was designed to complement the capabilities of the Security Assistance Network (SAN).  The interface between the SAN, RCPAMS, and GlobalNET provides faculty and students an effective information service to ensure student, activity, and alumni management.  Data is shared between the systems ensuring improved data integrity."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.165"
                },
                "CurrentYear": {
                    "val": "3.238"
                },
                "BudgetYearOne": {
                    "val": "3.270"
                },
                "BudgetYearOneBase": {
                    "val": "3.270"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.106"
                },
                "CurrentYear": {
                    "val": "3.238"
                },
                "BudgetYearOne": {
                    "val": "3.270"
                },
                "BudgetYearOneBase": {
                    "val": "3.270"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.059"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.059"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012: The decrease reflects SBIR\/STTR transfer.\n\nFY 2014:  RIO-PIMS requires $3.270 to research and implement the gaming and exercise support module identified as required from multiple user communities in FY 2013; extend the email\/system notification functionality to allow users to respond directly to system generated notifications without having to login to the system; to research the computer human interface (CHI) ensuring it meets RIO-PIMS mission objectives – modify where necessary, validate existing requirements with the user communities and gather new ones; to deploy a native video teleconference (VTC) capability to replace the existing Adobe connect system;  to update the GlobalNET implementation to the newest platform release; and to complete the FY 2013 recertification of security accreditation process that reflects the new and updated software capabilities as well newly integrated communities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "000000"
                    },
                    "ProjectTitle": {
                        "val": "Regional International Outreach - Partnership for Peace Information Management Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.090"
                        },
                        "PriorYear": {
                            "val": "2.106"
                        },
                        "CurrentYear": {
                            "val": "3.238"
                        },
                        "BudgetYearOne": {
                            "val": "3.270"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.270"
                        },
                        "BudgetYearTwo": {
                            "val": "2.292"
                        },
                        "BudgetYearThree": {
                            "val": "2.361"
                        },
                        "BudgetYearFour": {
                            "val": "2.402"
                        },
                        "BudgetYearFive": {
                            "val": "2.432"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Regional International Outreach (RIO) - Partnership for Peace (PfP) Information Management System (PIMS) is an Office of the Secretary of Defense (OSD) initiative.  The primary focus of the program is a common information technology platform (GlobalNET) to improve international partner outreach and collaboration efforts in a federated environment. A federated environment – characterized by the capacity of DoD institutions to directly share participants and content across websites - fosters networks of partner influencers and enables better use of DoD resources through collaboration among the Regional Centers for Security Studies, PfP and international partners, other DoD educational institutions and communities as required. The program uses a spiral methodology (making available capabilities as developed), to speed the delivery of open source collaboration technologies the user community. The Defense Security Cooperation Agency (DSCA) oversees execution of the research and development of the GlobalNET effort and its operations, and ensures that the program addresses DoD security cooperation requirements in the context of defense, interagency, and international information sharing and collaboration needs.\n\nThe GlobalNET effort focuses on improving collaboration, supporting outreach efforts, and enabling communication among the Regional Centers for Security Studies, the Combatant Commanders, the DSCA, OUSD (Policy), North Atlantic Treaty Organization’s (NATO) Military Cooperation Division (MCD), the PfP Consortium of Defense Academies, PfP Partner countries, and other designated DoD institutions and communities. It provides DoD and international partner security practitioners a platform to share information, communicate and collaborate, and improve administrative activities. It also provides the ability to form collaborative communities of interest around security issues. GlobalNET facilitates information sharing and knowledge management concepts in accordance with U.S. policy. PIMS, as a part of the NATO Enlargement Facilitation Act of 1996, implements the Congressional endorsement for the modernization of Defense capabilities in eligible PfP countries relative to their telecommunications infrastructure.  RIO-PIMS provides allies and partner countries the ability to collaborate in critical cooperative activities that underpin the spirit of the PfP program.  The program supports PfP coalition initiatives through development of distributive collaboration tools to support aspects of U.S. and NATO-approved PfP cooperative activities.  This support is important to achieve the interoperability\/integration outlined in the Guidance for the Employment of the Force.  RIO-PIMS supports internet-based education and collaboration, exercise simulations, and training center requirements. \n\nThe Regional Centers Person\/Activity Management System (RCPAMS) provides an integrated student and activities management framework that was designed to complement the capabilities of the Security Assistance Network (SAN).  The interface between the SAN, RCPAMS, and GlobalNET provides faculty and students an effective information service to ensure student, activity, and alumni management.  Data is shared between the systems ensuring improved data integrity."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Regional International Outreach - Partnership for Peace Information Management System"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.106"
                                            },
                                            "Text": {
                                                "val": "Deployed the new platform to Counter terrorism fellowship program (CFTP) Education and Collaboration Community Online (ECCO), Global Center for Security Cooperation (GCSC), Defense Institute for International Legal Studies (DIILS), PIMS Partners, Defense Language Institute English Learning Centers (DLI-ELC), Military Cooperation Division (MCD) at SHAPE, School if International Graduate Studies (SIGS), and the NATO School.\n\nBegin development of direct data exchange links with relevant information systems to remove the technical limitations to information sharing between GlobalNET and other learning management systems (LMS) implementations.  \n\nRefined, tested and deployed the chat capability.  In addition, provided a framework for chat that included the replacement for the capabilities for Adobe connect to minimize the recurring costs of the VTC capabilities and whiteboarding.\n\nWorked with DSCA and OSD-P leaders to identify additional institutions which require a similar capability.  Worked to extend the platform for those institution specific requirements, allowing existing members to avail themselves of the newly developed feature sets.\n\nWorked with the integrators of the RCPAMS system to ensure that information exchange between RCPAMS and GlobalNET is mapped.  This includes: 1) an automatic provision module allowing information from RCPAMS to populate and provision accounts for eligible participants, 2) participant nomination form, and 3) automatic group enrollment based on course participation.  \n\nWorked with the exiting platform managers to update the GlobalNET implementation to the newest platform stable release - allowing greater functionality and better security across all members of the platform.\n\nCompleted FY 2012 recertification of security accreditation process that also reflects the new and updated software capabilities as well newly integrated educational organizations. Conduct developmental and operational testing of latest software release.  Release latest validated software release into production."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.238"
                                            },
                                            "Text": {
                                                "val": "Complete the Joint Capabilities Integration development System (JCIDS) Capabilities Production Document (CPD) IAW  DoD regulations. \n\nWork to extend the email functionality support to the system users such that plain language support for common tasks is provided through email. This extends the exiting capability of responding to system generated notifications by allowing user initiated tasks through plain language submitted in an email.  The system will post all of the content correctly and in a structured format for knowledge management.  It begins to turn email into a client for limited functionality.\n\nValidate the existing requirements are still applicable to the aggregate user community across the platform.  Research the effectiveness of the CHI and ensure that it meets all mission objectives and goals and modify where necessary.  Perform user research to validate the new changes and implement the CHI to the platform.\n\nWork with DSCA and OSD-P leaders to identify institutions which need a similar capability.  Work to extend the platform for those institution specific requirements, allowing existing members to avail themselves of the newly developed feature sets.\n\nDeploy a native video teleconference (VTC) capability to replace the existing hosted service.  GlobalNET is currently bundled with a loosely coupled Adobe connect system outside of the GlobalNET stack and hosting environment.  The capability would create a native VTC capability inside of the platform allowing much tighter integrations with messaging, file sharing, white boarding, and chatting and reduce the operations and maintenance (O&M) expense of leasing this service.\nWork with the existing platform managers to update the GlobalNET implementation to the newest platform stable release - allowing greater functionality and better security across all members of the platform.\n\nTest, and implement the RCPAMS information exchange between the SAN and GlobalNET.\n\nComplete FY 2013 recertification of security accreditation process that also reflects the new and updated software capabilities as well newly integrated educational organizations.   Conduct the research and define the requirements for the gaming and exercise simulation module."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.270"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.270"
                                            },
                                            "Text": {
                                                "val": "Deploy new interface controls allowing administrative users to deploy blocks of functionality in the location and in the workflow for each individual community.\n\nDevelop a much more robust public facing interface such that community leaders can collapse the public facing web presences into the GlobalNET platform and drive content for public consumption through structured workflow. This will allow communities to reduce costs and improve public access to information.\n\nEnhance the user experience for browsing courses and groups to allow a much more robust experience, including tighter coupling of events and groups on the GlobalNET platform with courses operated on the Ilias Learning Management System (LMS) deployed in 2013.\n\nProvide a much more structured and granular reporting and goal tracking environment.  This will include the abiulity to offload the reporting data from the transaction servers to a dedicated reporting service and define goals for each member community. \n\n\nWork to extend the service that shares data between RCPAMS and GlobalNET to a generic service so that other communities can exploit the service for their internal business systems. \n\nUpgrade the core platform to be in alignment with the community versioning.  This will include ensuring that  previously identified issues not addressed is due to required effort being on the older versions, are addressed.\n\n\nContinue to optimize both the code and the underlying hardware to improve performance due to additional communities and provisioned accounts.\n\nWork with users to define their evolutionary needs and functionality and ensure that those needs are in alignment with the program goals. When validated, make system changes and ensure the changes meet anticipated needs.\n\nReview RCPAMS requirements and implement upgrades to the software.\n\nComplete recertification of security accreditation process that also reflects the new and updated software capabilities as well newly integrated communities.   \n\nWork with DSCA and OSD-P leaders to identify institutions which need a similar capability.  Work to extend the platform for those institution specific requirements, allowing existing members to avail themselves of the newly developed feature sets."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The GlobalNET effort employs a spiral acquisition strategy to ensure a well-defined model for each institution\/community that can be exported globally.  The program uses a regional approach to ensure sustainable, leave-behind technology and information sharing procedures.  By partnering with other U.S. Government agencies, existing assets are leveraged to preserve U.S. investments, avoid duplication of effort between agencies, and offer economically prudent solutions to improve information sharing and achieve U.S. security cooperation goals.  Independent Operational Test teams were brought on to ensure that GlobalNET and bears independent validation of the development team’s effort.  GlobalNET has regional based personnel to assist in the adoption of the platform with partners who are not familiar with social collaboration and networking media.  RCPAMS uses a similar spiral approach, testing and fielding approach."
                        },
                        "PerformanceMetrics": {
                            "val": "RIO-PIMS projects performance is measured in several methods: the successful meeting of stated performance objectives in the statement of work, and meeting target dates in the project management plan; via a combination of statistics including the number of trouble tickets generated on the development site, operational user feedback on development site usability, and design; and the system’s performance during developmental and operational testing.   The use of a 3rd party to execute the operational test ensures that the system meets the performance metrics prior to moving to production."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Defense Security Cooperation Agency"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Merlin International"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Englewood, CO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.106"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.106"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.238"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.270"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.270"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Deploy System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award Support Services Contract for Support, ISP, and Limited Equipment Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Refine Interface for Community Use"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Certification and Accreditation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Process JCIDS Documents"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Review Operational Requirements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop RCPAMS Interface"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Identify New Institutions for GlobalNET"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Upgrade Core and Maintenance Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Deploy to Other Institutions"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Review Technical Architecture"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}