{
    "id": "ce2c8870ee0d6d6804675aa1afc1a89fa1be27a6",
    "meta": {
        "filename": "dod-2014_RDTE_2014_SOCOM_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.zzz_unzipped_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160401BB"
        },
        "ProgramElementTitle": {
            "val": "Special Operations Technology Development"
        },
        "R1LineItemNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "295.615"
            },
            "PriorYear": {
                "val": "40.517"
            },
            "CurrentYear": {
                "val": "28.739"
            },
            "BudgetYearOne": {
                "val": "29.246"
            },
            "BudgetYearOneBase": {
                "val": "29.246"
            },
            "BudgetYearTwo": {
                "val": "29.750"
            },
            "BudgetYearThree": {
                "val": "30.289"
            },
            "BudgetYearFour": {
                "val": "30.834"
            },
            "BudgetYearFive": {
                "val": "31.389"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element enables USSOCOM to conduct studies and develop laboratory prototypes for applied research and advanced technology development, as well as leverage other organizations' technology projects that may not otherwise be affordable within MFP-11.  Applying small incremental amounts of investments to DoD, other government agencies, and commercial organizations allows USSOCOM to influence the direction of technology development or the schedule against which it is being pursued, and to acquire emerging technologies for Special Operations Forces.  This project provides an investment strategy for USSOCOM to link technology opportunities with capability deficiencies, capability objectives, technology thrust areas, human endurance and sensory performance, and technology development objectives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "41.591"
                },
                "CurrentYear": {
                    "val": "28.739"
                },
                "BudgetYearOne": {
                    "val": "29.246"
                },
                "BudgetYearOneBase": {
                    "val": "29.246"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.517"
                },
                "CurrentYear": {
                    "val": "28.739"
                },
                "BudgetYearOne": {
                    "val": "29.246"
                },
                "BudgetYearOneBase": {
                    "val": "29.246"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.074"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.074"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Funding:  \n\nFY 2012: Program decrease of $1.074 million is due to a transfer of funds to the Small Business Innovative Research Program.\n\nFY 2013:  None.\n\nFY 2014:  None.\n\nSchedule:  None.  \n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S100"
                    },
                    "ProjectTitle": {
                        "val": "SO Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "295.615"
                        },
                        "PriorYear": {
                            "val": "40.517"
                        },
                        "CurrentYear": {
                            "val": "28.739"
                        },
                        "BudgetYearOne": {
                            "val": "29.246"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.246"
                        },
                        "BudgetYearTwo": {
                            "val": "29.750"
                        },
                        "BudgetYearThree": {
                            "val": "30.289"
                        },
                        "BudgetYearFour": {
                            "val": "30.834"
                        },
                        "BudgetYearFive": {
                            "val": "31.389"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts studies and develops laboratory prototypes for applied research and advanced technology developments, and leverages other organizations' technology projects that may not otherwise be affordable within MFP-11.  Small incremental co-investments with DoD, other government agencies, and commercial organizations allows USSOCOM to influence the schedule and direction of technology developments, emerging technologies, and capabilities for Special Operations Forces (SOF), with significant economies of investment.  This USSOCOM investment strategy is used to link technology opportunities with USSOCOM capability deficiencies, capability objectives; technology thrust areas, and technology objectives.  Requirements in these areas may be advertised to industry and government research and development agencies via broad area announcements and calls for white papers.  Sub-projects within the Special Operations Technology Demonstration effort include:  \n\n•  Special Operations Technology Development Sub-Project:  This project conducts studies and develops laboratory prototypes for applied research and advanced technology developments, and leverages other organizations' technology projects that may not otherwise be affordable within MFP-11.\n\n•  Tagging, Tracking, and Locating (TTL) Sub-Project:  TTL funds Applied Research projects identified in the USSOCOM Capabilities Based Assessments.  TTL applies leading edge nanotechnology, biometric and biotechnology, and chemistry S&T which is directed towards the development of revolutionary tags, taggants, sensors, communications, and data processing.\n\n•  Classified Sub-Project (provided under separate cover).   \n\n•  The following technology activity was added by Congress in FY 2012:  \n\n•  Congressional add:  Unfunded Requirement - Increased development of multi-spectral optics which will address night vision capability gaps; assessed  approaches to address unique power requirements for SOF mobility platforms; and initiated efforts to address biometric and non-lethal engagement needs.   Classified unfunded requirement details are provided under separate cover."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Unfunded Requirement"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "Expanded and enhanced current Unclassified Test Bed (UTB) capabilities such as evaluating, developing, prototyping and fabricating quick reaction prototypes.  Included in this effort, is a classified area that will provide SOF the ability to quickly transition candidate technologies with multiple levels of classification.  Continued integration of Multi-Spectral optics, which addresses night vision capability gaps and signature management improvements; developed power solutions for SOF mobility platforms; and continued efforts to address non-lethal engagement needs."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Special Operations Technology Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.462"
                                            },
                                            "Text": {
                                                "val": "Pursued reduced signature technologies; developed advanced lightweight armor and materials; and began development of long duration small form factor power supplies, and alternative fuel power systems.  Continued to advance technologies for combat medical equipment and tactics.  Continued pursuit of methods to reduce operator load and provide advanced protection.  Developed technologies for improved Man-Machine Interface and functionality of Target Engagement Systems and investigate technologies that can be applied to increase human performance and endurance; pursue enhancements to technologies that can aid in detection of enemy intentions and movement.  Continued further development of Multi-Spectral Optics, Digital Night Vision, Digital Fusion, Short-Wave Infrared Radar Characterization, Power Systems and Advanced Optics transition mature technology into programs of record."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.226"
                                            },
                                            "Text": {
                                                "val": "Continue ongoing technology development sub-projects in areas such as, but not limited to:  reduced signature technologies; advanced lightweight armor and materials; multi-domain mobility platforms; long duration small form factor power supplies; alternative fuel power systems and eco-friendly energy devices.  Advance technologies for combat medical equipment and tactics; sensor and processing improvements; improve interfaces and displays; and secure communications.  Continue pursuit of methods to reduce operator load and provide advanced protection.  Develop technologies for improved and widened window of target engagement (escalation of force); pursue enhancements to technologies that can aid in detection of enemy intentions and movement; and continue development and exploration across the electromagnetic spectrum.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.427"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.427"
                                            },
                                            "Text": {
                                                "val": "Continues ongoing technology development sub-projects in areas such as, but not limited to:  reduced signature technologies; advanced lightweight armor and materials; long duration small form factor power supplies; and alternative fuel power systems.  Advances technologies for combat medical equipment and tactics; sensor and processing improvements; improve interfaces and displays; and secure communications.  Continues pursuit of methods to reduce operator load and provides advanced protection.  Develops technologies for improved and widened window of target engagement (escalation of force); pursues enhancements to technologies that can aid in detection of enemy intentions and movement; and continues development and exploration across the electromagnetic spectrum.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging, Tracking, and Locating Technologies (TTL)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.059"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Continued projects to exploit nanotechnology, biotechnology and chemistry for application to TTL systems.  Initiated projects linked to the USSOCOM\/DoD TTL Roadmap.  Support the JCS TTL Quick Look Capability Assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.371"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Continue projects to exploit nanotechnology, biotechnology and chemistry for application to TTL and TTL-enabling systems.  Initiate projects linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL Quick-Look Capabilities-Based Assessment (QL-CBA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.634"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.634"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Continues projects to exploit nanotechnology, biotechnology and chemistry for application to TTL and TTL-enabling systems.  Initiates projects linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL Quick-Look Capabilities-Based Assessment (QL-CBA)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Classified"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.996"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.142"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.185"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.185"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}