{
    "id": "e6c98ac43fb727f4f6e887d41f08e91ac8c6e877",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA7_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0607141A"
        },
        "ProgramElementTitle": {
            "val": "Logistics Automation"
        },
        "R1LineItemNumber": {
            "val": "157"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "3.717"
            },
            "BudgetYearOneBase": {
                "val": "3.717"
            },
            "BudgetYearTwo": {
                "val": "3.717"
            },
            "BudgetYearThree": {
                "val": "3.717"
            },
            "BudgetYearFour": {
                "val": "3.717"
            },
            "BudgetYearFive": {
                "val": "3.717"
            }
        },
        "ProgramElementNote": {
            "val": "Previously, these efforts were programmed and funded within the OSD PE 0303141 Global Combat Support System-Army (GCSS-A).  In an effort to reflect only those funds supporting GCSS-A in that OSD PE, this OSD PE was established."
        },
        "ProgramElementMissionDescription": {
            "val": "The Logistics Information Warehouse (LIW) has been designated by the Secretary of the Army as the primary system for the accessing, acquiring, and delivery of materiel data.  This includes data from all sources designated as Authoritative, as well as, system derived data and appropriate reference data.  This data will be used in support of materiel sourcing and distribution and other Materiel Enterprise missions.  It enables Command visibility of business intelligence and resulting metrics for critical logistics components enabling enterprise-level analytics to be performed in support of the equipping mission within the Army's Force Generation (ARFORGEN) processes. LOGSA and its LIW suite of products and services provide the Army community with vital logistics data necessary for the planning, conducting and sustainment of war fighting capability worldwide. The LMI-DST directly supports Army Force Generation (ARFORGEN) by linking available equipment to the Generated Force model. Specifically, LMI-DST synchronizes an Army authoritative Demand Signal for manning, equipping,services & infrastructure and authoritative resourcing (money) information, resulting in an accurate prediction of a ready and properly equipped force."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.717"
                },
                "BudgetYearOneBase": {
                    "val": "3.717"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.717"
                },
                "BudgetYearOneBase": {
                    "val": "3.717"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.717"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.717"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DY1"
                    },
                    "ProjectTitle": {
                        "val": "Logistics Information Warehouse (LIW)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.504"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.504"
                        },
                        "BudgetYearTwo": {
                            "val": "1.504"
                        },
                        "BudgetYearThree": {
                            "val": "1.504"
                        },
                        "BudgetYearFour": {
                            "val": "1.504"
                        },
                        "BudgetYearFive": {
                            "val": "1.504"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not Applicable."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Logistics Information Warehouse (LIW) is designated as the Army's authoritative materiel data repository. BENEFITS: As chartered by the Secretary of The Army, LIW will provide enterprise-accepted and trusted information for analysis, aggregation, and reuse in support of the Lead Materiel Integrator (LMI) mission. As an Army enterprise-level repository and retrieval system to facilitate accurate choices and rapid decision making. Specifically, LIW will provide all required data structured in a way that allows for querying and reporting; e.g., equipment authorizations, equipment on-hand, new procurement schedules, RESET production schedules and in-transit visibility from origin and distribution to final destination, in support of the information needs of the Army Materiel Command (AMC) and other command logistics managers. This includes data from all sources designated as authoritative, as well as system derived data and appropriate reference data. This data will be used in support of materiel sourcing and distribution and other Materiel Enterprise missions. LIW enables visibility of business intelligence and resulting metrics for critical logistics components enabling enterprise-level analytics to be performed in support of the equipping mission within the Army's ARFORGEN processes. LIW supports the tenants of Mission Command by logistically empowering the Commander to successfully integrate and synchronize logistics information with warfighter functions in time and space to maximize potential for mission success.ADDITIONAL CAPABILITIES: LIW provides the data and custom business intelligence environment to enable Command-specific analysis and presentation of business intelligence displays to satisy unique command management requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "LIW"
                                    },
                                    "Description": {
                                        "val": "Execution of tasks to create Army Logistics Repository."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.504"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.504"
                                            },
                                            "Text": {
                                                "val": "Execute Priority Group 3 Sprint, continue Best of Breed."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Utilize contract services available through LiTES contract vehicle in CHESS."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Priority Group 3 Sprint, continue Best of Breed"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD - Recompete"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.504"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.504"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.504"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Priority Group 3 Sprint, Best of Breed"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DY2"
                    },
                    "ProjectTitle": {
                        "val": "Lead Material Integrator (LMI) (DST)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.213"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.213"
                        },
                        "BudgetYearTwo": {
                            "val": "2.213"
                        },
                        "BudgetYearThree": {
                            "val": "2.213"
                        },
                        "BudgetYearFour": {
                            "val": "2.213"
                        },
                        "BudgetYearFive": {
                            "val": "2.213"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not Applicable."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Lead Materiel Integrator Decision Support Tool (LMI DST) is a software solution, resident within the Logistics Information Warehouse, that supports the Army Materiel Command in its mission as the Army Lead Materiel Integrator as well as materiel managers at Army Commands, Army Service Component Commands, Direct Reporting Units, Corps and Divisions with making informed equipping decisions. The LMI DST directly supports Army Forces Generation (ARFORGEN) by linking available equipment to the Generated Force model. Specifically, development will synchronize an Army authoritative Demand Signal with equipping information for accurate prediction of a ready and properly equipped force. \nFY 2014 Base funding supports development of LMI DST Version 5, as codified in the Army Materiel Command Requirements document."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "LMI\/DST"
                                    },
                                    "Description": {
                                        "val": "The Lead Materiel Integrator Decision Support Tool (LMI DST) is a software solution, resident within the Logistics Information Warehouse."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.213"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.213"
                                            },
                                            "Text": {
                                                "val": "Development of LMI DST Version 5."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The LMI DST is a development effort to meet the Secretary of the Army's intent in designating the Army Materiel Command as the Lead Materiel Integrator and the Logistics Information Warehouse (LIW) as the authoritative repository of Army logistics domain data.  The LMI DST integrates logistics domain data from the LIW with materiel demand requirements from the Readiness Enterprise to enable automated decision support for equippers throughout the Army.  In August 2011, a sole-source contract was awarded to ProModel Corporation to leverage their COTS modeling and simulation capability, the ProModel Application Framework to develop the Lead Materiel Integrator Decision Support Tool, which is a GOTS product.  This is an agile development process, where major versions are released on a six-month cycle.  Version 1 was released December 2011 and Version 2 released June 2012.  Version 2 is currently in production and in use by the Army Sustainment Command, with user training underway for Army Commands and other materiel stakeholders.  The first option year was awarded August 2012, and development of Version 3 is underway.  FY2014 base year funding supports Version 5."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development of LMI DST Version 5"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Pro Model Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.213"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.213"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.213"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Development of LMI DST Version 5"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}