{
    "id": "e8c4797cd6d7488f65ea3e30bce639ef40748844",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DARPA_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602702E"
        },
        "ProgramElementTitle": {
            "val": "TACTICAL TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "202.735"
            },
            "CurrentYear": {
                "val": "233.209"
            },
            "BudgetYearOne": {
                "val": "225.977"
            },
            "BudgetYearOneBase": {
                "val": "225.977"
            },
            "BudgetYearTwo": {
                "val": "236.874"
            },
            "BudgetYearThree": {
                "val": "265.869"
            },
            "BudgetYearFour": {
                "val": "298.653"
            },
            "BudgetYearFive": {
                "val": "305.243"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element is budgeted in the Applied Research Budget Activity because it supports the advancement of concepts and technologies to enhance the next generation of tactical systems.  The Tactical Technology program element funds a number of projects in the areas of Naval Warfare, Advanced Land Systems, Advanced Tactical Technology, Aeronautics Technology and Network Centric Enabling technologies.\n\nThe Naval Warfare Technology project develops advanced enabling technologies for a broad range of naval requirements.  Technologies under development will increase survivability and operational effectiveness of small and medium surface vessels in rough seas.  New areas to be investigated include ship self defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations and unmanned sea vehicles for anti-submarine warfare.\n\nThe Advanced Land Systems project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  Advanced manufacturing demonstration activities are also funded.\n\nThe Advanced Tactical Technology project is exploring the application of compact and solid state lasers; high performance computational algorithms to enhance signal processing, target recognition and tracking, electromagnetic propagation, and processing of advanced materials and microelectronics; precision optics components for critical DoD applications; aerospace electronic warfare systems; new tactical systems for enhanced air vehicle survivability, advanced airbreathing weapons, and enabling technologies for advanced space systems; and Training Superiority programs that will create revolutionary new training techniques.\n\nThe Aeronautics Technology project explores technologies to reduce costs associated with advanced aeronautical systems and provide revolutionary new capabilities for current and projected military mission requirements. This project funds development of a hybrid ground\/air vehicle, an advanced helicopter rotor capable of being optimized for each mission, and robust study efforts.\n\nThe Network Centric Enabling Technology project funds sensor, signal processing, detection, tracking and target identification technology development required for true network-centric tactical operations.  Technologies developed in this project will enable localized, distributed and cross-platform collaborative processing so that networks of sensors can rapidly adapt to changing force mixes, predictive modeling tools to evaluate failing nation states and identify potential hot spots, and social networking approaches to identify and track potential terrorist cells."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "202.422"
                },
                "CurrentYear": {
                    "val": "233.209"
                },
                "BudgetYearOne": {
                    "val": "236.851"
                },
                "BudgetYearOneBase": {
                    "val": "236.851"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "202.735"
                },
                "CurrentYear": {
                    "val": "233.209"
                },
                "BudgetYearOne": {
                    "val": "225.977"
                },
                "BudgetYearOneBase": {
                    "val": "225.977"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.313"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-10.874"
                },
                "BudgetYearOneBase": {
                    "val": "-10.874"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "5.830"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.517"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-10.874"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.874"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Increase reflects an internal below threshold reprogramming offset by reductions for the SBIR\/STTR transfer. \nFY 2014:  Decrease reflects drawdown of the Naval Warfare Project as the ACTUV program (Anti-Submarine Continuous Trail Unmanned Vessel) enters the final testing phase."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "TT-03"
                    },
                    "ProjectTitle": {
                        "val": "NAVAL WARFARE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.877"
                        },
                        "CurrentYear": {
                            "val": "53.642"
                        },
                        "BudgetYearOne": {
                            "val": "33.563"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.563"
                        },
                        "BudgetYearTwo": {
                            "val": "40.392"
                        },
                        "BudgetYearThree": {
                            "val": "51.732"
                        },
                        "BudgetYearFour": {
                            "val": "61.839"
                        },
                        "BudgetYearFive": {
                            "val": "63.255"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities such as drag reduction, ship stability, hypersonic missiles, logistically friendly distributed lighting systems, ship self-defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, and high bandwidth communications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-Submarine Warfare (ASW) Continuous Trail Unmanned Vessel (ACTUV)"
                                    },
                                    "Description": {
                                        "val": "The Anti-Submarine Warfare (ASW) Continuous Trail Unmanned Vessel (ACTUV) program has three primary goals: (1) to build and demonstrate an experimental unmanned vessel with beyond state-of-the-art platform performance based on clean sheet design for unmanned operation, (2) demonstrate the technical viability of operating autonomous unmanned craft at theater or global ranges, from forward operating bases, under a sparse remote supervisory control model, and (3) leverage unique ACTUV characteristics to transition a game changing ASW capability to the Navy.  By establishing the premise that a human is never intended to step on board at any point in the operational cycle, ACTUV concepts can take advantage of an unexplored design space that eliminates or modifies conventional manned ship design constraints in order to achieve disproportionate speed, endurance, and payload fraction.  The resulting unmanned naval vessels must possess sufficient situational awareness and autonomous behavior capability to operate in full compliance with the rules of the road and maritime law to support safe navigation for operational deployments spanning thousands of miles and months of time.  When coupled with innovative sensor technologies, the ACTUV system provides a low cost unmanned system with a fundamentally different operational risk calculus that enables game changing capability to detect and track even the quietest diesel electric submarine threats.  Key technical areas include unmanned naval vessel design methodologies, ship system reliability, high fidelity sensor fusion to provide an accurate world model for autonomous operation, novel application of sensors for ASW tracking, and holistic system integration due to unique optimization opportunities of the ACTUV system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.740"
                                            },
                                            "Text": {
                                                "val": "-  Initiated ACTUV integrated prototype detailed design, fabrication, and demonstration activity.\n-  Conducted incremental demonstrations of ACTUV critical enabling technologies.\n-  Commenced development of ACTUV surrogate hardware-in-the-loop system.\n-  Completed ACTUV concept of operations and preliminary operational performance assessments including situational awareness sensor performance, sonar sensor performance, and autonomous control architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.400"
                                            },
                                            "Text": {
                                                "val": "-  Complete ACTUV detailed design and conduct critical design review.\n-  Perform demonstrations of ACTUV critical enabling technologies.\n-  Conduct integrated system demonstration on ACTUV surrogate hardware-in-the-loop system.\n-  Complete high fidelity ACTUV operational performance assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete ACTUV sensor testing on surrogate platform.\n-  Initiate ACTUV prototype vessel construction.\n-  Integrate software and hardware into the ACTUV platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Arctic Operations"
                                    },
                                    "Description": {
                                        "val": "The Arctic Operations initiative is focused on developing technology to assure U.S. capability to achieve situational awareness in the Arctic.  Due to retreating Arctic ice in the coming decades there is an expectation for increased shipping traffic during the summer months, and increased interest in exploiting natural resources along the Arctic continental shelf.  This growth in activity will increase the strategic significance of the region, and will drive the need to ensure stability through effective regional monitoring.  The extreme environmental conditions of the Arctic may challenge the effectiveness of conventional technology to provide such monitoring.  As such, this program seeks to exploit unique physical attributes and emergent environmental trends in the Arctic to create surprising new capabilities, and will develop technologies for persistent and affordable sensing and communication both above and below the ice to ensure responsive operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.675"
                                            },
                                            "Text": {
                                                "val": "-  Initiate system studies and subsystem technology assessments for novel under-ice and near-ice surveillance.\n-  Conduct technology assessments and perform technology demonstrations in climactic laboratories.\n-  Conduct Arctic data collections analyses.\n-  Complete initial Arctic surveillance system studies.\n-  Develop canonical datasets including environmental data collections to support future design studies and technology efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.563"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.563"
                                            },
                                            "Text": {
                                                "val": "-  Conduct Arctic data collections and analysis for initial subsystem validations.\n-  Conduct system and subsystem designs for under-ice maritime awareness.\n-  Initiate system and sub-system designs for near-ice and surface maritime awareness. \n-  Begin scaling and design studies to understand limits of unique Arctic properties, including clutter, interference, and false contacts.\n-  Demonstrate software functionality and operation in laboratory and scaled field experiments.\n-  Demonstrate sustained autonomous operation in all system operating modes and transitions in a relevant CONUS-based environment.\n-  Complete system environmental assessment for Arctic demonstrations.\n-  Demonstrate sustained component operability and reliability during seasonal environmental variations. \n- Conduct system effectiveness modeling."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Upward Falling Payloads (UFP)"
                                    },
                                    "Description": {
                                        "val": "The Upward Falling Payloads (UFP) program will develop forward-deployed unmanned distributed systems that can provide non-lethal effects or situational awareness over large maritime areas.  The UFP approach centers on pre-deploying deep-ocean nodes years in advance in forward operating areas which can be commanded from standoff to launch to the surface.  Advances in miniaturized sensors and processors, the explosive growth in the variety of small unmanned systems, and the advances in autonomy and networking all point toward highly-capable, yet affordable distributed systems.  Currently, large numbers of distributed unmanned systems are not utilized in far-forward areas due to logistics and distance, the need for delivery platforms, and the associated latency for insertion.  The UFP program will remove this barrier to accelerate large-scale unmanned distributed applications and missions.  The presumption is that a wider range of technology options and system solutions will emerge when the barriers to deployment are removed."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct system trade studies addressing a range of UFP applications leading to conceptual designs.   \n-  Conduct assessments in simulated and real environments to characterize long-range deep sea communications.\n-  Develop conceptual designs for deep sea containment and launch."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactically Expandable Maritime Platform (TEMP)"
                                    },
                                    "Description": {
                                        "val": "The Tactically Expandable Maritime Platform (TEMP) concept seeks to develop and demonstrate macroscopic integrated systems built up from International Organization for Standardization (ISO) modular technologies that can be operated from unmodified commercial container ships and deliver credible naval capability for high priority missions.  TEMP will develop critical enabling modular technologies and evaluate the feasible range of naval missions that can be serviced from this highly flexible and cost effective unconventional force structure model.  An initial mission to be explored will be the modular sea depot concept to enable a remote unmonitored refueling capability for small craft; enabling independent operation from host ships.  TEMP will also evaluate a Humanitarian Assistance and Disaster Relief (HA\/DR) mission, engineering a modular first responder capability that allows the rapid force closure capability of TEMP to deliver immediate lifesaving operations in the hours and days following a disaster event, prior to the time that conventional platforms and organizations are able to respond."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed TEMP HA\/DR critical technology risk reduction demonstrations.\n-  Completed TEMP HA\/DR preliminary design activity and conducted a preliminary design review.\n-  Completed TEMP Modular Sea Depot autonomy and water docking tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct TEMP Modular Sea Depot ballast testing and prototype operational demonstration.\n-  Conduct incremental risk reduction testing of TEMP critical enabling technologies, including modularized air delivery vehicle and modularized sea delivery vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sea Change"
                                    },
                                    "Description": {
                                        "val": "Sea Change is a portfolio of disruptive approaches to critical operational challenges in the maritime domain.  The goal of the Sea Change program is to develop integrated system technologies that offer fundamentally new capabilities to address long-standing operational limitations of naval forces.  Sea Change focus areas include platform propulsion concepts to increase operational capability and efficiency of maritime systems, development of standoff technologies for rapid defeat of anti-access mines, and development of new concepts for employment of distributed unmanned systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.137"
                                            },
                                            "Text": {
                                                "val": "-  Completed assessment of novel maritime propulsion approaches.\n-  Completed assessment of hydroacoustic anti-mine array source technology.\n-  Initiated study of new concepts for employment of distributed unmanned systems with focus on anti-access and area denial challenges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.567"
                                            },
                                            "Text": {
                                                "val": "-  Continue efforts to develop new concepts and capabilities for use of distributed unmanned systems in challenging threat environments including advanced placement of situational awareness systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-04"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED LAND SYSTEMS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "50.304"
                        },
                        "CurrentYear": {
                            "val": "49.839"
                        },
                        "BudgetYearOne": {
                            "val": "47.951"
                        },
                        "BudgetYearOneBase": {
                            "val": "47.951"
                        },
                        "BudgetYearTwo": {
                            "val": "35.609"
                        },
                        "BudgetYearThree": {
                            "val": "15.609"
                        },
                        "BudgetYearFour": {
                            "val": "45.185"
                        },
                        "BudgetYearFive": {
                            "val": "45.185"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  This project will also explore novel design technologies for the manufacture of ground vehicles and new tools for systems assessments of emerging DARPA technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fast, Adaptable, Next Generation Ground Combat Vehicle (FANG)"
                                    },
                                    "Description": {
                                        "val": "The goals of the Fast, Adaptable, Next-Generation Ground Combat Vehicle (FANG) program are to employ a novel, model-based correct-by-construction design capability, a highly-adaptable foundry-style manufacturing capability, and crowd-sourcing design methods to demonstrate 5X-10X compression in the timeline necessary to build an infantry fighting vehicle.  The program seeks to create an open-source development infrastructure for the aggregation of designer inputs applicable to complex electromechanical systems as well as software, and to exercise this infrastructure with a series of design challenges, leading to prize awards and builds of winning designs in a foundry-style, rapidly configurable manufacturing facility.  The design challenges will culminate in a complete build of a next generation infantry fighting vehicle (IFV) to a requirements set loosely analogous to an existing program of record, but executed on a roughly one-year timescale."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.961"
                                            },
                                            "Text": {
                                                "val": "-  Prepared competition guidelines and participation outreach for an open collaborative design community.\n-  Completed the development and began operational testing of the collaborative vehicle design environment, with intent for use in design of mobility subsystems and drivetrains for military vehicles.\n-  Prepared notional design requirements for an IFV drivetrain and mobility subsystem.\n-  Completed procurement, development, and deployment of next-generation cloud-based infrastructure for the VehicleFORGE design sharing website.\n-  Completed algorithms and prototype development for next-generation reputation management engine and began simulating FANG challenges with good and malicious users\/parts to analyze reputation accumulation and effectiveness.\n-  Completed alpha prototype for web-based virtual world collaboration environment which allows users to explore component models and assemblies in a rich graphical environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.977"
                                            },
                                            "Text": {
                                                "val": "-  Perform experimental subsystem designs and subsequent design builds as a \"beta test\" activity using the vehicle design environment as well as the iFAB Foundry.\n-  Promulgate component model libraries, foundry capabilities, and objective design criteria for the first FANG Challenge covering an IFV drivetrain and mobility subsystem.\n-  Maintain and develop incremental upgrades to the collaborative vehicle design environment.\n-  Conduct the first FANG Challenge, a competitive, collaborative design contest for the drivetrain and mobility subsystem of a heavy, amphibious IFV.\n-  Product check the selected drivetrain and mobility subsystem built by the iFAB Foundry.\n-  Conduct developmental testing and evaluation of the drivetrain and mobility subsystem built by the iFAB Foundry.\n-  Prepare notional design requirements for an IFV chassis and integrated survivability subsystem.\n-  Promulgate component model libraries, foundry capabilities, and objective design criteria for the second FANG Challenge covering an IFV chassis and integrated survivability subsystem."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct the second FANG Challenge, a competitive, collaborative design challenge for the chassis and survivability subsystem of a heavy, amphibious IFV.\n-  Maintain and develop incremental upgrades to the collaborative vehicle design environment.\n-  Product check the selected chassis and integrated survivability subsystem built by the iFAB Foundry.\n-  Begin developmental testing and evaluation of the chassis and integrated survivability subsystem.\n-  Prepare notional design requirements for an entire amphibious IFV.\n-  Promulgate component model libraries, foundry capabilities, and objective design criteria for the third FANG Challenge covering an entire amphibious IFV."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics Challenge"
                                    },
                                    "Description": {
                                        "val": "The Robotics Challenge program, originally reported solely under Project NET-01, PE 0603766E, will directly meet Department of Defense strategic needs by developing robotic technology for disaster response operations.  This technology will improve the performance of robots that operate in the rough terrain and austere conditions characteristic of disasters, and use vehicles and tools commonly available in populated areas.  This technology will work in ways easily understood by subject matter experts untrained in the operation of robots and be governed by intuitive controls that require little training.   The program will also meet the global need for resilience against natural disasters and industrial accidents, and increase the resilience of infrastructure against acts of terrorism.\n\nThe primary goal of the Robotics Challenge program is to develop ground robotic capabilities to execute complex tasks in dangerous, degraded, human-engineered environments.  The program will focus on robots that can utilize available human tools, ranging from hand tools to vehicles.  The program aims to advance the key robotic technologies of supervised autonomy, mounted mobility, dismounted mobility, dexterity, strength, and platform endurance.  Supervised autonomy will be developed to allow robot control by non-expert operators, to lower operator workload, and to allow effective operation despite low fidelity (low bandwidth, high latency, intermittent) communications.  Anticipated Service users include the Army, Marines, and Special Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.447"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of specific challenge events, including methodology, metrics, and parameters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.862"
                                            },
                                            "Text": {
                                                "val": "-  Design robot systems and develop algorithms for locomotion and controls.\n-  Conduct the Virtual Robotics Challenge.\n-  Define the DARPA Robotics Challenge Trials event performance and test criteria."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.951"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.951"
                                            },
                                            "Text": {
                                                "val": "-  Build robot systems.\n-  Develop algorithms for perception, manipulation, and operator interface.\n-  Conduct the DARPA Robotics Challenge Trials.\n-  Define the DARPA Robotics Challenge Finals event performance and test criteria."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infantry Squad Systems (IS2)"
                                    },
                                    "Description": {
                                        "val": "The U.S. military achieves overmatch against its adversaries via vehicles in all regimes - land, sea and air.  This level of overmatch is not enjoyed at the squad to individual dismounted warfighter level, however.  The goal of the IS2 program is to leverage advances in real-time situational awareness and mission command; organic three-dimensional dismount mobility; extended range tracking, targeting, and response; and unmanned mobility and perception in order to create a squad that is 10x more mission capable.  The concept of overmatch at the squad level includes increased human stand-off, a smaller force density, and adaptive sensing to allow for responses at multiple scales.  IS2 will explore advanced wearable force protection, advanced organic squad level direct and indirect trajectory precision weaponry, and advanced single soldier aerial transport approaches and technologies.  This end result of the IS2 program is an individual dismount outfitted with sensors, weaponry, and supporting technology to achieve one-on-one overmatch as well as the overall integration of unmanned assets alongside the dismounts to create a new Hybrid Squad unit."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform CONOPS and systems architecture trades studies in the areas of unmanned user interfaces, controls, engineering and perception as well as sensors, weaponry and support technology for soldier sensing, targeting and response.\n-  Develop a simulation environment to allow for an overarching iterative design process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Precision Weapons (MCPW)"
                                    },
                                    "Description": {
                                        "val": "The Medium Caliber Precision Weapons (MCPW) program will validate the premise that high precision extended range (1-10 km) direct fire medium caliber cannons can enable smaller combat fighting vehicles and advanced shipboard flexible engagement cannons for ground and naval applications.  Lethal direct fire overmatch requires larger cannons and larger vehicles to overcome threat armor systems.  MCPW will provide a very precise medium caliber capability to neutralize threat combat vehicles with precision vs. penetration.  MCPW will enable smaller very capable combat vehicles, changing the ground vehicle requirement for larger vehicles to support larger cannons.  The technologies will also support shipboard precision engagement against \"go fast boats\" and other lower tier naval threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct systems architecture trades and cost studies.\n-  Initiate design studies of candidate weapons systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C-Sniper"
                                    },
                                    "Description": {
                                        "val": "Based on promising results obtained under the Crosshairs program, the C-Sniper effort developed the capability to detect and neutralize enemy snipers before they can engage U.S. Forces.  The program delivered a field testable prototype suitable for experimentation on a compatible vehicle such as the Stryker.  The C-Sniper system will operate day and night from a static or mobile military vehicle and will provide the operator with sufficient information to make a timely engagement decision.  Once a decision is made, the C-Sniper will provide data and control to point and track the on-board weapon to the selected target.  The final decision to fire the weapon will be left to the operator."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.896"
                                            },
                                            "Text": {
                                                "val": "-  Completed demonstration of fully integrated system capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-06"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED TACTICAL TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "47.023"
                        },
                        "CurrentYear": {
                            "val": "22.667"
                        },
                        "BudgetYearOne": {
                            "val": "33.544"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.544"
                        },
                        "BudgetYearTwo": {
                            "val": "33.330"
                        },
                        "BudgetYearThree": {
                            "val": "34.773"
                        },
                        "BudgetYearFour": {
                            "val": "50.543"
                        },
                        "BudgetYearFive": {
                            "val": "52.443"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project focuses on three broad technology areas: a) compact, efficient, frequency-agile, diode-pumped, solid-state lasers for infrared countermeasures, laser radar, holographic laser sensors, communications, and high-power laser applications; b) high performance computational algorithms for signal processing, target recognition and tracking, electromagnetic propagation, and processing of advanced materials and microelectronics; c) new approaches for training and mission rehearsal in the tactical\/urban environment.  Additionally, this project will develop new tactical systems for enhanced air vehicle survivability, precision optics, electronic warfare, and advanced air breathing weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Excalibur"
                                    },
                                    "Description": {
                                        "val": "The Excalibur program will develop high-power electronically-steerable optical arrays, with each array element powered by a fiber laser amplifier.  These fiber-laser arrays will be sufficiently lightweight, compact, and electrically efficient to be fielded on a variety of platforms with minimal impact on the platform's original mission capabilities.  Each array element will possess an adaptive-optic capability to minimize beam divergence in the presence of atmospheric turbulence, together with wide-field-of-view beam steering for target tracking.  With each Excalibur array element powered by high power fiber laser amplifiers (at up to 3 kilowatts (kW) per amplifier), high power air-to-air and air-to-ground engagements will be enabled that were previously infeasible because of laser system size and weight.  In addition, this program will also develop kilowatt-class arrays of diode lasers which will provide an alternate route to efficiently reaching mission-relevant power levels, and they will test the ultimate scalability of the optical phased array architecture.  Excalibur arrays will be conformal to aircraft surfaces and scalable in size and power by adding additional elements to the array.  Excalibur will provide the technology foundation for the defense of next generation airborne platforms, including all aircraft flying at altitudes below 50,000 ft, and against proliferated, deployed, and next-generation man-portable air-defense systems (MANPADS) and more capable air-to-air missiles converted for use as ground-to-air missiles.  Excalibur will enable these platforms to fly at lower altitudes and conduct truly persistent, all-weather ground missions, such as reconnaissance despite low-lying cloud cover.  Further capabilities may include: multichannel laser communications, target identification, tracking, designation, precision defeat with minimal collateral effects as well as other applications.\n\nThe Excalibur Budget Activity 2 program will develop the core set of laser components for efficiently driving elements of high-power electronically steerable optical arrays, namely: high-power coherently- and spectrally-combinable fiber laser amplifiers, high-brightness laser diodes for efficiently pumping the fiber laser amplifiers, and kW-class single-mode laser diode arrays.  In addition, advanced techniques (packaging, thermal and power management, beam control, target tracking, etc.) will be developed for light-weight, high power fiber-laser based and podded High Energy Laser Countermeasure (HELCM) systems enabling near-term options for low-altitude aircraft self-defense against MANPADS.  The vulnerabilities of MANPADS and other surface-to-air missiles, as well as their potential to incorporate counter-countermeasures to HELCM systems will also be measured and assessed.  These techniques and measurements will be designed to work in tandem with, and to support, the HELCM prototype subsystems developed under the Budget Activity 3 Excalibur program in PE 0603739E, Project MT-15.\n\nThe Excalibur Budget Activity 2 program will also conduct several analytical studies relevant to scaling and applications of high-efficiency (30% - 40% wall plug efficient) high power electric lasers that will examine: the potential to scale the output power of diode pumped alkali lasers (DPALs) to tactical and strategic levels (100's kW - MW class); the potential for integrating low-cost, high-sensitivity, wide-field-of-view imaging seekers and directional acoustic cueing into locating extended-altitude MANPADS; and the potential to use high power fiber lasers for long range target identification and tracking."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated a 2.5 kW coherently-combinable fiber laser amplifier at electrical efficiencies exceeding 30% and with near-perfect beam divergence.\n-  Initiated the development of advanced packaging, power storage and management, and thermal management and integration techniques needed for the fabrication and testing of a 5 kg\/kW high power laser subsystem and a light-weighted beam control system.\n-  Initiated the development of advanced active target detection, confirmation and tracking techniques to support proactive threat warning and increased precision (<10 micro-radian) fine-tracking needed for HELCM systems relative to the precision (~~milli-radians) required of current Directional Infared Countermeasure (DIRCM) systems.\n-  Established requirements and initiated design of prototype HELCM open architecture subsystems (laser, beam-control, command, threat warning\/lase-quality declaration, lightweight pod).\n-  Identified the requirements and developed conceptual designs for a proactive threat warning capability for HELCM systems.\n-  Conducted further lethality testing to assess vulnerability levels and potential HEL counter-countermeasures (CCMs) of various deployed MANPADS seeker technologies.\n-  Prepared plans and logistics for lethality testing to assess vulnerability levels and potential HEL counter-countermeasures (CCMs) of emerging surface-to-air and air-to-air seeker technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.197"
                                            },
                                            "Text": {
                                                "val": "-  Develop 2.5 kW wavelength combined pump sources with greater than 90% combining efficiency that can be coupled into a 200 micron \/0.15 numerical aperture fiber.\n-  Complete the development of advanced packaging, power storage and management, and thermal management and integration.  Techniques needed for the fabrication and testing of a 5 kg\/kW high power laser subsystem and a light-weight beam control system.\n-  Continue the development of advanced active target detection, confirmation, and tracking techniques to support proactive threat warning and increased precision (<10 micro-radian) fine-tracking needed for HELCM systems relative to the (~milli-radians) requirement of current DIRCM systems.\n-  Complete the design of prototype HELCM open architecture subsystems (laser, beam-control, command, threat warning\/laser-quality declaration, lightweight pod).\n-  Conceptual design study for a proactive threat warning capability for HELCM systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Endurance*"
                                    },
                                    "Description": {
                                        "val": "*Previously part of Excalibur\n\nThe Endurance program will develop technology for pod-mounted lasers to protect a variety of airborne platforms from emerging and legacy EO\/IR guided surface-to-air missiles.  The focus of the Endurance effort under TT-06 will be on miniaturizing component technologies, developing high-precision target tracking, identification, and lightweight agile beam control to support target engagement.  The program will also focus on the phenomenology of laser-target interactions and associated threat vulnerabilities.  This program is an early application of technology developed in the Excalibur program.  Advanced research for the program is budgeted in PE 0603739E, project MT-15."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.470"
                                            },
                                            "Text": {
                                                "val": "Design of subsystems:\n-  Design a miniaturized, flight-traceable, low-maintenance laser having output beam parameters that are consistent with estimated mission-kill requirements.\n-  Design of a light-weight highly-agile beam director and beam control assemblies that support coarse and fine tracking of dynamic targets, target-identification and target-engagement, and that can accommodate additional functions such as ISR and target designation.\n-  Design of a high-precision coarse to fine-track and target identification subsystem.\n-  Develop test plans for laser effects testing and initiate the acquisition of threat devices or the design of surrogate devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.544"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.544"
                                            },
                                            "Text": {
                                                "val": "-  Fabrication, assembly, and test of miniaturized subsystems.\n-  Complete the acquisition of threat devices and\/ or development of surrogate devices for laser effects testing.\n-  Conduct laser effects testing.\n-  Estimate, verify or validate vulnerabilities of threats to specific laser irradiation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "International Space Station SPHERES Integrated Research Experiments (InSPIRE)"
                                    },
                                    "Description": {
                                        "val": "An outgrowth of the Integrated Sensing and Processing program, the International Space Station SPHERES Integrated Research Experiments (InSPIRE) program will utilize the DARPA-sponsored Synchronized Position, Hold, Engage, and Reorient Experimental Satellites (SPHERES) platform, which has flown onboard the International Space Station (ISS) since May 2006, to perform a series of multi-body formation flight experiments that necessitate a medium-duration zero-gravity environment.  The overarching objectives of InSPIRE are twofold:  (1) to leverage the human presence in space for rapid, iterative experimentation and design of DoD-relevant space capabilities, and (2) to provide the next generation of scientists and engineers with experience in carrying out meaningful space experimentation economically, over reasonable time scales.  InSPIRE will enhance the ability to rapidly mature and insert new technologies into national security space assets.  The InSPIRE program will expand on the capabilities developed through SPHERES by developing a SPHERES-II infrastructure, adding arms, manipulator hands, and hard docking ports.  InSPIRE will also design a new generation of Spherelets.  Spherelets development will test satellite constructs where small satellite modules self-assemble into larger operational space structures, such as telescopes.  In addition, the InSPIRE program will continue the SPHERES Zero Robotics Challenge competition among high schools and middle schools across the United States."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "-  Conducted preliminary design review and critical design reviews for ExoSPHERES and the Electromagnetic Formation Flight & Power Transfer Experiment.\n-  Conducted NASA ISS safety reviews for ExoSPHERES.\n-  Conducted NASA ISS safety reviews for the Electromagnetic Formation Flight & Power Transfer Experiment.\n-  Completed Zero Robotics competition.\n-  Completed crowd-sourcing challenge."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct second Zero Robotics competition.\n-  Upgrade online SPHERES simulation to incorporate addition of vision-based navigation and manipulator arms.\n-  Design manipulator arms and hand for SPHERES.\n-  Design hard docking port for SPHERES.\n-  Develop conceptual design for Spherelet self-assembling satellite."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "-  Build manipulator arms and hand for SPHERES.\n-  Build hard docking port for SPHERES.\n-  Continue design of Spherelet self-assembling satellite."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Full Spectrum Learning"
                                    },
                                    "Description": {
                                        "val": "The Full Spectrum Learning program will integrate the findings and discoveries from studies of learning at all levels, e.g., individual, group, societal, to develop an optimal instruction system.  The system will incorporate modern technologies, including machine learning and recommender technology, to identify and suggest optimum teaching methods."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "- Develop system of tools to quantify the learning process and increase training efficacy and efficiency.\n- Utilize sensors for recording of physiologic, environmental, and neurocognitive data.\n- Develop human\/system interfaces with advances in information technology to visualize data and enable feedback.\n- Create analysis tools to integrate information and output predictions and recommendations.\n- Improve models to analytically describe and assess trajectory of learning in individuals and groups."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Liquid Laser Area Defense System (HELLADS)"
                                    },
                                    "Description": {
                                        "val": "The goal of the High Energy Liquid Laser Area Defense System (HELLADS) program is to develop a high-energy laser weapon system (150 kW) with an order of magnitude reduction in weight compared to existing laser systems.  With a weight goal of <5 kg\/kW, HELLADS will enable high energy lasers (HELs) to be integrated onto tactical aircraft, and will significantly increase engagement ranges compared to ground-based systems, enabling high precision, low collateral damage, and rapid engagement of fleeting targets for both offensive and defensive missions.  The HELLADS program has completed the design and demonstration of a revolutionary prototype unit cell laser module.  That unit cell demonstrated power output and is demonstrating optical wavefront performance that supports the goal of a lightweight and compact 150 kW high energy tactical laser weapon system.  Two unit cell module designs with integrated power and thermal management systems were fabricated and tested; they demonstrated an output power exceeding 34 kW.  Based on the results of the unit cell demonstration, additional laser modules will be replicated and connected to produce a 150 kW laser that will be demonstrated in a laboratory environment.  The 150 kW laser will then be integrated with beam control, prime power, thermal management, safety, and command and control subsystems all based upon existing technologies to produce a ground-based laser weapon system field demonstrator.  The capability to shoot down tactical targets such as surface-to-air missiles and rockets and the capability to perform ultra-precise offensive engagements will be demonstrated in a realistic ground test environment.  Additional funding for this integration effort is provided for HELLADS testing in Project NET-01, PE 0603766E.  The HELLADS laser will be transitioned following testing to a tactical platform for performance demonstration of ground, sea, or airborne precision engagements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.723"
                                            },
                                            "Text": {
                                                "val": "-  Continued the fabrication of the 150 kW laser.\n-  Completed planning and preparations to integrate the 150 kW laser with the ground-based demonstrator laser weapon system.\n-  Initiated subsystem testing of the ground-based demonstrator laser weapon system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-07"
                    },
                    "ProjectTitle": {
                        "val": "AERONAUTICS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.699"
                        },
                        "CurrentYear": {
                            "val": "36.106"
                        },
                        "BudgetYearOne": {
                            "val": "25.317"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.317"
                        },
                        "BudgetYearTwo": {
                            "val": "34.437"
                        },
                        "BudgetYearThree": {
                            "val": "69.437"
                        },
                        "BudgetYearFour": {
                            "val": "45.876"
                        },
                        "BudgetYearFive": {
                            "val": "47.245"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Aeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion and vehicle concepts, sophisticated fabrication methods, and examination of novel materials for aeronautic system applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Transformer (TX) Vehicle"
                                    },
                                    "Description": {
                                        "val": "The Transformer (TX) Vehicle program will develop a vertical take-off and landing (VTOL), road-worthy vehicle that can carry a 1,000 lb payload at a range of 250 nautical miles on a single tank of fuel.  With a flyable\/roadable vehicle, the warfighter has the ability to avoid road obstructions as well as improvised explosive devices and ambush threats, providing flexibility for tactical military and personnel transport missions.  The primary focus of this program is to demonstrate the ability to build a ground vehicle that is capable of configuring into a VTOL air vehicle that provides sufficient flight performance and range, while carrying a payload that is representative of four troops with gear.  The enabling technologies of interest include hybrid electric drive, advanced batteries, stowable wing structures, ducted fan propulsion, lightweight materials, and advanced sensors and flight controls for stable transition from vertical to horizontal flight.  TX vehicles could be dispatched for downed airman recovery, for evacuating injured personnel from difficult-to-access locations, or to resupply isolated small units.  TX will also be suitable for enhanced company operations concepts which would provide the warfighter\/team increased situational awareness for operations in an urban environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.700"
                                            },
                                            "Text": {
                                                "val": "-  Conducted preliminary design reviews of TX prototype vehicle.\n-  Completed preliminary detailed vehicle designs that meet program measures of performance.\n-  Completed detailed program plans and costs for the remaining phase.\n-  Integrated critical enabling technology development efforts into overall vehicle development.\n-  Conducted component testing, wind tunnel testing, and static propulsion testing, showing feasibility and function of key technology components.\n-  Initiated risk reduction experiments and modeling to validate design performance.\n-  Tracked traceability of the prototype vehicle to the field vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.493"
                                            },
                                            "Text": {
                                                "val": "-  Finalize analysis, trade studies, and prototype vehicle element designs to meet the program measures of performance.\n-  Conduct powered wind tunnel testing to increase the fidelity of flight control system development and verify vehicle performance simulations, showing feasibility and function of the design.\n-  Conduct key component tests demonstrating feasibility and function.\n-  Conduct component hardware-in-the-loop testing to ensure successful integration of prototype vehicle subsystems.\n-  Conduct critical design review of TX prototype vehicle to ensure it can proceed to fabrication, test, and demonstration.\n-  Prepare test plans for ground and flight test demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.317"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.317"
                                            },
                                            "Text": {
                                                "val": "-  Fabricate custom components, acquire powerplant and drivetrain components.\n-  Conduct component testing and static propulsion testing, showing feasibility and function of critical technology components.\n-  Complete development of flight control software to ensure successful flight and ground testing.\n-  Conduct subsystem testing and integration of components into the full scale prototype TX system.\n-  Complete hardware-in-the-loop and software-in-the-loop testing with fully integrated full scale prototype TX system.\n-  Conduct a test readiness review in preparation for ground and test demonstrations of the prototype vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aeronautics Technologies"
                                    },
                                    "Description": {
                                        "val": "The Advanced Aeronautics Technologies program will examine and evaluate aeronautical technologies and concepts through applied research.  These may include feasibility studies of novel or emergent materials, devices and tactics for both fixed and rotary wing air vehicle applications, as well as manufacturing and implementation approaches.  The areas of interest range from propulsion to control techniques to solutions for aeronautic mission requirements.  The result of these studies may lead to the design, development and improvement of prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed modeling of concepts and architectures.\n-  Conducted enabling technology and sub-system feasibility experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue to perform evaluation studies of emergent technologies.\n-  Initiate conceptual designs and conduct performance trade analyses.\n-  Conduct testing of enabling technology components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue testing of enabling technology components. \n-  Initiate conceptual system design.\n-  Develop technology maturation plan and risk reduction strategy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vertical Take-Off and Landing (VTOL) Technology Demonstrator"
                                    },
                                    "Description": {
                                        "val": "The Vertical Take-Off and Landing (VTOL) Technology Demonstrator program, an outgrowth of the Mission Adaptive Rotor program, will demonstrate revolutionary improvements in (heavier than air) VTOL air vehicle capabilities and efficiencies through the development of subsystem and component technologies, and aircraft configurations and system integration.  The program will lead to ground and flight tests of a technology demonstrator aircraft.  Program goals include demonstrating flight speeds in excess of 300 kts, while simultaneously retaining and proving enhanced hover and hot\/high operation that are key and unique to VTOL flight.  Improvements in aircraft productivity indices that are reflective of meaningful gains in military transport efficiencies of the system will be a key focus of the program.  Considerations will include alternative (for example, non-rotary wing) air vehicle configurations that embrace efficient new designs when addressing lift offset, propulsive compounding, and other solution spaces.  A strong emphasis will be placed on the development of elegant, multi-functional subsystem technologies that demonstrate net improvements in aircraft efficiencies that will be exemplified on the basis of defined productivity metrics.  Additionally, the program will design and demonstrate new concepts of adaptable landing gear to enable operations from irregular landing zones and moving launch\/recovery platforms.  Furthermore, novel electric power generation, motors, and distributed propulsion systems will also be studied in detail for future VTOL applications, including thrust and control authority augmentation, and power on demand.  The VTOL Technology Demonstrator will demonstrate the mission utility of the new technologies to enable previously un-executable missions and new concepts of operation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct concept design studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform complex simulations to baseline expected system level performance and validate the system concept and underlying enabling technologies.\n-  Perform subscale wind tunnel and laboratory testing.\n-  Define software and hardware integration approach and baseline controls necessary for successful air vehicle concept.\n-  Perform preliminary design reviews in support of air vehicle capabilities and flight test definition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Air Dominance Study"
                                    },
                                    "Description": {
                                        "val": "The Next Generation Air Dominance study will define the projected threat domains and capability gaps for the 2020-2050 timeframe.  DARPA will conduct a study of current air dominance efforts in coordination with the United States Air Force and Navy and explore potential technology developmental areas to ensure the air superiority of the United States in the future.  The study will consider roles of manned and unmanned platforms; the relative performance of alternative integrated system of systems concepts that combine various mixes of capabilities networked together; and the cost effectiveness of alternative balances of platforms and systesms that provide surveillance, command and control, electronic warfare, and weapons functions.  Innovative platform concepts for airframe, propulsion, sensors, weapons integration, avionics, and active and passive survivability features will be explored as a central part of the concept definition effort.  This effort will also explore the expanded development and use of automated and advanced aerospace engineering design tools, modeling, and simulation in areas that can increase the likelihood of producing more capable products with improved efficiency.  Following the initial multi-agency study, DARPA will present technical challenges to Industry to allow them to explore and present potential solutions.  Enabling technologies are next generation platforms, advanced networking capabilities, reliable navigation, passive and active defense, electronic attack, area denial, advanced sensors, and cyber technologies.  After the study, it is envisioned that high potential prototype programs will emerge to develop technologies for future air dominance.  Early planning for future technologies will also help to define the funding baselines for DOD research and development and acquisition programs.  This effort will be funded from PE 0602702E, Project TT-07, and from PE 0603286E, Project AIR-01.  Under this PE the study will fund concept and technology development efforts.  Systems efforts will be funded from AIR-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Define projected 2020-2050 threat domains and capability gaps.\n-  Identify funded baseline for DoD efforts for R&D.\n-  Identify high value technologies and prototype opportunities.\n-  Out-brief senior leadership on threat picture and high value opportunities.\n-  In-brief Industry and obtain feedback on potential technology opportunities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate technology and prototype developments.\n-  Conduct Technical Interchange Meeting (TIM) to coordinate between development efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Petrel"
                                    },
                                    "Description": {
                                        "val": "The Petrel program will investigate and develop advanced capabilities for the rapid transport of large quantities of cargo and equipment, such as in support of the deployment of a heavy brigade combat team, from CONUS to the battlefield, reducing the deployment timeline for mechanized land forces and critical supplies anywhere in the world to under 7 days at a price point comparable or slightly in excess of conventional sealift.  Petrel will fill the niche between conventional airlift and sealift through development of a new transportation mode capable of high speed operation across the surface\/air interface over water as well as terrain.  Technical approaches for rapid transport across the ocean and movement from the ship to the tactical battlefield will consider traditional and non-traditional aerodynamic and hydrodynamic concepts as well as innovative uses of existing technologies.  Primary technical goals for Petrel are to reduce or eliminate intermodal delays and to achieve a transport efficiency better than $0.1\/ton-mi."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct studies to refine the operational trade space, define limits of current technology, and inform new technical approaches.\n-  Initiate concept designs focusing on transport efficiency, speed, and producibility.\n-  Investigate component technologies with potential to enable specific concepts, including advanced propulsion and materials.\n-  Explore innovative approaches for significantly increasing lift to drag ratio."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Adaptive Rotor (MAR)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Mission Adaptive Rotor (MAR) program is to develop and demonstrate the capability to achieve dramatic improvements in rotor performance, survivability, and availability through the use of technologies that enable adaptation of the rotor throughout military missions and\/or mission segments and applications of advanced manufacturing technologies to reduce part counts and improve dynamic behavior.  Recent research indicates that significant performance benefits could be achieved by actively morphing the shape or properties of the rotor system; additionally, active rotors with on-blade control could eliminate the need for a rotor swashplate.  Other advanced technologies are also being studied which could lead to improvements in hover and cruise efficiencies, and the elimination of large, open rotor systems all together.  MAR capability will result in dramatic improvements in system performance, operational availability, sustainability, and survivability, including reduction in acoustic susceptibility and rotor vibration while increasing useful payload fraction and range.  The MAR program will design, test, and mature active rotor technologies that enable the effective operation of military rotorcraft in performance-limited environments of high-altitude mountainous terrain and deserts.  The MAR program will also facilitate the development of advanced technologies for application to future vertical take-off and landing (VTOL) class platforms capable of high cruise speed and efficient hover, leading to unsurpassed aircraft performance capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.999"
                                            },
                                            "Text": {
                                                "val": "-  Performed systems requirements and mission analyses to quantify operational MAR objective rotor system capabilities.\n-  Initiated planning for sub-scale ground testing of key MAR demonstration rotor technologies.\n-  Completed conceptual, and initiated detailed, design of hardware for fan-in-wing model wind tunnel test article to study an aerodynamic fairing concept for virtual drag reduction.\n-  Procured hardware in support of sub-scale ground testing of MAR demonstration rotor technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.613"
                                            },
                                            "Text": {
                                                "val": "-  Conduct simulations and subscale wind tunnel and ground-based testing of key technologies to meet MAR objectives.\n-  Design, and demonstrate active retreating side blowing on full-scale rotor blades at the National Full-Scale Aerodynamics Complex (NFAC) wind tunnel.\n- Design, simulate and perform tests of robotic landing gear for rotorcraft to enable uneven terrain and enhanced ship based operations.\n- Conduct simulations, hover tests and force and moment testing of dual plane prop-rotor concept.\n- Perform analysis and simulations of advanced VTOL configurations including fan-in-wing for sizing studies and military utility analysis.\n- Perform wind tunnel testing of a fan-in-wing concept to understand the flow field and possibilities of using the fan as an aerodynamic fairing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-13"
                    },
                    "ProjectTitle": {
                        "val": "NETWORK CENTRIC ENABLING TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.832"
                        },
                        "CurrentYear": {
                            "val": "70.955"
                        },
                        "BudgetYearOne": {
                            "val": "85.602"
                        },
                        "BudgetYearOneBase": {
                            "val": "85.602"
                        },
                        "BudgetYearTwo": {
                            "val": "93.106"
                        },
                        "BudgetYearThree": {
                            "val": "94.318"
                        },
                        "BudgetYearFour": {
                            "val": "95.210"
                        },
                        "BudgetYearFive": {
                            "val": "97.115"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Network Centric Enabling Technology project develops network-centric mission applications that integrate information arising from: 1) sensors and signal\/image processors; 2) collection platforms and weapon systems; 3) intelligence networks; and 4) open and other external sources.  Technical challenges include the need to process huge volumes of diverse, incomplete, and uncertain data streams in tactically-relevant timeframes.  Processing here includes a number of critical steps including conditioning of unstructured data, content analysis, behavioral modeling, pattern-of-life characterization, economic activity analysis, social network analysis, anomaly detection, and visualization.  Operational benefits include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon.  Promising technologies are evaluated in the laboratory and demonstrated in the field to facilitate transition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nexus 7"
                                    },
                                    "Description": {
                                        "val": "The Nexus 7 program applies forecasting, data extraction, and analysis methodologies to develop tools, techniques, and frameworks for the automated interpretation, quantitative analysis, and visualization of social networks.  Social network theory has emerged in recent years as a promising approach for understanding groups of individuals connected through a variety of shared interests and collaborative activities.  For the military, social networks provide a promising model for understanding terrorist cells, insurgent groups, and other stateless actors whose connectedness is established not on the basis of shared geography but rather through the correlation of their participation in coordinated activities such as planning meetings, training\/mission rehearsal sessions, sharing of materiel\/funds transfers, etc.  Nexus 7 supports emerging military missions using both traditional and non-traditional data sources for those areas of the world and mission sets with limited conventional Intelligence, Surveillance and Reconnaissance.  Examples of additional data sources include foreign news, media, and social network data.  These non-traditional sources will be integrated with a wide variety of military structured and unstructured data.  Nexus 7 will develop quantitative techniques and tools for processing and analyzing these large data sources as a means for understanding relationships between hostile, neutral, and friendly foreign organizations with the United States."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.605"
                                            },
                                            "Text": {
                                                "val": "-  Developed techniques for simulation, visualization, inference, and prediction of quantitative indicators of regional stability.\n-  Evaluated tools and techniques on real-world social-cultural-network data.\n-  Provided quick-response reach-back analytic capability to forward command echelons.\n-  Began transition of a suite of algorithms, software, and tools throughout DoD including Distributed Common Ground System (DCGS)-Army and NSA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.712"
                                            },
                                            "Text": {
                                                "val": "-  Provide additional quick-response reach-back analytic capability to forward command echelons.\n-  Extend algorithms, tools, and methodologies to address new datasets and new formats applicable to other national security interests.\n-  Develop techniques for processing timely, relevant information from traditional and non-traditional data streams that may be incomplete and\/or inaccurate.\n-  Transition enhanced algorithms, software, and tools throughout DoD including DCGS-Army and NSA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.034"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.034"
                                            },
                                            "Text": {
                                                "val": "-  Develop quantitative techniques and tools for processing, analyzing, and visualizing increasingly large volumes of cyber-social data.\n-  Create and deploy analytics for emerging DoD mission areas to Combatant Commands and other U.S. Government agencies.  \n-  Transition suite of algorithms, software, and tools throughout DoD including DCGS-Army and NSA."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "XDATA*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Network Flow Analytics \n\nThe XDATA program seeks to develop computational techniques and software tools for analyzing large volumes of data, both semi-structured (e.g., tabular, relational, categorical, meta-data, spreadsheets) and unstructured (e.g., text documents, message traffic).  Central challenges to be addressed include a) developing scalable algorithms for processing imperfect data in distributed data stores, and b) creating effective human-computer interaction tools for facilitating rapidly customizable visual reasoning for diverse missions.  The program will develop open source software toolkits that enable flexible software development supporting users processing large volumes of data in timelines commensurate with mission workflows of targeted defense applications.  An XDATA framework will support minimization of design-to-deployment time of new analytic and visualization technologies on diverse distributed computing platforms, and also accommodate changing problem spaces and collaborative environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.275"
                                            },
                                            "Text": {
                                                "val": "-  Explore scalable methods for processing vast amounts of incomplete and imperfect data.\n-  Develop a baseline of open source analytics and visualization technologies for large data processing.\n-  Initiate development of a framework for rapid composition of large data processing systems with advanced analytics and visualization for diverse missions and diverse platforms.\n-  Demonstrate proof-of-concept system on sample open source data.\n-  Engage DoD users for feedback on proof-of-concept prototypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.800"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of a framework for processing data from diverse sources with advanced analytics and visualization for diverse missions and diverse platforms.\n-  Develop and demonstrate analytic tools on petabyte scale.\n-  Develop adaptive visualization methods for large data for varying users and contexts.\n-  Demonstrate end-to-end systems in transactional problem domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visual Media Reasoning (VMR)*"
                                    },
                                    "Description": {
                                        "val": "*Previously funded in PE 0602305E, Project MCN-01.\n\nThe Visual Media Reasoning (VMR) program will create technologies to automate the analysis of enemy-recorded photos and videos and identify, within minutes, key information related to the content.  This will include the identification of individuals within the image (who), the enumeration of the objects within the image and their attributes (what), and the image's geospatial location and time frame (where and when).  Large data stores of enemy photos and video are available but cannot be easily leveraged by a warfighter or analyst attempting to understand a specific new image in a timely fashion.  The VMR program will enable users to gain insights rapidly through application of highly parallelized image analysis techniques that can process the imagery in massive distributed image stores.  VMR technology will serve as a force-multiplier by rapidly and automatically extracting tactically relevant information for the human analyst and alerting the analyst to scenes that warrant the analyst's expert attention."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.192"
                                            },
                                            "Text": {
                                                "val": "-  Refine the user interface as well as the accuracy and performance of the system based on warfighter\/analyst user group input.\n-  Demonstrate an image indexing scheme that enables the efficient search of large image datasets (hundreds of thousands of images).\n-  Continue to refine the core VMR reasoning engine to process and fuse the outputs of scores of heterogeneous computer vision algorithms during a single query.\n-  Demonstrate tactical machine learning on problems such as image search, activity recognition, pattern-of-life analysis, and autonomous navigation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.768"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.768"
                                            },
                                            "Text": {
                                                "val": "-  Establish formal Memorandum of Understanding with at least one DoD\/IC transition partner. \n-  Optimize the core VMR reasoning engine to make reliable inferences across the Who, What, Where and When domains to produce more accurate answers to user queries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Probabilistic Programming for Advancing Machine Learning (PPAML)"
                                    },
                                    "Description": {
                                        "val": "The Probabilistic Programming for Advancing Machine Learning (PPAML) program will create an advanced computer programming capability that greatly facilitates the construction of new machine learning applications in a wide range of domains.  This capability would increase the number of people who could effectively contribute, would make experts more productive, and would enable the creation of new tactical applications that are inconceivable given today's tools.  The key enabling technology is a new programming paradigm called probabilistic programming that facilitates the management of uncertain information.  In this approach, developers will use the power of a modern (probabilistic) programming language to quickly build a generative model of the phenomenon of interest as well as queries of interest, which a compiler will convert into an efficient application.  PPAML technologies will be designed for application to a wide range of military domains including ISR exploitation, robotic and autonomous system navigation and control, weather prediction, and medical diagnostics."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Design and build the front end of a probabilistic programming system that enables users from a range of skill levels to construct concise but useful models that can be solved effectively.\n-  Design and build the back end of a probabilistic programming system that takes as input expressive models written in a probabilistic programming language, queries, and prior data and produces as output an efficient implementation with predictable performance.\n-  Identify and develop challenge problems from various military domains, including collecting and making available sample data of appropriate size."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manned-Unmanned Collaborative Autonomy"
                                    },
                                    "Description": {
                                        "val": "Currently most autonomous unmanned systems, from robots for IED operations to sophisticated drones, are actually operated with supervised autonomy with one or more humans \"in-the-loop\" for every unmanned system.  This prevents humans from effectively performing their mission while also directing the operations of unmanned teammates, thereby negating the force multiplication potential of robotics.   The Manned-Unmanned Collaborative Autonomy program will develop concepts and implementing software for a truly shared autonomy - human \"on-the-loop\" - in which multiple unmanned systems can perform missions with minimal guidance from, and limited cognitive interference with, a single human operator in conventional arenas, such as air or ground, as well as atypical environments such as littoral waters. Approaches to develop shared autonomy will build on past successes in a range of efforts, including pilot-on-the-loop simulations under the past DARPA Unmanned Combat Air Rotor (UCAR) and Unmanned Combat Air Vehicle (UCAV) efforts as well as the significant progress made in DARPA's Warfighter Under Stress program."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop architecture for manned-unmanned collaborative autonomy.\n-  Develop underlying technologies for collaborative autonomy, such as mission planning using commander's intent. \n-  Develop a simulation environment in parallel with technology development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mind's Eye*"
                                    },
                                    "Description": {
                                        "val": "* Previously funded in PE 0602305E, Project MCN-01.\n\nThe Mind's Eye program is developing a machine-based capability to learn generative representations of action between objects in a scene, directly from visual inputs, and then to reason over those learned representations.  Mind's Eye will create the perceptual and cognitive underpinnings for reasoning about the action in scenes, enabling the generation of a narrative description of the action taking place in the visual field.  The technologies developed under Mind's Eye have applicability in automated ground-based surveillance systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.776"
                                            },
                                            "Text": {
                                                "val": "-  Develop selected visual intelligence capabilities and integrate in a prototype smart camera system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Video and Image Retrieval and Analysis Tool (VIRAT)"
                                    },
                                    "Description": {
                                        "val": "The Video and Image Retrieval and Analysis Tool (VIRAT) program developed and demonstrated a system for video data exploitation that enables an analyst to rapidly find video content of interest from archives and provides alerts to the analyst of events of interest during live operations.  The ability to quickly search large volumes of existing video data and monitor real-time video data for specific activities or events provides a new capability to the U.S. military and intelligence agencies.  Currently, video analysis is very labor intensive, limited to metadata queries, manual annotations, and \"fast-forward\" examination of clips.  The software tools developed under VIRAT radically improve the analysis of huge volumes of video data by: 1) alerting operators when specific events or activities occur at specific locations or over a range of locations and; 2) enabling fast, content-based searches of existing video archives.  The final products of the VIRAT program have been transitioned to the Distributed Common Ground System (DCGS) - Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.574"
                                            },
                                            "Text": {
                                                "val": "-  Initiated technologies to accommodate stationary, ground-mounted video sources.\n-  Continued development and optimization of technologies to accommodate larger datasets.\n-  Tested and evaluated performance of the system against an experienced analyst's performance.\n-  Completed a second phase of evaluation by Air Force Electronic Systems Center for potential transition into Air Force DCGS.\n-  Executed an Memorandum of Agreement to transition technologies and software to DCGS-A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extreme Accuracy Tasked Ordnance (EXACTO)"
                                    },
                                    "Description": {
                                        "val": "The Extreme Accuracy Tasked Ordnance (EXACTO) program demonstrated the ability to engage targets at extremely long ranges, regardless of target motion or crosswinds, with previously unachievable accuracy.  The EXACTO system is comprised of an advanced targeting optic, the first ever guided, power-generating, small caliber bullet, innovative guidance and control software, and a conventional sniper rifle.  The EXACTO 50-caliber bullet and brass-board optical sighting technology greatly extends the day and night ranges over current state-of-the-art sniper systems allowing sniper teams to engage tactically important moving targets including accelerating vehicle-borne targets, in high crosswind conditions.  EXACTO enhances survivability by allowing greater shooter standoff range and reduces target engagement timelines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.245"
                                            },
                                            "Text": {
                                                "val": "-  Integrated updated version of the enhanced breadboard targeting optic device.\n-  Completed multiple rounds of live fire testing to optimize bullet configuration.\n-  Updated guidance and control algorithms to support performance metrics.\n-  Held test readiness review in preparation for live fire demonstration.\n-  Completed live fire demonstration of on-board power generation, processor power-up, and software initiation.\n-  Coordinated with potential transition partners across the Services and Special Forces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Crisis Early Warning System (ICEWS)"
                                    },
                                    "Description": {
                                        "val": "The Integrated Crisis Early Warning System (ICEWS) program developed and integrated a set of data analysis tools into a unified information system to support Theater Security Cooperation.  The ICEWS system monitors, assesses, and forecasts leading indicators of events that make countries vulnerable to crises.  ICEWS technologies include quantitative and computational social science modeling and simulation, scenario generation, ontological modeling of security problems, advanced interactive visualization techniques, and agent-based programming.  ICEWS technologies were successfully transitioned to operations at several commands."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.408"
                                            },
                                            "Text": {
                                                "val": "-  Created an automated system to parse news reports, identify key stability drivers, and monitor, assess, and forecast de-stabilizing events in near real time.   \n-  Transitioned ICEWS components to USSTRATCOM, USPACOM, and USSOUTHCOM."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}