{
    "id": "f449bccc6b6c15c851a1236985a0479f41eed347",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DARPA_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0601117E"
        },
        "ProgramElementTitle": {
            "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
        },
        "R1LineItemNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "44.445"
            },
            "CurrentYear": {
                "val": "39.676"
            },
            "BudgetYearOne": {
                "val": "49.500"
            },
            "BudgetYearOneBase": {
                "val": "49.500"
            },
            "BudgetYearTwo": {
                "val": "51.500"
            },
            "BudgetYearThree": {
                "val": "53.500"
            },
            "BudgetYearFour": {
                "val": "53.500"
            },
            "BudgetYearFive": {
                "val": "53.500"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Basic Operational Medical Science Program Element is budgeted in the Basic Research Activity because it will explore and develop basic research in medical-related information and technology leading to fundamental discoveries, tools, and applications critical to solving DoD challenges.  Programs in this project address the Department's identified medical gaps in taking care of the warfighter such as blast-induced traumatic brain injury.  Efforts will draw upon the information, computational modeling and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  This project will establish a fundamental understanding of brain function, short-term memory and the mechanism(s) of injury induced by exposure to blast.  Basic research that aims at new methods and medical devices includes the ability to perform in-theater, continuous analysis of a warfighter's health as a preventative measure to mitigate widespread disease and development of biomaterials that allow long-term interfaces with neural tissue, electronics that provide sound attenuation and processes to remove harmful bacteria and their toxins in blood to prevent sepsis."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.870"
                },
                "CurrentYear": {
                    "val": "39.676"
                },
                "BudgetYearOne": {
                    "val": "45.500"
                },
                "BudgetYearOneBase": {
                    "val": "45.500"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "44.445"
                },
                "CurrentYear": {
                    "val": "39.676"
                },
                "BudgetYearOne": {
                    "val": "49.500"
                },
                "BudgetYearOneBase": {
                    "val": "49.500"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "6.575"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.000"
                },
                "BudgetYearOneBase": {
                    "val": "4.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "7.574"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.999"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Increase reflects an internal below threshold reprogramming offset by the SBIR\/STTR transfer.\nFY 2014:  Increase reflects increased activities in the Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MED-01"
                    },
                    "ProjectTitle": {
                        "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "44.445"
                        },
                        "CurrentYear": {
                            "val": "39.676"
                        },
                        "BudgetYearOne": {
                            "val": "49.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.500"
                        },
                        "BudgetYearTwo": {
                            "val": "51.500"
                        },
                        "BudgetYearThree": {
                            "val": "53.500"
                        },
                        "BudgetYearFour": {
                            "val": "53.500"
                        },
                        "BudgetYearFive": {
                            "val": "53.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Operational Medical Science Program Element is budgeted in the Basic Research Activity because it will explore and develop basic research in medical-related information and technology leading to fundamental discoveries, tools, and applications critical to solving DoD challenges.  Programs in this project address the Department's identified medical gaps in taking care of the warfighter such as blast-induced traumatic brain injury.  Efforts will draw upon the information, computational modeling and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  This project will establish a fundamental understanding of brain function, short-term memory and the mechanism(s) of injury induced by exposure to blast.  Basic research that aims at new methods and medical devices includes the ability to perform in-theater, continuous analysis of a warfighter's health as a preventative measure to mitigate widespread disease and development of biomaterials that allow long-term interfaces with neural tissue, electronics that provide sound attenuation and processes to remove harmful bacteria and their toxins in blood to prevent sepsis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Assisted Neural Devices"
                                    },
                                    "Description": {
                                        "val": "The Human Assisted Neural Devices program will develop the scientific foundation for understanding the language of the brain for application to a variety of emerging DoD challenges, including improving performance on the battlefield and returning active duty military to their units after injury.  This will require an understanding of neuroscience, significant computational efforts, and new material design and implementation.  Key advances expected from this research include determining the nature and means through which short-term memory is encoded, and discovering the mechanisms and dynamics underlying neural computation and reorganization.  These advances will enable memory restoration through the use of devices programmed to bridge gaps in the injured brain.  Further, modeling of the brain will progress to an unprecedented level with this novel approach. A key aspect of this effort will be to develop non-invasive bioimaging techniques that are capable of rapid analysis and interpretation of brain tissue alterations including new methods of analysis and interpretation for measuring brain tissue alterations at the cellular scale."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.934"
                                            },
                                            "Text": {
                                                "val": "-  Assessed consistency of encoding long-term memory through use of patterned neural stimulation in pre-clinical models. \n-  Identified homogeneity of neural codes involving long-term memory in preclinical studies conducting various long-term memory tasks. \n-  Continued development of  wireless neural interface for online, closed loop recovery of long-term memory encoding and retrieval in pre-clinical studies.\n-  Demonstrated that networks of neurons can be differentially modulated through optogenetic neural stimulation in in animal models.\n-  Used neuroimaging methods to model connectivity among different areas of the brain.\n-  Evaluated the ability to model multi-scale brain recording and imaging data in order to accurately predict underlying spiking behavior of groups of neurons.\n-  Investigated the ability in animal models to engage in virtual sensorimotor tasks through the use of recorded neural signals.\n-  Demonstrated ability of non-human primates to evaluate and make use of auxiliary sensory information provided solely through a neural interface."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.176"
                                            },
                                            "Text": {
                                                "val": "-  Expand suite of tools and methods to enable optogenetic neuromodulation of specific, diverse neural populations in animal models.\n-  Demonstrate the ability of non-human primates to perform a dexterous sensorimotor task using only auxiliary sensory information provided through a neural interface. \n-  Develop models that predict the evolution of neural firing patterns following brain injury, and following the introduction of artificial neural connections aimed at facilitating recovery."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the ability of non-human primates to perform a dexterous sensorimotor task through the use of a neural interface, without the use of neural spike recordings. \n-  Develop new methods of analysis and interpretation for measuring brain tissue alterations without the need for image reconstruction.\n-  Develop novel technologies, such as optical\/non-optical tools and cellular dyes, to detect the functional dynamics of a cell or a group of cells in the tissues and organs of a living organism in a non-invasive manner.  \n-  Develop methods of data analysis and interpretation that will allow the mathematical characterization of normal and abnormal cellular processes in situ."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT)"
                                    },
                                    "Description": {
                                        "val": "The Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program will develop the underlying technologies to rapidly respond to a disease or threat and improve individual readiness and total force health protection by providing capabilities, which are currently available only in centralized laboratories in the U.S., to non-tertiary care and individual settings.  ADEPT will develop and exploit synthetic biology for the in vivo creation of nucleic acid circuits that continuously and autonomously sense and respond to changes in physiologic state and for novel methods to target delivery, enhance immunogenicity, or control activity of vaccines, potentially eliminating the time to manufacture a vaccine ex vivo.  ADEPT advancements to control cellular machinery include research to optimize orthogonality and modularity of genetic control elements; identify methods to increase sensitivity and specificity; and demonstrate methods to control cellular machinery in response to changes in physiological status.  ADEPT will develop methodologies for measuring health-specific biomarkers from a collected biospecimen to enable diagnostics at the point-of-need or resource limited clinical facilities (point-of-care), in-garrison or deployed.  Additionally, ADEPT will develop techniques that will enable the rapid establishment of transient immunity through stimulation of the production of components of the immune system to impart effective but temporary protection.  This transient immunity would bridge the time gap between the delivery of a vaccine and the development of a long term protective immune response.  Applied research efforts are budgeted in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.511"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of modular and orthogonal nucleic acid-based elements for application within a sense-and-respond circuit operating within the context of a mammalian cell.\n-  Investigated controlled expression in mammalian cells of synthetic circuit that responds to physiological biomarkers associated with health status.\n-  Developed novel concepts and molecular approaches to enable deployable diagnostics.\n-  Developed novel reagents and materials for stabilizing self-collected biospecimens at room temperature for simple shipment and storage.\n-  Developed methods for sample preparation that require no operator manipulation and are consistent with point-of-need and point-of-care settings.\n-  Developed new methods for signal amplification amenable to deployable diagnostics.\n-  Investigated the ability of administered synthetic oligonucleotides to direct cells to produce elements of the immune response."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate development of modular and orthogonal nucleic acid-based elements for application within a sense-and-respond circuit that operates within the context of a mammalian cell.\n-  Demonstrate controlled expression in mammalian cells of synthetic circuit that responds to physiological biomarkers associated with health status.\n-  Quantify sensitivity and specificity of developed molecular approaches designed for deployable diagnostics using physiological concentrations of clinically relevant analytes in complex biospecimens.\n -  Quantify performance of biostabilization reagents\/materials to evaluate analytical recovery of clinically relevant molecules as compared to traditional stabilization methods that require cold-chain storage.\n-  Quantify performance of methods for room temperature analyses and reagent stabilization to demonstrate analytical results with similar-to-enhanced performance as compared to current laboratory methods for clinical diagnostics.\n -  Quantify detection limits achieved with signal amplification methods to demonstrate performance superior to current state of the art methods for quantification of low abundance biomarkers in an actionable timeframe.\n-  Demonstrate performance of new sample preparation methods suitable for simple and multiplexed analysis of biospecimens that are either self-collected under low-resource settings or collected by trained professionals at the physician-office settings.\n-  Design integration of developed diagnostic methodologies.\n-  Quantify the level of antibody and immunoadhesin production directed by the administration of synthetic oligonucleotides in comparison to standard vaccine delivery.\n-  Investigate the impact of the antibody sequence on the therapeutic strength of immune response in vivo."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate in mammalian cells the function of a synthetic circuit that can integrate multiple signals associated with health status and respond with a targeted change in cell function.\n-  Demonstrate the ability to generate synthetic nucleic acid and protein circuit components that respond to an exogenously supplied small molecule drug trigger.\n-  Demonstrate in mammalian cells the function of an orthogonal, multi-functional nucleic acid-based circuit with sense-and-respond functionality that responds to biomarkers of cell state.\n-  Refine developed molecular approaches and develop targeted molecular assays designed for deployable diagnostics.\n-  Demonstrate biostabilization reagents\/materials with numerous biospecimen types and processing\/fluidic approaches to be eventually integrated into disposable and on-person diagnostic devices.\n-  Demonstrate methods for room temperature analyses and reagent stabilization with numerous biospecimen types and fluidic approaches to permit collection and transport of patient samples for diagnostic analysis.\n-  Demonstrate signal amplification methods in conjunction with processing\/assay methods.\n-  Demonstrate developed sample preparation methods in conjunction with simple and multiplexed analysis of biospecimens representative of those either self-collected under low-resource settings or collected by trained professionals at the physician-office settings to assist the diagnosis of an individual.\n-  Demonstrate delivery of synthetic oligonucleotide constructs to cells appropriate to produce an antibody response.\n-  Demonstrate antibody and immunoadhesin production targeted to specific disease classes.\n-  Optimize antibody sequence  for maximal therapeutic strength of immune response in vivo."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dialysis-Like Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Sepsis, a bacterial infection of the blood stream, is a significant cause of injury and death among combat-injured soldiers.  The goal of this program is to develop a portable device capable of controlling relevant components in the blood volume on clinically relevant time scales.  Reaching this goal is expected to require significant advances in sensing in complex biologic fluids, complex fluid manipulation, separation of components from these fluids, and mathematical descriptions capable of providing predictive control over the closed loop process.  The envisioned device would save the lives of thousands of military patients each year by effectively treating sepsis and associated complications.\n\nInitial basic research will develop the component technologies that will ultimately make up the integrated device. Included in this effort will be the development of non-fouling continuous sensors for complex biological fluids; design of high-flow microfluidic structures that do not require the use of anticoagulation; development of intrinsic separation technologies that do not require pathogen specific molecular labels or binding chemistries; and predictive modeling and control (mathematical formalism) with sufficient fidelity to enable agile adaptive closed-loop therapy.  Applied research efforts are budgeted in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Achieved detection over 10 days of ricin toxin B chain in whole blood using a surface enhanced Raman spectroscopy (SERS) substrate functionalized with degradation-resistant aptamers.\n-  Flowed whole blood at 3 L\/hr for 60 minutes without clotting in specially functionalized medical tubing.\n-  Removed > 80% of pathogens and inflammatory molecules from flowing blood using label-free separation technologies.\n-  Improved the outcome of 7x more virtual patients as compared to static treatment using a 4-state predictive control model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Improve sensing technologies to achieve continuous detection of pathogens and biomolecules in flowing blood, blood components, and wound fluid.\n-  Refine microfluidic architectures and coatings for continuous blood flow without platelet activation or clotting.\n-  Enhance label-free separation technologies to successfully remove pathogens and select bioagents from blood or blood components.\n-  Validate the sepsis predictive modeling using data from small animal testing within the program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}