{
    "id": "f58a4ed23c1c94c6b9614a6b6ce8398817115614",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605790D8Z"
        },
        "ProgramElementTitle": {
            "val": "Small Business Innovation Research (SBIR)\/Small Business Technology Transfer (STTR) Administration"
        },
        "R1LineItemNumber": {
            "val": "158"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "1.911"
            },
            "CurrentYear": {
                "val": "1.857"
            },
            "BudgetYearOne": {
                "val": "1.868"
            },
            "BudgetYearOneBase": {
                "val": "1.868"
            },
            "BudgetYearTwo": {
                "val": "1.907"
            },
            "BudgetYearThree": {
                "val": "2.532"
            },
            "BudgetYearFour": {
                "val": "2.573"
            },
            "BudgetYearFive": {
                "val": "2.623"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "(U) This Program Element (PE) provides funding for the administration of the Department of Defense (DoD) Small Business Innovation Research (SBIR) Program and the Small Business Technology Transfer (STTR) Program.  The SBIR\/STTR Program funds over one billion dollars annually in mission oriented research and development projects at small technology companies. The purpose of the program is to stimulate technological innovation, increase private sector commercialization of Federal R&D, increase small business participation in Federally funded R&D, foster participation by minority and disadvantaged firms in technological innovation, and foster cooperative research & technology transfer between small business and research institutions. The SBIR\/STTR Program is codified in 15 USC 638. The SBIR\/STTR Program competitively funds scientific and technical innovation to specifically address the needs of participating DoD components.\n\n(U) DoD components participating in the SBIR Program include the: Army, Navy, Air Force, Defense Advanced Research Projects Agency (DARPA), Missile Defense Agency (MDA), Defense Threat Reduction Agency (DTRA), U.S. Special Operations Command (SOCOM), Joint Science & Technology Office for Chemical & Biological Defense (CBD), National Geospatial-Intelligence Agency (NGA), the Defense Logistics Agency (DLA), the Defense Microelectronics Activity (DMEA), the Defense Health Program (DHP) and the Office of Secretary of Defense (OSD) through the Assistant Secretary of Defense for Research & Engineering. DoD components participating in the STTR Program include the: Army, Navy, Air Force, DARPA, MDA, and OSD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.854"
                },
                "CurrentYear": {
                    "val": "1.857"
                },
                "BudgetYearOne": {
                    "val": "1.868"
                },
                "BudgetYearOneBase": {
                    "val": "1.868"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.911"
                },
                "CurrentYear": {
                    "val": "1.857"
                },
                "BudgetYearOne": {
                    "val": "1.868"
                },
                "BudgetYearOneBase": {
                    "val": "1.868"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.057"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.057"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P518"
                    },
                    "ProjectTitle": {
                        "val": "SBIR\/Challenge Admin"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.911"
                        },
                        "CurrentYear": {
                            "val": "1.857"
                        },
                        "BudgetYearOne": {
                            "val": "1.868"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.868"
                        },
                        "BudgetYearTwo": {
                            "val": "1.907"
                        },
                        "BudgetYearThree": {
                            "val": "2.532"
                        },
                        "BudgetYearFour": {
                            "val": "2.573"
                        },
                        "BudgetYearFive": {
                            "val": "2.623"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "(U) The SBIR\/STTR Program is executed in three phases. The purpose of Phase I is to determine, insofar as possible, the scientific technical and commercial merit, and feasibility of ideas submitted under the SBIR\/STTR Program. Phase II awards are made to firms that have been awarded a Phase I contract on the basis of the results of their Phase I effort and the scientific, technical, and commercial merit of the Phase II proposal. Phase II is the principal research or research and development effort and is expected to produce a well-defined deliverable prototype. Phase III SBIR\/STTR efforts derive from, extend or conclude Phase I or Phase II efforts, and are not funded with SBIR\/STTR funds. Under Phase III, companies participating in the SBIR\/STTR Program are expected to obtain funding from the private sector and\/or non-SBIR\/STTR government sources to develop the prototype into a viable product or non-R&D service for sale in military and\/or private sector markets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIR\/Challenge Admin"
                                    },
                                    "Description": {
                                        "val": "(U) Public law mandating the SBIR\/STTR Programs prohibits the use of the SBIR\/STTR budget to fund administrative costs of the program, therefore program element (PE) 0605790D8Z is the only source of funds for the coordination, administration and execution of the Department's SBIR\/STTR Programs. In addition to funding costs for program administration, coordination and execution, PE 0605790D8Z funds essential elements of the SBIR\/STTR Program that are required by law including: \n(1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation SBIR\/STTR R&D solicitations, and receipt of proposal responses; \n(2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle including the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Department's SBIR\/STTR Programs; \n(3) Implement an aggressive outreach program including the execution of two conferences and outreach to small technology companies, potential investors in such companies, SDBs WOSBs HBCU\/MIs and others, to facilitate participation in the SBIR\/STTR Programs; \n(4) Coordinate oversight, collect results, track execution and provide reporting of Phase II technology transition in support of the DoD SBIR Commercialization Pilot  and Commercialization Readiness Program (CPP\/CRP); and \n(5) Prepare all reports mandated by law and policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.911"
                                            },
                                            "Text": {
                                                "val": "(U) The execution of the FY 2012 DoD SBIR\/STTR budget between 13 DoD Components and the following specific activities:\n1) Coordinated and executed the administrative portions of the DoD SBIR\/STTR Programs including the receipt and approval of over 600 technical topics, the preparation of five solicitations, and the receipt and processing of over 5,000 proposals;  \n2) Maintained and modified ten databases and two web sites essential to the management and administration of the program; \n3) Planned and executed one government training conference for approximately 300 attendees and one commercialization conference for approximately 400 attendees to promote the transition of small business developed SBIR\/STTR technology; \n4) Coordinated oversight, collected results, and tracked execution of Phase III technology transition in support of the DoD SBIR Commercialization Pilot Program (CPP) (section 252 of the NDAA for FY 2006); and \n5) Prepared the following reports as mandated by law and\/or policy:  SBIR\/STTR Annual, Energy Independence Act, Nanotechnology, Manufacturing and Commercialization Pilot Program (CPP)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.857"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2013 plan includes program administration, coordination and execution of the DoD SBIR\/STTR Program.  Specifically, manage the execution of the FY 2013 DoD SBIR\/STTR budget between 13 DoD Components to include:\n(1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation SBIR\/STTR R&D solicitations, and receipt of proposal responses; \n(2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle including the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Department's SBIR\/STTR Programs; \n(3) Implement an aggressive outreach program including the execution of two conferences and outreach to small technology companies, potential investors in such companies, SDBs WOSBs HBCU\/MIs and others, to facilitate participation in the SBIR\/STTR Programs; \n(4) Coordinate oversight, collect results, track execution and provide reporting of Phase II technology transition in support of the DoD SBIR Commercialization Readiness Program (CRP); and \n(5) Prepare all reports mandated by law and policy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.868"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.868"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2014 plan includes program administration, coordination and execution of the DoD SBIR\/STTR Program.  Specifically, manage the execution of the FY 2014 DoD SBIR\/STTR budget between 13 DoD Components to include:\n(1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation SBIR\/STTR R&D solicitations, and receipt of proposal responses; \n(2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle including the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Department's SBIR\/STTR Programs; \n(3) Implement an aggressive outreach program including the execution of two conferences and outreach to small technology companies, potential investors in such companies, SDBs WOSBs HBCU\/MIs and others, to facilitate participation in the SBIR\/STTR Programs; \n(4) Coordinate oversight, collect results, track execution and provide reporting of Phase II technology transition in support of the DoD SBIR Commercialization Readiness Program (CRP); and \n(5) Prepare all reports mandated by law and policy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "(U) Performance is in support of the administration of the program and compliance with statutory requirements.  \n\n(U) For PE 0605790D8Z, management and administration of the DoD SBIR\/STTR Programs, the following measures have been established to meet requirements as mandated by law:  1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs, especically the creation of the five solicitions; 2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle; 3) Develop and conduct an aggressive outreach program, especially the planning and execution of one government training workshop and one small business conference; 4) Coordinate oversight, collect results, track execution and provide reporting of Phase III technology transition management and support of the DoD SBIR Commercialization Readiness Program; and 5) Prepare all reports required of the SBIR\/STTR Programs as mandated by law and policy."
                        }
                    }
                }
            ]
        }
    }
}