{
    "id": "f8c8149ddde4c0b2c7c02f464de1a434520db019",
    "meta": {
        "filename": "dod-2014_RDTE_2014_NAVY_BA1_3_RDTE_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603123N"
        },
        "ProgramElementTitle": {
            "val": "Force Protection Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "41.666"
            },
            "CurrentYear": {
                "val": "18.616"
            },
            "BudgetYearOne": {
                "val": "28.328"
            },
            "BudgetYearOneBase": {
                "val": "28.328"
            },
            "BudgetYearTwo": {
                "val": "32.354"
            },
            "BudgetYearThree": {
                "val": "35.048"
            },
            "BudgetYearFour": {
                "val": "35.699"
            },
            "BudgetYearFive": {
                "val": "17.054"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Advanced Technology Development (PE 0603673N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.3 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011). This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century. The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nThis PE addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This program supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial and air) and the protection of those platforms. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "45.020"
                },
                "CurrentYear": {
                    "val": "18.616"
                },
                "BudgetYearOne": {
                    "val": "28.540"
                },
                "BudgetYearOneBase": {
                    "val": "28.540"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "41.666"
                },
                "CurrentYear": {
                    "val": "18.616"
                },
                "BudgetYearOne": {
                    "val": "28.328"
                },
                "BudgetYearOneBase": {
                    "val": "28.328"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.354"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.212"
                },
                "BudgetYearOneBase": {
                    "val": "-0.212"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.992"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.362"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.212"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.212"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2912"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "39.273"
                        },
                        "CurrentYear": {
                            "val": "16.062"
                        },
                        "BudgetYearOne": {
                            "val": "25.738"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.738"
                        },
                        "BudgetYearTwo": {
                            "val": "29.730"
                        },
                        "BudgetYearThree": {
                            "val": "32.375"
                        },
                        "BudgetYearFour": {
                            "val": "32.974"
                        },
                        "BudgetYearFive": {
                            "val": "14.280"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This project supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "FLEET FORCE PROTECTION AND DEFENSE AGAINST UNDERSEA THREATS"
                                    },
                                    "Description": {
                                        "val": "Fleet Force Protection and Defense against Undersea Threats addresses efforts that include applied research for complementary sensor and processing technologies for platform protection and shipboard technologies to increase the survivability of surface ship and submarine platforms against torpedo threats. \n\nThe first major goal of this activity is to develop complementary sensor and processing technologies for 21st century warfighting success and platform protection.  Current small platforms (both surface and airborne) have little or no situational awareness (SA) or self-protection against air, surface, and asymmetric threats.  This activity will provide tactical aircraft (TACAIR) and other platforms with effective threat warning and self-protection.  The technology areas specific to platform protection will develop individual or multi-spectral [Electro-Optic (EO), IR, radio frequency (RF), EM, visual, and acoustic] sensors and associated processing.  To defend platforms from current and advanced threats in at-sea littoral environments and in port, these technologies must improve multi-spectral detection and distribution of specific threat information. \n\nThe Fleet Force Protection portion of this activity includes support to the FNC Enabling Capabilities for: Aircraft Integrated Self-protection Suites; Intent Determination - EO\/IR Enhancements; Proof-of-Concept for Non-lethal Approach; Advanced Electronic Sensor Systems for Missile Defense; Hostile Fire Detection and Response Spirals 1 and 2; Defense of Harbor and Near-Shore Naval Infrastructure Against Asymmetric Threats; Four-Torpedo Salvo Defense; and Shipboard Force Protection in Port and Restricted Waters - Detection and Classification.\n\nThe second major goal of this activity is to develop enabling technologies that will increase the survivability of surface ship and submarine platforms against torpedo threats.  Proposed technologies focus on defeating high priority threats including torpedoes (i.e. straight running, wake homing, acoustic homing, air dropped torpedoes, and salvoes of torpedoes).  Technologies developed will minimize shipboard impact and require no shipboard organizational maintenance.  The Anti-Torpedo Torpedo (ATT) provides technologies that enable an ATT to engage threat torpedoes detected by a surface ship towed sensor system.  The ultimate goal is to develop technologies to enable a torpedo defense capability, including ship self-defense against salvo torpedo attacks, to fill the FNC Sea Shield Warfighting Capability Gap\/Enabling Capability: Platform Defense against Undersea Threats. Ultimately the goal is to deliver an anti-torpedo-torpedo for use in defeating a four-torpedo salvo attack against a surface platform.  This activity supports the development of technologies that aid the helicopter pilot when operating in degraded visual cue environments (brown-out).  \n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to new FNC R2 activities titled Sea Strike and Sea Shield.  Efforts in these R2 activities have been continued from FY 2012 to FY 2013 into new R2 activities to support all FNC program EC Investments. All efforts in this R-2 Activity have been realigned to PE 0603673N, Future Naval Capabilities, for FY13 and later."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.560"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors & Associated Processing\n- Continued new FNC Enabling Capability (EC) Shipboard Force Protection in Port and Restricted Waters - Detection and Classification. This project will develop mission specific electro-optic\/infrared sensors to detect, classify, and determine the intent of potential terrorist and special operations force threats to ships and craft in port and transiting restricted waters.\n- Continued the Countermeasures for Advanced Imaging Infrared (IIR) Guided Missiles FNC effort by commencing IIR threat surrogate hardware development.\n- Continued the Countermeasures for Millimeter Wave Guided Missiles FNC effort by initiating wide band gap monolithic microwave integrated circuit (MMIC) Ka-band development.\n- Completed the Multifunction Capabilities for Missile Warning Sensors FNC effort.\n- Completed the Helicopter Laser-Based Landing Aids FNC effort by development of a ladar capable of sensing through brown-out and providing a display format that is usable to the pilot.\n\nUnderwater Platform Self-Defense\n- Continued the development of low-cost, light-weight swimmer detection and localization technologies.\n- Continued expanded development of autonomous, underway refueling for Unmanned Sea Surface Vehicle Technologies.\n- Continued advanced development of software encoded algorithms for the Anti-Torpedo Torpedo (ATT) sensor and controller that will enable ATT's to successfully engage torpedo salvoes of up to four attacking units. In support of FNC (Force Projection Advanced Technology), perform the following efforts\n- Continued the development of advanced technologies that support delivery of Navy approved FNC enabling capabilities structured to close operational capability gaps in force projection. \n- Continued the packaging of advanced force projection technologies into deliverable FNC products and ECs that can be integrated into acquisition programs within a five year period. \n- Continued the development of force projection technologies that support naval requirements identified within the Sea Shield and Sea Strike naval capability pillars, as well as those applicable to specific naval platforms and those that apply across the naval enterprise."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MISSILE DEFENSE (MD)"
                                    },
                                    "Description": {
                                        "val": "This activity describes Missile Defense Science and Technology (S&T) projects of the Sea Shield Future Naval Capability (FNC) program.\n- Naval Interceptor Improvements (NII) technology upgrades for STANDARD Missile (SM) future missile. Metrics are to achieve SM performance requirements in specified tactical rain environments and all specified electronic countermeasures environments, while meeting the planned transition date.\n- Extended Distributed Weapons Coordination (EDWC) algorithms for an Automated Battle Management Aid (ABMA) that recommends hard kill weapons, soft kill countermeasures, and emission control measures to reduce the probability of being hit or to optimally engage threats with self-defense weapons. Metric is improved probability of negation (Pneg) against advanced ballistic & cruise missile anti-ship threats that may be susceptible to decoys & jamming, while meeting the planned transition date.\n- Positive Control of Naval Weapons (PCNW) - additional technology upgrades for SM to enable forward relay, remote launch and potentially forward pass engagements. Metrics are classified.\n- Midcourse and Terminal Algorithms (MTA) for prototype state-of-the art weapon system algorithms for STANDARD Missile (SM) engagements vs modern anti-ship missile threats. Specific metrics are classified.\n- Enhanced Lethality Guidance Algorithms (ELGA) to increase Navy shipboard missile probability of kill versus an expanded threat set including ASBMs and advanced ASCMs. Metrics for this project are classified.\n- Enhanced Maneuverability Missile Airframe (EMMA) technology for Navy shipboard missile systems to intercept highly agile maneuvering ASCMs and ASBMs. Metrics for this project are classified.\n- Integrated Active & Electronic Defense (IAED) technology basis for response combinations of active and electronic weapons & systems to optimize Pneg against ASBMs and ASCMs, including potential interactions. Metrics are classified.\n\n- Radar Resource Manager (RRM) algorithms and software for weapon control system capability to provide dynamic platform and force-level radar management and coordination of radar resources for integrated air and missile defense (IAMD). Metrics will be classified.\n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to new FNC R2 activities titled Sea Strike and Sea Shield.  Efforts in these R2 activities have been continued from FY 2012 to FY 2013 into new R2 activities to support all FNC program EC Investments. All efforts in this R-2 Activity have been realigned to PE 0603673N, Future Naval Capabilities, for FY13 and later."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.303"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued RRM project effort.\n- Continued MTA and ramp up of the ELGA and EMMA projects.\n- Continued IED project effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURFACE SHIP & SUBMARINE HULL MECHANICAL & ELECTRICAL (HM&E)"
                                    },
                                    "Description": {
                                        "val": "Activity includes: advanced technology demonstrations to evaluate emerging energy technologies and advanced technology development to evaluate Unmanned Sea Surface Vehicles. \n\nThe decrease of funding from FY 2012 to FY 2013 is the result of the transfer of resources from this R2 activity to new FNC R2 activities titled Enterprise and Platform Enablers and Power and Energy (PE 0603673N). Efforts in these R2 activities have been continued from FY 2012 to FY 2013 into new R2 activities to support all FNC program EC Investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.410"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of autonomous recovery system for Unmanned Sea Surface Vehicles from a host ship\n- Continued development of Integrated Damage Control Systems which includes Integrated Damage Control Communications and Advanced Magazine Protection System. \n- Continued Compact Power Conversion Technologies FNC transitioned from PE 0603236N\/Turbine Engine Technology. \n- Continued Total Ship Survivability Damage Tolerance and Recoverability efforts which include integrated damage control situation awareness technologies.\n- Continued Affordable Submarine Propulsion and Control Surface Actuator technologies focused on the development and demonstration of affordable advanced material propellers and torque dense and quiet actuation of submarine control surface efforts. \n- Continued Underwater Total Ship Survivability\/Payload Implosion and Platform Damage Avoidance efforts.\n- Continued scaled testing and large scale analysis for ship protection systems. \n- Continued fabrication of scaled control surface actuator systems. \n- Initiate air-independent energy system sub-scale component development, analysis, and benchtop testing.\n- Initiate efforts in support of Renewable-Sustainable Expeditionary Power FNC.\n- Initiate efforts in support of Long Endurance Undersea Vehicle Propulsion FNC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.841"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as completed above.\n- Initiate efforts to conduct advanced technology demonstrations to evaluate emerging energy technologies using Navy and Marine Corps facilities as test beds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.826"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.826"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AIRCRAFT TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "DESCRIPTION: \nThe Aircraft Technology activity develops technologies for enhanced capability of Naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, scalable Naval air vehicle technologies, such as - autonomous air vehicle command and control, helicopter and tiltrotor rotor drive systems, aerodynamics, propulsion systems, materials, structures and flight controls for future and legacy air vehicles. This activity directly supports the Naval Aviation Enterprise Science and Technology Objectives and the Naval Science and Technology Strategic Plan, principally in the Autonomy and Unmanned Systems, Platform Design and Survivability, Power and Energy and Total Ownership Cost Focus Areas. \n\nThe funding increase in FY 2013 and ramp up in FY 2014 are due to the Autonomous Aerial Cargo\/Utility System (AACUS) program and the 6.3 portion of the Variable Cycle Advanced Technology (VCAT) program."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.221"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiate demonstration of initial core software, sensor, air vehicle, and capability applications for Autonomous Aerial Cargo\/Utility System (AACUS).\n- Initiate the advanced technology demonstration portion of the Variable Cycle Advanced Technology (VCAT) Program.  Critical technology development efforts will begin with major engine manufactures and system contractors to develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based TACAIR\/ISR systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.912"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.912"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013.\n- Demonstrate initial core software, sensor, air vehicle, and capability applications for Autonomous Aerial Cargo\/Utility System (AACUS).\n- Complete the majority of VCAT Phase I variable cycle engine\/propulsion subsystem technology development efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goals of this advanced technology program are the development of technologies which focus on the warfighter and providing the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage, while preserving operational capability.  Overall metric goals are to transition the advanced technology projects into acquisition programs.  Each Activity within this PE has unique goals and metrics, some of which include classified quantitative measurements.  \n\nSpecific examples of metrics under this PE include:\n- Advanced technology demonstrations to evaluate emerging energy technologies."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3049"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.393"
                        },
                        "CurrentYear": {
                            "val": "2.554"
                        },
                        "BudgetYearOne": {
                            "val": "2.590"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.590"
                        },
                        "BudgetYearTwo": {
                            "val": "2.624"
                        },
                        "BudgetYearThree": {
                            "val": "2.673"
                        },
                        "BudgetYearFour": {
                            "val": "2.725"
                        },
                        "BudgetYearFive": {
                            "val": "2.774"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Advanced technologies developed, critical to protecting naval installations, will provide seamless full spectrum protection against asymmetric terrorist attack by improving the ability to: sense developing and immediate threats; shape our responses through improved situational awareness and decision making; shield personnel, mission critical facilities, infrastructure, and operating fleet assets; maintain essential functions; and sustain and restore critical services in the aftermath of an incident.  Technologies developed will also seek to reduce the required manpower and skill levels devoted to the force protection mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EMERGING THREATS"
                                    },
                                    "Description": {
                                        "val": "This activity includes development of advanced technologies critical to protecting naval installations, and will provide seamless, full spectrum protection against asymmetric terrorist attack by improving the ability to: sense developing and immediate threats; shape our responses through improved situational awareness and decision making; shield personnel, mission critical facilities, infrastructure, and operating fleet assets; maintain essential functions; and sustain and restore critical services in the aftermath of an incident.  Technologies developed will also seek to reduce the required manpower and skill levels devoted to the force protection mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.393"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of lower cost\/higher performance Force Protection sensors and automated detection algorithms, and decision support tools. \n- Continued research to reduce force protection manpower and equipment costs through automation and predictive learning algorithms. \n- Continued threat characterization research and perception experiments for sensor performance optimization and model development and validation. \n- Continue development of all weather sensors optimized for installation of force protection. \n- Continue research into sensors for use in counter-surveillance around protected facilities.\n- Continued research to advance sensor fusion capabilities in high density networks with diverse sensor grids.\n- Continued development of assessment algorithms and information analysis technologies to augment skills or replace persons in operations centers. \n- Continued research into sensors and countermeasures for use against unmanned underwater vehicles.\n- Completed threat characterization research and perception experiments for sensor performance optimization and model development and validation.\n- Completed research to advance sensor and fusion capabilities in high density networks with diverse sensor grids."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.554"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2012, less those noted as completed above.\n- Conduct interim demonstration of acoustic sensors for perimeter and area surveillance in realistic environments.\n- Initiate multi-band electro-optical sensor and fusion algorithm development and demonstrations in adverse weather conditions.\n- Initiate development of protection technology for naval installation power and energy infrastructure.\n- Expand research into sensors and countermeasures for use against unmanned underwater to include surface swimmers, underwater divers, and underwater diver propulsion aids."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goals of this advanced technology program are the development of technologies which will provide seamless full spectrum protection against asymmetric terrorist attack by improving the ability to protect naval installations. Overall metric goals are to reduce the required manpower and skill levels devoted to the force protection mission. Specific metric under the Project includes: 50% reduction of manpower associated with FP surveillance, situational awareness, and decision making, 2x improvement in elctro-optical sensor performance in adverse weather conditions, 50%reduction in sensor cost per square or cubic meter of detection at a given resolution, and a 50% reduction in false alarm rates for automated detection and tracking algorithms both above and below water."
                        }
                    }
                }
            ]
        }
    }
}