{
    "id": "fedbc539c385d8dfbdb13a6a441394bc4de916d6",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0804767D8Z"
        },
        "ProgramElementTitle": {
            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2)"
        },
        "R1LineItemNumber": {
            "val": "178"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "37.534"
            },
            "PriorYear": {
                "val": "37.255"
            },
            "CurrentYear": {
                "val": "77.475"
            },
            "BudgetYearOne": {
                "val": "43.247"
            },
            "BudgetYearOneBase": {
                "val": "43.247"
            },
            "BudgetYearTwo": {
                "val": "44.008"
            },
            "BudgetYearThree": {
                "val": "43.086"
            },
            "BudgetYearFour": {
                "val": "43.919"
            },
            "BudgetYearFive": {
                "val": "44.906"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "These programs support readiness of the joint force by creating a Joint Training Environment to replicate the complex and ever changing operational environment.   These investments support the Secretary of Defense’s (SECDEF) Combatant Commanders Exercise Engagement and Training Transformation (CE2T2) initiative to enable and enhance Joint Warfighting readiness by training as we intend to fight. The elements associated with this coordinated effort consist of:\n\n- Joint National Training Capability (JNTC)\n- Joint Simulation Systems (JSS)\n- Joint Knowledge Development & Distribution Capability (JKDDC)\n- U.S. Forces Korea Training & Exercise Support (USFK)\n- Air Force JNTC\n- Navy JNTC\n\nJNTC:  The Joint National Training Capability (JNTC) program adds joint\/integrated context to existing Service and Combatant Commander (COCOM) training programs. This is accomplished through integrated live, virtual, and constructive training environment and prepares units, and commanders for operations in joint\/integrated operational environments. JNTC can train against a general or mission focused threat; test doctrine, tactics, techniques, procedures, Joint Operational Concepts, and equipment. As the integrating environment, JNTC provides training to the full complement of defense, inter-agency and multi-national audiences. Active and reserve forces train in a realistic joint context with other Services and joint\/integrated battle staffs. Battle staffs from joint, component, and tactical headquarters train and rehearse using real-world command and control systems, with tactical forces represented through simulation support.\n\nJSS:  The Joint Simulation System provides the joint models and simulation enabling trained, capable, and interoperable Joint Forces.  \nThis effort provides warfighters with the joint simulation to keep pace with operational environment supporting the Joint Force 2020 and ensure the Joint Training Environment reacts to strategic guidance such as training in anti-access anti-denial environments.    \n\nJKDDC:  Joint Knowledge Online (JKO) is the DOD unique and authoritative source for online joint training.  They are tasked to develop a Joint Individual Training Toolkit of web-enabled individual and small group training products and services.  Products and services are developed in response to OSD(P&R) CE2T2 Program Goals & Objectives guidance, CJCS High Interest Training Items, Joint Staff J7 training priorities, and JKDDC Joint Knowledge Online (JKO) Stakeholder (CCMDs, Services, and Combat Support Agencies) prioritized training requirements.  JKDDC JKO supports a career-long joint learning continuum, joint professional military education and tailored common training standards to Service members for tasks that are jointly executed, resulting in trained, capable, and interoperable joint forces.  JKDDC JKO technology initiatives principally include Small Group Scenario Trainer (SGST) desk top modeling & simulation based training, OSD requested virtual worlds prototype, and mobile “pilot” courseware training devices.  These capabilities facilitate the training and preparation of tens of thousands of military and civilian personnel deploying to CCMD theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. Specifically, C\/JTF ‘battle staffs’ will be adequately trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise. JKO mobile “pilot” courseware training device development facilitates the global distribution of web-based joint training content on portable, hand-held platforms for joint warriors.  The future virtual worlds learning environment will provide training and learning to promote adaptability and agility in the workforce with the capability to tailor and adapt instructional material to fit the learner's strengths and weaknesses, learning style, and level of proficiency.\n      \nUSFK:  This program provides to Joint Training Environment to support the 2015 stand-up of KORCOM as a sub-unified command under PACOM.  This program is developing a Jointly Accredited and Supported Modeling & Simulation federation of constructive simulations capable of satisfying all joint exercise training requirements in the Korean Theater of Operations.  This simulation system is also interoperable with the Republic of Korea developed Korean Simulation System.  This solution will be capable of interoperating in a common battle space that realistically represents the operating environment to all levels of training audiences, tactical to strategic, in Korean theater exercises.  While supporting USFK’s specific requirements, this solution will contain enhancements that will benefit all users of the JLVC.\n\nAir Force JNTC:  Supports the SECDEF's Transformation in Training\/Joint National Training Capability (JNTC).  Develops capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment.  Using a scientific and phased approach and focusing on modeling air and space capabilities, researches new technologies and methods that provide a crucial technology-based foundation supporting all JNTC operations.\n\nNavy JNTC:  Supports SECDEF Transformation of DoD training and Joint National Training Capability. These funds enable Navy in developing unique maritime capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment. Navy continues to develop and integrated joint training technologies that play a crucial role in its ability to address current and future joint operational training requirements. Navy program activities include conducting research, development, test and evaluation and cross-service architecture certification on all T2 capable systems, developing cross-domain architectures for US and Coalition Forces as well as ensure sister service modeling\/simulation and instrumentation efforts follow a common unified standard."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.255"
                },
                "CurrentYear": {
                    "val": "77.475"
                },
                "BudgetYearOne": {
                    "val": "59.060"
                },
                "BudgetYearOneBase": {
                    "val": "59.060"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "37.255"
                },
                "CurrentYear": {
                    "val": "77.475"
                },
                "BudgetYearOne": {
                    "val": "43.247"
                },
                "BudgetYearOneBase": {
                    "val": "43.247"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-15.813"
                },
                "BudgetYearOneBase": {
                    "val": "-15.813"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Immersive Simulation terminated as part of Secretary of Defense efficiencies"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-15.813"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-15.813"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Immersive Simulation terminated as part of Secretary of Defense ten percent efficiency reduction and also reflects a reduction in the CE2T2 fiscal guidance topline."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "758"
                    },
                    "ProjectTitle": {
                        "val": "Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "17.921"
                        },
                        "PriorYear": {
                            "val": "21.245"
                        },
                        "CurrentYear": {
                            "val": "24.381"
                        },
                        "BudgetYearOne": {
                            "val": "23.211"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.211"
                        },
                        "BudgetYearTwo": {
                            "val": "26.256"
                        },
                        "BudgetYearThree": {
                            "val": "27.908"
                        },
                        "BudgetYearFour": {
                            "val": "31.074"
                        },
                        "BudgetYearFive": {
                            "val": "31.849"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "OSD P&R established the JNTC to improve readiness of the force by developing a robust Joint training environment that represents the complexities of the operational environment through the seamless integration of Live, Virtual, and Constructive (LVC) elements.  JNTC creates Joint warfighting conditions through a networked collection of interoperable training sites, ranges, and nodes that synthesize personnel, doctrine, and technology to deliver and achieve “Joint Context” for CCMD and Service training requirements.  JNTC provides RDT&E within an LVC distributed test-bed supporting the advancement of training technologies in the context of a Joint integrated battle space.  The test bed operates as a continuous training RDT&E environment, providing the foundation for a distributed and deployable Mission Rehearsal System, integrating live Intelligence, Surveillance and Reconnaissance feeding the Common Operational Picture.  These funds provide critical Joint\/Coalition Service members and interagency partners enhanced training to allow requisite enhancements to existing training systems, capabilities, and technologies. These enhancements improve training efficiencies and provide an integrated LVC environment.  This capability minimizes the necessity for conducting large-scale live exercises to achieve the SECDEF’s Combatant Commanders Exercise Engagement and Training and Transformation (CE2T2) vision."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint National Training Center (JNTC)"
                                    },
                                    "Description": {
                                        "val": "Initially established in 2003, JNTC continues to develop and integrate Advanced Training Technologies into a seamless Joint training environment.  JNTC establishes the overarching Joint framework and context necessary for CCMDs and Services to achieve a Joint training environment through an integrated network of training sites and nodes.  JNTC provides the common standards, architecture, and development processes required to link Joint training programs.  By leveraging existing training programs or initiating specific actions, JNTC is developing credible opposing force capabilities and expanded access to assets typically unavailable to the training audience by developing and integrating modeled and simulated representations of these capabilities. This furthers the integration of Joint training objectives into Service training events, while capturing the objective data necessary to provide a complete and accurate after action review.  This program develops and enhances current and future Joint training enterprise capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.245"
                                            },
                                            "Text": {
                                                "val": "•  Developed the Joint Live Virtual Constructive 2020 modeling and simulation strategy, roadmap, and conceptual design working with the Services, Combatant Commands, Coalition partners, Agencies, and the Department of Defense Modeling and Simulation community to deliver a future modeling and simulation training environment reliant on cloud-enabled modular services with an initial operating capability in fiscal year 2016, and operational capability in fiscal year 2019. The current modeling and simulation federation supporting joint and coalition training is unsustainable and unable to keep pace with the rapidly changing joint operational environment training requirements of the future. In order comply with Department of Defense guidance on cloud computing and meet warfighter training needs, the Joint Live Virtual Constructive modeling and simulation federation must be re-engineered to be adaptive, agile, and affordable.\n•  Began collaborative planning efforts with the Services and Defense Information Systems Agency to create a future adaptive and agile Joint Training Enterprise Architecture enabling an affordable joint training environment that emulates the complexity, uncertainty, and dynamic nature of the Joint Force 2020 operating environment.\n•  Demonstrated a second use case for extension of the Combined Enterprise Regional Information Exchange System International Security Assistance Force Training Federation into Australia. \n•  Completed redesign and implementation of the Australia, Canada, Great Britain, and United States Training Enclave, and operationalized this enclave for training.\n•  Demonstrated proof of concept for Navy requirements in Joint Staff J7\/Navy\/Air Force Cross Domain Solution Pilot Program, a consolidation of requirements necessary to achieve an enterprise and eliminate artificial boundaries between disparate organizations with similar requirements. Redirected focus to Air Force requirements.\n•  Continued Joint Training Enterprise Network Test Bed systems certification, product evaluation, problem replication and troubleshooting, to be conducted off the production network.  The test bed significantly mitigates risk to the operational network, permitting simultaneous test & evaluation without impact to training events, and permits fielding capabilities at a much quicker rate than waiting for windows of availability on the production network.\n• Transitioned Joint Training Enterprise Network 2.0 technology upgrade to operational use to replace old network sites with new technology (version 2.0) and increasing the capacity, throughput, efficiency, and security of the network.\n• Completed the installation of a new Joint Exercise Control Group capability in Pentagon to provide initial Interagency integration home station support for participation of Joint and Combatant Command collective training events.\n• Completed planning phase of the Virtual Collective Training Environment project. This project will capitalize on emerging capabilities in Department of Defense's Virtual World Framework and 21st century Web technologies to deliver an initial capability release (prototype) of a three-dimensional Virtualized Collective Training Environment that supports the ability to exercise command and control systems and tactical voice radio systems in a Cloud enabled virtual environment supporting Joint, Service, Combatant Command, and experimentation\/test communities. The prototype is an initial subset of emulated real world command and control systems embedded in a virtual world environment that mirrors the capabilities and facilities of a live Joint Operations Center.  This virtual Joint Operations Center will be a prototype for future capabilities integrated into the next generation joint training environment.\n• Completed communication technologies research and development initiative to facilitate the distribution of mixed reality training around the globe. This facilitates home-station operations vice having to relocate operators to remote locations.  The technologies ensure warfighter’s pre-deployment training closely replicates real-world operations.\n•  Continued development of the Joint After Action Review Resource Library to improve stability and usability to enhance near-real time and post event Live-Virtual-Constructive assessment of Joint Warfighter’s performance. Completed development planning and investment roadmap to deliver a web-based user interface and Joint After Action Review Resource Library as an enterprise service via cloud computing in fiscal year 2016 integrated within the Joint Training Enterprise Architecture.\n•  Completed integration of the Marine Air-Ground Task Force Tactical Warfare Simulation into the Joint Live Virtual Constructive modeling and simulation federation. Completed research and testing of a prototype solution for a web services framework that will enable seamless information exchange between Joint Staff training information systems and Net-Centric Enterprise Services information services available on the Global Information Grid.\n•  Developed a rapid synthetic civilian environment capability to support service level tactical gaming. \n•  Completed the All Things Missile initial capabilities document and established the initial operational capability by fielding the prototype for a scalable, dynamic, low cost and low overhead technical solution in support of strategic to tactical missile mission training for Combatant Command and Service stakeholders. \n•  Completed software modification of the National Security Agency’s Joint Cryptologic Mission Simulation system in order to integrate with the Joint Live Virtual Construction modeling and simulation training federation.  When completely integrated this will deliver the full capability of the National Security Agency into the Joint training environment thus providing an enhanced capability to train all Service Signals Intelligence analysts and allow Joint and Service staffs to integrate these capabilities into training events prior to deployment.\n•  Completed research and development efforts to mitigate identified Joint training cross-domain information sharing issues and release Increment 1 of a cross domain enterprise solution for Joint training environment.\n•  Researched services in the area of system-of-system interoperability in joint training including command and control, sensor and robotic to simulation interoperability leading to preparation of Coalition Battle Management Services capabilities for integration into North Atlantic Treaty Organization Research Technology Organization Model and Simulation Group 085 “C2 to Simulation Interoperability,” the Technical Cooperation Program Coalition Attack Guidance Experiment due to execute in fiscal year 2013, and other North Atlantic Treaty Organization Allied Command Transformation demonstrations and integration events. \n• Initiated engagements with Combatant Commands to determine their exercise cyber training requirements and objectives through participation in exercise planning conferences.\n• Began development of cyber training capabilities to support Combatant Commands exercise programs.\n• Initiated Information Assurance certification and accreditation of cyber software application on Non-Secure Internet Protocol Router Network."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.381"
                                            },
                                            "Text": {
                                                "val": "To have a relevant post Operation Enduring Freedom joint training environment, continue development and refinement of the Joint Live Virtual Constructive 2020 modeling and simulation strategy, roadmap, and conceptual design working with the Services, Combatant Commands, Coalition partners, Agencies, and the Department of Defense (DOD) Modeling and Simulation community. To comply with DOD IT enterprise direction, deliver a future modeling and simulation training environment reliant on cloud-enabled modular services with an initial capability in fiscal year 2016, and operational capability in fiscal year 2019.\n\nConduct Joint Live Virtual Constructive 2020 Integration Event #1.\n\n•  Research and define the future joint training enterprise communications and information services construct of the Joint Training Enterprise Architecture and develop a Systems Engineering Plan supporting the architecture development effort. The goal is to align the joint training enterprise with Department of Defense Joint Information Enterprise project to comply with Department guidance and provide agile and adaptive Joint training capabilities supporting warfighter requirements while reducing overall operating and sustainment costs.\n•  Continue planning, research, and development of a prototype cloud computing and virtualization environment supporting the Joint Training Enterprise Architecture.\nIn coordination with the Services and Combatant Commands, develop a Joint Training Enterprise Architecture concept of operations document to describe how the future Joint Training Environment will support Joint Force Development in 2020.\n• Develop modular mix and match integration of simulation activity and Master Scenario Event List events to simplify and reduce manpower through automation within the Joint Live, Virtual, and Constructive modeling and simulation federation.\n• Continue to enhance Joint Logistics modeling within the Joint Live Virtual Constructive modeling and simulation federation to increase realism of logistics planning and execution in training by providing simulated in transit visibility of logistics\n• Demonstrate Joint Training Enterprise Network capability from the Pentagon in a scheduled Joint, Service, or Combatant Command event that has interagency involvement. This proof of concept demonstration allows interagency organizations to participate from the Pentagon rather than from a down range location.  \n• Virtual Collective Training Environment will complete Phase 2, Proof of Concept.  The primary objectives of this phase are to refine the requirements established in Phase 1, develop and deliver additional architectural products, perform the bulk of the project’s systems engineering and software development, and conduct a proof of concept demonstration.  This demonstration investigates Virtual World Framework capabilities, assesses these capabilities against mission requirements, and conducts a comparative analysis.  The fundamental questions to be answered are how well virtual world technologies satisfy collective joint training requirements; how these technologies can be quickly adapted to meet new training requirements; and what the overall cost is to employ these technologies compared to current practices within collective joint training.\n•  Continue Joint Training Enterprise Network Test Bed systems certification, product evaluation, network problem replication and troubleshooting, to be conducted off the production network.  The test bed significantly mitigates risk to the operational network, permits simultaneous test and evaluation without impact to exercise events, and permits fielding capabilities at a much quicker rate than waiting for windows of availability on the production network. \n• Expand the visibility, accessibility and reuse of modeling and simulation data by developing an initial operating capability that provides consumers the ability to search for and down load Order Of Battle data from different sources.\n• Evaluate the potential of standard web-based services combined with Virtual World type technologies to support Joint Training using emulated command and control systems.\n• Research services in the area of system-of-system interoperability in joint training and experimentation including command and control, sensor and robotic to simulation interoperability.\n• Evaluation and development of methods supporting initialization, orchestration and composition of Live, Virtual, and Constructive systems using Coalition Battle Management Services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.211"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.211"
                                            },
                                            "Text": {
                                                "val": "Continue development and refinement the Joint Live Virtual Constructive 2020 modeling and simulation strategy, roadmap, and conceptual design working with the Services, Combatant Commands, Coalition partners, Agencies, and the Department of Defense Modeling and Simulation community to deliver a future modeling and simulation training environment reliant on cloud-enabled modular services with an initial capability in fiscal year 2016, and an operational capability in fiscal year 2019.\n\nConduct Joint Live Virtual Constructive 2020 Integration Events #2 and #3 to prepare for initial limited operational capability in fiscal year 2015.\n\n•  Continue to build the Joint Training Enterprise Architecture decomposing modeling and simulation, networking and Information Technology applications into a cloud-enabled modular service supporting Combatant Command and Service Joint training requirements. \n• Virtual Collective Training Environment will complete development of the prototype system:  Phase 3 will focus on development and delivery of a prototype Virtual Worlds Framework capability (Capability Release 1).  In anticipation that Joint Staff J7’s proposal for the Modeling and Simulation Coordination Office High Level Task is approved, Capability Release 1 will be realized through the Command and Control Systems in Virtual Environments initiative.  Command and Control Systems in Virtual Environments will integrate the Virtual Worlds Framework into the emerging next generation joint training environment to create an adaptive virtual environment that enables joint force development for Commanders, staffs, units, and personnel.  Command and Control Systems in Virtual Environments will employ cloud-enabled modular simulation services that will provide joint warfighters the ability to rapidly access and compose M&S capabilities to meet specific joint requirements, and then deliver that capability how, when and where required. \n• Based on discovery identified with the initial cloud capabilities research, continue development on next phase of cloud-enabled modular services in support of delivering modeling and simulation services supporting Joint Force Development and Joint Live Virtual Constructive 2020 modeling and simulation capability. This effort will contribute to the long range modeling and simulation development and training strategy.\n• Based on discovery identified with the initial data strategy on reuse of modeling and simulation data by developing and initial operating capability that provides consumers the ability to search for and down load Order Of Battle data from different sources; expand development into geospatial services.\n• Based on discovery identified with research on web-based services using Virtual World type technologies to support Joint Training using emulated command and control systems, expand research to support additional Joint Training use cases.\n• Based on discovery identified with system of system interoperability using Coalition Battle Management Services, continue research to establish CBMS as an modeling and simulation standard that promotes interoperability between command and control, sensor, and robotic to simulation systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "37.817"
                                        },
                                        "CurrentYear": {
                                            "val": "24.756"
                                        },
                                        "BudgetYearOne": {
                                            "val": "25.427"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.427"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "25.110"
                                        },
                                        "BudgetYearThree": {
                                            "val": "27.240"
                                        },
                                        "BudgetYearFour": {
                                            "val": "27.966"
                                        },
                                        "BudgetYearFive": {
                                            "val": "27.966"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z-"
                                    },
                                    "Title": {
                                        "val": "JNTC Procurement Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.252"
                                        },
                                        "CurrentYear": {
                                            "val": "2.531"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow? \n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Achieve a ten percent increase per year in Joint Training Data Scenario production builds \/ downloads from FY 12 through FY 14.\n• Reduction in joint training environment Operation & Sustainment costs achieving a threshold goal of 30% reduction by FY 19. \n• Provide enhanced cyber capabilities meeting 45% of CCMD exercises cyber requirements.\n• Joint training enterprise event preparation time is reduced by 15%."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "761"
                    },
                    "ProjectTitle": {
                        "val": "Joint Simulations Systems (JSS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.208"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.017"
                        },
                        "BudgetYearOne": {
                            "val": "3.098"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.098"
                        },
                        "BudgetYearTwo": {
                            "val": "2.193"
                        },
                        "BudgetYearThree": {
                            "val": "2.333"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.849"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This effort provides warfighters with Joint Simulations and Tools that enhance and enable Joint training across Services, CCMDs, Agencies and Coalition partners.  These Joint Simulations and Tools are part of an overall Joint Live, Virtual, and Constructive (JLVC) baseline of training capabilities resident in the Joint Force Trainer Toolkit (JFTT).  The JFTT is a set of training enablers, and “certified systems” that are interoperable and acceptable for usage within the Joint training environment.  The Joint Simulations and Tools provided by JSS are critical enablers that support the delivery of trained, capable, and interoperable Joint Forces."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Simulation System (JSS)"
                                    },
                                    "Description": {
                                        "val": "This effort provides warfighters with Joint Simulations and Tools that enhance and enable Joint training across Services, CCMDs, Agencies and Coalition partners.  These Joint Simulations and Tools are part of an overall Joint Live, Virtual, and Constructive (JLVC) baseline of training capabilities resident in the Joint Force Trainer Toolkit (JFTT).  The JFTT is a set of training enablers, and “certified systems” that are interoperable and acceptable for usage within the Joint training environment.  The Joint Simulations and Tools provided by JSS are critical enablers that support the delivery of trained, capable, and interoperable Joint Forces."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.017"
                                            },
                                            "Text": {
                                                "val": "• Continue the integration, verification, validation, accreditation , and delivery of a stable and reliable software version of the Joint Live Virtual Constructive Federation version 6.0 to support current Combatant Command and Service joint training requirements.  \n• Develop Civilian infrastructure network models in simulations to increase realism to the training audience.\n• Develop modeling and simulation web-services, cloud computing and virtualization to comply with Department of Defense guidance.\n• Joint Live Virtual Constructive 2020 prototyping of cloud enabled modular services.  Prototyping of a future architecture for Joint modeling and simulation involving decoupling simulation processes that can be shared by multiple simulations within the Joint Training Enterprise Architecture to decrease operating and sustainment costs and produce agile and adaptable training capabilities that meet future Warfighting training requirements.\n• Develop terrain service prototype (static and streaming) to demonstrate how the cloud-based modular service concept can be applied to Joint training.\n• Develop enhancements in the Joint Live Virtual Constructive modeling and simulation federation to address hybrid warfare and Anti-Access Area Denial defense training capabilities to comply with Chairman Joint Chiefs of Staff training priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.098"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.098"
                                            },
                                            "Text": {
                                                "val": "• Federate Anti-Access Area Denial and Hybrid threats modeling and simulation capabilities.\n• Develop hybrid threat effects on civilian population and Anti-Access Area Denial modeling to comply with Chairman Joint Chiefs of Staff training priorities.\nContinue Joint Live Virtual Constructive 2020 prototyping of cloud enabled modular services.  Prototyping of a future architecture for Joint Modeling and Simulation involving decoupling simulation processes that can be shared by multiple simulations within the Joint Training Enterprise Architecture to decrease operating and sustainment costs and produce agile and adaptable training capabilities that meet future Warfighting training requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JSS O&M Funding"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "1.007"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.026"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.026"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.050"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.062"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.088"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.109"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures\n•  Provide the JLVC Federation version 6.0 by 30 September 2013 to enable Services, CCMDS, Agencies and Coalition partners to deploy trained, capable, and interoperable joint forces. \n•  JLVC version 6.0 is delivered on time with less than ten priority one, and two problem trouble reports.  \n•  JLVC version 6.0 has an exercise availability rating of 95%\n•  Enhance Joint model and simulation capabilities to meet 65% of CCMD training requirements in hybrid threats and Anti-access Area-Denial functional areas.\n•  One major software release to implement emerging technologies supporting enterprise architecture development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "769"
                    },
                    "ProjectTitle": {
                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.194"
                        },
                        "PriorYear": {
                            "val": "2.181"
                        },
                        "CurrentYear": {
                            "val": "4.656"
                        },
                        "BudgetYearOne": {
                            "val": "4.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.000"
                        },
                        "BudgetYearThree": {
                            "val": "4.000"
                        },
                        "BudgetYearFour": {
                            "val": "4.000"
                        },
                        "BudgetYearFive": {
                            "val": "4.066"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "JKDDC Joint Knowledge Online (JKO) is the DOD unique and authoritative source for online joint training.  They are tasked to develop a Joint Individual Training Toolkit of web-enabled individual and small group training products and services.  Products and services are developed in response to OSD(P&R) CE2T2 Program Goals & Objectives guidance, CJCS High Interest Training Items, Joint Staff J7 training priorities, and JKDDC Joint Knowledge Online (JKO) Stakeholder (CCMDs, Services, and Combat Support Agencies) prioritized training requirements.  JKDDC JKO supports a career-long joint learning continuum, joint professional military education and tailored common training standards to Service members for tasks that are jointly executed, resulting in trained, capable, and interoperable joint forces.  JKDDC JKO technology initiatives principally include Small Group Scenario Trainer (SGST) desk top modeling & simulation based training, OSD requested virtual worlds training prototype, and mobile “pilot” courseware training devices.  These capabilities facilitate the training and preparation of tens of thousands of military and civilian personnel deploying to CCMD theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. Specifically, C\/JTF ‘battle staffs’ will be adequately trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise. JKO mobile “pilot” courseware training device development facilitates the global distribution of web-based joint training content on portable, hand-held platforms for joint warriors.  The future virtual worlds learning environment will provide training and learning to promote adaptability and agility in the workforce with the capability to tailor and adapt instructional material to fit the learner's strengths and weaknesses, learning style, and level of proficiency."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                                    },
                                    "Description": {
                                        "val": "JKDDC JKO technology initiatives principally include Small Group Scenario Trainer (SGST) desk top modeling and simulation based training, OSD requested virtual worlds training prototype, and mobile “pilot” courseware training devices.  These capabilities facilitate the training and preparation of tens of thousands of military and civilian personnel deploying to CCMD theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. Specifically, C\/JTF ‘battle staffs’ will be adequately trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise. JKO mobile “pilot” courseware training device development facilitates the global distribution of web-based joint training content on portable, hand-held platforms for joint warriors.  The future virtual worlds learning environment will provide training and learning to promote adaptability and agility in the workforce with the capability to tailor and adapt instructional material to fit the learner's strengths and weaknesses, learning style, and level of proficiency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.181"
                                            },
                                            "Text": {
                                                "val": "•  Developed Virtual Culture Awareness Trainer (VCAT) South America Phase II web-based training game.  Based on the FY11 success with VCAT South America training utility in the SOUTCHCOM AOR, SOUTHCOM required an enhanced training product focusing on 5 expanded mission scenarios, in the Andean Ridge geographic region, integrating Defense Language Institute (DLI) approved language training content, while simultaneously demonstrating an improved capability to deliver training via an innovative training technique on JKO.\n•  Continued to operationalize JKO training simulation by developing SGST version 3, a small group training capability focused on improving the training readiness of individuals and small joint headquarters staffs.  Version 2 enhanced joint warrior provided recommendations from version 1, and targeted development of six additional SGST scenario use cases for representative JTF staffs, all designed to complement existing Combatant Command mission rehearsal exercises in preparation for deployment to their respective theaters of operation.  Version 3 increased training audience participant size to 40 concurrent players (vice current 8-10).  Additionally, users are now able to create their training scenarios more efficiently with minimal resources.  Thousands of joint, interagency, intergovernmental and multinational participants will be better trained as individuals and collectively as small teams prior to and during deployment in CCMD environments.\n•  Developed mobile “pilot” training device capabilities based on JKO high payoff courseware. Completed courses include Cross Culture Competency Trainer, Virtual Cultural Awareness Trainer + Language Afghanistan, US Army’s Headstart2 Language Training, US Forces Korea Theater Specific Training, US SOUTHCOM’s Human Rights Awareness, & Operational Swahili training products.  These joint training courses will be playable from the JKO web-based desktop and from iOS and Android operating systems based portable, hand-help devices (phones and tablets)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.656"
                                            },
                                            "Text": {
                                                "val": "•  Craft and begin implementing a comprehensive plan to develop mobile “pilot” training device capabilities focused on JKO’s entire Joint Individual Training Toolkit.  Plan components include existing JKO courseware conversion to portable, hand-held devices; emerging training courseware requirements interoperable with portable, hand-held devices; and the leveraging of other DoD agencies, Interagency, and Multinational training courseware ported to mobile training devices.  \n•  Develop a future virtual worlds learning prototype that will provide training and learning environments (software agents) that are consistent with the virtual worlds framework (VWF).  The prototype will demonstrate how online training can be delivered via the VWF."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "•  Assess, refine and continue implementing comprehensive plan to develop mobile “pilot” training device capabilities focused on JKO’s entire Joint Individual Training Toolkit.  Plan components include existing JKO courseware conversion to portable, hand-held devices; emerging training courseware requirements interoperable with portable, hand-held devices; and the leveraging of other DoD agencies, Interagency, and Multinational training courseware ported to mobile training devices.  Refined plan will include eBook, Podcast, and video capabilities in addition to current courseware capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JKDDC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.548"
                                        },
                                        "CurrentYear": {
                                            "val": "6.348"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.810"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.810"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.982"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.134"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.174"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.174"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z-"
                                    },
                                    "Title": {
                                        "val": "JKDDC Procurement Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.284"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Staff prescribed performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n•  Augment the ability to provide cultural context training for CCMD’s Joint Mission Essential Task functional areas by one geographic area of responsibility, and two mission areas per year.\n•  Provide small group training focused on Joint Exercise Life Cycle specified mission areas for pre-requisite in exercise augmentation, or post exercise remediation training for three exercise response cells per year.\n•  Add context sensitive remediation to five existing Joint Distributed Learning courses per year.\n•  Provide a systematic, steady-state process for integrating cultural context, small group training, and intelligent remediation requirements into the Joint Training System Phase I of the initiative, resulting in improved training and readiness for the warfighter.\n•  Provide cost model for evaluating level of effort, additional conditions and standards for cultural context, small group training, and intelligent remediation to Joint Mission Essential Task training solutions for the Joint Training System Phase II, resulting in improved readiness, while providing improved training to the warfighter, will be in place by year five of the initiative."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "770"
                    },
                    "ProjectTitle": {
                        "val": "U.S. Forces Korea Training and Exercise Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.211"
                        },
                        "PriorYear": {
                            "val": "7.342"
                        },
                        "CurrentYear": {
                            "val": "6.497"
                        },
                        "BudgetYearOne": {
                            "val": "6.451"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.451"
                        },
                        "BudgetYearTwo": {
                            "val": "4.483"
                        },
                        "BudgetYearThree": {
                            "val": "1.378"
                        },
                        "BudgetYearFour": {
                            "val": "1.378"
                        },
                        "BudgetYearFive": {
                            "val": "1.401"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "USFK’s current federation of models, including the overarching Joint Training Transformation Initiative Korea is used only at USFK, does not meet Coalition interoperability requirements, and cannot fully utilize the Joint Live Virtual Constructive (JLVC) Federation’s capabilities.  Joint Staff J-7, in collaboration with USFK and appropriate Republic of Korea agencies, integrate Warfighters’ Simulation (WARSIM) into the JLVC Training Federation in order to field a functioning JLVC federation to USFK.  This new training environment will support the extensive ground order of battle required to accurately simulate operations on the Korean Peninsula.  It also maximizes existing JLVC training standards and investments, and fully leverages Service training capabilities and roadmaps.  This solution will provide the initial effort to link coalition training architectures into the JLVC as well.  It will also promotes the Joint Training Environment vision and goals and implement selected pieces of recommendations identified in the LVC report, the Flagship Study."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "USFK Training & Exercise"
                                    },
                                    "Description": {
                                        "val": "This program provides to Joint Training Environment to support the 2015 stand-up of KORCOM as a sub-unified command under PACOM.  This program develops a jointly accredited, supported, and funded federation of constructive models and simulations which are capable of satisfying all joint exercise training requirements in the Korean Theater of Operations, and which is interoperable with the Republic of Korea developed Korean Simulation System.  While supporting U.S. Forces Korea specific training requirements, this solution also is inextricably linked to the Next Generation Joint Live Virtual Constructive modeling and simulation capability via Cloud Enabled Modular Services which will provide a simulated common, interoperable battlespace which realistically represents the operating environment to all levels of training audiences, tactical to strategic, in Korean theater exercises and across the Combatant Commands, Services, and Coalition Partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.342"
                                            },
                                            "Text": {
                                                "val": "•  Continued Joint Training Data Services development to support U.S. Army Warfare Simulation Intelligence Model, and to provide rapid scenario generation in support of Joint Training Exercises and short notice mission rehearsal capabilities.\n•  Continued process mapping of Joint Live Virtual Construction modeling and simulation federation operations and procedures to provide systems engineering approaches to improve U.S. Forces Korea - Joint Live Virtual Construction modeling and simulation federation capabilities. \n•  Continued development of Joint Live Virtual Constructive modeling and simulation Joint Conflict and Tactical Simulation-Joint Low Overhead Drive scalability. \n•  Continued design and development of Graphical Interface Aggregate Control Bridge to provide a technical interface to interoperate with Joint Live Virtual Constructive 2020 cloud-based modular services.\n•  Initial development for Integrated Air and Missile Defense Training Support System training capabilities to provide synthetic environment, trainer controls and external interfaces for holistic training environment to United States Forces Korea.\n•  Continued Joint Semi-Automated Forces modeling and simulation software design enhancements to fully support United States Forces Korea joint training requirements and computer assisted exercise events, which have maritime components and involve response cells of mixed Republic of Korea and United States personnel in close cooperation.  \n•  Initial research to develop portable software applications (“apps”) of the existing Joint Staff J7 land maneuver models and simulations (JCATS and JTDS), to expand current capabilities of Joint, Live, Virtual, and Constructive Federation and integration of United States Forces Korea modeling and simulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.497"
                                            },
                                            "Text": {
                                                "val": "Research, develop, test and evaluate for U.S. Forces Korea ROK (Joint Live Virtual Constructive 6.x modeling and simulation federation and Korean simulations) bridge.\n•  Continue development and integration of Marine Air-Ground Task Force Tactical Warfare Simulation High Level Architecture 1516 Laissez-Faire to engineer interoperability the Korean modeling and simulation federation and the Joint Live Virtual Constructive 6.x modeling and simulation federation.\n•  Research, development, test of Marine Air-Ground Task Force Tactical Warfare Simulation aggregated composable models.\n•  Complete Joint Exercise Control Suite Cross Federation testing tool.\n•  Complete Warfighter Simulation Intelligence Model integration into the Joint Live Virtual Constructive 6.x modeling and simulation federation.\n•  Initial development of refugee and civilian traffic modeling and simulations into the Joint Live Virtual Constructive 6.x modeling and simulation federation.\n•  Initial development of U.S. Forces Korea civilian infrastructure modeling and simulations into the Joint Live Virtual Constructive 6.x modeling and simulation federation.\n•  Initial development of targeting networks and visualization modeling and simulations into the Joint Live Virtual Constructive 6.x modeling and simulation federation to enable visualization of intended targeting effects.\n•  Continue Air Force Modeling and Simulation Training Toolkit database support.\n•  Initial development of U.S. Forces Korea Staff Process Model. \n•  Complete Joint Conflict and Tactical Simulation Low Overhead Driver High Level Architecture 1516 Modular Federated Object Model migration.\n•  Continue Joint Land Component Constructive Training Capability database support.\n•  Initial Navy Continuous Training Environment Modular Federation Object Model and Dynamic Data Model implementation.\n•  Initial Modular Federation Object Model design.\n•  Initial Marine Air-Ground Task Force Tactical Warfare Simulation Modular Federation Object Model migration.\n•  Complete Coalition releasable Joint Semi-Automated Forces baseline.\n•  Continue Korean Battle Simulation Center Terrain support.\n•  Initial Defense Training Network Guard for Joint Live Virtual Constructive 6.x modeling and simulation federation.\n•  Continue enterprise architecture subject matter expertise research analysis to facilitate delivery of state of the art USFK training capability. \n•  Start development of the Joint Terrain Data Services specific dataset and server to meet U.S. Forces Korea exercise training requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.451"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.451"
                                            },
                                            "Text": {
                                                "val": "• Enhance Army, Air Force, Navy, and Marine Corps Live, Virtual, and Constructive capabilities and fully integrate these into the Joint Live Virtual Constructive 2020 modeling and simulation capability to meet U.S. Forces Korea theater specific, Combatant Command, Service, and Coalition training requirements.\n• Achieve full interoperability of joint service and Republic of Korea modeling and simulations, capable of supporting large (e.g. 1M entities), high-intensity combat scenarios by 2016."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "U.S. Forces Korea Training & Exercise Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.255"
                                        },
                                        "CurrentYear": {
                                            "val": "0.307"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.309"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.309"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.299"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.304"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.304"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.304"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n•  Develop software for interoperability of Joint Live Virtual Constructive (JLVC) 6.x simulations, with initial integration of the Army’s WARSIM Intelligence Model, along with a validated approach for Cross Domain Information Sharing technologies, and Korea Battle Simulation Center (KBSC)simulations, to provide a joint training enterprise, realistic warfighter training environment, to meet the training requirements of the United States Forces Korea."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "754"
                    },
                    "ProjectTitle": {
                        "val": "Immersive Simulation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "32.900"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "32.900"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "A state of the art simulated close combat environment will enable enhanced decision-making by squads and platoons, increasing their military effectiveness, reducing friendly and non-combatant casualties and increasing lethality against foes.  It will contribute to combat team proficiency and decision making across the full range of military operations, from irregular to conventional.  This training capability will increase survival and success rates in first and subsequent combat actions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Simulation"
                                    },
                                    "Description": {
                                        "val": "Accelerate fielding of immersive training systems and capabilities inclusive of integrated hardware with virtual enhancements, modular systems and video capture within individual and collective tracking systems.\n\nAccelerate development of autonomous behavior capabilities through development of Opposing Force and Blue Force Behavior, Common SAF in Synthetic Environment, and enhancement of current software (Virtual Battlespace 2).  These expenditures will improve 119 behaviors models, establish 50 new entities, 50 new visual models\/year, 50 BLUEFOR Behaviors, improve Avatar capability and enhance interactions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.900"
                                            },
                                            "Text": {
                                                "val": "•  Highly Detailed Scenarios.  Develop scenario data that is sufficiently detailed to satisfy training requirement.  Develop training scenarios that replicate the contemporary operating environment.  Develop a comprehensive set of IW tasks, conditions and standards to enable training relevant to ethical and tactical decision making. Develop specific scenario requirements that support mission-specific rehearsal, including representation of second and third order effects of ethical and tactical decisions made under conditions simulating combat stress.\n •  Geo-typical Data Repositories. Develop standardized repositories for geo-typical data such as terrain features, vegetation, population appearance, cultural behaviors (i.e., correct form of greeting in a specific location), language and dialect. \n•  External Enablers Representation.  Identify and create processes to leverage a pool of expertise for each external capability to be represented. Develop training standards for controllers representing external enablers. Enhance automated responses for required external enablers. Establish habitual relationships with organizations representing and or providing external enablers at the tactical level, in order to enhance interoperability, maintain currency and ensure validity of the scenario.\n•  Natural Verbal and Non-Verbal Communication.  Develop a broader selection of gestures available through a range of interface devices. Further develop Voice over Internet Protocol (VOIP) technology for use with live, virtual and gaming technologies. Further develop natural gesture recognition capabilities. Further develop natural voice recognition capabilities.\n•  Autonomous Behavior. Develop methodology to characterize and organize entity behaviors. Expand library of scripted behaviors and supporting animations (including individuals, cells and units) to allow limited interactions with trainees. Develop improved game engine and virtual Semi-Automated Forces (SAF) behaviors in order enhance tactical and ethical decision making. Develop a detailed response library for certain conditions and behaviors. Develop virtual human with capability to perceive and understand the environment.\n•  Sensory Stimulation.  Further develop and integrate current olfactory systems for both live and virtual environments. Further develop and integrate current hap tic feedback devices for both live and virtual environments. Further develop and integrate higher resolution display technologies for both live and virtual environments. Further develop and integrate enhanced audio technologies for both live and virtual environments. Integrate all sensory stimulation capabilities in order to maximize overall effectiveness within the training environment. Conduct research into best methods to stimulate the senses in a training environment. Conduct research into the effectiveness and value of sensory stimulation in a training environment.\n•  Interactions. Conduct research to determine optimal level of interaction within the training environment, with respect to the training requirements. Develop tools to eliminate the capability gaps in Sensory Stimulation, Natural Verbal and Non-Verbal Communication Methods, Visual Representation of Terrain, and Visual Representation of Individuals.\n•  Visual Representation of Terrain.  Develop a central repository of correct textures, models and objects. Leverage technology advancements from the commercial gaming industry to improve visualization engines.\n•  Visual Representation of Individuals.  Develop a library of common body 3D frameworks to represent a variety of visual characteristics. Develop and utilize body-mapping technology to enable live role-players to drive avatar movement. Develop and utilize facial mapping technology to enable live role players to provide realistic avatar facial expressions. Develop a library of cut scenes and pre-recorded video segments for common human motions and movements. Develop and maintain a database of highly realistic animations. Leverage commercial gaming technology to allow rapid generation of unique avatars. Leverage technology resident in the entertainment industry to enhance immersive training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Program terminated as part of Secretary of Defense efficiency cuts."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "701"
                    },
                    "ProjectTitle": {
                        "val": "Air Force JNTC"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.955"
                        },
                        "CurrentYear": {
                            "val": "2.041"
                        },
                        "BudgetYearOne": {
                            "val": "2.307"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.307"
                        },
                        "BudgetYearTwo": {
                            "val": "2.716"
                        },
                        "BudgetYearThree": {
                            "val": "2.794"
                        },
                        "BudgetYearFour": {
                            "val": "2.794"
                        },
                        "BudgetYearFive": {
                            "val": "2.840"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Supports the SECDEF's Transformation in Training\/Joint National Training Capability (JNTC). Develops capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment. Using a scientific and phased approach and focusing on modeling air and space capabilities, researches new technologies and methods that provide a crucial technology-based foundation supporting all JNTC operations.  In particular, the Air Force JNTC funding has provided a focused upgrade to developing models for Space Based capabilities and integrated them into the Joint Live Virtual Constructive capabilities.  We have also supported development of cross domain solutions allowing linking of systems with differing security requirements, extending the breadth of the training audiences to additional Joint and Coalition participants.  The Air Force intends to support the President’s priorities by developing cyber simulations as well as developing deployable ranges which will allow for training to Anti-Access\/Area Denial (A2\/AD) tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AF JNTC"
                                    },
                                    "Description": {
                                        "val": "Supports the Secretary of Defense (SECDEF) Transformation in Training\/Joint National Training Capability (JNTC). Develops capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment. Using a scientific and phased approach and focusing on modeling air and space capabilities, researches new technologies and methods that provide a crucial technology-based foundation supporting all JNTC operations.  In particular, the Air Force JNTC funding has provided a focused upgrade to developing models for Space Based capabilities and integrated them into the Joint Live Virtual Constructive (JLVC) capabilities.  We have also supported development of cross domain solutions allowing linking of systems with differing security requirements, extending the breadth of the training audiences to additional Joint and Coalition participants.  The Air Force intends to support the President’s priorities by developing cyber simulations as well as developing deployable ranges which will allow for training to Anti-Access\/Area Denial (A2\/AD) tasks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.955"
                                            },
                                            "Text": {
                                                "val": "•  Integrated Space System Generator Version 3.0 and Global Position System (GPS) Environment Generator Version 2.5 into JLVC.\n•  Distributed Mission Operations Center–Space (DMOC-S) has expanded on Joint Air and Space Operations Center (JSpOC) Mission System (JMS) stimulation for testing and integration, leading to its inclusion in future exercise events.\n•  Demonstrated the capability to remotely stimulate the Upgraded Early Warning Radar (UEWR) Integrated Trainer (UIT) and engaged in the operational acceptance of the capability as the trainer develops.\n•  Introduced GPS jamming effects into weapons systems modeling and simulation.\nCONTINUE:  Multi-Level Security (MLS):  Enables Virtual and Constructive entities of various classification levels to be accessed by users with different security clearances and needs-to-know, and prevent users from obtaining access to information for which they lack authorization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.041"
                                            },
                                            "Text": {
                                                "val": "•  Develop a Cyber Simulator to creating a Live Virtual Constructive environment to train\/exercise offensive\/defensive tactical cyber operators.\n•  Modify current JLVC Federations to simulate Blue Cyber effects on adversary networks.  Enhanced exercise environment will simulate the execution of operational and strategic plan\/orders in a constructive environment to better train cyber warriors. \n•  Develop a Multinational Aviation Live Virtual Constructive Training System (MALTS).  This portable theater electronic warfare system will present aircrews with a highly realistic threat system.  Will provide the opportunity for aircrews to neutralize\/suppress Red Integrated Air Defense Systems (IADS).\n•  CONTINUE:  Multi-Level Security (MLS):  Enables Virtual and Constructive entities of various classification levels to be accessed by users with different security clearances and needs-to-know, and prevent users from obtaining access to information for which they lack authorization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.307"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.307"
                                            },
                                            "Text": {
                                                "val": "CONTINUE:  Cyber Simulator:  Expand the capability to create a Live Virtual Constructive environment to train\/exercise offensive\/defensive tactical cyber operators.\nCONTINUE:  Blue Cyber Effects:  Expand the capability to train cyber personnel on Blue cyber-attack on adversary networks.\nCONTINUE:  Multinational Aviation Live Virtual Constructive Training System (MALTS):  Continue development of a deployable electronic warfare range to train\/exercise aircrew capabilities.  \nCONTINUE:  Multi-Level Security (MLS):  Enables Virtual and Constructive entities of various classification levels to be accessed by users with different security clearances and needs-to-know, and prevent users from obtaining access to information for which they lack authorization."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Air Force JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.849"
                                        },
                                        "CurrentYear": {
                                            "val": "14.455"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.127"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.127"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.030"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.747"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.747"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z-"
                                    },
                                    "Title": {
                                        "val": "Air Force JNTC Procurement Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.255"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": ".255"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n•  Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n•  Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n•  Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nThe Performance Improvement and Information Management Board is the strategic forum where the outcomes of performance relative to our external customers, stakeholders, and strategic stewardship of resources are the focus of discussion.  Performance against the targets will be assessed and reported monthly, briefed quarterly to the FMB\/CAMB, and rolled up into the JCW Joint Training End-of-Fiscal Year Performance Report to ensure transparency and accountability.\n\nUSAFE ULTrA:  \n•  Feasibility study of six (6) month duration to determine optimum configuration and suggest acquisition strategy.\n•  Contract award within four (4) months of funds receipt.\n•  Engineering design complete (software integration\/hardware integration\/mobile platform developed) within six (6) months of contract award.\n•  Initial Operational Capability (IOC) (system tested and capability validated) within two (2) years of contract award.\n•  Full Operational Capability (FOC) (field use meeting requirements of all accepted missions) eighteen (18) months after IOC."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "772"
                    },
                    "ProjectTitle": {
                        "val": "Navy JNTC"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.532"
                        },
                        "CurrentYear": {
                            "val": "3.983"
                        },
                        "BudgetYearOne": {
                            "val": "4.180"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.180"
                        },
                        "BudgetYearTwo": {
                            "val": "4.360"
                        },
                        "BudgetYearThree": {
                            "val": "4.673"
                        },
                        "BudgetYearFour": {
                            "val": "4.673"
                        },
                        "BudgetYearFive": {
                            "val": "4.750"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These funds enable Navy in developing unique maritime capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment. Navy continues to develop and integrate joint training technologies that play a crucial role in its ability to address current and future joint operational training requirements.\n\nNavy JNTC RDT&E program conducts cross-service architecture certification on all T2 capable systems, developing cross-domain architectures for US and Coalition Forces as well as ensure other military service modeling\/simulation and instrumentation efforts follow a common unified standard."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Joint National Training Center"
                                    },
                                    "Description": {
                                        "val": "Supports the Secretary of Defense (SECDEF) Transformation in Training\/Joint National Training Capability (JNTC). Develops unique maritime capabilities that integrate live, virtual, and constructive elements into a seamless joint training environment. Using a scientific and phased approach and focusing on modeling ground, air, space and maritime capabilities, researches new technologies and methods that provide a crucial technology-based foundation supporting all JNTC T2 operations.  \n\nNavy JNTC T2 RDT&E efforts (JSAF M&S Development & JNTC\/JLVC Navy Federation Object Model (FOM) Integration) directly support the Unified Command Plan (UCP) and is aligned with the DOD information Operations (IO) Roadmap."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.532"
                                            },
                                            "Text": {
                                                "val": "• Continued integration of over 20 Navy programs and coalition countries into Fleet Synthetic Training - Joint (FST-J), a JNTC accredited joint training program\n• Continued alignment of NAVY Live Virtual Constructive (LVC) training standards with JLVC training standards\n• Continued development of interoperable data models and FOM specifications of emerging integrated CONOPS and Tactics, Techniques, and Procedures (TTP`s) of Navy, Joint, Service, Interagency, and Coalition participants\n• Integration of  new and updated joint ballistic missile defense (BMD) training systems including Aegis BMD baseline version 4.0.1, Aegis Ashore, Patriot, THAAD, Ground Based Interceptor (GBI), and TPY-2\n• Development of enhanced IO\/Cyberspace training architecture standards for electronic warfare\n• Continued development BLUFOR training capabilities for use in joint training exercises, including AWACS, CRC, JSTARS, E-2C, E-2D, Ep-3DDG-1000, Littoral Combat Ship (LCS), P-8A, Surface Warfare Enterprise Advanced Capability Build (ACB), P-8A, MH-60R\/S, SH-60B, and P-3C\n• Development of advanced coalition integration technology while keeping pace with coalition partner integration, including AUS FFG\/FFH, JA Aegis BMD, and GE PATRIOT\n• Development of JSAF to improve upon realistic OPFOR threat representation to meet the goals of 1) realistic combat training for EW and OPFOR threats 2) realistic opposing force representations in the areas of EW, SIGINT, ELINT and COMINT\n• Development of Integrated Air and Missile Defense (IAMD) improvements and additional features in support of Ballistic Missile Defense objectives for the Fleet, services and Joint and coalition partners\n• Development of Maritime Domain Awareness to interface with command and control systems\n• Development of capabilities to address ASW improvements from a Joint perspective\n• Development of releasable software and parametric data in support of the Korean Simulation Battle Center (KSBC) integration"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.983"
                                            },
                                            "Text": {
                                                "val": "• Continue alignment of NAVY LVC training standards with JLVC training standards, particularly next generation JLVC architecture\n• Provide capabilities that support BMD training - tailored to the Navy's DDG\/CG onboard BMD capability. This effort involves continuous integration and development of numerous BMD models at the Missile Defense Agency (MDA) as well as the communication links\/data paths that allow us to provide this training to DDG\/CG even while at sea\n• Further address additional Coalition Partner Integration, Aegis BMD 5.0, Aegis Ashore Team Trainer, Integrated Undersea Surveillance System (IUSS)\/Surveillance Towed Array Sensor System (SURTASS) integration, Combined Armed Forces (CAF) -Distributed Mission Operations (DMO) integration, Cooperative Engagement Capability (CEC), and Naval Integrated Fires Capability - Counter Air (NIFC-CA)\n• Navy will make significant improvements to JSAF's representation of a realistic threat environment to address high priority training gaps. These threat environment improvements include a more tactically-realistic electronic signals environment; unmanned Intelligence, Surveillance and Reconnaissance (ISR) platform representation and employment; support and stimuli for US signals collection models, training systems and combat systems; Electronic Attack (EA) representation; and an improved threat common operational picture representation for two-sided event support\n• Continue to invest in capabilities that mitigate joint training gaps in joint exercises and home station training\n• Extend and integrate virtual and augmented reality into training to facilitate the mastery of tasks not easily addressed in live training\n• Continue the development of JSAF’s representations to OPFOR, ASW, EW, SIGINT, ELINT, COMINT, IAMD, MDA and BMD capabilities in support of the Fleet, Joint and Coalition missions\n• Continue development in support of KSBC integration, including releasable parametrics and KSBC specific enhancements\n• Sustain and improve knowledge of and capabilities to build the capacity and competence of U.S., allied and partner forces for internal and external defense"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.180"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.180"
                                            },
                                            "Text": {
                                                "val": "• Continue alignment of NAVY LVC training standards with JLVC training standards, particularly next generation JLVC architecture\n• Continue development of BMD training capabilities, including Aegis Ashore and numerous EUCOM\/CENTCOM BMD models\n• Integration of new Cyber and Information Operations training systems, including STALLION IO trainer and UAS streaming video generation and distribution\n• Integration of additional Coalition Partner nation capabilities including Japanese PATRIOT and Air Defense Ground Environment (JADGE)\n• Continue to invest in capabilities that mitigate joint training gaps in joint exercises and home station training\n• Extend and integrate virtual and augmented reality into training to facilitate the mastery of tasks not easily addressed in live training\n• Continue the development of JSAF’s representations to OPFOR, ASW, EW, SIGINT, ELINT, COMINT, IAMD, MDA and BMD capabilities in support of the Fleet, Joint and Coalition missions\n• Continue development in support of KSBC integration, including releasable parametrics and KSBC specific enhancements"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Navy JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.069"
                                        },
                                        "CurrentYear": {
                                            "val": "7.636"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.540"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.540"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.548"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.164"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.163"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.163"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z-"
                                    },
                                    "Title": {
                                        "val": "Navy JNTC Procurement Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.650"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": ".650"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n•  Navy will produce one JSAF software release to include documentation; will design and implement upgrades to JSAF consistent with approved requirements and CRs and document the effects of JSAF capabilities (robustness) and stability.  Will design, implement, test, and integrate JSAF enhancements in accordance with requirements.\n\n•  Navy will produce one Navy Training Federation Object Model (FOM) (NTF) release to include applicable documentation updates for the Guidance, Rational, and Interoperability Manual (GRIM) and Federation Agreement document (FAD). Will implement JSAF capability enhancements to support evolving joint and Coalition training requirements.\n\n•  Navy will deliver a JSAF\/JNTC-JLVC FOM interoperability Guide.\n\n•  Navy will facilitate integration by providing dedicated support to the effort, improving the quality of participation and documentation of Navy efforts in the JNTC.  Refine and mature the Navy Training Federation Object Model (NTF), it is improving interoperability and integration with other services and the Joint community.  Provides a standardized FOM for integration across the Navy training simulations.\n\n•  Navy’s current Joint Live-Virtual-Constructive (JLVC) and other federation simulation distribution is accomplished by tying simulation data to multicast groups. This is neither a scalable solution nor is it an effective one as federates are not able to publish and subscribe with fine enough precision. The Simulation Aware Software Router will address this shortcoming, and additionally provide a flexible solution for federating heterogeneous networks and on-the-wire protocols without forcing all federates onto a single, uniform, lowest common denominator solution for each training event.  Ultimately, a simulation aware router will allow simulation users to optimize the network for both simulation scalable traffic and for voice and Command, Control, Communications, (Computers), Intelligence (C4I) traffic."
                        }
                    }
                }
            ]
        }
    }
}