{
    "id": "0111c8c686581ba224ef6388534b4955c701d856",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA2_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602618A"
        },
        "ProgramElementTitle": {
            "val": "Ballistics Technology"
        },
        "R1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "73.906"
            },
            "CurrentYear": {
                "val": "85.575"
            },
            "BudgetYearOne": {
                "val": "92.801"
            },
            "BudgetYearOneBase": {
                "val": "92.801"
            },
            "BudgetYearTwo": {
                "val": "87.540"
            },
            "BudgetYearThree": {
                "val": "89.915"
            },
            "BudgetYearFour": {
                "val": "90.850"
            },
            "BudgetYearFive": {
                "val": "93.226"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates and evaluates materials and technologies, and designs and develops methodologies and models required to enable enhanced lethality and survivability.  Project H80 focuses on applied research of lightweight armors and protective structures for the Soldier and vehicles; kinetic energy active protection; crew and components protection from ballistic shock and mine-blast; insensitive propellants\/munitions formulations; novel multi-function warhead concepts; affordable precision munitions design; and techniques, methodologies, and models to analyze combat effectiveness, and identify vulnerabilities of current and emerging technologies; and developing a demonstrator with associated methods and tools for injury prediction of vehicle occupants during under-body blast events.      \n\nWork in this PE makes extensive use of high performance computing and experimental validation and builds on research transitioned from PE 0601102A (Defense Research Sciences)\/Project H42 (Materials and Mechanics) and Project H43 (Ballistics); and utilizes emerging materials from PE 0602105A (Materials Technology) and applies it to specific Army platforms and the individual Soldier applications.  \n\nThe work in this PE complements and is fully coordinated with efforts in PE 0602120A (Sensors and Electronic Survivability), PE 0602303A (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602716A (Human Factors Engineering), PE 0602786A (Warfighter Technology), PE 0603125A (Combating Terrorism-Technology Development), PE 0603001A (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle Advanced Technology), PE 0603313A (Missile and Rocket Advanced Technology), and PE 0708045A (Manufacturing Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the U.S. Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "75.263"
                },
                "CurrentYear": {
                    "val": "85.597"
                },
                "BudgetYearOne": {
                    "val": "93.967"
                },
                "BudgetYearOneBase": {
                    "val": "93.967"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "73.906"
                },
                "CurrentYear": {
                    "val": "85.575"
                },
                "BudgetYearOne": {
                    "val": "92.801"
                },
                "BudgetYearOneBase": {
                    "val": "92.801"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.357"
                },
                "CurrentYear": {
                    "val": "-0.022"
                },
                "BudgetYearOne": {
                    "val": "-1.166"
                },
                "BudgetYearOneBase": {
                    "val": "-1.166"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.022"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.357"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.166"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.166"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H80"
                    },
                    "ProjectTitle": {
                        "val": "Survivability And Lethality Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "67.139"
                        },
                        "CurrentYear": {
                            "val": "85.575"
                        },
                        "BudgetYearOne": {
                            "val": "92.801"
                        },
                        "BudgetYearOneBase": {
                            "val": "92.801"
                        },
                        "BudgetYearTwo": {
                            "val": "87.540"
                        },
                        "BudgetYearThree": {
                            "val": "89.915"
                        },
                        "BudgetYearFour": {
                            "val": "90.850"
                        },
                        "BudgetYearFive": {
                            "val": "93.226"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, designs and develops materials,methods and models that provide Soldier protection by enhancing survivability and lethality.  Specific technology and research thrusts include: lightweight armors and protective structures; crew and component protection from ballistic shock and\/or mine-blast; insensitive high energy propellants\/munitions to increase lethality and reduce propellant\/munitions vulnerability to attack; novel kinetic energy (KE) penetrator concepts to maintain\/improve lethality; novel multi-function warhead concepts to enable defeat of a full-spectrum of targets (anti-armor, bunker, helicopter, troops); and techniques, methodologies and models to analyze combat effectiveness and identify vulnerabilities of current and emerging technologies; and developing a demonstrator and associated methods and analysis tools for injury prediction (due to underbody blast).   \n\nThis project sustains Army science and technology efforts supporting the Ground, Lethality and Soldier portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Underbody Blast & Occupant Protection"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs tools, techniques, and technologies for protection against mine\/improvised explosive device (IED) blast threats, ballistic shock mitigation, and fuel\/ammunition fires to enable survivability of current and future platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.083"
                                            },
                                            "Text": {
                                                "val": "Introduced advanced modeling tools developed under the Ballistic and Blast Loading Highly Scalable Software Institute to develop strongly hardened hull designs; and matured long-stroke technology and multi-directional seating mechanisms to further enhance interior protection along with an appropriate sensor suite for pre-activation of active seat or exterior hull mechanisms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.550"
                                            },
                                            "Text": {
                                                "val": "Continue to develop experimental and modeling approaches to identify relevant physical parameters affecting the loading from buried blast and penetrator threats; develop experimental tools to track complex occupant motion during a blast event and validate associated numerical models; and develop and validate momentum transfer concepts to absorb energy from underbody threats through a combination of materials development and structural design research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.314"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.314"
                                            },
                                            "Text": {
                                                "val": "Will investigate structural damage and response due to buried blast and penetrator threats and propose novel protection solutions to defeat these threats; develop active mechanisms including momentum transfer and other technologies to mitigate lower-extremity injuries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Hyper-Accuracy Munition Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs advanced components\/subsystems to enable a broad spectrum of future affordable direct and indirect fire precision munitions. The focus is on a multidisciplinary approach to munition systems design by coupling physics-based models of interior ballistics, launch dynamics, flight mechanics, and high-gravitational force guidance, navigation, and control (GN&C) technologies. The goal is smaller, cheaper and lighter munition components enabling low-collateral-damage precision munitions for future asymmetric operations in military operations on urban terrain (MOUT)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.903"
                                            },
                                            "Text": {
                                                "val": "Implemented new optimal terminal homing guidance laws and flight control algorithms in simulation code; conducted parametric studies across a range of attack angles to quantify resulting control effectiveness to more cost effectively and accurately hit targets; and performed lab, wind tunnel and soft launch experiments to investigate lifting surface control mechanisms and lateral & axial thrusters especially at high angles of attack."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.048"
                                            },
                                            "Text": {
                                                "val": "Advance individual component guidance technologies and simulation capability by evaluating, at bench level, candidate actuator technologies, guided spin-stabilized munition technologies, and flow control technologies; and assess concepts using multiple technologies for guided munitions in global positioning system (GPS) denied environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.812"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.812"
                                            },
                                            "Text": {
                                                "val": "Will develop nonlinear methods to assess flight dynamics and stability and to enhance control algorithm development for precision munitions; evaluate inertial navigation technologies to improve abilities to hit moving targets; and develop new electro-optic\/infrared-based navigation capabilities and assess associated in-lab maneuver performance of precision munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Disruptive Energetics and Propulsion Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, evaluates, models, and informs the selection of propulsion and energetic materials and technologies to validate novel energetic materials concepts (such as nano-structural and insensitive) that exploit managed energy release required for improving the effectiveness and reducing the vulnerability of future gun\/missile systems and warheads.  This effort builds on disruptive energetic materials discovery efforts in PE 0601102A (Defense Research Sciences)\/Project H43 (Ballistics) to synthesize new materials with energy content up to ten times that of Research Department Explosive (RDX)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.365"
                                            },
                                            "Text": {
                                                "val": "Synthesized two new energetic compounds (binder and explosive) that exhibit increased energy compared to current carbon, hydrogen, nitrogen and oxygen (CHNO) compounds; experimentally quantified their performance with a small scale technique that cost effectively requires only grams (compared to current kilogram technique); and evaluated propellant improvements for small arms ammunition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.280"
                                            },
                                            "Text": {
                                                "val": "Explore and exploit innovative methods for efficient synthesis and scale-up of disruptive energetic materials; develop novel energetic ingredients using chemical and high pressure synthesis methods; use these ingredients in new formulations for transition to weapons applications with significantly improved performance; develop multi-phase explosive and initiation concepts to maximize energy transfer to target; develop and validate numerical model of muzzle flow field in small caliber weapon systems to enable control of overpressure; and validate propulsion models and methods to enable 6 to 10 times solid propellant burn-rate\/regression-rate enhancement using nitrate ester and novel propellant ingredients."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.538"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.538"
                                            },
                                            "Text": {
                                                "val": "Will mature synthetic research on disruptive energetic materials, including nanodiamond-based materials and boron-based materials, confirming shock pressure\/temperature enhancement and measuring energies delivered to target; develop laboratory experimental capabilities for evaluating gram-scale quantities of disruptive energetic materials to determine potential for further exploration and scale-up; explore methods to reduce power required to accelerate rounds for medium-caliber weapons using computational fluid dynamics (CFD)-based models; and develop chemistry, thermodynamics, and multi-phase physics associated with increases in propellant burn rate sensitivity as a function of pressure to improve propellant efficiency and performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lethal and Scalable Effects Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort identifies and models preferred options to reduce energy\/mass required to defeat emerging armor threats and to provide multi-purpose capabilities for revolutionary future lethality. In addition, this effort investigates technology options for scaling warhead lethality to enhance urban Warfighting capabilities including control of collateral damage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.505"
                                            },
                                            "Text": {
                                                "val": "Conducted proof-of-principle experiments for man-portable weapons that validated capability to perforate wall targets including double reinforced concrete and adobe; experimentally investigated and quantified performance improvements of chemical energy weapons when nano-crystalline materials (e.g., copper and tungsten) were used; conceptualized variations in novel penetrator deployment schemes and conducted laboratory experiments to understand how deployment variations affect lethality performance; and incorporated an optimized multi-component\/jacketed shearing composite penetrator into a large caliber cartridge to examine its lethality."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.517"
                                            },
                                            "Text": {
                                                "val": "Develop small caliber soldier-portable mechanisms to defeat combatants in high-risk urban scenarios; validate robust kinetic energy penetrator concept with reduced mass while maintaining armor defeat capabilities to reduce life-cycle costs and enable defeat of future threats; and validate modeling and simulation capabilities to assess novel lethality concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.691"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.691"
                                            },
                                            "Text": {
                                                "val": "Will develop energy requirements and associated mechanisms to adapt large caliber performance to a shoulder fired system; investigate new mechanisms that take advantage of increased energy availability from enhanced gun efficiencies and new energetic materials to increase lethal capabilities; and explore new concepts to utilize lower energies on target to achieve effects ranging from non-lethal to lethal."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability\/Lethality Analyses"
                                    },
                                    "Description": {
                                        "val": "This effort devises state-of-the-art survivability\/lethality\/vulnerability methodologies to dynamically model the interaction of conventional ballistic threats against future weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.871"
                                            },
                                            "Text": {
                                                "val": "Developed new methodologies to characterize Personnel Protective Equipment armor back face deformation and assessed the associated injury incapacitation probabilities for soldiers; performed improvements to tools, techniques, and methodologies for ballistic survivability\/lethality analysis to ensure analysis tools are relevant and credible for developmental and modernized Army systems; and conducted validation and verification of the Modular Unix-based Vulnerability Estimation Suite (MUVES) 3 ballistic vulnerability and lethality code."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.566"
                                            },
                                            "Text": {
                                                "val": "Develop new methodologies to characterize behind helmet blunt trauma and assess the associated injury incapacitation probabilities for soldiers; develop predictive ammunition vulnerability methodologies (vulnerability to unintended ammunition detonation due to incoming round); perform improvements to tools, techniques, and methodologies for ballistic survivability\/lethality analysis to ensure analysis tools are relevant and credible for developmental and modernized Army systems; and conduct validation and verification of  ballistic vulnerability and lethality codes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.202"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.202"
                                            },
                                            "Text": {
                                                "val": "Will mature methodologies that characterize behind-helmet blunt trauma and assess the associated injury incapacitation probabilities for soldiers; mature predictive ammunition vulnerability methodologies (vulnerability to unintended ammunition detonation due to incoming round); mature tools, techniques, and methodologies for ballistic survivability\/lethality analysis to ensure analysis tools are relevant and credible for developmental and modernized Army systems in their operational context; and conduct validation and verification of mature ballistic vulnerability and lethality codes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Threat Armor Formulations and Designs"
                                    },
                                    "Description": {
                                        "val": "This effort devises and matures multi-threat hybrid armor technologies incorporating both active and passive mechanisms for ground vehicle systems that are effective against future conventional weapons and evolving improvised threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.764"
                                            },
                                            "Text": {
                                                "val": "Developed ceramic laminate technology, large improvised threat protection, and second generation multi-threat protection; supported transition to the U.S. Army TARDEC (PE 0602601A \/Project C05); used modeling and simulation coupled with experimentation to explore encapsulated ceramic mechanisms capable of defeating more advanced kinetic energy (KE) threats; and began exploration and concept development of novel adaptive protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.953"
                                            },
                                            "Text": {
                                                "val": "Investigate ceramic laminate characteristics to identify\/gain iterative improvements for protection during future threat\/armor engagement processes; investigate concepts for defeat of very large shaped charge threats, including developing an understanding of how various defeat mechanisms interact as threat size increases; explore novel explosive reactive armor mechanisms for defeat of advanced threats; develop new approaches for advanced KE multi-hit defeat for vehicle sides and front; validate protection capabilities against both explosively formed penetrators (EFPs) and rocket propelled grenades (RPGs) by utilizing multiple defeat mechanisms in a single system; develop new mechanisms to enable defeat of both KE and chemical energy (CE) threats in a single system; and support transitions to the U.S. Army TARDEC PE 0602601A\/Project C05and PE 0603005A \/Project 441)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.188"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.188"
                                            },
                                            "Text": {
                                                "val": "Will develop understanding of limiting mechanics of multiple impacts from advanced KE threats and expand our functional library of defeat mechanisms that are independent of size, severity, or configuration regarding shaped charge equipped warheads; develop defeat concepts that greatly expand protection from vast array of kinetic energy and shaped charge weapons; and continue support for transitions to the U.S. Army TARDEC through PE 0602601A (Combat Vehicle and Automotive Technology)\/ Project C05 (Armor Applied Research) and PE 0603005A (Combat Vehicle and Automotive Advanced Technology) \/Project 441(Combat Vehicle Mobility) as KE armors and warhead defeat mechanisms are matured."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ballistic and Blast Protection for Dismounted Soldiers"
                                    },
                                    "Description": {
                                        "val": "This effort develops unique physics-based models to understand the deflection and stress wave interactions with the human during the complex target interactions between threats and personal protective equipment (PPE).  Use of this knowledge framework to develop low technology readiness level (TRL) PPE concepts that are informed by the human effects during impact and blast events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.055"
                                            },
                                            "Text": {
                                                "val": "Developed techniques for understanding the response of biologic materials at high rates of loading that cause severe deformation and failure; and explored low TRL concepts for PPE that were based on computational simulations of the interaction of humans with the dynamic threat\/PPE impact."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.059"
                                            },
                                            "Text": {
                                                "val": "Develop an objective blunt trauma test methodology for helmets using a combination of experimental and modeling approaches, exploring relationships to injury mechanisms; and explore the use of covers and surface coatings on ceramic performance for monolithic and flexible body armor concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.758"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.758"
                                            },
                                            "Text": {
                                                "val": "Will explore novel helmet concepts that provide both ballistic and blunt trauma protection by incorporating understanding of  ballistic impact on curved structures fabricated from structural composites; explore light fabric solutions for protection from secondary blast fragments; explore novel ceramic configurations for protection against advanced kinetic energy rounds; and develop computational methodologies to support development of these technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Penetrator Lethality Applied Research"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates effects of velocity and novel penetrator designs for future lethality applications across the spectrum of targets to include vehicles, buildings, and personnel. (In FY15 this effort transfers to Lethal and Scalable Effects Technologies)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.060"
                                            },
                                            "Text": {
                                                "val": "Conducted lethality analysis (i.e., probability of kill given a target hit) across the velocity spectrum for novel penetrator concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Lethality Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on development of advanced lethal mechanisms, improved accuracy approaches, and leverages state-of-the-art materials to enable a single small arms cartridge for defeat of hard and soft targets and enable the defeat of combatants in defilade out to 2 km."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.943"
                                            },
                                            "Text": {
                                                "val": "Investigated alternate approaches to increase long range precision and improve probability of incapacitation for sniper and small arms applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.477"
                                            },
                                            "Text": {
                                                "val": "Pursue novel concepts to enable significant increases in impact velocities, reduced muzzle pressures, and increased accuracy in small caliber systems; and develop understanding of alternate approaches to achieve long range precision for 50 caliber man-portable systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.299"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.299"
                                            },
                                            "Text": {
                                                "val": "Will continue to investigate concepts and validate models to achieve significantly higher muzzle velocities in small caliber weapons; and develop deeper understanding of novel concepts such as gun tube geometries, weapon dynamics, blast attenuation, impulse management, and transitional ballistics to enhance accuracy and lethality of small caliber weapons."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warrior Injury Assessment Manikin (WIAMan)"
                                    },
                                    "Description": {
                                        "val": "This work develops an improved demonstrator blast test manikin, data acquisition system, and injury prediction methods and tools that incorporate new medical research and which provides an improved capability to measure and predict skeletal injuries for vehicle occupants during under-body blast events.  Transfer of responsibilities and funding from PE 0602787A (Medical Technology)\/Project 869 (Warfighter Health Protection & Performance Standards, U.S. Army Medical Research and Materiel Command (MRMC) to U.S. ARL effective FY15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.150"
                                            },
                                            "Text": {
                                                "val": "Completed technical data package for the design concept for a first generation, WIAMan demonstrator; began fabrication of the first generation WIAMan demonstrator and initiated manufacturing and component testing; developed new methods for injury prediction and spun-out knowledge to benefit on-going Live Fire Test & Evaluation programs; and defined concept for WIAMan data acquisition system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "Initiate validation and verification testing of the first generation WIAMan demonstrator; design and initiate development of the WIAMan data acquisition system; transfer knowledge and tools for use in Live Fire Test & Evaluation and other under-body blast survivability efforts; and conduct research to establish human tolerance to the under-body blast loading environment and development of human injury probability curves; and transfer of responsibilities and funding (PE 0602787A\/project 869) from U.S. Army Medical Research and Materiel Command (MRMC) to U.S. ARL effective FY15."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.393"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.393"
                                            },
                                            "Text": {
                                                "val": "Complete validation and verification testing of the first whole-body WIAMan demonstrator; fabricate and integrate the WIAMan data acquisition system into the manikin; revise prototype manikin design and prepare technical data package for fabrication of the next generation prototype manikin and award fabrication contract; conduct program assessment milestone review; conduct injury medical research in a blast driven environment; transfer knowledge and tools for use in Live Fire Test and Evaluation and other under-body blast survivability efforts; and conduct research to establish human tolerance to the under-body blast loading environment and development of human injury probability curves."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vulnerability Assessment of Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort reviews developmental technologies in the context of current and emerging threats, identifies tradeoffs, develops risk reduction and mitigation strategies, and promotes the development of technologies that are \"threat ready\". State-of-the-art vulnerability assessment methodology and tools are applied across a broad spectrum of threats in order to determine vulnerabilities. This effort investigates, designs, and develops methods and tools and the oversight and coordination required to execute this research across the Army enterprise. This work complements and is coordinated with PE 0603125A (Combating Terrorism-Technology Development)\/Project DF5 (Agile Integration & Demonstration)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.440"
                                            },
                                            "Text": {
                                                "val": "Designed and conducted experiments on developmental communications technologies (Multiple-Input and Multiple-Output (MIMO), Dynamic Spectrum Access, and Ultra-Wideband) to identify potential technology vulnerabilities through brute force and smart jamming approaches, spoofing, malicious code, and device discovery exploitation; determined mitigation options to address demonstrated technology vulnerabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "Select developmental (current and emerging) technologies; identify spectrum of threats for technologies identified and select high-priority threats for investigation; design, develop and mature assessment methods and tools; design and conduct experiments that will demonstrate technology vulnerabilities; and identify mitigation strategies for any vulnerabilities discovered. Technology selection will be influenced by highest priority\/highest potential payoff technologies taking in to account intelligence research, such as that performed at the National Ground Intelligence Center (e.g., high priority threat\/capabilities, threat horizon, characterization of contested environment, etc.); and design assessments with environments and factors that may be used to demonstrate vulnerabilities (electronic warfare, cyber security, survivability, lethality and system of systems). Candidates and technologies to investigate include Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and Network Modernization, Active Protection Systems, unmanned ground vehicle\/unmanned aerial vehicle technologies, hostile fire detection technologies, digital radio frequency memory (DRFM) for countermeasures\/counter-countermeasures, or optics technologies that might benefit from reduction of optical augmentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.630"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.630"
                                            },
                                            "Text": {
                                                "val": "Will conduct vulnerability assessments on critical 6.2 technologies based on Army priorities. These assessments will identify very early-on, possible vulnerabilities and shortcomings of emerging technologies and will influence future S&T investment decisions resulting in the fielding of more robust systems. Candidate technologies will be considered across all Army S&T portfolios."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection Modeling and Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development of Active Protection System (APS) technologies and common architecture to reduce vehicle weight while significantly increasing protection against current and emerging advanced threats by reducing reliance on armor through other means such as sensing, warning, and active countermeasures. The APS common architecture will provide adaptable APS solutions that can be integrated across Army vehicle platforms as required. This research includes the development of new modeling and simulation capabilities along with supporting experimental and theoretical approaches to enable active protective systems. This effort includes integrated information (e.g., battlefield geography, threat launch detection and tracking) and intelligence to inform protection optimization, requiring collaboration across multiple Army organizations. This effort complements and is coordinated with PE 0602601A (Combat Vehicle and Automotive Technology)\/Project C05 (Armor Applied Research), PE 0603004A (Weapons and Munitions Advanced Technology)\/Project 232 (Advanced Lethality & Survivability Demo), PE 0603005A (Combat Vehicle Survivability and Automotive Advanced Technology)\/Project 221 (Combat Vehicle Survivability), PE 0603270A (Electronic Warfare Technology)\/Project K16 (Non-Commo ECM Technology Demo), and PE 0603313A (Missile and Rocket Advanced Technology)\/Project 263(Future Missile Technology Integration)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.125"
                                            },
                                            "Text": {
                                                "val": "Explore threat independent hybrid\/adaptive mechanisms; develop and validate initial computational model to examine interactions of sensors and defeat mechanisms against ballistic threats; and develop active protection concepts, including countermeasures, threat warning capabilities, and dynamic threat maps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.976"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.976"
                                            },
                                            "Text": {
                                                "val": "Will develop Anti-Tank Guided Missile (ATGM) flight models; conduct warhead damage experiments into larger threats with different warhead explosives; develop softkill countermeasure models; complete integrate softkill and hardkill components and controller algorithms into an overarching softkill\/hardkill simulation; integrate results into RDECOM-level APS simulations suite."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "HB1"
                    },
                    "ProjectTitle": {
                        "val": "SURVIVABILITY AND LETHALITY TECHNOLOGIES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.767"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "These are Congressional Interest Items"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.767"
                                        },
                                        "Text": {
                                            "val": "Program Increase for the WIAMan effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}