{
    "id": "09aa11f7ec640a5903d81bbc157c9c967ab25d59",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA6_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605154N"
        },
        "ProgramElementTitle": {
            "val": "Center For Naval Analyses"
        },
        "R1LineNumber": {
            "val": "154"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "44.928"
            },
            "CurrentYear": {
                "val": "44.696"
            },
            "BudgetYearOne": {
                "val": "48.563"
            },
            "BudgetYearOneBase": {
                "val": "48.563"
            },
            "BudgetYearTwo": {
                "val": "49.773"
            },
            "BudgetYearThree": {
                "val": "50.899"
            },
            "BudgetYearFour": {
                "val": "52.080"
            },
            "BudgetYearFive": {
                "val": "53.113"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Center for Naval Analyses (CNA) is the Department of the Navy's (DoN) only Federally Funded Research and Development Center (FFRDC). CNA provides independent, objective, and expert analyses based on its unique access to sensitive data and hands-on exposure to fleet operations gained through its world-wide field program. CNA's research program is centrally funded by this program element and is primarily concentrated along one Marine Corps category and thirteen Navy categories of study called product areas. These product areas are structured to enhance CNA's focus of research and analysis upon the major present and future needs and issues of the Navy and the Marine Corps. Because of rapid advances in technology, changes in the fleet, the increasing complexity of weapon systems, and reductions in manpower, force structure, budgets, the current security environment, and Department of Defense (DoD) transformation, the Navy and Marine Corps have a greater need for analyses that are sophisticated, relevant, and timely. CNA conducts research and analysis at all security classification levels, to include Sensitive Compartmented Information (SCI) and Special Access Programs (SAP)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "46.655"
                },
                "CurrentYear": {
                    "val": "45.752"
                },
                "BudgetYearOne": {
                    "val": "45.990"
                },
                "BudgetYearOneBase": {
                    "val": "45.990"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "44.928"
                },
                "CurrentYear": {
                    "val": "44.696"
                },
                "BudgetYearOne": {
                    "val": "48.563"
                },
                "BudgetYearOneBase": {
                    "val": "48.563"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.727"
                },
                "CurrentYear": {
                    "val": "-1.056"
                },
                "BudgetYearOne": {
                    "val": "2.573"
                },
                "BudgetYearOneBase": {
                    "val": "2.573"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-1.056"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.727"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.427"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.427"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: N\/A\n\nSchedule: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0031"
                    },
                    "ProjectTitle": {
                        "val": "MCOAG"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.077"
                        },
                        "CurrentYear": {
                            "val": "5.695"
                        },
                        "BudgetYearOne": {
                            "val": "5.921"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.921"
                        },
                        "BudgetYearTwo": {
                            "val": "6.098"
                        },
                        "BudgetYearThree": {
                            "val": "6.253"
                        },
                        "BudgetYearFour": {
                            "val": "6.412"
                        },
                        "BudgetYearFive": {
                            "val": "6.546"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "9"
                            },
                            "PriorYear": {
                                "val": "9"
                            },
                            "CurrentYear": {
                                "val": "9"
                            },
                            "BudgetYearOne": {
                                "val": "8"
                            },
                            "BudgetYearOneBase": {
                                "val": "8"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the Marine Corps portion of the Department of Navy, CNA, Center for Naval Analysis Research Program, and is managed as an element of the Marine Corps Studies System. This program provides the Marine Corps with independent and objective research and analysis of specific issues\/topics appropriately performed by a Federally Funded Research and Development Center (FFRDC).  Marine Corps Division analysts work at CNA headquarters and, through CNA's Field representative Program serve at commands worldwide, including:  Marine Forces Command, Marine Forces Pacific, Marine Special Operations Command, the three Marine Expeditionary Forces, Marine Aviation Weapons and Tactics Squadron One (MAWTS-1), and in Iraq, providing on-site analysis to deployed Marine forces there. CNA also assigns analysts to support the Deputy Commandants and their staffs as well as other Marine Corps organizations such as the Marine Corps Warfighting Lab, Marine Corps Systems Command, and the Commander, Marine Forces Reserve.  The program areas are linked to the Marine Corps Advocacy (prepotency), which are: (1) Logistics and Infrastructure; (2) Manpower and Training; (3) Research, Development and Acquisition; (4) Operations and Plans; (5) Programs and Resources; (6) Aviation; (7) Combat Development and Integration; and (8) Intelligence, Surveillance and Reconnaissance.  Scientific Analyst support provides six scientific analysts for the following six focus areas: Deputy Commandant (DC), Plans, Policies and Operations; DC Aviation; DC Installation and Logistics; DC Programs and Resources; DC Manpower Reserve Affairs; and Director, Manpower Plans (MP) - Manpower and Reserve Affairs (M&RA). The program continues analytical support for field exercises, Ad Hoc and Quick Response study requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MARINE CORPS OPERATIONS AND ANALYSIS GROUP"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.077"
                                            },
                                            "Articles": {
                                                "val": "9"
                                            },
                                            "Text": {
                                                "val": "- Continued the following efforts from the FY13 Marine Corps Studies System Master Plan (MCSSMP): Marine Aviation Requirements Study; USMC Pacific Posture:  Basing and Presence for the Future; Demographic Profile of Successful\/At Risk Transitional Marines; Understanding Enduring Requirements for Unit Cohesion & Potential to Avoid \"Tiered\" Personnel Readiness; Strategy for USMC Installations in Future Budget Environment; Determining Best Practices for ANSF Advising; Marine Air Ground Task Force (MAGTF) Organic Sensing Strategy Study.\n- Provided formal study and analysis support to the operating forces and headquarters elements included in the annual MCSSMP.\n- Scientific analysts for direct analytical support to Marine Corps Headquarters staff elements: DCMC Plans, Policies, and Operations; DCMC Installations and Logistics; DCMC Manpower and Reserve Affairs (x2); DCMC Aviation; and DCMC Programs and Resources, Marine Forces Command, Marine Forces Pacific, Marine Special Operations Command, the three Marine Expeditionary Forces, Marine Aviation Weapons and Tactics Squadron One (MAWTS-1), and in Iraq, providing on-site analysis to deployed Marine forces there. CNA also assigns analysts to support the Deputy Commandants and their staffs as well as other Marine Corps organizations such as the Marine Corps Warfighting Lab, Marine Corps Systems Command, and the Commander, Marine Forces Reserve.\n- Field Representatives for direct analytical support to the Commander Marine Forces Pacific (COMMARFORPAC), Commander Marine Forces Command (MARFORCOM), Commanding General I Marine Expeditionary Force (CG I MEF), Commanding General II Marine Corps Expeditionary Force (CG II MEF), Commanding General II Marine Expeditionary Forces Forward, (II MEF Fwd), Commanding General III Marine Expeditionary Force (CG III MEF), and Commanding General, Marine Air Weapons Training Squadron (MAWTS).\n- The program areas are linked to the Marine Corps Advocacy (prepotency), which are: (1) Logistics and Infrastructure; (2) Manpower and Training; (3) Research, Development and Acquisition; (4) Operations and Plans; (5) Programs and Resources; (6) Aviation; (7) Combat Development and Integration; and (8) Intelligence, Surveillance and Reconnaissance. \n- Initiate efforts in support of the Women in Infantry program that will integrate women into occupational fields to the maximum extent possible and determine potential impacts of women in Marine Corps occupational specialties with focus on infantry. \n- Initiate high priority study and analysis projects approved in FY14 Marine Corps Studies System Master Plan (MCSSMP)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.695"
                                            },
                                            "Articles": {
                                                "val": "9"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY14\n- Initiate high priority study and analysis projects approved in FY15 MCSSMP.\n- Initiate new efforts associated with the Marine Forces Integration Plan (MCFIP) Women in Infantry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.921"
                                            },
                                            "Articles": {
                                                "val": "8"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.921"
                                            },
                                            "Articles": {
                                                "val": "8"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY15\n- Initiate high priority study and analysis projects approved in FY16 MCSSMP."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "This project supports the Marine Corps portion of the Department of Navy, CNA Center for Naval Analysis Research Program, and is managed as an element of the Marine Corps Studies System. This program provides the Marine Corps with independent and objective research and analysis of specific issues\/topics appropriately performed by a Federally Funded Research and Development Center (FFRDC).  Marine Corps Division analysts work at CNA headquarters and, through CNA's Field representative Program serve at commands worldwide, including:  Marine Forces Command, Marine Forces Pacific, Marine Special Operations Command, the three Marine Expeditionary Forces, Marine Aviation Weapons and Tactics Squadron One (MAWTS-1), and in Iraq, providing on-site analysis to deployed Marine forces there. CNA also assigns analysts to support the Deputy Commandants and their staffs as well as other Marine Corps organizations such as the Marine Corps Warfighting Lab, Marine Corps Systems Command, and the Commander, Marine Forces Reserve.  The program areas are linked to the Marine Corps Advocacy (prepotency), which are: (1) Logistics and Infrastructure; (2) Manpower and Training; (3) Research, Development and Acquisition; (4) Operations and Plans; (5) Programs and Resources; (6) Aviation; (7) Combat Development and Integration; and (8) Intelligence, Surveillance and Reconnaissance.  Scientific Analyst support provides six scientific analysts for the following six focus areas: Deputy Commandant (DC), Plans, Policies and Operations; DC Aviation; DC Installation and Logistics; DC Programs and Resources; DC Manpower Reserve Affairs; and Director, Manpower Plans (MP) - Manpower and Reserve Affairs (M&RA). \n\nThe Marine Corps' portion of the CNA program is executed via the Marine Corps Studies System (MCSS) Annual Plan which is reviewed and updated on a quarterly basis. The MCSS maintains a comprehensive listing of all CNA studies performed for the Marine Corps.  The MCSS ensures there are no duplicate analytical efforts within the Marine Corps.  Additionally, the Operations Analysis Division of Combat Integration Division (CD&I, MCCDC) provides analytical review of all CNA products for the Marine Corps and integrates the results and recommendations into a quarterly newsletter for research and analysis.  Other evaluation processes are as follows: \nA) Contract Status Meetings: The Marine Corps participates in contract status meetings. The Contracting Officer chairs monthly meetings with the Marine Corps, and members of the CNA Business Support Group to provide guidance regarding contract management to include reviewing the Defense Technical Information Center (DTIC) database requirements to emphasize the contractual requirement that all ongoing research be submitted to DTIC to ensure against duplication to reviewing CNA's cost effectiveness and efficiency.\nB) Marine Corps Three-Star Flag Officer Review: The Commanding General, CD&I, MCCDC and the Director, Operations Analysis Division (OAD) frequently to review the current research program and provide guidance to CNA regarding future research requirements. Meetings are essential to provide CNA to ensure that research conducted is of the greatest value to the Marine Corps. The meetings serve as a roadmap for future projects. The Marine Corps' research plan is consolidated with the DoN's Annual Plan that is submitted to the Deputy Chief of Naval Operations for Integration of Capabilities and Resources (N8) for final review and acceptance."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0148"
                    },
                    "ProjectTitle": {
                        "val": "Center For Naval Analyses (CNA)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "38.851"
                        },
                        "CurrentYear": {
                            "val": "39.001"
                        },
                        "BudgetYearOne": {
                            "val": "42.642"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.642"
                        },
                        "BudgetYearTwo": {
                            "val": "43.675"
                        },
                        "BudgetYearThree": {
                            "val": "44.646"
                        },
                        "BudgetYearFour": {
                            "val": "45.668"
                        },
                        "BudgetYearFive": {
                            "val": "46.567"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program supports the Navy's portion of the CNA Research Program, which is primarily concentrated along thirteen Navy categories of study called product areas. These product areas include the following: (1) Manpower\/Personnel, Medical and Training; (2) Intelligence, Information and Networks; (3) Plans, Policy, and Operations; (4) Infrastructure and Readiness; (5) Resources, Programs, and Assessments; (6) Capability Integration; (7) Research, Development and Acquisition; (8) Navy Field Program; (9) Navy Field Exercise Program; (10)Scientific Analyst Program; (11) Navy Quick Response Projects; (12) Navy General Concept Development and (13) CNA Initiated Projects. This program provides the Navy with independent and objective research and analysis of specific issues\/topics appropriately performed by a FFRDC and includes studies support (to include quick response studies support), field support to fleet commanders, scientific analyst support to Deputy Chiefs of Naval Operations (DCNOs) and their staffs, exercise support, and ad hoc support. CNA's analyses have resulted in substantial improvements in force structure, fleet effectiveness, and significant cost avoidance"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CENTER FOR NAVAL ANALYSES, NAVY"
                                    },
                                    "Description": {
                                        "val": "Funding in this project supports integrated research for the Department of Navy (DoN) and other DoD components across a broad range of issues including the development and evaluation of tactics, operations testing of new systems, assessment of current capabilities, logistics and readiness, work-force management, space and space-related activities, cyber operations, cost and operational program analysis, assessment of advanced technology, force planning, and strategies implications of political-military developments.\n\nThe increase from FY15 to FY16 reflects the Navy priorities to expand the ability to respond to both CNO tasking and anticipated real-world contingencies.\n\n."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "38.851"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "CNA initiated 451 analytic efforts in FY14. This work is for a wide range of DoN and DoD sponsors including: OPNAV and HQMC, the Navy Secretariat, Type Commanders, the numbered Fleets and Navy\/Marine Corps component commanders, Combatant Commands, Operational test and evaluation activities including OPTEVFOR and DOT&E, SYSCOMs, Office of the Secretary of Defense, Defense agencies and the Defense Intelligence Community. A few examples of recently completed or ongoing efforts that parallel the general topics mentioned in the preceding section include: helping train Carrier Strike Groups (CSGs) to operate successfully in contested RF environments; support for operational testing of the F-35, a new sensor package for the F\/A-18E\/F, and LCS mission packages; an independent assessment of the Afghan National Security Forces; assessing the consequence of maintenance delays on ship deployment readiness and analysis of Navy logistics resiliency in WESTPAC; developing recommendations to help the Navy improve FIT and FILL on its surface combatants, assessing the impact of increased OPTEMPO on officer retention, and providing analytical support for the Marine Corps Force Integration plan; analysis of cyber activity conducted against the Navy's intranet in 2013 and helping improve Fleet cyber defense; helping the Program Assessment and Root Cause Analysis (PARCA) office in OSD anticipate cost and schedule changes in defense acquisition programs; conducting a series of wargames to help the Navy examine future fleet architecture; assessing the PLA and PLAN views of the U.S rebalance to Asia and helping the Navy develop a competitive strategy for Iran.\nCNA has 43 field billets at Navy, Marine Corps, Joint and Combatant Commander commands throughout the world. Work done by CNA has supported three deployed Navy CSGs and I MEF(Forward) in ongoing operations in the CENTCOM AOR."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "39.001"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.642"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.642"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY15.\n- Initiate high priority China studies.\n- Increase efforts in Cyber security.\n- Provide additional support in the area of Electronic Warfare."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "CNA is reviewed throughout the research year on several different levels to ensure that research produced is not duplicated elsewhere. The primary (and most effective) method of review for duplication is the Contracting Officer's Technical Representative (COTR) review and approval of each and every project proposal submitted by CNA. This method is highly effective in providing the necessary oversight to ensure that duplication of effort does not occur. The Marine Corps Studies System (MCSS) maintains a comprehensive listing of all CNA studies performed for the USMC. The MCSS ensures that there are no duplicate analytical efforts within the USMC. Additionally, the Studies and Analysis Division of the Marine Corps Combat Development Command (MCCDC) provides analytical review of all CNA products for the USMC and integrates the results and recommendations into a quarterly newsletter and an annual plan for research and analysis. Other evaluation processes: \nA) DoN Contract Status Meetings: As part of the CNA oversight process, the Office of Naval Research Contracting Officer chairs a monthly meeting with the COTR, the USMC, and the CNA's Chief Financial Office to provide guidance regarding contract management. \nB) Two-Star Flag Officers and VCNO Corporate Board Meetings: DoN Two-Star and their equivalent civilian counterparts meet several times a year to review the current fiscal year's research and provide guidance to CNA regarding their future research for DoN. These high level meetings are essential to provide CNA with DoN's guidance to ensure that the research conducted is of the greatest value to DoN. The meetings also serve as the catalyst for the formation of the CNA Annual Plan, CNA's roadmap for research during the upcoming fiscal year. The CNA Annual Plan is then submitted to VCNO\/N8 for final review and acceptance. \nC) CNA Comprehensive Review: Prior to contract renewal, CNA, as an FFRDC, must be evaluated to ensure that the DoN wants to renew CNA's contract for an additional five year period. DoN completes an exhaustive review of sponsors' technical needs and mission requirements; DoN's consideration of other sources; CNA's efficiency and effectiveness; CNA's management and cost effectiveness; as well as the FFRDC establishment criteria and sponsorship agreement. The CNA Comprehensive Review is approved by ASN (RDA) and accepted by OSD (AT&L)."
                        }
                    }
                }
            ]
        }
    }
}