{
    "id": "1bf994a42e9d6a0d5dc791d8cf64dd8952a9f18e",
    "meta": {
        "filename": "dod-2016_RDTE_2016_MDA_RDTE_JustificationBook_Missile_Defense_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Missile_Defense_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603176C"
        },
        "ProgramElementTitle": {
            "val": "Advanced Concepts and Performance Assessment"
        },
        "R1LineNumber": {
            "val": "30"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.919"
            },
            "CurrentYear": {
                "val": "8.470"
            },
            "BudgetYearOne": {
                "val": "12.139"
            },
            "BudgetYearOneBase": {
                "val": "12.139"
            },
            "BudgetYearTwo": {
                "val": "13.227"
            },
            "BudgetYearThree": {
                "val": "12.932"
            },
            "BudgetYearFour": {
                "val": "13.249"
            },
            "BudgetYearFive": {
                "val": "13.219"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The FY 2016 increase funds the digital simulation and hardware in the loop infrastructure required for testing of the Multi-Spectral Targeting System (MTS-C) and Airborne Processor software prior to Standard Missile -3 Flight Test Standard Missile-01 (SFTM-01), Controlled Test Vehicle (CTV)-02 flight test, and Aegis Launch-on-Remote live fire (FTM DST-1) test missions in FY 2016 and 1Q FY 2017."
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Concepts & Performance Assessments (ACPA) program delivers an integrated government concept definition, simulation, and analysis capability and centralizes assessment of advanced Ballistic Missile Defense (BMD) technology.  Delivering insight into the performance of proposed concepts extends Missile Defense Agency's (MDA) ability to address evolving threats for the warfighter.  \n\n\nIndependent assessments of government, university, and industry technology concepts, which are used in concert with systems engineering requirements to support acquisition strategy decisions and define technology focus areas.  Innovative structured concept definition and assessment methodology enables analysts to quickly validate focus areas, verify contractor technology solutions, and evaluate promising concepts in future Ballistic Missile Defense System (BMDS) architectures.\n\n\nThis innovation significantly enhances our ability to assess technology concepts while decreasing the cost of the BMDS:\n\n- Independent model based simulations of industry technology concepts to inform systems engineering process\n- Digital simulation and hardware in the loop performance assessments of algorithms and hardware concepts prior to expensive live fire test events\n- End-to-end testing of technology concepts integrated with weapon systems and Command, Control, Battle Management and Communications (C2BMC) \n\nBetter Buying Power philosophy has been incorporated and applied to the earliest stages of technology development to maximize technology investments in a limited budget environment.\n\nMD40 Program-Wide Support (PWS) consists of essential non-headquarters management efforts providing integrated and efficient support to the MDA functions and activities across the entire Ballistic Missile Defense System (BMDS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.919"
                },
                "CurrentYear": {
                    "val": "8.470"
                },
                "BudgetYearOne": {
                    "val": "10.683"
                },
                "BudgetYearOneBase": {
                    "val": "10.683"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.919"
                },
                "CurrentYear": {
                    "val": "8.470"
                },
                "BudgetYearOne": {
                    "val": "12.139"
                },
                "BudgetYearOneBase": {
                    "val": "12.139"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.456"
                },
                "BudgetYearOneBase": {
                    "val": "1.456"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.456"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.456"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2016 increase funds the digital simulation and hardware in the loop infrastructure required for testing of the Multi-Spectral Targeting System (MTS-C) and Airborne Processor software prior to Standard Missile -3 Flight Test Standard Missile-01 (SFTM-01), Controlled Test Vehicle (CTV)-02 flight test, and Aegis Launch-on-Remote live fire (FTM DST-1) test missions in FY 2016 and 1Q FY 2017."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD71"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Concepts and Performance Assessments"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.919"
                        },
                        "CurrentYear": {
                            "val": "7.986"
                        },
                        "BudgetYearOne": {
                            "val": "11.569"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.569"
                        },
                        "BudgetYearTwo": {
                            "val": "12.568"
                        },
                        "BudgetYearThree": {
                            "val": "12.244"
                        },
                        "BudgetYearFour": {
                            "val": "12.515"
                        },
                        "BudgetYearFive": {
                            "val": "12.467"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The FY 2016 increase funds the digital simulation and hardware in the loop infrastructure required for testing of the Multi-Spectral Targeting System (MTS-C) and Airborne Processor software prior to Standard Missile -3 Flight Test Standard Missile-01 (SFTM-01), Controlled Test Vehicle (CTV)-02 flight test, and Aegis Launch-on-Remote live fire (FTM DST-1) test missions in FY 2016 and 1Q FY 2017. The FY 2016 increase reflects a realignment of Department of Defense priorities."
                        },
                        "ProjectMissionDescription": {
                            "val": "Advanced Concepts & Performance Assessment (ACPA) centralizes all Advanced Technology concept modeling, simulation, software, and analysis.  Combining models of promising technical solutions into Ballistic Missile Defense System (BMDS) system-level simulations, ACPA enables leadership to make data driven acquisition and technology investment decisions.\n\nACPA capitalizes on the innovation of small business, universities, Federally Funded Research and Development Centers (FFRDC), University Affiliated Research Centers (UARC) to pursue a broad range of hardware, software, models, algorithms, trade studies and analysis.  These innovations bring together government developed models representing existing and future ballistic missile defense architectures, technology concepts, and advanced algorithms to provide detailed assessments of concept performance and support investment decisions. \n\nThese innovations combined with a robust high performance computing infrastructure provide a unique in house government capability to demonstrate and assess technology concepts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Description": {
                                        "val": "Advanced Concepts and Performance Assessment's diverse staff of subject matter experts develops advanced concepts across the broad spectrum of Ballistic Missile Defense (BMD) Technology initiatives.\n\n- Prioritize technology investments and inform requirements\n- Develop and extend modeling techniques \n- Demonstrate concept performance against evolving threats"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Integrated Discriminating Sensor Technology prototypes with Command, Control, Battle Management, and Communications (C2BMC) and weapon systems for end-to-end capability demonstrations.  Demonstrated readiness for FTX-20 and FTM-25 \n- Independently assessed industry concepts for the Common Kill Vehicle and Re-designed Exo-atmospheric Kill Vehicle (RKV) acquisition strategy.  Developed Top Level Requirements (TLR) for RKV\n- Defined discriminating sensor component technology performance goals to meet Ballistic Missile Defense System (BMDS) mission needs \n- Delivered technology performance parameters for key MDA studies: the Homeland Defense Analysis of Alternatives and the BMDS Sensor Evaluation of Opportunities\n- Demonstrated test as you fly open architecture hardware\/software-in-the-loop testbed to verify kill vehicle and sensor performance for FTX-20 and FTM-25\n- Verified MQ-9 Airborne Processor (ABP) flight code used in FTX-20 and FTM-25 \n- Advanced sensor algorithm development and distributed C2BMC hardware-in-the-loop testing \n- Led a team of university, international, and small business partners in developing a framework for integrating and testing kill vehicle and sensor technologies from multiple suppliers"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.986"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Work with the Ballistic Missile Defense System (BMDS) Architect and Systems Engineer to provide realistic assumptions, design concepts, models and assessments for technology items included within the future BMDS, elements, and component concepts\n- Provide technology concepts, models and assessments for kill vehicles, discrimination sensors, space alternatives and directed energy systems\n- Mature tracking, discrimination, and sensor fusion algorithms \n- Demonstrate precision track through simulation exercises\n- Accelerate assessment of hardware and algorithms for space alternative sensors\n- Focus research and engineering activities from university and small business partners to identify suitable technology and concepts that improve BMDS performance through a rapid innovation model based engineering test bed \n- Reduce time to translate innovative technology into Ballistic Missile Defense System BMDS capability by providing integrated models of emerging concepts that characterize key parameters and expected performance"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.569"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.569"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Increase from FY 2015 to FY 2016, funds upgrades to the digital simulation and hardware in the loop infrastructure required to move from Multi-Spectral Targeting System B (MTS-B)  to MTS-C hardware and Airborne Processor software prior to Standard Missile -3 Flight Test Standard Missile-01 (SFTM-01), Controlled Test Vehicle (CTV)-02 flight test, and Aegis Launch-on-Remote live fire test (FTM DST-1) test missions in FY 2016 and 1Q FY 2017\n- Build the digital simulation and hardware in the loop infrastructure required for testing of the Multi-Spectral Targeting System (MTS-C) and Airborne Processor software prior to Standard Missile -3 Flight Test Standard Missile-01 (SFTM-01), Controlled Test Vehicle (CTV)-02 flight test, and Aegis Launch-on-Remote live fire test (FTM DST-1) test missions in FY 2016 and 1Q FY 2017\n- Work with the Ballistic Missile Defense System (BMDS) Architect and Systems Engineer to design concepts, build models and assess technology concepts for the future BMDS\n- Analyze discrimination sensor flight tests\n- Conduct hardware-in-the-loop (HWIL) tests\n- Develop modular open kill vehicle architecture testbed \n- Mature tracking, discrimination, and sensor fusion algorithms \n- Demonstrate precision track through digital and HWIL simulation exercises\n- Focus research and engineering activities from university and small business partners to identify suitable technology and concepts that improve (BMDS) performance through a rapid innovation model based engineering test bed \n- Reduce time to translate innovative technology into BMDS capability by providing integrated models of emerging concepts that characterize key parameters and expected performance"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603175C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.372"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "10.3720"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603177C"
                                    },
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.642"
                                        },
                                        "CurrentYear": {
                                            "val": "36.610"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.200"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.200"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603178C"
                                    },
                                    "Title": {
                                        "val": "Weapons Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.268"
                                        },
                                        "CurrentYear": {
                                            "val": "54.068"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.389"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.389"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "48.912"
                                        },
                                        "BudgetYearThree": {
                                            "val": "70.115"
                                        },
                                        "BudgetYearFour": {
                                            "val": "54.595"
                                        },
                                        "BudgetYearFive": {
                                            "val": "66.797"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603180C"
                                    },
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.025"
                                        },
                                        "CurrentYear": {
                                            "val": "16.584"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.364"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.364"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.919"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.380"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.069"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.457"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603294C"
                                    },
                                    "Title": {
                                        "val": "Common Kill Vehicle Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "67.796"
                                        },
                                        "CurrentYear": {
                                            "val": "25.639"
                                        },
                                        "BudgetYearOne": {
                                            "val": "46.753"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "46.753"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "75.262"
                                        },
                                        "BudgetYearThree": {
                                            "val": "71.476"
                                        },
                                        "BudgetYearFour": {
                                            "val": "86.814"
                                        },
                                        "BudgetYearFive": {
                                            "val": "99.701"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603904C"
                                    },
                                    "Title": {
                                        "val": "Missile Defense Integration and Operations Center (MDIOC)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "50.271"
                                        },
                                        "CurrentYear": {
                                            "val": "58.503"
                                        },
                                        "BudgetYearOne": {
                                            "val": "49.211"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "49.211"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "58.074"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.655"
                                        },
                                        "BudgetYearFour": {
                                            "val": "55.194"
                                        },
                                        "BudgetYearFive": {
                                            "val": "57.162"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Advanced Concepts and Performance Assessment utilizes an acquisition strategy that continues its successful partnerships with Small Business, the Aviation & Missile Research Development & Engineering Center (AMRDEC), Federally Funded Research and Development Centers (FFRDCs) and University Affiliated Research Centers (UARCs) to provide concept modeling and assessment capability. This innovative strategy leverages agency and partner subject matter experts and government model based assessments to inform Better Buying Power acquisition decisions."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.484"
                        },
                        "BudgetYearOne": {
                            "val": "0.570"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.570"
                        },
                        "BudgetYearTwo": {
                            "val": "0.659"
                        },
                        "BudgetYearThree": {
                            "val": "0.688"
                        },
                        "BudgetYearFour": {
                            "val": "0.734"
                        },
                        "BudgetYearFive": {
                            "val": "0.752"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Program-Wide Support (PWS) contains non-headquarters management costs in support of Missile Defense Agency (MDA) functions and activities across the entire Ballistic Missile Defense System (BMDS). It Includes Government Civilians, Contract Support Services, and Federally Funded Research and Development Center (FFRDC) support.  This provides integrity and oversight of the BMDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes Global Deployment personnel and support performing deployment site preparation and activation and, provides facility capabilities for MDA Executing Agent locations.  Other MDA wide costs includes:  physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office and equipment leases; utilities; data and unified communications support; supplies and maintenance; materiel and readiness and central property management of equipment; and similar operating expenses. Program Wide Support is allocated on a pro-rata basis and therefore, fluctuates by year based on the total adjusted RDT&E profile (which excludes:0305103C Cyber Security Initiative, 0603274C Special Program, 0603913C Israeli Cooperative Program and 0901598C Management Headquarters)."
                        }
                    }
                }
            ]
        }
    }
}