{
    "id": "280e0377910a062ae48b816802934b1f32d5bc35",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DSCA_RDTE_JustificationBook_Defense_Security_Cooperation_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Security_Cooperation_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Security Cooperation Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605127T"
        },
        "ProgramElementTitle": {
            "val": "Regional International Outreach (RIO) - Partnership for Peace Information Management System (PIMS)"
        },
        "R1LineNumber": {
            "val": "179"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Security Cooperation Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "7.081"
            },
            "PriorYear": {
                "val": "3.270"
            },
            "CurrentYear": {
                "val": "1.750"
            },
            "BudgetYearOne": {
                "val": "1.750"
            },
            "BudgetYearOneBase": {
                "val": "1.750"
            },
            "BudgetYearTwo": {
                "val": "1.750"
            },
            "BudgetYearThree": {
                "val": "1.750"
            },
            "BudgetYearFour": {
                "val": "1.783"
            },
            "BudgetYearFive": {
                "val": "1.817"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Regional International Outreach (RIO) - Partnership for Peace (PfP) Information Management System (PIMS) is an Office of the Secretary of Defense (OSD) initiative.  The primary focus of the program is a common information technology platform (GlobalNET) to improve international partner outreach and collaboration efforts in a federated environment. A federated environment – characterized by the capacity of DoD institutions and Partners to directly share participants and content across proprietary community websites - fostering networks of partner influencers and enabling better use of DoD resources through collaboration among the Regional Centers for Security Studies, PfP and international partners, other DoD educational institutions and communities as required. The program uses a spiral methodology (making available capabilities as developed), to speed the delivery of open source collaboration technologies the user community. The Defense Security Cooperation Agency (DSCA) oversees execution of the research and development of the GlobalNET effort and its operations, and ensures that the program addresses DoD security cooperation requirements in the context of defense, interagency, and international information sharing and collaboration needs.\n\nThe GlobalNET effort focuses on improving collaboration, supporting outreach efforts, and enabling communication among the Regional Centers for Security Studies, the Combatant Commanders, the DSCA, OUSD (Policy), North Atlantic Treaty Organization’s (NATO) Military Partnerships Directorate (MPD), the PfP Consortium of Defense Academies, PfP Partner countries, and other designated DoD institutions and communities. It provides DoD and international partner security practitioners a platform to share information, communicate and collaborate, and improve administrative activities. It also provides the ability to form collaborative communities of interest around security issues. GlobalNET facilitates information sharing and knowledge management concepts in accordance with U.S. policy. PIMS, as a part of the NATO Enlargement Facilitation Act of 1996, implements the Congressional endorsement for the modernization of Defense capabilities in eligible PfP countries relative to their telecommunications infrastructure.  RIO-PIMS provides allies and partner countries the ability to collaborate in critical cooperative activities that underpin the spirit of the PfP program.  The program supports PfP coalition initiatives through development of distributive collaboration tools to support aspects of U.S. and NATO-approved PfP cooperative activities.  This support is important to achieve the interoperability\/integration outlined in the Guidance for the Employment of the Force.  RIO-PIMS supports internet-based education and collaboration, exercise simulations, and training center requirements. \n\nThe Regional Centers Person\/Activity Management System (RCPAMS) provides an integrated student and activities management framework for the Regional Centers for Security Studies that was designed to complement the capabilities of the Security Assistance Network (SAN).  Data updates in GlobalNET and RCPAMS will be shared to ensure data integrity."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.270"
                },
                "CurrentYear": {
                    "val": "1.750"
                },
                "BudgetYearOne": {
                    "val": "1.750"
                },
                "BudgetYearOneBase": {
                    "val": "1.750"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.270"
                },
                "CurrentYear": {
                    "val": "1.750"
                },
                "BudgetYearOne": {
                    "val": "1.750"
                },
                "BudgetYearOneBase": {
                    "val": "1.750"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014:  RIO-PIMS required $3.270 to research and implement the learning management module identified as required from multiple user communities in FY 2014; move the system out of current hosted environment and deploy it in a FEDRAMP compliant hosting facility; to research the computer human interface (CHI) ensuring it is closely aligned with the new stakeholder workflow;, migrate the technology from an older code base to a newer version reducing security vulnerabilities and making system extensions less costly to perform and maintain; deploy a native video teleconference (VTC) capability to replace the existing Adobe connect system; update and complete DIACAP paperwork and support DSCA CIO to get a GIG waiver.\n\nFY2015: The decrease reflects sequestration reduction and SBIR\/STTR transfer\n\nFY2016:  No Change"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "000000"
                    },
                    "ProjectTitle": {
                        "val": "Regional International Outreach - Partnership for Peace Information Management Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.081"
                        },
                        "PriorYear": {
                            "val": "3.270"
                        },
                        "CurrentYear": {
                            "val": "1.750"
                        },
                        "BudgetYearOne": {
                            "val": "1.750"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.750"
                        },
                        "BudgetYearTwo": {
                            "val": "1.750"
                        },
                        "BudgetYearThree": {
                            "val": "1.750"
                        },
                        "BudgetYearFour": {
                            "val": "1.783"
                        },
                        "BudgetYearFive": {
                            "val": "1.817"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Regional International Outreach (RIO) - Partnership for Peace (PfP) Information Management System (PIMS) is an Office of the Secretary of Defense (OSD) initiative.  The primary focus of the program is a common information technology platform (GlobalNET) to improve international partner outreach and collaboration efforts in a federated environment. A federated environment – characterized by the capacity of DoD institutions and Partners to directly share participants and content across proprietary community websites - fosters networks of partner influencers and enables better use of DoD resources through collaboration among the Regional Centers for Security Studies, PfP and international partners, other DoD educational institutions and communities as required. The program uses a spiral methodology (making available capabilities as developed), to speed the delivery of open source collaboration technologies the user community. The Defense Security Cooperation Agency (DSCA) oversees execution of the research and development of the GlobalNET effort and its operations, and ensures that the program addresses DoD security cooperation requirements in the context of defense, interagency, and international information sharing and collaboration needs.\n\nThe GlobalNET effort focuses on improving collaboration, supporting outreach efforts, and enabling communication among the Regional Centers for Security Studies, the Combatant Commanders, the DSCA, OUSD (Policy), North Atlantic Treaty Organization’s (NATO) Military Partnerships Directorate (MPD), the PfP Consortium of Defense Academies, PfP Partner countries, and other designated DoD institutions and communities. It provides DoD and international partner security practitioners a platform to share information, communicate and collaborate, and improve administrative activities. It also provides the ability to form collaborative communities of interest around security issues. GlobalNET facilitates information sharing and knowledge management concepts in accordance with U.S. policy. PIMS, as a part of the NATO Enlargement Facilitation Act of 1996, implements the Congressional endorsement for the modernization of Defense capabilities in eligible PfP countries relative to their telecommunications infrastructure.  RIO-PIMS provides allies and partner countries the ability to collaborate in critical cooperative activities that underpin the spirit of the PfP program.  The program supports PfP coalition initiatives through development of distributive collaboration tools to support aspects of U.S. and NATO-approved PfP cooperative activities.  This support is important to achieve the interoperability\/integration outlined in the Guidance for the Employment of the Force.  RIO-PIMS supports internet-based education and collaboration, exercise simulations, and training center requirements. \n\nThe Regional Centers Person\/Activity Management System (RCPAMS) provides an integrated student and activities management framework that was designed to complement the capabilities of the Security Assistance Network (SAN).  The interface between the SAN, RCPAMS, and GlobalNET will provide faculty and students an effective information service to ensure student, activity, and alumni management.  Data will be shared between the systems ensuring improved data integrity."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Regional International Outreach - Partnership for Peace Information Management System"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.270"
                                            },
                                            "Text": {
                                                "val": "Move the system out of current hosted environment and deploy it in a FEDRAMP compliant hosting facility.  Currently the security requirements according to the DSCA CIO do not meet the new baseline requirements and need to be hardened.  The technology is intended to be hosted at the same facility as RCPAMS taking advantage of economies of scale. At the same time, update and complete new DIACAP paperwork and support DSCA CIO to get a GIG waiver.\n\nImplement the learning management module identified as required. Users have identified the current workflow built into the system as incomplete and it is required to be extended.  The NATO School uses an open source LMS that we will make available via GlobalNET with single sign –on which they currently lack this gives us economies of scale that can be realized and by using NATO School’s open source LMS which will be less costly than extending the software for this functionality.\n\nCommon access card (CAC) enable the system.  As the system was designed to support foreign nationals, it does not support CAC authentication and with the security requirements and the inclusion of more US citizens, CAC enablement will provide more access control and easier access.\n\nMigrate the technology from an older code base to a newer version.  GlobalNET is at risk for falling two major software releases behind, increasing the lack of supportability and development personnel.  The update will certify all of the extensions and move to the most recent stable version which will reduce security vulnerabilities and make system extensions less costly to perform and maintain\n\nContinue to research the computer human interface (CHI) ensuring it is closer aligned with the consolidated workflow. We continue to refine the interface such that users are finding operations to be easier and more intuitive to perform.\n\nDeploy a native video teleconference (VTC) capability to replace the existing hosted service.  GlobalNET is currently bundled with a loosely coupled Adobe connect system outside of the GlobalNET stack and hosting environment.  The capability would create a native VTC capability inside of the platform allowing much tighter integrations with messaging, file sharing, white boarding, and chatting and reduce the operations and maintenance (O&M) expense of leasing this service.\n\nWork with the existing platform managers to update the GlobalNET implementation to the newest platform stable release - allowing greater functionality and better security across all members of the platform.\n\nExtend the information exchange between the RCPAMS and GlobalNET.  The exchange is only working for exporting users from RCPAMS to GlobalNET for account provisioning and there are three additional functions to implement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "Add redundant\/additional user capacity.  This includes expanding the hardware and software to an alternate site to allow additional users to access and use the system concurrently and be a backup site in the event of a disaster or failure.  Because of all of the advanced graphics and expansion of the user base, it is expected that we will need this additional capacity and the best plan to distribute it out to an alternate location.\n\nEnsure that discovery is much easier including adding the capability to refine search results using a keyword based refinement methodology.  The amount of data the system will be collecting dictates greater refinement of the search results.  In addition, build the capability to allow the users to refine the data by multiple folders. \n\nRe-engineer the security model to allow much greater granular permission on functions.  The current model does not allow permissions down to the activity level and that is need as more users are starting to restrict access to functions. \n\nRe-engineer the email integration capabilities.  Put more control on the content of sent emails and well as greater capabilities to receive emails and incorporated them into the system as natively entered data elements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "Add redundant\/additional user capacity.  This includes expanding the hardware and software to an alternate site to allow additional users to access and use the system concurrently and be a backup site in the event of a disaster or failure.  Because of all of the advanced graphics and expansion of the user base, it is expected that we will need this additional capacity and the best plan to distribute it out to an alternate location."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The GlobalNET effort employs a spiral acquisition strategy to ensure a well-defined model for each institution\/community that can be exported globally.  The program uses a regional approach to ensure sustainable, leave-behind technology and information sharing procedures.  By partnering with other U.S. Government agencies, existing assets are leveraged to preserve U.S. investments, avoid duplication of effort between agencies, and offer economically prudent solutions to improve information sharing and achieve U.S. security cooperation goals.  Independent Operational Test teams were brought on to ensure that GlobalNET and bears independent validation of the development team’s effort.  GlobalNET has regional based personnel to assist in the adoption of the platform with partners who are not familiar with social collaboration and networking media.  RCPAMS uses a similar spiral approach, testing and fielding approach."
                        },
                        "PerformanceMetrics": {
                            "val": "RIO-PIMS projects performance is measured in several methods: the successful meeting of stated performance objectives in the statement of work, and meeting target dates in the project management plan; via a combination of statistics including the number of trouble tickets generated on the development site, operational user feedback on development site usability, and design; and the system’s performance during developmental and operational testing.   The use of a 3rd party to execute the operational test ensures that the system meets the performance metrics prior to moving to production."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Defense Security Cooperation Agency"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Merlin International"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Englewood, CO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.081"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.270"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.750"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.750"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.750"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Deploy System"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award Support Services Contract for Support, ISP, and Limited Equipment Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Refine Interface for Community Use"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Certification and Accreditation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Deploy full RCPAMS Interface"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Identify New Institutions for GlobalNET"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Upgrade Core and Maintenance Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Deploy to Other Institutions"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}