{
    "id": "289d7a0d00748ca7fe58dc34ae77d48dddd685c7",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602131M"
        },
        "ProgramElementTitle": {
            "val": "Marine Corps Lndg Force Tech"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "45.834"
            },
            "CurrentYear": {
                "val": "45.782"
            },
            "BudgetYearOne": {
                "val": "49.001"
            },
            "BudgetYearOneBase": {
                "val": "49.001"
            },
            "BudgetYearTwo": {
                "val": "49.590"
            },
            "BudgetYearThree": {
                "val": "50.936"
            },
            "BudgetYearFour": {
                "val": "51.036"
            },
            "BudgetYearFive": {
                "val": "51.036"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Science and Technology (S&T) Strategic Plan approved by the S&T Corporate Board (June 2012).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. This PE also directly supports Expeditionary Force 21 (EF 21), which  is now the Marine Corps' capstone concept that establishes  the vision and goals for USMC S&T over the next 10 years and provides a plan for guiding the design and development of the future force.  One third of the Marine Corps operating forces will be forward  deployed.  These forces will be task-organized into a greater variety of formations, capable of operating from a more diverse array of ships dispersed over wider areas, in order to meet the Combatant Commanders' security cooperation and partner engagement requirements.  In the event of crises, those forces will be able to composite these distributed formations into larger, cohesive naval formations.  This presents both challenges and opportunities for USMC S&T. Expeditionary Force 21 will inform future decisions regarding how the Marine Corps will adjust organizational structure to exploit the value of regionally focused forces.  A fixed geographic orientation will facilitate Marine Commanders and their staffs with more frequent interactions with theater- and component-level organizations, establishing professional bonds and a shared sense of the area's challenges and opportunities.  Expeditionary Force 21 provides the basis for future Navy and Marine Corps capability development to meet the challenges of the 21st Century.  The vision for Expeditionary Force 21 is to provide guidance for how the Marine Corps will be postured, organized, trained, and equipped to fulfill the responsibilities and missions required around the world.  Through Expeditionary Force 21, the Marine Corps intends to operate from the sea and provide the right sized force in the right place, at the right time.\n\nThis PE is organized into nine activities which are represented as seven Expeditionary Warfighting Capability Areas, as well as Future Concepts, Technology Assessment and Roadmapping, and the Littoral Combat\/Power Projection (LC\/PP) FNC.  The primary objective of this PE is to develop and demonstrate the technologies needed to meet the Marine Corps unique responsibility of training and equipping the Marine Air\/Ground Task Force (MAGTF) for Expeditionary Maneuver Warfare.  In the post-September 11 world, irregular warfare (IW) has emerged as the dominant form of warfare confronting the United States, its allies and its partners; accordingly, this PE has been structured to account for distributed, long-duration operations, including unconventional warfare, counterterrorism, counterinsurgency, and stabilization and reconstruction operations.  IW emphasizes the use of indirect, non-conventional methods and means to subvert, attrite, and exhaust an adversary, or render irrelevant, rather than defeat him through direct conventional military confrontation.   IW is now institutionalized in Marine Corps planning, investment, and capability development.  This PE provides the knowledge base to support Advanced Technology Development (6.3) and is the technology base for future expeditionary warfare capabilities.  This PE supports the Expeditionary Force Development System of the Marine Corps Combat Development Command (MCCDC) and responds directly to the Marine Corps Science and Technology (S&T) process as well as supporting related Littoral and Expeditionary Maneuver Warfare capabilities developed by the Navy's Mission Capability Program.  The Future Naval Capabilities (FNC) process is supported and funds are programmed accordingly.  The FNC program explores and demonstrates technologies that enable Sea Strike, Sea Shield, Sea Basing, FORCEnet and Force Health Protection pillars, Space, Naval Expeditionary Maneuver Warfare and the Enterprise and Platform Enablers.  The FNC program comprises Enabling Capabilities (ECs) which develop and deliver quantifiable products (i.e., prototype systems, knowledge products, and technology improvements) in response to validated requirements for insertion into acquisition programs of record after meeting agreed upon exit criteria within five years. The core 6.2 program also supports Discovery and Invention (D&I) and Innovation and Transformation (I&T).  Within the Naval Transformation Roadmap, this investment will achieve key transformational capabilities required by the Sea Power 21 Pillars, as well as enable Ship to Objective Maneuver (STOM), Persistent Intelligence, Surveillance and Reconnaissance and Overseas Contingency Operations (OCO).  The Marine Corps Service Campaign Plan (MCSCP) is the lens through which USMC S&T priorities are acted upon to guide the future development of the Total Force.\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "47.334"
                },
                "CurrentYear": {
                    "val": "45.831"
                },
                "BudgetYearOne": {
                    "val": "49.001"
                },
                "BudgetYearOneBase": {
                    "val": "49.001"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "45.834"
                },
                "CurrentYear": {
                    "val": "45.782"
                },
                "BudgetYearOne": {
                    "val": "49.001"
                },
                "BudgetYearOneBase": {
                    "val": "49.001"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.500"
                },
                "CurrentYear": {
                    "val": "-0.049"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.049"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.500"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not Applicable.\n\nSchedule: Not Applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3001"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps Landing Force Tech"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "45.834"
                        },
                        "CurrentYear": {
                            "val": "45.782"
                        },
                        "BudgetYearOne": {
                            "val": "49.001"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.001"
                        },
                        "BudgetYearTwo": {
                            "val": "49.590"
                        },
                        "BudgetYearThree": {
                            "val": "50.936"
                        },
                        "BudgetYearFour": {
                            "val": "51.036"
                        },
                        "BudgetYearFive": {
                            "val": "51.036"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project is organized into nine activities, which are represented as seven Expeditionary Warfighting Capability Areas, as well as Future Concepts, Technology Assessment and Roadmapping; and the Littoral Combat\/Power Projection (LC\/PP) FNC.  The seven Expeditionary Warfighting Areas support the Discovery and Invention (D&I) and the Innovation and Transformation (I&T) investment.  The LC\/PP FNC supports the Exploitation and Deployment (E&D) investment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "FIREPOWER"
                                    },
                                    "Description": {
                                        "val": "This activity develops technology for application on current and future expeditionary weapons and elements of the kill chain. It includes, but is not limited to, the following technologies:  Fuze, fire control, launch\/propulsion, lethality, and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.658"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of a concept for an insensitive munitions propulsion system to enable firing a shoulder launched rocket from an enclosed space.\n- Continued investigation of the scalability of variable effects conventional munitions and gun technology for improving firepower effectiveness while increasing affordability and decreasing logistics burden in support of expeditionary warfare.\n- Continued development of collaborative fires coordination technologies.\n- Continued development of precision fires engagement technologies, to include trajectory shaped 81mm mortars.\n- Continued expanded efforts in lightweight weapons and ammunition (crew served weapons, small arms ammunition, and packaging), to include Caseless (CL) Ammunition. This includes priority USMC fires efforts in Micro-electromechanical Systems (MEMS) Safe and Arm (S&A), to develop a Military Standard (MilStd) 1316 compliant S&A for incorporation into developmental precision 81mm mortar munitions and MEMS Initiation Safety Device (ISD), to develop MilStd 1901A compliant igniters for current and developmental weapons propulsion systems as well as a Revolutionary Target Effects project, to develop conventional warhead concepts for breaching specific urban targets.\n- Continued Targeting & Engagement and Precision Target Location efforts that include Non-Magnetic Azimuth Sensing (NMAS) Technology. NMAS will continue to develop various technologies to achieve higher performance than previously possible while decreasing size and weight.\n- Continued design and development of lightweight technologies to provide individual Marines enhanced capabilities to detect and identify man-sized targets at least out to the maximum effective ranges of their individual weapons, during all conditions (daylight, limited visibility, & darkness), by integrating multiple optics capabilities into a single system.\n- Continued E&D portion of NMAS technology development to reduce size, weight and power (SWaP) while increasing performance.\n- Continued Hypervelocity Gun Propulsion project, to investigate hypervelocity gun technologies for Marine expeditionary weapons systems as possible artillery, tank main gun, and\/or naval surface fire support replacement systems.\n- Continued Semi-Autonomous Fires Technology.\n- Continued Awareness for Lightweight Engagements and Remote Targeting (ALERT) to develop large aperture, lightweight lens with enhanced fields of view. \n- Initiated Azimuth and Inertial Micro-electromechanical System (MEMS) Navigation System (AIM) to develop low cost, precision, inertial navigation systems for use in highly accurate handheld targeting systems, shoulder launched missiles, and munitions.\n- Initiated Caseless, Lightweight, Low-volume Round (CLLVR) to develop lightweight, small caliber ammunition for individual, crew served, and remotely mounted weapons.\n- Initiated Advanced Sensors Applications (ASA) to develop Short Wave Infrared (SWIR) imagers for guided munitions seekers.\n- Initiated Disruptive Energetic Materials (DEM) to exploit nano-energetics developments for significant enhancement of explosive yield per warhead mass and volume."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.942"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of a concept for an insensitive munitions propulsion system to enable firing a shoulder launched rocket from an enclosed space.\n- Continue investigation of the scalability of variable effects conventional munitions and gun technology for improving firepower effectiveness while increasing affordability and decreasing logistics burden in support of expeditionary warfare.\n- Continue development of precision fires engagement technologies, to include trajectory shaped 81mm mortars, 83mm missiles, and smaller precision munitions. \n- Continue design and development of lightweight technologies to provide individual Marines enhanced capabilities to detect and identify man-sized targets at least out to the maximum effective ranges of their individual weapons, during all conditions (daylight, limited visibility, & darkness), by integrating multiple optics capabilities into a single system.\n- Continue Semi-Autonomous Fires Technology.\n- Continue Awareness for Lightweight Engagements and Remote Targeting (ALERT) to develop large aperture, lightweight lens with enhanced fields of view. \n- Continue Azimuth and Inertial Micro-electromechanical System (MEMS) Navigation System (AIM) to develop low cost, precision, inertial navigation systems for use in highly accurate handheld targeting systems, shoulder launched missiles, and munitions.\n- Continue Caseless, Lightweight, Low-volume Round (CLLVR) to develop lightweight, small caliber ammunition for individual, crew served, and remotely mounted weapons.\n- Continue Disruptive Energetic Materials (DEM) to exploit nano-energetics developments for significant enhancement of explosive yield per warhead mass and volume.\n- Complete development of collaborative fires coordination technologies.\n- Complete expanded efforts in lightweight weapons and ammunition (crew served weapons, small arms ammunition, and packaging), to include Caseless (CL) Ammunition. This includes priority USMC fires efforts in Micro-electromechanical Systems (MEMS) Safe and Arm (S&A), to develop a Military Standard (MilStd) 1316 compliant S&A for incorporation into developmental precision 81mm mortar munitions and MEMS Initiation Safety Device (ISD), to develop MilStd 1901A compliant igniters for current and developmental weapons propulsion systems as well as a Revolutionary Target Effects project, to develop conventional warhead concepts for breaching specific urban targets. \n- Complete USMC fires efforts in MEMS Safe and Arm (S&A), to develop a Military Standard (MilStd) 1316 compliant S&A for incorporation into developmental precision 81mm mortar munitions and MEMS Initiation Safety Device (ISD), to develop MilStd 1901A compliant igniters for current and developmental weapons propulsion systems.\n- Complete Revolutionary Target Effects project, to develop conventional warhead concepts for breaching specific urban targets.\n- Complete Targeting & Engagement and Precision Target Location efforts that include Non-Magnetic Azimuth Sensing (NMAS) Technology by transitioning to the AIM Future Naval Capability project. \n- Complete (E&D) portion of NMAS Technology development to reduce size, weight and power (SWaP) while increasing performance by transitioning to the AIM Future Naval Capability project. \n- Complete Hypervelocity Gun Propulsion project, to investigate hypervelocity gun technologies for Marine expeditionary weapons systems as possible artillery, tank main gun, and\/or naval surface fire support replacement systems.\n- Complete Advanced Sensors Applications (ASA) to develop Short Wave Infrared (SWIR) imagers for guided munitions seekers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue investigation of the scalability of variable effects conventional munitions and gun technology for improving firepower effectiveness while increasing affordability and decreasing logistics burden in support of expeditionary warfare.\n- Continue development of precision fires engagement technologies, to include trajectory shaped 81mm mortars, 83mm missiles, and smaller precision munitions. \n- Continue design and development of lightweight technologies to provide individual Marines enhanced capabilities to detect and identify man-sized targets at least out to the maximum effective ranges of their individual weapons, during all conditions (daylight, limited visibility, & darkness), by integrating multiple optics capabilities into a single system.\n- Continue Semi-Autonomous Fires Technology.\n- Continue Awareness for Lightweight Engagements and Remote Targeting (ALERT) to develop large aperture, lightweight lens with enhanced fields of view. \n- Continue Azimuth and Inertial Micro-electromechanical System (MEMS) Navigation System (AIM) to develop low cost, precision, inertial navigation systems for use in highly accurate handheld targeting systems, shoulder launched missiles, and munitions.\n- Continue Caseless, Lightweight, Low-volume Round (CLLVR) to develop lightweight, small caliber ammunition for individual, crew served, and remotely mounted weapons.\n- Continue Disruptive Energetic Materials (DEM) to exploit nano-energetics developments for significant enhancement of explosive yield per warhead mass and volume.\n- Complete the development of a concept for an insensitive munitions propulsion system to enable firing a shoulder launched rocket from an enclosed space. This program will transition to the Future Naval Capabilities program.\n- Initiate High-Reliability Dual Purpose Improved Conventional Munitions (DPICM) Replacement (HRDR) to develop high-reliability sub-munitions fuzing technologies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE PROTECTION"
                                    },
                                    "Description": {
                                        "val": "This activity supports the Force Protection Thrust's applied research program. Technologies are being developed that focus on the following: Explosive Hazard avoidance, detection, breaching\/neutralization, marking and analysis;  Air Defense\/Counter Rocket, Artillery, and Mortars; Counter tactical surveillance and targeting, and technologies for improved protection for individuals including Marine Personnel Protective Equipment against blast, ballistic and blunt impact threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of technologies for stand-off detection and neutralization of mines, IEDs, and Unexploded Ordnance (UXO) (Transitioned from Maneuver activity).\n- Continued development of technologies to defeat side\/top attack and advanced mine fuzes (seismic, acoustic, and infrared) through advanced signature reduction, duplication, and projection (Transitioned from Maneuver activity).\n- Continued technology development programs to address force protection personal protective equipment capability gaps (Transitioned from Maneuver activity).\n- Continued Counter Rockets, Artillery, Mortars, and Sniper efforts addressing indications and warnings for pre-shot sniper detection and enabling detection of sniper observation and targeting in advance of a ballistic event.\n- Continued the demonstration of the feasibility of a deployable mission package consisting of technologies capable of screening multiple individuals rapidly over a wide area to detect, classify and track suicide bombers at relevant distances within a critical time frame. Due to an urgent Naval operational need, this effort was initiated in FY 2011.  \n- Continued a scientific study of laser technology readiness, performing technology roadmapping, and conducting system level simulations.  This effort was initiated in FY 2011 due to an urgent operational need. This effort continues in FY 2012 and will assess the suitability of lasers on the battlefield and drive future HEL technology investment plans and support the acquisition process.\n- Continued the development of technologies that will detect and classify optics (sniper scopes, ccds, eyeball, etc.) from a moving platform. \n- Continued a study regarding the feasibility of detecting and locating sniper weapons using the return of their unique radar signatures that was initiated in FY 2011 due to operational urgency. \n- Continued a spectral signature classification efforts for Mine Counter Measure (MCM) applications (Transitioned from Maneuver activity).\n- Completed development of computational models to scale the effects of small-scale explosives tests to full-scale landmine explosions in order to study mine blast effects on advanced vehicle geometry. \n- Completed technology development efforts to detect and defeat incoming rocket, artillery, and mortar threats via non-kinetic means.\n- Completed multi-spectral protection efforts against battlefield directed energy weapons.\n- Completed a study of automated human detection via spectral imaging during low-light level operation conditions (e.g. dusk\/dawn\/moonlit\/starlit night). \n- Completed the development of technologies that will detect Rocket Propelled Grenades (RPGs) and Anti-Tank Guided Missiles (ATGMs) prior to launch, and countermeasures after launch. \n- Completed development of technologies to defeat advanced mine fuzes (seismic, acoustic, and infrared) (Transitioned from Maneuver activity). \n- Completed studies of sensor fields to identify and classify mine threats.\n- Completed evaluation of active wideband double notch filters for a wide, spur-free dynamic range in specific frequencies of interest to cover a variety of threats. \n- Completed an Explosive Hazard Defeat for IED Neutralization effort focused on applying passive infrared phenomenology understanding to a capability enabling defeat of PIR devices from significant stand-off distances. \n- Completed development and demonstrate technologies that will detect RPGs and ATGMs prior to launch and countermeasures after launch. \n- Initiated a program to determine the feasibility to detect and neutralize anti-helicopter mine threat. \n- Initiated the refinement and improve current suite of advanced biomechanical instrumentation to assess potential reductions of Warfighter mobility and functionality caused by PPE systems.\n- Initiated the scientific investigation into an integrated PPE performance tool for assessing coordinated human and armor performance (mobility, back-face deformation, area of coverage, propensity for injury and mass)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.472"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of technologies for stand-off detection and neutralization of mines, IEDs, and Unexploded Ordnance (UXO) (Transitioned from Maneuver activity).\n- Continue development of technologies to defeat side\/top attack and advanced mine fuzes (seismic, acoustic, and infrared) through advanced signature reduction, duplication, and projection (Transitioned from Maneuver activity).\n- Continue technology development programs to address force protection personal protective equipment capability gaps (Transitioned from Maneuver activity).\n- Continued Counter Rockets, Artillery, Mortars, and Sniper efforts addressing indications and warnings for pre-shot sniper detection and enabling detection of sniper observation and targeting in advance of a ballistic event.\n- Continue the development of technologies that will detect and classify optics (sniper scopes, ccds, eyeball, etc) from a moving platform from an effort that was initiated in FY 2011 due to an urgent operational need. \n- Continue a program to determine the feasibility to detect and neutralize anti-helicopter mine threat. \n- Continue the refinement and improve current suite of advanced biomechanical instrumentation to assess potential reductions of Warfighter mobility and functionality caused by PPE systems.\n- Continue the scientific investigation into an integrated PPE performance tool for assessing coordinated human and armor performance (mobility, back-face deformation, area of coverage, propensity for injury and mass).\n- Complete a study regarding the feasibility of detecting and locating sniper weapons using the return of their unique radar signatures that was initiated in FY 2011 due to operational urgency. \n- Complete spectral signature classification efforts for Mine Counter Measure (MCM) applications (Transitioned from Maneuver activity).\n- Complete the demonstration of the feasibility of a deployable mission package consisting of technologies capable of screening multiple individuals rapidly over a wide area to detect, classify and track suicide bombers at relevant distances within a critical time frame. \n- Complete a scientific study of laser technology readiness, performing technology roadmapping, and conducting system level simulations.  This effort was initiated in FY 2011 due to an urgent operational need. This effort continues in FY 2012 and will assess the suitability of lasers on the battlefield and drive future HEL technology investment plans and support the acquisition process. \n- Initiate program to study the fundamental sciences of homemade explosives due to urgent operational needs.\n- Initiate broad based material (ceramics, fiber and Fiber Re-Enforced Plastics) studies so that significant weight reductions (greater than 50%) can be achieved.\n- Initiate studies to improve ballistic and blast armor material and systems models so that novel concepts can be evaluated and material property characteristics which provide the necessary improvements can be identified prior to significant monetary investments.\n- Initiate modeling and simulation efforts for the Warfighter-as-a-System analysis approach and methodology combining survivability, mobility, and warfighter performance parameters.\""
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.567"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.567"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of technologies for stand-off detection and neutralization of mines, IEDs, and Unexploded Ordnance (UXO) (Transitioned from Maneuver activity).\n- Continue development of technologies to defeat side\/top attack and advanced mine fuzes (seismic, acoustic, and infrared) through advanced signature reduction, duplication, and projection (Transitioned from Maneuver activity).\n- Continue technology development programs to address force protection personal protective equipment capability gaps (Transitioned from Maneuver activity).\n- Continue Counter Rockets, Artillery, Mortars, and Sniper efforts addressing indications and warnings for pre-shot sniper detection and enabling detection of sniper observation and targeting in advance of a ballistic event.\n- Continue the development of technologies that will detect and classify optics (sniper scopes, ccds, eyeball, etc) from a moving platform. \n- Continue a program to determine the feasibility to detect and neutralize anti-helicopter mine threat. \n- Continue the refinement and improve current suite of advanced biomechanical instrumentation to assess potential reductions of Warfighter mobility and functionality caused by PPE systems.\n- Continue the scientific investigation into an integrated PPE performance tool for assessing coordinated human and armor performance (mobility, back-face deformation, area of coverage, propensity for injury and mass).\n- Continue based material (ceramics, fiber and Fiber Re-Enforced Plastics) studies so that significant weight reductions (greater than 50%) can be achieved.\n- Continue studies to improve ballistic and blast armor material and systems models so that novel concepts can be evaluated and material property characteristics which provide the necessary improvements can be identified prior to significant monetary investments.\n- Continue modeling and simulation efforts for the Warfighter-as-a-System analysis approach and methodology combining survivability, mobility, and warfighter performance parameters.  \n- Complete program to study the fundamental sciences of homemade explosives due to urgent operational needs.\n- Initiate a program to develop modular mission packages for the detection, neutralization, marking and reporting of explosive hazards using multiple, existing vehicles in movement to contact and amphibious raid scenarios.\n- Initiate a program to study the use of autonomous vehicles in the detection, neutralization, marking and reporting of explosive hazards using multiple, existing vehicles in movement to contact and amphibious raid scenarios."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FUTURE CONCEPTS, TECHNOLOGY ASSESSMENT, AND ROADMAPPING"
                                    },
                                    "Description": {
                                        "val": "This activity supports the planning and integration of technology development efforts across the entire PE.  In conjunction with the Concepts Based Capabilities System and the Marine Corps Warfighting Laboratory, unique and novel concepts for advanced warfighting are developed and validated.  Effectiveness analyses are conducted to identify the synergistic effects that can be achieved through the integration of emerging technology with innovative tactics, doctrine, and techniques.  Technology assessments are conducted to determine the supporting technologies that have the highest impact across the warfare areas, and warrant further investment within this PE.  Technology Roadmapping is conducted to help identify opportunities to leverage technology development within the Department of the Navy and the Department of Defense, as well as, with the commercial sector and university communities.  The resultant technology investment strategy is developed and used to guide out-year technology development efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.313"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued assessments in Lightening the Marine's Load and Enhancing the Capabilities of the Marine Corps Rifle Squad.\n- Continued planning and integration of technology development efforts to meet imposing security threats that challenge our Nation.\n- Continued assessments in Asymmetric\/Irregular Warfare and Distributed Operations.\n- Continued an assessment of the S&T impacts of the Marine Corps concept of force employment to meet the need for counterinsurgency and building partnership capacity.  How the Marine Corps will support the National Defense Strategy (NDS) and multinational efforts in the Global War on Terrorism\/Long War will have long-term S&T impacts.\n- Continued a Cargo Unmanned Aerial study focused on Ship-to-Objective Maneuver (STOM) and developmental technologies for expeditionary operations, to include ground autonomous capabilities.\n- Continued an assessment of Unmanned Ground Systems Affordability, Experimentation and Rapid Prototyping Investments and formulating a USMC S&T future strategy.\n- Continued an effort focused on the suitability of lasers on the battlefield and formulating future High Energy Laser technology investment plans that support the acquisition process.\n- Completed an assessment of DoD-Wide programs to increase individual resiliency training throughout unit forming, training, deployment and post deployment phases. The objective is to provide the best skills and tools available to Marines and their leaders so that they can better cope with the challenges of combat and the rigor of life as a Marine, both deployed and in garrison."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.353"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue planning and integration of technology development efforts to meet imposing security threats that challenge our Nation.\n- Complete assessments in Lightening the Marine's Load and Enhancing the Capabilities of the Marine Corps Rifle Squad.\n- Complete assessments in Asymmetric\/Irregular Warfare and Distributed Operations.\n- Complete an assessment of the S&T impacts of the Marine Corps concept of force employment to meet the need for counterinsurgency and building partnership capacity. \n- Complete a Cargo Unmanned Aerial study focused on Ship-to-Objective Maneuver (STOM) and developmental technologies for expeditionary operations, to include ground autonomous capabilities.\n- Complete an assessment of Unmanned Ground Systems Affordability, Experimentation and Rapid Prototyping Investments and formulate a USMC S&T future strategy.\n- Complete an effort focused on the suitability of lasers on the battlefield and formulate future High Energy Laser technology investment plans that support the acquisition process.\n- Initiate a careful analysis of trends that can identify emerging changes in the security environment that are likely to have significant implications for U.S. ground forces. The output will be used to reduce risk and hedge against the surprises that will inevitably occur.\n- Initiate a technology assessment for a Cyber\/Electronic Warfare Coordination Cell (CEWCC) to enable seamless integration of kinetic and non-kinetic fires during expeditionary operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.426"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.426"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue planning and integration of technology development efforts to meet imposing security threats that challenge our Nation.\n- Continue a technology assessment for a Cyber\/Electronic Warfare Coordination Cell (CEWCC) to enable seamless integration of kinetic and non-kinetic fires during expeditionary operations.  \n- Complete a careful analysis of trends that can identify emerging changes in the security environment that are likely to have significant implications for U.S. ground forces. The output will be used to reduce risk and hedge against the surprises that will inevitably occur.\n- Initiate a review and assess the Marine Corps' required surface connector capabilities specifically exploring promising and relevant research, technologies, capabilities and opportunities by which the Marine Corps can anticipate and identify potential solutions\" that meet the service's surface connector requirements.\n- Initiate a review and assessment of Expeditionary Force 21.  This new USMC concept describes how the Marine Corps must deploy and operate, and what force attributes will be required.  This study will describe Expeditionary Force 21 implications for S&T. Nested directly under Cooperative Strategy 21 (Naval Strategy), Expeditionary Force 21 covers a 10-year planning horizon that informs, and is informed by, other USMC concepts and documents."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN PERFORMANCE, TRAINING AND EDUCATION"
                                    },
                                    "Description": {
                                        "val": "This activity addresses the applied research effort of the Human Performance Training and Education thrust (HPT&E).  The HPT&E thrust investment profile is directed at two technology investment areas, Warrior Resilience, and Decision Making and Expertise Development. The funding aligned to Warrior Resilience is focused on advanced training technologies and methodologies that enhance neural, cognitive, and physical readiness.  Those funds aligned to Decision Making and Expertise Development refers to training and education technologies and methodologies that accelerate the development and improve the retention of skills in decision making, situation awareness, and individual and team adaptability and coordination on decentralized, dynamic and dispersed battlefields."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.702"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of team training mitigation strategies triggered by behavioral and neurophysiological markers of learning, cognition, and expertise.\n- Continued studies into next generation physical performance enhancement methodologies and technologies (enhanced warfighter psycho-physical performance). \n- Continued research to evaluate the feasibility of integrating augmented reality technologies into current and emerging training systems. \n- Continued the development of foundational learning theories extended to complex tasks for a range of expertise levels, training mitigation strategies triggered by neurophysiological markers of learning, cognition and expertise, and principles of expertise development on a continuum of novice to expert. \n- Continued evaluations of asymmetric distributed learning techniques for distributed operations, language, and cultural training. \n- Continued additional Human Performance and Training efforts (Cognitive and physical enhancement, modeling and simulation, and virtual reality squad level training in support of Distributed Operations). \n- Continued a Mind-Body Integration Systems effort to improve team training by developing and validating Electroencephalogram (EEG) (and other physiological and performance measures) for use in assessing team performance, coordination, and cohesion in training environments. \n- Continued Advanced Mobile Assessment and Field Readiness Technologies to improve the capability to assess situational awareness in the field and predict physical performance by developing mobile, rugged tools, algorithms, and models. \n- Continued additional efforts to incorporate effects of nutrition and functional fitness into models and simulations in the Distributed Operations Virtual Toolkit. \n- Continued development of team training\/immersive approaches towards language and culture training that incorporate foundational learning theories and other advanced educational methods. \n- Continued development of squad-level team training mitigation strategies triggered by behavioral and\nneurophysiological markers of learning, cognition, and expertise. \n- Continued development of field team performance mitigation strategies triggered by behavioral and\nneurophysiological markers of learning, cognition, and expertise.\n- Continued research into cold tolerance biomarkers for the individual warfighter.\n- Continued research into Acclimatization Strategies for Optimized Performance at Altitude, drawing on findings from previous research done in the field.\n- Continued research into mobile brain imaging to enhance warfighter performance.\n- Continued research into haptic solutions for immersive training environments.\n- Continued research into skills retention technologies, advancing the Smart Tutoring System.\n- Continued research into tools for distributed training (trend analysis).\n- Completed research into acclimatization parameters to enhance warfighter performance. \n- Completed research into heat stress mitigations for the individual warfighter, and develop intervention strategies to improve performance in hot environments.\n- Completed research into distributed mobile architectures to support US Marine Corps training.\n- Completed research to improve nutritional optimization strategies for enhancing performance of warfighters.\n- Initiated research into a multi-modal framework for assessing stress resiliency; develop, test and evaluate non-contact, video and audio-based human response measures for use in detecting degree and type of stress for eventual integration into a resiliency training program.\n- Initiated research into the architecture for stress, performance, inoculation, resilience, and endurance (ASPIRE); development of an inductive framework of stressors, stress proneness, and stress resilience, while also building an actionable, deductive counterpart of these stress variables that will ultimately include an operational taxonomy of stress resilience components, combined with an integrated stress resilience framework.\n- Initiated research into methodologies for assessing training and for training adaptability, identifying key salient components of adaptive behavior for Warfighter tactical tasks; research into the development of a generalized framework for adaptive behavior that can be applied to any appropriate tactical task, and the creation of methodologies for training interventions that demonstrates the feasibility of using virtual training experiences to accelerate the development of adaptive decision-making expertise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.992"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue studies into next generation physical performance enhancement methodologies and technologies (enhanced warfighter psycho-physical performance). \n- Continue research to evaluate the feasibility of integrating augmented reality technologies into current and emerging training systems.\n- Continue the development of foundational learning theories extended to complex tasks for a range of expertise levels, training mitigation strategies triggered by neurophysiological markers of learning, cognition and expertise, and principles of expertise development on a continuum of novice to expert.\n- Complete research into a multi-modal framework for assessing stress resiliency; develop, test and evaluate non-contact, video and audio-based human response measures for use in detecting degree and type of stress for eventual integration into a resiliency training program.\n- Complete research into methodologies for assessing training and for training adaptability, identifying key salient components of adaptive behavior for Warfighter tactical tasks; research into the development of a generalized framework for adaptive behavior that can be applied to any appropriate tactical task, and the creation of methodologies for training interventions that demonstrates the feasibility of using virtual training experiences to accelerate the development of adaptive decision-making expertise.\n- Complete evaluations of asymmetric distributed learning techniques for distributed operations, language, and cultural training.\n- Complete additional Human Performance and Training efforts (Cognitive and physical enhancement, modeling and simulation, and virtual reality squad level training in support of Distributed Operations). \n- Complete a Mind-Body Integration Systems effort to improve team training by developing and validating Electroencephalogram (EEG) (and other physiological and performance measures) for use in assessing team performance, coordination, and cohesion in training environments.\n- Complete Advanced Mobile Assessment and Field Readiness Technologies to improve the capability to assess situational awareness in the field and predict physical performance by developing mobile, rugged tools, algorithms, and models. \n- Complete additional efforts to incorporate effects of nutrition and functional fitness into models and simulations in the Distributed Operations Virtual Toolkit.\n- Complete development of team training mitigation strategies triggered by behavioral and neurophysiological markers of learning, cognition, and expertise.\n- Complete development of team training\/immersive approaches towards language and culture training that incorporate foundational learning theories and other advanced educational methods.\n- Complete development of squad-level team training mitigation strategies triggered by behavioral and\nneurophysiological markers of learning, cognition, and expertise.\n- Complete development of field team performance mitigation strategies triggered by behavioral and\nneurophysiological markers of learning, cognition, and expertise.    \n- Complete research into cold tolerance biomarkers for the individual warfighter.\n- Complete research into Acclimatization Strategies for Optimized Performance at Altitude, drawing on findings from previous research done in the field.\n- Complete research into mobile brain imaging to enhance warfighter performance.\n- Complete research into haptic solutions for immersive training environments.\n- Complete research into skills retention technologies, advancing the Smart Tutoring System.\n- Complete research into tools for distributed training (trend analysis).\n- Complete research into the architecture for stress, performance, inoculation, resilience, and endurance (ASPIRE); development of an inductive framework of stressors, stress proneness, and stress resilience, while also building an actionable, deductive counterpart of these stress variables that will ultimately include an operational taxonomy of stress resilience components, combined with an integrated stress resilience framework.\n- Initiate research into the effects of glucose administration to mitigate stress reactions in trauma patients. This effort initiated in FY 2014 due to urgent operational requirements.\n- Initiate design and development of an automated functional movement screening system to provide a low cost accurate solution for fit-for-duty evaluations and injury prevention training. This effort initiated in FY 14 due to urgent operational requirements.\n- Initiate development of statistical methods for measuring small unit decision making (SUDM), using previous work on developing assessments of small unit decision making (e.g., Levels of Mastery), and provide a series of training sessions on statistical modeling to enable ground work to be laid by SUDM projects to also use statistical modeling.  This effort initiated in FY 2014 due to urgent operational requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.078"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.078"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue studies into next generation physical performance enhancement methodologies and technologies (enhanced warfighter psycho-physical performance). \n- Continue research to evaluate the feasibility of integrating augmented reality technologies into current and emerging training systems. \n- Continue the development of foundational learning theories extended to complex tasks for a range of expertise levels, training mitigation strategies triggered by neurophysiological markers of learning, cognition and expertise, and principles of expertise development on a continuum of novice to expert. \n- Continue design and development of an automated functional movement screening system to provide a low cost accurate solution for fit-for-duty evaluations and injury prevention training. \n- Continue development of statistical methods for measuring small unit decision making (SUDM), using previous work on developing assessments of small unit decision making (e.g., Levels of Mastery), and provide a series of training sessions on statistical modeling to enable ground work to be laid by SUDM projects to also use statistical modeling.  \n- Continue research into the effects of glucose administration to mitigate stress reactions in trauma patients. \n- Initiate research into automated simulation content generation via a field worn sensor suite.  \n- Initiate research for establishing optimal training intervals for improvement in physical performance and warrior mindset."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INTELLIGENCE, SURVEILLANCE, AND RECONNAISSANCE (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity develops ISR technologies for applications in future intelligence, surveillance, and reconnaissance.  Technologies being pursued enhance situational awareness, persistent surveillance, and tactical decision making through automated analysis of data and rapid integration of information and acquired knowledge.  Specific technologies in this activity effectively present actionable information to decision-makers, especially those at the lower command levels.  This includes biometrics for expeditionary operations, complete future automation of options and persistent surveillance in support of distributed operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.686"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of information fusion technologies to allow automated construction of a common tactical picture from various sources of sensor data.\n- Continued development of low power consumption urban sensing technologies.\n- Continued development of tagging, tracking and locating technologies to monitor adversary movement.\n- Continued development of information on demand technologies to provide the warfighter with the right information at the right time.\n- Continued development of distributed information architecture technologies.\n- Continued development of a single, integrated, battlespace picture with tactical and strategic injections that begins to close the gap between ISR and C2.\n- Continued development of advanced tactical nets to include additional phenomenologies and the netting of C2, Sensors and Analysis nodes.\n- Continued efforts addressing \"battlespace awareness\" of human networks, improving the accuracy of classification decisions and enabling a human network predictive capability. Once a human network sensor can be defined and dynamically observed in a common feature space, predictive capabilities are realized. If one network is observed to be moving towards at risk behavior, a generalized force warning may be enabled addressing the threat associated with all networks with similar human network sensors. When combined, research into human network awareness, network classification and network prediction, will be a powerful tool for warfare against the irregular actor.\n- Continued development of capabilities to integrate socio-cultural models of human behavior with the ability to forecast the processes of decision making through predictive forecasting models.\n- Continued development of approach to model and expose enemy networks, actions, and reactions through statistical models with techniques for probabilistic forecasting of behaviors of interest, with consideration for open source information and conventional intelligence data sources.\n- Continued development of sensors that provide near-real-time decision support to distributed operations by detecting specific interactions utilizing nanotechnology.\n- Continued efforts to derive high resolution models of human networks statistically, with associated behavior attributes.\n- Continued work on influencing, disrupting, and stimulating behavior by fusing high resolution models of decisions with models of human networks.  This includes work to provide an accurate decision tool to the warfighter that is relevant to irregular warfare, and development of tools to enable robust facial recognition in poor conditions and difficult environments.\n- Continued development of model based adversarial decision making stimulus and manipulation that will assist in the influence of decisions made by adversaries to our benefit.\n- Continued research in automated techniques to establish the reliability of data from human and machine sources.  \n- Continued technology development efforts required to enable a lightweight hyperspectral sensor capable of material characterization.\n- Continued research on the development of networked, ultra low power, long life and smart ground sensors. \n- Continued research to develop algorithms that can disambiguate complex network graphs containing millions of sparsely characterized nodes.\n- Continued Sensor Fields efforts such as Nanotechnology Enabled Witness Fields, development of sensors that provide near real time decision support to distributed operations by detecting specific interactions, and nanotechnology efforts which offer the potential to revolutionize tactical sensors. To enable this capability, nanomaterials that change state in the presence of another nanomaterial will be developed.  \n- Continued development of urban sensing technologies to detect weapons at distance.\n- Continued development of advanced tactical sensor technologies to improve unit awareness.\n- Continued development of adaptable enemy course of action engine to manipulate adversary decisions.\n- Continued Actionable Intelligence for Expeditionary and Irregular Warfare effort which includes real-time methods for Identifying Human Networks.  \n- Continued efforts to track entities of interest in a high clutter environment via geolocation of optical tags from a UAV platform.\n- Continued work on specific nanomaterial triggers and receptors.\n- Continued work on new optical taggants with improved producibility.  \n- Initiated development of advanced analytics (data disambiguation, conditioning, fusion and dissemination) as a set of map reduce tasks that can run across a highly distributed data architecture.  \n- Initiated development of own force decision aids based on imprecisely-specified multi-attribute utility theory.\n- Initiated the development of automated workflow managers enabled by the semantic representation of tasks and resources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.844"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of information fusion technologies to allow automated construction of a common tactical picture from various sources of sensor data.\n- Continue development of low power consumption urban sensing technologies.\n- Continue development of tagging, tracking and locating technologies to monitor adversary movement.\n- Continue development of information on demand technologies to provide the warfighter with the right information at the right time.\n- Continue development of urban sensing technologies to detect weapons at distance.\n- Continue development of advanced tactical sensor technologies to improve unit awareness.\n- Continue development of distributed information architecture technologies.\n- Continue development of a single, integrated, battlespace picture with tactical and strategic injections that begins to close the gap between ISR and C2.\n- Continue Actionable Intelligence for Expeditionary and Irregular Warfare effort which includes real-time methods for Identifying Human Networks.\n- Continue efforts addressing \"battlespace awareness\" of human networks, improving the accuracy of classification decisions and enabling a human network predictive capability. Once a human network sensor can be defined and dynamically observed in a common feature space, predictive capabilities are realized. If one network is observed to be moving towards at risk behavior, a generalized force warning may be enabled addressing the threat associated with all networks with similar human network sensors. When combined, research into human network awareness, network classification and network prediction, will be a powerful tool for warfare against the irregular actor.\n- Continue development of adaptable enemy course of action engine to manipulate adversary decisions.\n- Continue efforts to track entities of interest in a high clutter environment via geolocation of optical tags from a UAV platform.\n- Continue development of capabilities to integrate socio-cultural models of human behavior with the ability to forecast the processes of decision making through predictive forecasting models.\n- Continue efforts to derive high resolution models of human networks statistically, with associated behavior attributes.\n- Continue work on specific nanomaterial triggers and receptors.\n- Continue work on new optical taggants with improved producibility.  \n- Continue research in automated techniques to establish the reliability of data from human and machine sources.  \n- Continue technology development efforts required to enable a lightweight hyperspectral sensor capable of material characterization.\n- Continue research on the development of networked, ultra low power, long life and smart ground sensors.  \n- Continue research to develop algorithms that can disambiguate complex network graphs containing millions of sparsely characterized nodes.\n- Continue development of advanced analytics (data disambiguation, conditioning, fusion and dissemination) as a set of map reduce tasks that can run across a highly distributed data architecture.  \n- Complete development of advanced tactical nets to include additional phenomenologies and the netting of C2, Sensors and Analysis nodes.\n- Complete new Sensor Fields efforts such as Nanotechnology Enabled Witness Fields, development of sensors that provide near real time decision support to distributed operations by detecting specific interactions, and nanotechnology efforts which offer the potential to revolutionize tactical sensors. To enable this capability, nanomaterials that change state in the presence of another nanomaterial will be developed.  \n- Complete development of approach to model and expose enemy networks, actions, and reactions through statistical models with techniques for probabilistic forecasting of behaviors of interest, with consideration for open source information and conventional intelligence data sources.\n- Complete development of sensors that provide near-real-time decision support to distributed operations by detecting specific interactions utilizing nanotechnology.\n- Complete work on influencing, disrupting, and stimulating behavior by fusing high resolution models of decisions with models of human networks.  This includes work to provide an accurate decision tool to the warfighter that is relevant to irregular warfare, and development of tools to enable robust facial recognition in poor conditions and difficult environments.\n- Complete development of model based adversarial decision making stimulus and manipulation that will assist in the influence of decisions made by adversaries to our benefit.\n- Complete development of own force decision aids based on imprecisely-specified multi-attribute utility theory.\n- Complete the development of automated workflow managers enabled by the semantic representation of tasks and resources.\n- Initiate research in analytics for limited and isolated computational environments to enable advanced analytic capabilities to be available on expeditionary lightweight computing platforms.\n- Initiate research on the automated deconfliction and fusion of multi-intelligence tracks on movers of interest, enabled by a rich maritime ontology and active wiki technology.   \n- Initiate research on the technologies needed to develop a sensor\/force and analytic task planner informed by real time predictive analysis for power restricted cells.\n- Initiate research on technologies needed to produce products from multi-modal information in response to information requirements by leveraging cloud data access capabilities.\n- Initiate research on technologies needed to tailor information delivery to warfighters based on mission context and user preferences.  \n- Initiate research on technologies needed to enable multi-INT sensors to collaborate in real time on complex fusion tasks.\n- Initiate research in the detection of partially observed patterns of interest in large and diverse data streams.\n-  Initiate research in representing the content of large data stores in a way that allows remote and accurate searching against data indexes to be enabled.\n-  Initiate research in deep machine understanding of information requirements relevant to amphibious warfare.\n-  Initiate research in characterizing patterns of life from persistent track data.\n-  Initiate research on collapsing networks inferred from disparate data sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.893"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.893"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of low power consumption urban sensing technologies.\n- Continue development of information on demand technologies to provide the warfighter with the right information at the right time.\n- Continue development of distributed information architecture technologies.\n- Continue efforts addressing \"battlespace awareness\" of human networks, improving the accuracy of classification decisions and enabling a human network predictive capability. Once a human network sensor can be defined and dynamically observed in a common feature space, predictive capabilities are realized. If one network is observed to be moving towards at risk behavior, a generalized force warning may be enabled addressing the threat associated with all networks with similar human network sensors. When combined, research into human network awareness, network classification and network prediction, will be a powerful tool for warfare against the irregular actor.\n- Continue development of capabilities to integrate socio-cultural models of human behavior with the ability to forecast the processes of decision making through predictive forecasting models.\n- Continue efforts to derive high resolution models of human networks statistically, with associated behavior attributes.\n- Continue development of urban sensing technologies to detect weapons at distance.\n- Continue development of advanced tactical sensor technologies to improve unit awareness.\n- Continue development of adaptable enemy course of action engine to manipulate adversary decisions.\n- Continue Actionable Intelligence for Expeditionary and Irregular Warfare effort which includes real-time methods for Identifying Human Networks.  \n- Continued efforts to track entities of interest in a high clutter environment via geolocation of optical tags from a UAV platform.\n- Continue work on specific nanomaterial triggers and receptors.\n- Continue work on new optical taggants with improved producibility. \n- Continue research in automated techniques to establish the reliability of data from human and machine sources.  \n- Continue technology development efforts required to enable a lightweight hyperspectral sensor capable of material characterization.\n- Continue research to develop algorithms that can disambiguate complex network graphs containing millions of sparsely characterized nodes.\n- Continue development of advanced analytics (data disambiguation, conditioning, fusion and dissemination) as a set of map reduce tasks that can run across a highly distributed data architecture.\n- Continue research in analytics for limited and isolated computational environments to enable advanced analytic capabilities to be available on expeditionary lightweight computing platforms.\n- Continue research on the automated deconfliction and fusion of multi-intelligence tracks on movers of interest, enabled by a rich maritime ontology and active wiki technology.\n- Continue research on the technologies needed to develop a sensor\/force and analytic task planner informed by real time predictive analysis for power restricted cells.\n- Continue research on technologies needed to produce products from multi-modal information in response to information requirements by leveraging cloud data access capabilities.\n- Continue research on technologies needed to enable multi-INT sensors to collaborate in real time on complex fusion tasks.\n- Continue research in the detection of partially observed patterns of interest in large and diverse data streams.\n- Continue research in representing the content of large data stores in a way that allows remote and accurate searching against data indexes to be enabled.\n- Continue research in deep machine understanding of information requirements relevant to amphibious warfare.\n- Continue research in characterizing patterns of life from persistent track data.\n- Continue research on collapsing networks inferred from disparate data sources.\n- Complete development of information fusion technologies to allow automated construction of a common tactical picture from various sources of sensor data.\n- Complete development of tagging, tracking and locating technologies to monitor adversary movement.\n- Complete development of a single, integrated, battlespace picture with tactical and strategic injections that begins to close the gap between ISR and C2.\n- Complete research on the development of networked, ultra low power, long life and smart ground sensors. \n- Complete research on technologies needed to tailor information delivery to warfighters based on mission context and user preferences.\n- Initiate project to enable the synchronized planning and management and ISR assets given a set of disparate mission information requirements. \n- Initiate effort to represent disparate data as a reduced feature vector."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LITTORAL COMBAT\/POWER PROJECTION"
                                    },
                                    "Description": {
                                        "val": "This activity addresses the applied research associated with the Marine Corps participation in the Department of the Navy's (DoN) Science and Technology Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the DoN Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are generated by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders.  The funding is aligned with the Naval challenges associated with projecting power despite anti-access and area denial, specifically the Sea Shield, Power and Energy, FORCEnet, and the Naval Expeditionary Maneuver Warfare warfighting capability gaps. The funding profile reflects the alignment of the FNC program investments into Enabling Capabilities (ECs); ECs respond to priority Naval warfighting capability gaps.  Funding for each EC is aligned to a 6.2 or 6.3 Budget Activity (BA) as appropriate.  Concurrent funding for Naval Expeditionary Warfare capability ECs is also provided from Navy PE0602750N and PE0603673N. Both of the Navy PE's were included in the FY 2013 President's Budget Request and are now the only program elements funding Navy FNC work.  In previous submissions 7 Navy 6.2 PEs and 8 Navy 6.3 PEs funded FNC efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of wide area surgical and persistent surveillance technologies. (Concurrent funding provided by PE 0602271N and PE 0603640M). \n- Continued development of the Ground Based Air Defense On-the-move high energy laser demonstrator. (Concurrent funding in PE 0603640M). \n- Continued development and began transitioning EFV obstacle detection capability to EFV Direct Reporting Program Manager.\n- Continued development of integrated vehicle self-defense system to defeat incoming RPGs. \n- Continued transparent urban structure 'see thru the wall', image and mapping technologies development. \n- Continued development of an integrated, company level, Urban Sensor Suite. (Automated Control of Large Sensor Networks Transitions to PE 0602235N). \n- Continued detect and identify facilities technology development. (Transparent Urban Structures). \n- Continued decision aids technology development. \n- Continued development of Modular Scalable Effects weapons technologies. (Concurrent funding in PE 0603640M). \n- Continued development of tactical urban breaching technologies. Due to required program necessities resourcing of continued development of tactical urban breaching technologies has been realigned to PE 0603640M. \n- Continued development of individual Warfighter protection technologies. (Concurrent funding in PE 0603640M). \n- Continued development of advanced survivability and mobility technologies for Marine Corps tactical and combat vehicles. (Concurrent funding in PE 0603640M and 0603236N). \n- Completed development of technologies to lighten-the-load of warfighters by: 1) reducing the weight and improving the capability of the day\/night weapon sight; 2) eliminating battery incompatibility; and 3) providing Graphical User Interface (GUI)-based software for tradeoff analyses based on Military Operational Posture. \n- Completed development of precision universal mortar attack technologies. (Concurrent funding in PE 0603640M)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.404"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of wide area surgical and persistent survellience technologies. (Concurrent funding provided PE 0603640M.)\n- Continue development of the Ground Based Air Defense On-the-move high energy laser demonstrator. (Concurrent funding in PE 0603640M).\n- Continue development and began transitioning EFV obstacle detection capability to EFV Direct Reporting Program Manager. \n- Complete development of integrated vehicle self-defense system to defeat incoming RPGs.\n- Complete transparent urban structure 'see thru the wall', image and mapping technologies development.\n- Complete development of an integrated, company level, Urban Sensor Suite. (Automated Control of Large Sensor Networks Transitions to PE 0602235N).\n- Complete detect and identify facilities technology development. (Transparent Urban Structures).\n- Complete decision aids technology development. \n- Complete development of Modular Scalable Effects weapons technologies. (Concurrent funding in PE 0603640M). \n- Complete development of tactical urban breaching technologies. Due to required program necessities resourcing of continued development of tactical urban breaching technologies has been realigned to PE 0603640M. \n- Complete development of individual Warfighter protection technologies. (Concurrent funding in PE 0603640M). \n- Complete development of advanced survivability and mobility technologies for Marine Corps tactical and combat vehicles. (Concurrent funding in PE 0603640M and 0603236N). \n- Initiate development of an azimuth and inertial navigation system.  (Effort was previously funded by PE 0602750N and PE 0603673N; concurrent funding in PE 0603640M.) \n- Initiate and complete development of spectral and reconnaissance imagery for tactical exploitation (SPRITE). (Previous and follow-on funding provided by PE 0602750N and PE 0603673N; concurrent funding in PE 0602131M.)\n- Initiate limited development of Target Processing Center (TPC) sensor correlation and fusion technology; specifically, context fusion, and radar fusion and false track mitigation. (Concurrent funding in PE 0603640M.)\n- Initiate development of technologies to enable the exchange of actionable information at the tactical edge; specifically, actionable information tactical applications, data conditioning and network adaptive communication services. (Effort was previously funded by PE 0602750N and PE 0603673N; concurrent funding in PE 0603640M.)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of wide area surgical and persistent surveillance technologies (WASPS). (Concurrent funding provided PE 0603640M). This EC remains on schedule and will develop an advanced, integrated unmanned aerial systems payload in order to reduce timelines for detecting, classifying, identifying and targeting adversaries.  \n- Continue development of an azimuth and inertial navigation system (MEMS).  (Concurrent funding in PE 0603640M). This EC remains on schedule and will develop and integrate a lightweight, handheld Micro-Electro-Mechanical Systems (MEMS) inertial navigation system into ground-based targeting systems in order to improve small unit fires capability.\n- Continue development of spectral and reconnaissance imagery for tactical exploitation (SPRITE). (Concurrent funding in PE 0603640M). This EC remains on schedule and will develop a hyper-spectral (transition to Navy) and wide area reconnaissance ISR capability (transition to Marine Corps) for MCTUAS\/STUAS in order to provide autonomous detection of IED precursors, hidden targets, camouflage, and taggants over wide areas.  \n- Continue development of Target Processing Center (TPC) sensor correlation and fusion technology. (Concurrent funding in PE 0603640M). This EC remains on schedule and will develop cloud-based analytic tools to automate, correlate and fuse sensor and intelligence data aboard amphibious shipping in order to enhance threat identification capability and improve timeliness of decision-making.\n- Continue development of technologies to enable the exchange of actionable information at the tactical edge (EAITE). (Concurrent funding in PE 0603640M). This EC remains on schedule and will develop analytic tools to process raw data and autonomously disseminate information products to dispersed warfighters without relying on intelligence analysts, heavy computational resources or high-throughput communications networks.  \n- Continue development of the Ground Based Air Defense On-the-move high energy laser demonstrator (GBAD). (Concurrent funding in PE 0603640M). This EC remains on schedule and will develop a surface-to-air High Energy Laser (HEL) and beam director in order to defend maneuvering forces, forward combat areas, and vital installations against enemy aerial unmanned systems other threats.\n- Complete development and  transition of EFV obstacle detection capability to EFV Direct Reporting Program Manager.\n- Complete development of the Expeditionary Fighting Vehicle obstacle detection (EFVODS) capability."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LOGISTICS"
                                    },
                                    "Description": {
                                        "val": "This activity supports Marine Corps Expeditionary Logistics which is the practical discipline and real world application of the deployment, sustainment, reconstitution, and re-deployment of forces engaged in expeditionary operations.  Expeditionary Logistics replaces mass with assured knowledge and speed, is equally capable ashore or afloat in austere environments, and is fully scalable to meet uncertain requirements.  Expeditionary Logistics logically divides into five pillars:  deployment support, force closure, sustainment, reconstitution\/redeployment, and command and control.  These pillars are thoroughly integrated and perpetually related in execution.\n\nThe FY 2014 to FY 2015 funding decrease is due to the early completion and transition of a solid oxide fuel cell capable of directly oxidizing liquid logistic fuels.\n\nThe FY 2015 to FY 2016 funding increase is due to the acceleration and early completion of the logistics C2 systems for optimizing the transportation of materiel across multiple intra and inter-theater connector vehicles (aka: Transportation Exploitation Tool)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.388"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued applications of advanced material surface treatments and coatings for reducing required maintenance and enhancing operational readiness of expeditionary warfare vehicles, machinery, and electrical systems \n- Continued advancement of a solid oxide fuel cell capable of directly oxidizing liquid logistic fuels such as JP-8, thus eliminating the necessity for both reforming and sulfur removal pre-processing of the fuel.\n- Continued development of water purification applied research focused toward small personal water purification devices. This includes previous work in an energy recovery system for enhancing the efficiency of small reverse osmosis water purification devices. \n- Continued applied research into electrochemical methods of converting diverse hydrocarbon fuels to electrical energy.\n- Continued applied research toward materials that will reduce, or prevent, wear and corrosion on systems and equipment.\n- Continued advancement of high specific energy electrochemical capacitors to function as peak electric load-leveling buffers in advanced, lightweight, portable power applications.\n- Continued applied research toward producing a lightweight device for converting hydrocarbon fuels to electrical energy.\n- Continued applied research toward an extremely high specific energy, metal-air primary battery and research toward an advanced electrochemical ultracapacitor based on down-selection of prior research approaches.\n- Completed development technologies to facilitate cargo transfer across intra-theater logistics connector vehicles, to include advanced material handling equipment as well as asset tracking and reporting technologies.\n- Completed research on hydrodynamic particle separation technologies for enhancing the life of water purification technologies at the small scale.\n- Completed development of self-lubricating coatings that will reduce maintenance expense and down time of systems and equipment. \n- Completed research on photo-catalytic technologies for unpowered water purification at the small scale.\n- Completed development of adsorbed membrane coatings to provide enhanced fouling resistance in membrane-based water purification systems.\n- Initiated the development of logistics IT systems for optimizing the transportation of materiel across multiple intra and inter-theater connector vehicles e.g. TET.\n- Initiated development of high efficiency, rugged, and inexpensive solar photovoltaic energy harvesting technologies.\n- Initiated development technologies to facilitate cargo transfer across intra-theater logistics connector vehicles, to include advanced material handling equipment as well as asset tracking and reporting technologies. \n- Initiated the development of advanced water location, harvesting, packaging, distribution, and quality monitoring systems to enable Marines to be fully self-sufficient for water resources on the battlefield."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.534"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of water purification applied research focused toward small personal water purification devices. This includes previous work in an energy recovery system for enhancing the efficiency of small reverse osmosis water purification devices. \n- Continue applications of advanced material surface treatments and coatings for reducing required maintenance and enhancing operational readiness of expeditionary warfare vehicles, machinery, and electrical systems (Note: This also includes development of alternative human load carrying concepts to lighten the load carried by the Marine and reduce structural damage to the human body).\n- Continue applied research toward materials that will reduce, or prevent, wear and corrosion on systems and equipment.\n- Continue the development of logistics IT systems for optimizing the transportation of materiel across multiple intra and inter-theater connector vehicles (aka: Transportation Exploitation Tool).\n- Continue development of high efficiency, rugged, and inexpensive solar photovoltaic energy harvesting technologies.\n- Continue development technologies to facilitate cargo transfer across intra-theater logistics connector vehicles, to include advanced material handling equipment as well as asset tracking and reporting technologies. \n- Continue the development of advanced water location, harvesting, packaging, distribution, and quality monitoring systems to enable Marines to be fully self-sufficient for water resources on the battlefield.\n- Complete advancement of high specific energy electrochemical capacitors to function as peak electric load-leveling buffers in advanced, lightweight, portable power applications.\n- Complete advancement of a solid oxide fuel cell capable of directly oxidizing liquid logistic fuels such as JP-8, thus eliminating the necessity for both reforming and sulfur removal pre-processing of the fuel.\n- Complete applied research toward producing a light weight device for converting hydrocarbon fuels to electrical energy.\n- Complete applied research toward an extremely high specific energy, metal-air primary battery and research toward an advanced electrochemical ultracapacitor based on down-selection of prior research approaches.\n- Complete applied research into electrochemical methods of converting diverse hydrocarbon fuels to electrical energy.\n- Initiate operations research and analysis efforts to enhance seabased expeditionary supply chain concepts and technologies.\n- Initiate development of infrastructureless In-Transit Visibility (ITV) technologies to enable asset tagging, tracking, locating, and monitoring anywhere in the expeditionary supply chain.\n- Initiate the development of modular thermoacoustic systems capable of acting as power generation or heat-pump devices.\n- Initiate the development of energy scavenging technologies to minimize wasted thermal, RF, kinetic, and other energy on the battlefield."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.790"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.790"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of water purification applied research focused toward small personal water purification devices. This includes previous work in an energy recovery system for enhancing the efficiency of small reverse osmosis water purification devices. \n- Continue applications of advanced material surface treatments and coatings for reducing required maintenance and enhancing operational readiness of expeditionary warfare vehicles, machinery, and electrical systems \n- Continue applied research toward materials that will reduce, or prevent, wear and corrosion on systems and equipment.\n- Continue the development of advanced water location, harvesting, packaging, distribution, and quality monitoring systems to enable Marines to be fully self-sufficient for water resources on the battlefield.\n- Continue operations research and analysis efforts to enhance seabased expeditionary supply chain concepts and technologies.\n- Continue development of infrastructureless In-Transit Visibility (ITV) technologies to enable asset tagging, tracking, locating, and monitoring anywhere in the expeditionary supply chain.\n- Continue the development of modular thermoacoustic systems capable of acting as power generation or heat-pump devices.\n- Continue the development of energy scavenging technologies to minimize wasted thermal, RF, kinetic, and other energy on the battlefield.\n- Complete the development of logistics C2 systems for optimizing the transportation of materiel across multiple intra and inter-theater connector vehicles (aka: Transportation Exploitation Tool).\n- Complete development of high efficiency, rugged, and inexpensive solar photovoltaic energy harvesting technologies.\n- Complete development technologies to facilitate cargo transfer across intra-theater logistics connector vehicles, to include advanced material handling equipment as well as asset tracking and reporting technologies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANEUVER"
                                    },
                                    "Description": {
                                        "val": "The Maneuver thrust area focuses on the development, demonstration, and transition of technologies that will increase the warfighting capabilities and effectiveness of the Marine Air-Ground Task Force (MAGTF).  This thrust aims at capturing emerging and \"leap ahead\" technologies in the areas of mobility, materials, propulsion, survivability, durability, signature reduction, modularity, and unmanned systems.  Special emphasis on survivability technologies for the defeat of small arms, IEDs, mine blast, and RPGs continue to be incorporated into this thrust area.  Efforts also continue in the development of modeling and simulation tools that integrate many different physics based modeling systems with rigorous operational analysis simulations to accurately define a system's performance characteristics.  These tools will aid in defining the trade space for emerging technologies and assist in providing the program manager insight and guidance into pursuing future technologies.  Finally, this technology thrust area also seeks to develop technologies to enhance combat vehicle crewman effectiveness and situational awareness through the incorporation of advanced autonomous vehicle functions triggered directly by the cognitive state of the operator.\n\nThe FY 2014 to FY 2015 decrease in funding is due to a decrease in the plans to initiate and develop autonomous technologies transcribing vision-based perception data.\n\nThe FY 2015 to FY 2016 increase in funding is due to the initiation of autonomous technologies automating behavior generation and enabling adaptive behavior using virtual environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.713"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued lightweight Expeditionary Systems Materials (ESM) efforts to determine feasibility of scaling and producing candidate structural armor.\n- Continued development of Advanced Electro-Magnetic Armor (AEMA) for ground vehicle survivability.\n- Continued mobility enhancement development effort for current and future light and medium weight Marine Corps vehicle programs.\n- Continued efforts addressing survivability and technologies to mitigate acceleration and traumatic brain injuries to vehicle occupants to enhance tactical mobility.\n- Continued efforts addressing advanced suspension systems with ride height adjustment capabilities, adjustable ride quality capabilities, rollover prevention, and load equalizing systems to enhance tactical mobility and survivability.\n- Continued efforts addressing improvements in vehicle fuel efficiency by improvements in drive train efficiencies, engine efficiencies and alternative fuels capabilities to enhance tactical mobility.\n- Continued technology development programs to address maneuver capability gaps in Survivability such as an Advanced Seat Technology effort to improve\/increase occupant protection within the platform by reducing injury due to the effects of dynamic blast events and accidental vehicle rollover.\n- Continued technology development programs to address maneuver capability gaps in Mobility such as a Vehicle Stability effort to improve\/increase vehicle performance characteristics such as reducing vehicle rollover tendencies.\n- Continued efforts in advanced perception and context-based reasoning aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continued Survivability efforts in Advanced Blast Mitigation to develop solutions that mitigate injuries to vehicle occupants, while reducing the weight burden, thereby enhancing tactical mobility and survivability.  These efforts were delayed from FY 2011 due to a shift in program priorities which necessitated allocating the funds to the development of autonomous vehicle capabilities.\n- Continued Advanced Mobility efforts in Future Fuel Alternatives and Advanced Propulsion and Suspension Technologies to improve vehicle fuel efficiency through improvements in drive train and engine efficiencies and alternative fuels capabilities to enhance tactical mobility.\n- Completed technology development programs to address maneuver capability gaps in Mobility such as increasing warfighter\/vehicle agility, improving prime power, and improving electrical power.\n- Completed development of materials to promote Combat Science and Technology Vehicle (CSTV) survivability. \n- Initiated the development of autonomy technologies and system concepts that will enable unmanned ground vehicles (UGVs) to be used as autonomous logistic connector vehicles.\n- Initiated mobility technologies that enable improved vehicle agility and stability.\n- Initiated lightweight armor, material, and structural technologies that enable maneuver and survivability of small, light expeditionary platforms.\n- Initiated survivability technologies that enable defeat of all unitary and tandem RPG and select ATGM threats, and the demonstration of survivable vehicles.\n- Initiated non-GPS localization technologies such that autonomous vehicles can navigate in areas where satellite data is inaccessible.\n- Initiated the development of technologies that enable vehicle component modularity and reduce life cycle costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.985"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue lightweight Expeditionary Systems Materials (ESM) efforts to determine feasibility of scaling and producing candidate structural armor.\n- Continue mobility enhancement development effort for current and future light and medium weight Marine Corps vehicle programs.\n- Continue efforts addressing survivability and technologies to mitigate acceleration and traumatic brain injuries to vehicle occupants to enhance tactical mobility.\n- Continue efforts addressing advanced suspension systems with ride height adjustment capabilities, adjustable ride quality capabilities, rollover prevention, and load equalizing systems to enhance tactical mobility and survivability.\n- Continue efforts addressing improvements in vehicle fuel efficiency by improvements in drive train efficiencies, engine efficiencies and alternative fuels capabilities to enhance tactical mobility.\n- Continue technology development programs to address maneuver capability gaps in survivability such as an advanced seat technology effort to improve\/increase occupant protection within the platform by reducing injury due to the effects of dynamic blast events and accidental vehicle rollover.\n- Continue technology development programs to address maneuver capability gaps in Mobility such as a Vehicle Stability effort to improve\/increase vehicle performance characteristics such as reducing vehicle rollover tendencies.\n- Continue efforts in advanced perception and context-based reasoning aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continue the development of autonomy technologies and system concepts that will enable unmanned ground vehicles (UGVs) to be used as autonomous logistic connector vehicles.\n- Continue lightweight armor, material, and structural technologies that enable maneuver and survivability of small, light expeditionary platforms.\n- Continue survivability technologies that enable defeat of all unitary and tandem RPG and select ATGM threats, and the demonstration of survivable vehicles.\n- Continue non-GPS localization technologies such that autonomous vehicles can navigate in areas where satellite data is inaccessible.\n- Continue the development of technologies that enable vehicle component modularity and reduce life cycle costs.\n- Continue mobility technologies that enable improved vehicle agility and stability.\n- Continue Advanced Mobility efforts in Future Fuel Alternatives and Advanced Propulsion and Suspension Technologies to improve vehicle fuel efficiency through improvements in drive train and engine efficiencies and alternative fuels capabilities to enhance tactical mobility.\n- Continue development of Advanced Electro-Magnetic Armor (AEMA) for ground vehicle survivability.\n- Complete survivability efforts in advanced blast mitigation to develop solutions that mitigate injuries to vehicle occupants, while reducing the weight burden, thereby enhancing tactical mobility and survivability. \n- Initiate the development of fuel saving vehicle technologies, including advanced transmission, power train, and electrical power system technologies.\n- Initiate the development of autonomous technologies transcribing vision-based perception data in order to be understood by a context-based reasoning system enabling adaptive behavior. \n- Initiate the development of autonomous technologies by enhanced human machine interface (HMI) through gestures and natural language understood by unmanned ground systems (UGS).\n- Initiate survivability technologies to provide reduction in the probability of detection in a given background."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.278"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.278"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue lightweight Expeditionary Systems Materials (ESM) efforts to determine feasibility of scaling and producing candidate structural armor.\n- Continue mobility enhancement development effort for current and future light and medium weight Marine Corps vehicle programs.\n- Continue efforts addressing survivability and technologies to mitigate acceleration and traumatic brain injuries to vehicle occupants to enhance tactical mobility.\n- Continue efforts addressing advanced suspension systems with ride height adjustment capabilities, adjustable ride quality capabilities, rollover prevention, and load equalizing systems to enhance tactical mobility and survivability.\n- Continue technology development programs to address maneuver capability gaps in survivability such as an advanced seat technology effort to improve\/increase occupant protection within the platform by reducing injury due to the effects of dynamic blast events and accidental vehicle rollover.\n- Continue technology development programs to address maneuver capability gaps in Mobility such as a Vehicle Stability effort to improve\/increase vehicle performance characteristics such as reducing vehicle rollover tendencies.\n- Continue the development of fuel saving vehicle technologies, including advanced transmission, power train, and electrical power system technologies.\n- Continue efforts addressing improvements in vehicle fuel efficiency by improvements in drive train efficiencies, engine efficiencies and alternative fuels capabilities to enhance tactical mobility.\n- Continue efforts in advanced perception and context-based reasoning aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continue the development of autonomy technologies and system concepts that will enable unmanned ground vehicles (UGVs) to be used as autonomous logistic connector vehicles.\n- Continue lightweight armor, material, and structural technologies that enable maneuver and survivability of small, light expeditionary platforms.\n- Continue survivability technologies that enable defeat of all unitary and tandem RPG and select ATGM threats, and the demonstration of survivable vehicles.\n- Continue non-GPS localization technologies such that autonomous vehicles can navigate in areas where satellite data is inaccessible.\n- Continue the development of technologies that enable vehicle component modularity and reduce life cycle costs.\n- Continue mobility technologies that enable improved vehicle agility and stability.\n- Continue Advanced Mobility efforts in Future Fuel Alternatives and Advanced Propulsion and Suspension Technologies to improve vehicle fuel efficiency through improvements in drive train and engine efficiencies and alternative fuels capabilities to enhance tactical mobility.\n- Continue the development of autonomous technologies by enhanced human machine interface (HMI) through gestures and natural language understood by unmanned ground systems (UGS).\n- Continue survivability technologies to provide reduction in the probability of detection in a given background.\n- Complete the development of autonomous technologies transcribing vision-based perception data in order to be understood by a context-based reasoning system enabling adaptive behavior. \n- Complete development of Advanced Electro-Magnetic Armor (AEMA) for ground vehicle survivability.\n- Initiate the development of technologies that sustain vehicle components longer and reduce life cycle costs.\n- Initiate the development of autonomous technologies automating behavior generation and enabling adaptive behavior using virtual environments. \n- Initiate technology development programs to address expeditionary maneuver capability gaps."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "COMMAND, CONTROL, COMMUNICATIONS, AND COMPUTERS (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity supports S&T investment in Command and Control and is focused in three main areas:  (1) Implementing the FORCEnet concept; (2) Developing decision support systems that enable warfighters to take advantage of the FORCEnet and MAGTF C2, and tactically extend Net-Enabled Command and Control (NECC) for shared situational awareness; and (3) Providing effective combat identification of enemy combatants, friendly forces, and non-combatants.  FORCEnet is the operational construct and architectural framework for naval warfare in the information age that integrates warriors, networks, command and control, and weapons into a networked, distributed, combat force that is scalable across all levels of conflict from the seabed to space, and from sea to land. The Marine Corps instantiation of FORCEnet is Marine Air Ground Task Force Command and Control (MAGTF C2), with technologies to exchange data and information with, and among, distributed tactical forces. Activities in this program area provide technologies for secure, robust, self-forming, mobile communications networks and distributed computing to support information dissemination to all echelons; and sensors, software and data processing to support formation of an appropriate common picture.  Marine Corps specific efforts include power management, low detectability, size and weight constraints, and interoperability within the joint environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.014"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of urban\/restricted environment communications technologies.\n- Continued new efforts in Over-the-Horizon Communications, which include the development of an airborne, software-defined communications, networking, Electronic Signals Intelligence (ELINT) and Electronic Warfare (EW) capability.\n- Continued Adaptable Antennas, Self-Adapting Radio Prototype and RF Technologies efforts.\n- Continued Cognitive Networking and Trusted Computing Technology efforts.  These technologies were planned for initiation in FY 2011 but were delayed until FY 2012 due to unforeseen technical delays.\n- Continued Dynamic Cosite Mitigation, Sensing Comms and Blue Force Tracking efforts.\n- Initiated a distributed, Cyber Technology development effort.\n- Initiated a meta-material antennas effort. (This activity was planned for FY 2014, but due to fiscal constraints it was not initiated until FY 2015.)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of urban\/restricted environment communications technologies.\n- Continue Adaptable Antennas, Self-Adapting Radio Prototype and RF Technologies efforts.\n- Continue Cognitive Networking and Trusted Computing Technology efforts.  These technologies were planned for initiation in FY 2011 but were delayed until FY 2012 due to unforeseen technical delays.\n- Continue a distributed, Cyber Technology development effort.\n- Complete Dynamic Cosite Mitigation, Sensing Comms and Blue Force Tracking efforts.\n- Complete new efforts in Over-the-Horizon Communications, which include the development of an airborne, software-defined communications, networking, Electronic Signals Intelligence (ELINT) and Electronic Warfare (EW) capability.\n- Initiate a meta-material antennas effort. (This activity was planned for FY 2014, but due to fiscal constraints it was not initiated until FY 2015.\")\n- Initiate an Electro-Magnetic Technologies effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.329"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.329"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of urban\/restricted environment communications technologies.\n- Continue Adaptable Antennas, Self-Adapting Radio Prototype and RF Technologies efforts.\n- Continue Cognitive Networking and Trusted Computing Technology efforts. \n- Continue a meta-material antennas effort. \n- Continue an Electro-Magnetic Technologies effort.\n- Complete a distributed, Cyber Technology development effort."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this PE is the development of technologies to meet unique Marine Corps needs in conducting Expeditionary Maneuver Warfare and Combating Terrorism.  The program consists of a collection of projects categorized by critical warfighting function.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                }
            ]
        }
    }
}