{
    "id": "32cdffd7b355abcb3aeff67b21c93650e1f2dcc9",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DHRA_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2016.zzz_unzipped_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "DoD Human Resources Activity",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603769SE"
        },
        "ProgramElementTitle": {
            "val": "Distributed Learning Advanced Technology Development (ADL)"
        },
        "R1LineNumber": {
            "val": "61"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "DoD Human Resources Activity"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "38.004"
            },
            "PriorYear": {
                "val": "12.116"
            },
            "CurrentYear": {
                "val": "10.692"
            },
            "BudgetYearOne": {
                "val": "10.771"
            },
            "BudgetYearOneBase": {
                "val": "10.771"
            },
            "BudgetYearTwo": {
                "val": "10.808"
            },
            "BudgetYearThree": {
                "val": "10.800"
            },
            "BudgetYearFour": {
                "val": "10.982"
            },
            "BudgetYearFive": {
                "val": "11.108"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Established by Executive Order, with policy oversight by the Office of the Deputy Assistant Secretary of Defense\/Readiness (Training Readiness and Strategy), this program (1) Identifies, assesses, develops, and provides guidance on standards for instructional software and associated services used by Federal agencies, international partners, and contractors; (2) Conducts research on the ways these organizations can harness the power of learning technologies, such as computer-based and online courseware, training games, virtual worlds, mobile technology, intelligent tutors, and other emerging learning technologies to provide high-quality, easily accessible, adaptable, and cost-effective education and training.  The ADL Initiative efforts reduce costs by reducing the need for face-to-face instruction, by increasing interoperability--which enables discovery, retrieval, and reuse of distributed learning content--and by researching and prototyping methods of distributed learning with superior motivational and learning outcomes.  ADL past work resulted in the development of a Sharable Content Object Reference Model (SCORM), the current de facto internationally accepted standard and specification for distributed learning interoperability.  SCORM is mandated for all Department of Defense (DoD) agencies through DoD Instruction 1322.26.  ADL provides support for users of SCORM, and is also working in collaboration with the Services, other government agencies, industry, and our international partners to develop the next generation training learning architecture (TLA).  The TLA is aimed at modernizing the way we learn by facilitating learning experiences that take advantage of current and emerging technologies based on new specifications and standards built upon web services.  With respect to researching and prototyping new methods of distributed learning, ADL is conducting projects on intelligent tutoring and serious game for Science, Technology, Engineering, and Math (STEM), as well as projects aimed at supporting life-long learning, in the form of a personal assistant for learning (PAL).  The PAL is an advanced concept research effort to provide a ubiquitous, tailored training and learning capability."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.116"
                },
                "CurrentYear": {
                    "val": "10.692"
                },
                "BudgetYearOne": {
                    "val": "10.771"
                },
                "BudgetYearOneBase": {
                    "val": "10.771"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.116"
                },
                "CurrentYear": {
                    "val": "10.692"
                },
                "BudgetYearOne": {
                    "val": "10.771"
                },
                "BudgetYearOneBase": {
                    "val": "10.771"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Project 1"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Distributed Learning"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "38.004"
                        },
                        "PriorYear": {
                            "val": "12.116"
                        },
                        "CurrentYear": {
                            "val": "10.692"
                        },
                        "BudgetYearOne": {
                            "val": "10.771"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.771"
                        },
                        "BudgetYearTwo": {
                            "val": "10.808"
                        },
                        "BudgetYearThree": {
                            "val": "10.800"
                        },
                        "BudgetYearFour": {
                            "val": "10.982"
                        },
                        "BudgetYearFive": {
                            "val": "11.108"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Established by Executive Order, with policy oversight by the Office of the Deputy Assistant Secretary of Defense\/Readiness (Training Readiness and Strategy), this program (1) Identifies, assesses, develops, and provides guidance on standards for instructional software and associated services used by Federal agencies, international partners, and contractors; (2) Conducts research on the ways these organizations can harness the power of learning technologies, such as computer-based and online courseware, training games, virtual worlds, mobile technology, intelligent tutors, and other emerging learning technologies to provide high-quality, easily accessible, adaptable, and cost-effective education and training.  The ADL Initiative efforts reduce costs by reducing the need for face-to-face instruction, by increasing interoperability--which enables discovery, retrieval, and reuse of distributed learning content--and by researching and prototyping methods of distributed learning with superior motivational and learning outcomes.  ADL past work resulted in the development of a Sharable Content Object Reference Model (SCORM), the current de facto internationally accepted standard and specification for distributed learning interoperability.  SCORM is mandated for all Department of Defense (DoD) agencies through DoD Instruction 1322.26.  ADL provides support for users of SCORM, and is also working in collaboration with the Services, other government agencies, industry, and our international partners to develop the next generation training learning architecture (TLA).  The TLA is aimed at modernizing the way we learn by facilitating learning experiences that take advantage of current and emerging technologies based on new specifications and standards built upon web services.  With respect to researching and prototyping new methods of distributed learning, ADL is conducting projects on intelligent tutoring and serious game for Science, Technology, Engineering, and Math (STEM), as well as projects aimed at supporting life-long learning, in the form of a personal assistant for learning (PAL).  The PAL is an advanced concept research effort to provide a ubiquitous, tailored training and learning capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Distributed Learning"
                                    },
                                    "Description": {
                                        "val": "Established by Executive Order, with policy oversight by the Office of the Deputy Assistant Secretary of Defense\/Readiness (Training Readiness and Strategy), this program leverages emerging learning technologies to provide cost effective training and education to Service members and civilian employees of the Federal Government."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.116"
                                            },
                                            "Text": {
                                                "val": "• Published multiple research articles in leading professional journals on the best practices and effectiveness of online distributed learning;\n• Managed multiple research projects with industry and academia on solving the challenges associated with supporting lifelong learning through a 24\/7, non-intrusive ubiquitous assistance, adapted to the learner's specific strengths and weaknesses, learning preferences, and level of proficiency (PAL);\n• Researched new learning technologies for possible integration into DoD educational and training programs to include the assessment and tracking of experiential training & education activities;\n• Researched structured learning content schemas and transformation technologies to modularize content, enhance semantic understanding, and improve the prospects for reuse;\n• Tested advanced instructional methods using intelligent tutors for training; \n• Instituted advanced concept research on the Next Generation (SCORM), referred to as TLA.  Released version 1.0 of the Experience Application Protocol Interface (xAPI), which is the initial instantiation of the TLA's capabilities;\n• Developed tools for Service members transitional from Active Duty to civilian life through the Transition Assistance Program (TAP).\n• Participated and influenced as Co-chair of the Individual Training & Education Development (IT&ED), NATO Training Group to increase the standardization and reuse of training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.692"
                                            },
                                            "Text": {
                                                "val": "• Research new learning technologies for possible integration into DoD educational and training programs to include innovative methodologies and approaches to using Social Networking for solving problems in collaborative, disparate environments;\n• Demonstrate the application of the spacing effect using current mobile technologies to reinforce learning and improve long-term retention.\n• Continue to test advanced instructional methods for intelligent tutors for training;\n• Integrate proven concepts form FY14 research into application prototypes \n• Update policies, plans, and programs to support Distributed Learning Content (DLC) programs; standardizations, identification and distribution of best practices; and guidelines for learning, training, and job performance aids that accommodate today's networked learning environment;\n• Support the White House educational initiatives as the DoD representative to the Learning Registry and Federal Game Guild;\n• Continue work with the DoD training community for the purpose of sharing DLC, standardization of common terminology, and best practices for developing and implementing efficient and effective DL technologies across DoD;\n• Collaborate with the Services, other government agencies, industry, and our international partners in development of the TLA;\n• Continue, in collaboration with Military Services and other government agencies, to better enable sharing of DLC and 3D models used for immersive learning experiences;\n• Collaborate with the other Federal Agencies to share descriptive metadata about learning resources and usage information about how those resources are being used;\n• Deliver tools that assist transitioning Service member to civilian jobs and\/or educational opportunities.\n• Participate and influence as Co-chair of the IT&ED, NATO Training Group to increase the standardization and reuse of training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.771"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.771"
                                            },
                                            "Text": {
                                                "val": "• Continue to influence industry and academia through publication of research articles in leading professional journals on the integration of emerging learning technologies to enhance training;\n• Deliver STEM prototypes for integration into DoD educational and training programs (e.g., with DoDEA).\n• Expand research into the following areas: persistent, open independent Learning Models with reasoning capability that incorporate new methods of machine learning; common sense reasoning; cognitive modeling; artificial intelligence; the use of intelligent systems designed to increase both cognitive adaptability and emotional resiliency; and domain independent intelligent system design.\n• Test lifelong learning support prototypes (PAL) with DoD learners.\n• Develop the next iteration of the TLA for the next generation learning environment.\n• Develop new tools that assist transitioning Service member to civilian jobs and\/or educational opportunities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Required."
                        },
                        "PerformanceMetrics": {
                            "val": "In FY2016, ADL will:\n1.  Deliver the next version of the xAPI, which is the first component of the TLA.\n2   Publish results on initial field testing of a life-long learning assistant.\n3.  Influence key Service and international ADL meetings and conferences reference the discovery, sharing and delivery of interoperable training content; \n4.  Increase the sharing of data among DoD, other Federal Agencies and state and local education departments throughout the U.S., by making educational resources discoverable and retrievable and also through the open source initiative.  \n5.  Evaluate an Intelligent Tutor with the intent to determine the utilization of this technology for DoDEA."
                        }
                    }
                }
            ]
        }
    }
}