{
    "id": "34e0a763428a859309f98a97cc4a234863f494f4",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0601117E"
        },
        "ProgramElementTitle": {
            "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "48.066"
            },
            "CurrentYear": {
                "val": "60.757"
            },
            "BudgetYearOne": {
                "val": "56.544"
            },
            "BudgetYearOneBase": {
                "val": "56.544"
            },
            "BudgetYearTwo": {
                "val": "62.807"
            },
            "BudgetYearThree": {
                "val": "65.685"
            },
            "BudgetYearFour": {
                "val": "67.882"
            },
            "BudgetYearFive": {
                "val": "66.456"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.500"
                },
                "CurrentYear": {
                    "val": "49.848"
                },
                "BudgetYearOne": {
                    "val": "44.700"
                },
                "BudgetYearOneBase": {
                    "val": "44.700"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.066"
                },
                "CurrentYear": {
                    "val": "60.757"
                },
                "BudgetYearOne": {
                    "val": "56.544"
                },
                "BudgetYearOneBase": {
                    "val": "56.544"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.434"
                },
                "CurrentYear": {
                    "val": "10.909"
                },
                "BudgetYearOne": {
                    "val": "11.844"
                },
                "BudgetYearOneBase": {
                    "val": "11.844"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "10.909"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.434"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "11.844"
                                },
                                "BudgetYearOneBase": {
                                    "val": "11.844"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014:  Decrease reflects the SBIR\/STTR transfer. \nFY 2015:  Increase reflects congressional add.\t\t\nFY 2016:  Increase reflects exploration of new methods to maintain and optimize warfighter health, and harness biological technologies and systems."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MED-01"
                    },
                    "ProjectTitle": {
                        "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.066"
                        },
                        "CurrentYear": {
                            "val": "60.757"
                        },
                        "BudgetYearOne": {
                            "val": "56.544"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.544"
                        },
                        "BudgetYearTwo": {
                            "val": "62.807"
                        },
                        "BudgetYearThree": {
                            "val": "65.685"
                        },
                        "BudgetYearFour": {
                            "val": "67.882"
                        },
                        "BudgetYearFive": {
                            "val": "66.456"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Operational Medical Science Program Element will explore and develop basic research in medical-related information and technology leading to fundamental discoveries, tools, and applications critical to solving DoD challenges.  Programs in this project address the Department's identified medical gaps in warfighter care related to blast-induced traumatic brain injury as well as health monitoring and the prevention of the spread of infectious disease.  Efforts will draw upon the information, computational modeling and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  For traumatic brain injury, this project will establish a fundamental understanding of brain function, short-term memory and the mechanism(s) of injury induced by exposure to blast.  To enable in-theater, continuous analysis and treatment of warfighters, this project will also explore diagnostic and therapeutic approaches, such as the use of bacterial predators as therapeutics against infections caused by antibiotic-resistant pathogens.  Advances in this area may be used as a preventative measure to mitigate widespread disease."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research Congressional Add"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.909"
                                        },
                                        "Text": {
                                            "val": "Supports increased efforts in basic research that engage a wider set of universities and commercial research communities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT)"
                                    },
                                    "Description": {
                                        "val": "The Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program will develop the underlying technologies to rapidly respond to a disease or threat and improve individual readiness and total force health protection by providing capabilities which are currently available only in centralized laboratories in the U.S. to non-tertiary care and individual settings.  ADEPT will develop and exploit synthetic biology for the in vivo creation of nucleic acid circuits that continuously and autonomously sense and respond to changes in physiologic state and for novel methods to target delivery, enhance immunogenicity, or control activity of vaccines, potentially eliminating the time to manufacture a vaccine ex vivo.  ADEPT advancements to control cellular machinery include research to optimize orthogonality and modularity of genetic control elements; identify methods to increase sensitivity and specificity; and demonstrate methods to control cellular machinery in response to changes in physiological status.  ADEPT will develop methodologies for measuring health-specific biomarkers from a collected biospecimen to enable diagnostics at the point-of-need or resource limited clinical facilities (point-of-care), in-garrison or deployed.  Additionally, ADEPT will develop techniques that will enable the rapid establishment of transient immunity through stimulation of the production of components of the immune system to impart effective but temporary protection.  This transient immunity would bridge the time gap between the delivery of a vaccine and the development of a long term protective immune response.  Applied research efforts are budgeted in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated in mammalian cells the function of a synthetic circuit that can integrate multiple signals associated with health status and respond with a targeted change in cell function.\n-  Demonstrated the ability to generate synthetic nucleic acid and protein circuit components that respond to an exogenously supplied small molecule drug trigger.\n-  Demonstrated biostabilization reagents\/materials with biospecimen types and physical formats appropriate for integration into devices for collection and transport of patient samples for diagnostic analysis, and integration into on-person diagnostic devices.\n-  Demonstrated signal amplification methods in conjunction with processing\/assay methods.\n-  Optimized sample preparation methods and tested efficacy using biospecimens representative of those either self-collected under low-resource settings or collected by trained professionals at the physician-office settings to assist the diagnosis of an individual.\n-  Developed advanced materials for incorporation in disposable diagnostic devices.\n-  Optimized advanced microfluidic methods for no\/low power flow control.\n-  Demonstrated delivery of synthetic oligonucleotide constructs to cells appropriate to produce an antibody response.\n-  Demonstrated antibody and immunoadhesin production targeted to specific disease classes.\n-  Optimized antibody sequence for maximal therapeutic strength of immune response in vivo."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.848"
                                            },
                                            "Text": {
                                                "val": "-  Collect serum from ill, convalescent, or immunized humans and identify two or more antibodies that in combination provide disease-specific protection.\n-  Demonstrate ability to administer nucleic acid encoding multiple antibodies to protect against existing, unmet, clinical targets; emerging global infectious diseases; and known, engineered biothreats.\n-  Demonstrate onset of protection within hours after delivery and duration of therapeutic response greater than IV administered antibodies.\n-  Demonstrate protective response and duration of antibody-encoding nucleic acid constructs greater than that conferred by administration of preformed antibodies against infectious disease in a large animal model.\n-  Demonstrate optimized, high sensitivity assay methods for protein and nucleic acid biomarkers, suitable for incorporation in deployable devices.\n-  Demonstrate advanced materials properties and incorporation of developed materials into disposable assay formats.\n-  Demonstrate advanced methods for reagent stabilization and delivery for assays developed for deployable devices.\n-  Demonstrate sample preparation methods in conjunction with developed assays and quantify performance metrics.\n-  Demonstrate performance of developed assays using advance no\/low power microfluidic methods.\n-  Measure performance of developed diagnostic methods and demonstrate capability to measure clinically relevant analyte levels in appropriate biospecimen matrices.\n-  Demonstrate in mammalian cells the function of a synthetic circuit that can control the timing and level of expression of a protein when expressed from an RNA-based expression vector.\n-  Demonstrate in mammalian cells the function of a synthetic circuit that can integrate at least two physiological signals associated with a change in health status and respond to at least two exogenously added small molecules, and respond with a targeted change in cell state.\n-  Demonstrate the ability to generate a synthetic antibody via continuous evolution that can specifically bind to a defined target in mammalian cells.\n-  Investigate non-traditional approaches to treating infectious diseases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.400"
                                            },
                                            "Text": {
                                                "val": "-  Establish biodistribution maps in appropriate models resulting from varied delivery methods, formulations, and devices relevant to nucleic acid constructs for antibody production.\n-  Demonstrate protection conferred by delivery of nucleic acid constructs encoding two or more antibodies in validated infectious disease animal model.\n-  Deliver high-sensitivity assay methods for protein and nucleic acid biomarkers for incorporation into deployable devices.\n-  Deliver advanced materials for incorporation into disposable assay formats.\n-  Deliver advanced methods for reagent stabilization and delivery for incorporation into deployable devices.\n-  Deliver sample preparation methods for incorporation into deployable devices.\n-  Demonstrate optimized performance of developed bacterial\/viral detection methods, assays, and materials using advanced no\/low power microfluidic methods."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Harnessing Biological Systems"
                                    },
                                    "Description": {
                                        "val": "The Harnessing Biological Systems program will explore fundamental approaches to applying the advantages of nature's building blocks and principles in the design of biological technologies and systems.  Rather than creating biomimetic designs that imitate naturally evolved capabilities this program seeks to transition to a biocentric design approach, developing tools and understanding mechanisms to leverage evolutionary advances from the start.  Key advances expected from this research include identifying the underlying mechanisms by which predatory bacteria prey upon and consume other antibiotic-resistant bacteria that are pathogenic to humans.  This approach represents a significant departure from conventional antibacterial therapies that rely on small molecule antibiotics.  This thrust will also investigate the adaptability of microorganisms as well as the process for microbial community evolution.  Advances in these areas may be applied in a range of biological technologies including the development of novel therapeutics and biocentric sensors."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.103"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.103"
                                            },
                                            "Text": {
                                                "val": "-  Investigate predator effectiveness against pathogens of interest.\n-  Initiate basic science studies of the relevant underlying mechanisms of predation.\n-  Begin basic science studies to enhance understanding of biological adaptability in response to external pressures.\n-  Identify and understand fundamental mechanisms that control the transition between unicellular and multicellular function.\n-  Examine biological basis for naturally occurring evolutionary advances.\n-  Investigate novel methods to integrate evolved biological traits.\n-  Research basic science processes by which bacteria grow and spread throughout a community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analytics and Adaptation of Human Resilience"
                                    },
                                    "Description": {
                                        "val": "The Analytics and Adaptation of Human Resilience program will explore new methods to maintain and optimize warfighter health in response to environmental insults such as new and emerging infectious diseases.  Projects in this area will apply recent advances in comparative biology, genetic sequencing, omics technologies, and bioinformatics to develop new tools for modulating health to ensure warfighter readiness.  One approach to achieve this goal is identifying the fundamental mechanisms that enable certain species to be tolerant to various environmental insults.  Genomic and physiological analyses of a wide array of resilient animal species may be combined with sophisticated algorithms to identify important patterns of survival.  By analyzing patterns in the underlying variability of host responses for resilient animals, one may formulate a survival blueprint to restore and maintain warfighter homeostasis in response to infection.  This approach is orthogonal to traditional infectious disease research, which primarily relies on reducing the pathogen load through drug intervention.  Projects within this program may enable discovery of novel methods to optimize human health against infectious disease such as multi-drug resistant pathogens."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.041"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.041"
                                            },
                                            "Text": {
                                                "val": "-  Develop human-relevant animal models of infection across multiple resilient species.\n-  Apply diagnostic technologies that can rapidly detect pathogen load and characterize the different stages of infection in multiple animal species.\n-  Correlate experimental results with bioinformatics datasets to discover key markers of tolerance.\n-  Develop a bioinformatics database to house acquired clinical retrospective data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Assisted Neural Devices"
                                    },
                                    "Description": {
                                        "val": "The Human Assisted Neural Devices program developed the scientific foundation for understanding the language of the brain for application to a variety of emerging DoD challenges, including improving performance on the battlefield and returning active duty military to their units after injury.  This required an understanding of neuroscience, significant computational efforts, and new material design and implementation.  Key advances from this research include determining the nature and means through which the brain utilizes sensory inputs to plan and execute behavioral outputs, and discovering the mechanisms and dynamics underlying neural computation and reorganization.  These advances enabled restoration of sensorimotor function through the use of devices programmed to bridge gaps in the injured brain.  Further, modeling of the brain progressed to an unprecedented level with this novel approach.  A key aspect of this effort was to develop non-destructive neuronal imaging and control techniques that are capable of rapid analysis and interpretation of brain tissue alterations at the cellular scale.  Additional research under this effort generated new methodologies to understand the structural and functional relationships between individual neurons through direct, high-resolution, optical imaging of neuron populations of interest as well as the entire brain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.566"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the ability of non-human primates to perform a dexterous sensorimotor task through the use of a neural interface, without the use of neural spike recordings.\n-  Explored initial models of the brain driven by understanding of the physical connections between individual neurons of highly trained animals conducting a specific task.\n-  Generated initial, high-resolution, optical connectivity activity data and corresponding very-large neural data sets."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}