{
    "id": "390246005cd75e9a6a736a0c6ee918631abea85e",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA2_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602623A"
        },
        "ProgramElementTitle": {
            "val": "Joint Service Small Arms Program"
        },
        "R1LineNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.592"
            },
            "CurrentYear": {
                "val": "6.850"
            },
            "BudgetYearOne": {
                "val": "5.487"
            },
            "BudgetYearOneBase": {
                "val": "5.487"
            },
            "BudgetYearTwo": {
                "val": "5.545"
            },
            "BudgetYearThree": {
                "val": "5.608"
            },
            "BudgetYearFour": {
                "val": "5.565"
            },
            "BudgetYearFive": {
                "val": "5.675"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates designs and evaluates individual and crew-served weapon technologies that enhance the fighting capabilities and survivability of the dismounted Warfighter in support of all of the Services. All work is led by the Joint Service Small Arms Program (JSSAP) and is based upon the Joint Service Small Arms Master Plan (JSSAMP) and the Joint Capabilities Integration Development System's Small Arms Analyses.\n \nWork in this PE is related to, and fully coordinated with, efforts in PE 0601102A (Defense Research Sciences), PE 0602624A (Weapons and Munitions Technology), PE 0603607A (Joint Service Small Arms Program), and PE 0602618A (Ballistic Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.   \n \nThis program is managed by the US Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ, in collaboration with the Army Research Laboratory (ARL) at Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.814"
                },
                "CurrentYear": {
                    "val": "6.853"
                },
                "BudgetYearOne": {
                    "val": "5.527"
                },
                "BudgetYearOneBase": {
                    "val": "5.527"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.592"
                },
                "CurrentYear": {
                    "val": "6.850"
                },
                "BudgetYearOne": {
                    "val": "5.487"
                },
                "BudgetYearOneBase": {
                    "val": "5.487"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.222"
                },
                "CurrentYear": {
                    "val": "-0.003"
                },
                "BudgetYearOne": {
                    "val": "-0.040"
                },
                "BudgetYearOneBase": {
                    "val": "-0.040"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.003"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.222"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.040"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.040"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H21"
                    },
                    "ProjectTitle": {
                        "val": "Jt Svc Sa Prog (JSSAP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.592"
                        },
                        "CurrentYear": {
                            "val": "6.850"
                        },
                        "BudgetYearOne": {
                            "val": "5.487"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.487"
                        },
                        "BudgetYearTwo": {
                            "val": "5.545"
                        },
                        "BudgetYearThree": {
                            "val": "5.608"
                        },
                        "BudgetYearFour": {
                            "val": "5.565"
                        },
                        "BudgetYearFive": {
                            "val": "5.675"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates designs and evaluates individual and crew-served weapon component technologies that enable increased lethality for survivability of the dismounted Warfighter in all the Services. All efforts are based upon the Joint Service Small Arms Master Plan (JSSAMP) and the Joint Capabilities Integration Development System's Small Arms Analyses.\n\nEfforts in this program element support the Soldier Science and Technology portfolio\n\nWork in this project is related to, and fully coordinated with, efforts in PE 0602624A (Weapons and Munitions Technology) and PE 0603607A (Joint Service Small Arms Program) and PE 0602786A (Warfighter Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Small Unit (Squad) Small Arms Technology Concepts"
                                    },
                                    "Description": {
                                        "val": "This effort was originally titled JSSAP Mini Grand Challenge.  It addresses future small arms technology investments including new materials, high power energy sources, miniaturization techniques, and reduction of weapon moving components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.639"
                                            },
                                            "Text": {
                                                "val": "Continued to design and conduct experiments of a universal projectile concept to validate modeling and simulation of projectile aerodynamics, launch survivability and suitability to military environments; investigated gun barrel stabilization technologies to validate effectiveness of maximum range increases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.015"
                                            },
                                            "Text": {
                                                "val": "Validate advanced armor piercing ammunition technology designs that achieve TRL 5 and prepare transition documentation for Project Manager Maneuver Ammunition Systems (PM MAS); mature weapon advanced stabilization concept for 6.3 transition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Material and Process Technology"
                                    },
                                    "Description": {
                                        "val": "This effort addresses state of the art material substrates and surface coatings to improve reliability, reduce maintenance and improve weapon diagnostics through embedded technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.953"
                                            },
                                            "Text": {
                                                "val": "Developed and analyzed custom phosphors for providing day\/night capable tracer material; validated phosphor characteristics (excitation and emission energies) to enhance focus light back to the shooter; matured coatings for corrosion resistant applications on ammunition and weapons; conducted experiments through suppressor development designs to decrease peak temperatures and increase reliability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.518"
                                            },
                                            "Text": {
                                                "val": "Experiment with selected phosphors properties that provide one-way luminescence capability for 5.56mm and 7.62mm caliber ammunition; will investigate and evaluate suppressor designs to decrease flash and acoustic detection; validate adaptive solid lubricants to decrease required weapon maintenance and transition to PE 0603607A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Future Small Arms Concept Exploration"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the investigation and design of enabling technologies transitioned from Basic Research (6.1) efforts in the areas of ballistics, energetics, future weapon and fire control sensors in order to extend individual soldier engagement ranges and maintain squad lethality overmatch; and optimize caliber performance to match mission sets."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.317"
                                            },
                                            "Text": {
                                                "val": "Investigate and evaluate advanced small arms kinetic ammunition designs; design new small caliber weapons component technologies to obtain increased range and accuracy, decreased weight, improved target acquisition and engagement while reducing weapons recoil and suppressing weapon signature; investigate futuristic small arms weapon systems proposed by the West Point Futures Studies and generate technology development plans, trade-off analysis, and concept designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapon System and Enablers"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates small arm weapon systems and enabling technologies to include: weapon size, weight and power consumption, barrel properties, recoil force, balance, and suitability.  This effort also investigates scalable effects weapons in order to increase warfighter capability by providing one cartridge\/weapon system delivering variable effects from non-lethal to lethal at greater non-lethal ranges than currently available."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.742"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.742"
                                            },
                                            "Text": {
                                                "val": "Will investigate and evaluate advanced materials, coatings and weapon system designs in order to reduce weight, mitigate recoil, and decrease weapon signature; mature suppressor designs to reduce gun flash and acoustic signatures; investigate futuristic small arms weapon systems proposed by the West Point Futures Study and generate technology plans, trade-off analyses, and concept gun designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Ammunition Research"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the design and evaluation of ammunition with reduced weight, signature, fouling and contaminants as well as improved terminal performance and improved soft and hard target performance."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.278"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.278"
                                            },
                                            "Text": {
                                                "val": "Will investigate and evaluate ammunition designs in order to increase probability of hit and probability of incapacitation\/hit; optimize caliber and configuration to defeat personnel targets at extended ranges, with or without protection; conduct trade studies to support energetic materials for propulsion, breaching ammo and tagging and marking; design, fabricate or evaluate advanced armor piercing 5.56mm and advanced kinetic energy ammunition in collaboration with the Army Research Laboratory (ARL)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optics and Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates optics and fire control technologies in order to provide a single ballistic solution to the Warfighter. Fire control devices include a laser range finder to determine the range of a target, a ballistic sensor to detect the position of the weapon system, and sensors that can measure local and downrange conditions that would affect the trajectory of a round."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.841"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.841"
                                            },
                                            "Text": {
                                                "val": "Will investigate and evaluate hardware and software component technologies for an enhanced ballistic computer that enables fire on the move trajectory correction and increased precision at longer ranges, wind and improved environmental sensing, and improved target identification."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Technology Applied Research"
                                    },
                                    "Description": {
                                        "val": "This effort supports the requirements analysis and the long-term investigation and maturation of technologies to fulfill the Department of Defense small arms capabilities.  The Joint Service Small Arms Program continuously utilizes studies and evaluations to determine the feasibility of novel material concepts; investigate all potential interfaces between the Soldier, training, weapon, optics, and the ammunition; and explore and evaluate interior and exterior ballistic component technologies to enhance weapon performance."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.626"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.626"
                                            },
                                            "Text": {
                                                "val": "Will evaluate state-of-art small arms technologies components to determine maturity for system integration; investigate small arms technologies capabilities to defeat current and future threats to the dismounted warfighter; conduct extensive analysis of available worldwide small arms systems and component technologies; leverage small arms knowledge to better focus applied research efforts in support of DOD small arms capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}