{
    "id": "39dedf856f72aff2de359bc425f65e7ca61d2b5b",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DSCA_RDTE_JustificationBook_Defense_Security_Cooperation_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Security_Cooperation_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Security Cooperation Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605147T"
        },
        "ProgramElementTitle": {
            "val": "Overseas Humanitarian Assistance Shared Information System (OHASIS)"
        },
        "R1LineNumber": {
            "val": "180"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Security Cooperation Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.842"
            },
            "PriorYear": {
                "val": "0.287"
            },
            "CurrentYear": {
                "val": "0.286"
            },
            "BudgetYearOne": {
                "val": "0.294"
            },
            "BudgetYearOneBase": {
                "val": "0.294"
            },
            "BudgetYearTwo": {
                "val": "0.299"
            },
            "BudgetYearThree": {
                "val": "0.302"
            },
            "BudgetYearFour": {
                "val": "0.308"
            },
            "BudgetYearFive": {
                "val": "0.314"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Overseas Humanitarian Assistance Shared Information System (OHASIS) provides Humanitarian Assistance (HA) offices, including embassy staff, country team members, Combatant Command leads, and the Defense Security Cooperation Agency (DSCA) the capability to manage and visualize Overseas Humanitarian, Disaster and Civic Aid (OHDACA) funded projects on a web-based map display, automate report generation, coordinate with Inter-Agency and Partner Nation stakeholders, as well as perform a variety of analysis.  \n\nUnder the direction of DSCA, the U.S. Army Corps of Engineers, Army Geospatial Center (AGC) is responsible for the entire lifecycle--from system definition to development, support, training, and product improvement of OHASIS. The AGC has been responsible for the OHASIS system since 2005 and has evolved it to the present 2.2 system which contains more than 14,000 projects valued at more than $1.8 billion, with a community of over 3,000 users.  The OHASIS system is a critical and mission essential means for thousands of military and civilian users to develop, staff, coordinate, approve, fund, implement, and manage projects intended to assist the Combatant Commands in accomplishing theater campaign plan objectives and achieve strategic ends states in support of U.S. national security and foreign policy interests."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.287"
                },
                "CurrentYear": {
                    "val": "0.286"
                },
                "BudgetYearOne": {
                    "val": "0.294"
                },
                "BudgetYearOneBase": {
                    "val": "0.294"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.287"
                },
                "CurrentYear": {
                    "val": "0.286"
                },
                "BudgetYearOne": {
                    "val": "0.294"
                },
                "BudgetYearOneBase": {
                    "val": "0.294"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "SummaryExplanation": {
                "val": "FY14-16:  No significant change, the increase or decrease is a small inflation amount.  The Overseas Humanitarian Assistance Shared Information System requires $.3M to continue to provide web-based lifecycle management of Humanitarian Assistance projects to the Combatant Commands."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "000204"
                    },
                    "ProjectTitle": {
                        "val": "Overseas Humanitarian Assistance Shared Information System"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.842"
                        },
                        "PriorYear": {
                            "val": "0.287"
                        },
                        "CurrentYear": {
                            "val": "0.286"
                        },
                        "BudgetYearOne": {
                            "val": "0.294"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.294"
                        },
                        "BudgetYearTwo": {
                            "val": "0.299"
                        },
                        "BudgetYearThree": {
                            "val": "0.302"
                        },
                        "BudgetYearFour": {
                            "val": "0.308"
                        },
                        "BudgetYearFive": {
                            "val": "0.314"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Overseas Humanitarian Assistance Shared Information System (OHASIS) enables Humanitarian Assistance (HA) offices, including embassy staff, country team members, Combatant Command leads, and the Defense Security Cooperation Agency (DSCA) to manage and visualize Overseas Humanitarian, Disaster and Civic Aid (OHDACA) projects on a web-based map display, automate report generation, and perform a variety of analysis.  \n\nUnder the direction of DSCA, the U.S. Army Corps of Engineers, Army Geospatial Center (AGC) is responsible for the entire lifecycle--from system definition to development, support, training and product improvement of OHASIS. The AGC has been responsible for the OHASIS system since 2005 and has evolved it to the present 2.2 system which contains 15,000 projects valued at more than $1.8 billion, with a community of over 3,000 users.    The OHASIS system is a critical and mission essential means for thousands of military and civilian users to develop, staff, approve and manage projects intended to assist the Combatant Commands in accomplishing theater campaign plan objectives and achieve strategic ends states in support of U.S. national security and foreign policy interests."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Overseas Humanitarian Assistance Shared Information System"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.287"
                                            },
                                            "Text": {
                                                "val": "Building upon the improvements above: the FY 2014 funding will be used to improve reporting capabilities and efficiencies, and continue development of establishing quantifiable measures of effectiveness within HA projects that can be used to assess program success.  Specific plans include:\n\nOperationalize Project Umbrella functionality\n\nDevelop one Year After Action Reporting data input forms\n\nRefine and tune Humanitarian Assistance project nomination template\n\nRefine and tune Humanitarian Assistance Mine Action project nomination template"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.286"
                                            },
                                            "Text": {
                                                "val": "Focus on developing functionality geared towards the analysis of project information, after action reporting, and assess data. Develop tools to measure long-term effects of HA steady state projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.294"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.294"
                                            },
                                            "Text": {
                                                "val": "Develop ways to use the data and tools, within OHASIS, to measure long-term effects of our HA projects. This includes beginning the development of the one-year AAR by leveraging the system tools (i.e. project nomination template, 30-day AAR, etc).\n\nContinue to find more efficient ways of integrating with other systems including Pacific Disaster Center, REDi, Cooperation Security JCTD, GTSCMIS, USAID, CAOS, Foreign Assistance Dashboard, MARCIMs, etc.\n\nContinue working the system accreditation through the DSCA CIO.\nRefine and implement the “Umbrella Project” concept within the system. The umbrella project will give users a more strategic approach towards our humanitarian assistance investment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program employs an incremental technology development and implementation strategy to ensure a desired capability is delivered in a relevant timeframe. This strategy also will continue to leverage industry standard technologies for web development, database technology, database modeling, geographic information systems, reporting, and documentation.  As additional users require the system, it will continue to be developed with scalability and maintainability as key considerations.  Additionally, this capability will help DoD better collaborate and support external agencies and their programs by leveraging the web services that have been designed in the initial baseline."
                        },
                        "PerformanceMetrics": {
                            "val": "OHASIS project performance is measured in several methods: the successful meeting of stated performance objectives in the statement of work and meeting target dates in the project management plan, and successful management of the full life cycle of the over 1,000 Overseas Humanitarian Disaster and Civic Aid (OHDACA) projects."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Geospatial Research Integration Develoopment and Support (GriDS) II, IDIQ"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.842"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.287"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.286"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.294"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.294"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "1-yr After Action Reporting Module"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Measuring Effectiveness of Projects Module"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "\" Umbrella Project\"Program Module"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Establish SIPR Presence"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SIPR Data Replication"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SIPR Project Prioritization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SIPR Project Analysis"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop Low Bandwidth Connectivity"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Project Evaluation Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Handheld Data Access"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Handheld Data Collection"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}