{
    "id": "4731090e67d66940afb8ced763f578944e8fdd7c",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA4_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603779A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology - Dem\/Val"
        },
        "R1LineNumber": {
            "val": "63"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "2.544"
            },
            "CurrentYear": {
                "val": "7.826"
            },
            "BudgetYearOne": {
                "val": "8.813"
            },
            "BudgetYearOneBase": {
                "val": "8.813"
            },
            "BudgetYearTwo": {
                "val": "9.120"
            },
            "BudgetYearThree": {
                "val": "8.468"
            },
            "BudgetYearFour": {
                "val": "9.589"
            },
            "BudgetYearFive": {
                "val": "9.342"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2016 reduction attributed to realignment to other higher priority Army programs."
        },
        "ProgramElementMissionDescription": {
            "val": "There is a broad application potential for environmental quality technology (EQT) to be applied to multiple Army weapon systems and installations.  However technology must be demonstrated and validated (total ownership cost and performance data identified) before potential users will consider exploiting it.  This program element includes projects focused on validating the general military utility or cost reduction potential of technology when applied to different types of infrastructure, military equipment or techniques.  It may include validations and proof-of-principle demonstrations in field exercises to evaluate upgrades or provide new operational capabilities.  The validation of technologies will be in as realistic an operating environment as possible to assess performance or cost reduction potential.  EQT demonstration\/validation is systemic; i.e., applies to a class of systems (e.g., vehicles or aircraft) or to a Department of Army-wide, multiple site\/installation problem (e.g., unexploded ordnance detection and discrimination).  This program will address, and eventually resource, programs in each of the Army environmental quality technology pillars (military materials in the environment, sustainable ranges and lands, compliance, and pollution prevention).  All work must be endorsed by potential users and supported by a state-of-the-art assessment (i.e., \"technology is heading for user to implement\")."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.631"
                },
                "CurrentYear": {
                    "val": "7.830"
                },
                "BudgetYearOne": {
                    "val": "9.988"
                },
                "BudgetYearOneBase": {
                    "val": "9.988"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.544"
                },
                "CurrentYear": {
                    "val": "7.826"
                },
                "BudgetYearOne": {
                    "val": "8.813"
                },
                "BudgetYearOneBase": {
                    "val": "8.813"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.087"
                },
                "CurrentYear": {
                    "val": "-0.004"
                },
                "BudgetYearOne": {
                    "val": "-1.175"
                },
                "BudgetYearOneBase": {
                    "val": "-1.175"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.004"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.087"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.175"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.175"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "035"
                    },
                    "ProjectTitle": {
                        "val": "National Defense Cntr For Enviro Excellence"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.127"
                        },
                        "CurrentYear": {
                            "val": "2.578"
                        },
                        "BudgetYearOne": {
                            "val": "2.776"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.776"
                        },
                        "BudgetYearTwo": {
                            "val": "4.208"
                        },
                        "BudgetYearThree": {
                            "val": "4.029"
                        },
                        "BudgetYearFour": {
                            "val": "3.671"
                        },
                        "BudgetYearFive": {
                            "val": "3.743"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "The National Defense Center for Environmental Excellence (NDCEE) was established by Congress in 1990 with a directive to \"serve as a national leadership organization to address high priority environmental problems for the Department of Defense (DoD), other government organizations, and the industrial community.\"  The NDCEE Program is a national resource for developing and disseminating advanced environmental technologies.  The NDCEE is used to demonstrate environmentally acceptable technology to industry; validate new technology prior to transferring that technology; and assist in the training of potential users as part of that technology transfer process.  The NDCEE is a DoD resource for environmental quality management and technology validation.  This program is managed by the Army on behalf of the Office of the Assistant Deputy Under Secretary of Defense for Environment.  In May 2008, the program name was redesignated from the National Defense for Environmental Excellence to the National Defense Center for Energy and Environment to ensure that the Center's mission recognizes and addresses the strategic interdependence of energy and environmental technology requirements within an overall sustainability framework in support of our installations, weapons systems and war fighters.  This name change also directly supports the DoD's proactive implementation of Executive Order 13423, \"Strengthening Federal Environmental, Energy and Transportation Management.\"\n\nOur broadly encompassing and growing mobile, personal and stationary advanced energy technology requirements include infrastructure, alternative and synthetic fuels, surety, renewables, storage, distribution, advanced power, micro-grids, transportation, systems integration and others.  Further, to train as we fight, validated energy and environmental technologies need to be available and implemented at our installations.  The NDCEE will continue to demonstrate, validate, and transfer these technologies supporting our integrated environment, safety, occupational health and energy objectives with full consideration of the triple bottom line of mission, environment and community."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management and operations of the NDCEE by the prime contractor."
                                    },
                                    "Description": {
                                        "val": "Consists of the management and operation expenses required by the prime contractor to operate the NDCEE program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.319"
                                            },
                                            "Text": {
                                                "val": "Management and operation of the NDCEE by the prime contractor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.386"
                                            },
                                            "Text": {
                                                "val": "Management and operation of the NDCEE by the prime contractor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.335"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.335"
                                            },
                                            "Text": {
                                                "val": "Will consist of management and operation of the NDCEE by the prime contractor."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Industrial base integration, operation of the NDCEE environmental technology facility, and environmental information analysis."
                                    },
                                    "Description": {
                                        "val": "Funds the industrial base integration, operation of the NDCEE environmental technology facility, and environmental information analysis by the NDCEE prime contractor."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.242"
                                            },
                                            "Text": {
                                                "val": "Funded the industrial base integration, operation of the NDCEE environmental technology facility, and environmental information analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.293"
                                            },
                                            "Text": {
                                                "val": "Funds industrial base integration, operation of the NDCEE environmental technology facility, and environmental information analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.268"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.268"
                                            },
                                            "Text": {
                                                "val": "Will fund industrial base integration, operation of the NDCEE environmental technology facility, and environmental information analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Conduct demonstration\/validation of environmentally acceptable technologies that enhance military readiness and reduce production, operating, and\/or disposal costs."
                                    },
                                    "Description": {
                                        "val": "Supports the demonstration and validation of environmental, safety, occupational health, and energy technologies that support the Army's Environmental Quality Technology mission.  The objective is to determine if the technology is ready for implementation that will enhance military readiness and reduce production, operating, and\/or disposal costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.818"
                                            },
                                            "Text": {
                                                "val": "Conducted demonstration\/validation of environmentally acceptable technologies that enhance military readiness and reduce production, operating, and\/or disposal costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.991"
                                            },
                                            "Text": {
                                                "val": "Conduct demonstration\/validation of environmentally acceptable technologies that enhance military readiness and reduce production, operating, and\/or disposal costs.  Technologies demonstrated consist of technologies selected by the NDCEE Technical Working Group and approved by the NDCEE Executive Advisory Board."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.441"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.441"
                                            },
                                            "Text": {
                                                "val": "Will conduct demonstration\/validation of environmentally acceptable technologies that enhance military readiness and reduce production, operating, and\/or disposal costs.  Technologies to be demonstrated will consist of technologies selected by the NDCEE Technical Working Group and approved by the NDCEE Executive Advisory Board."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NDCEE Government program management during contract negotiations and during project formulation, execution, and technology transfer."
                                    },
                                    "Description": {
                                        "val": "Funds the government program management office for the NDCEE.  This consists of personnel assisting in contract negotiations and during project formulation, execution, and technology transfer."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.748"
                                            },
                                            "Text": {
                                                "val": "Funded NDCEE Government program management during contract negotiations and execution and during project formulation, execution, and technology transfer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.908"
                                            },
                                            "Text": {
                                                "val": "Fund NDCEE Government program management during contract negotiations and during project formulation, execution, and technology transfer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.732"
                                            },
                                            "Text": {
                                                "val": "Will fund NDCEE Government program management during contract negotiations and during project formulation, execution, and technology transfer."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The NDCEE is a national asset focused on DoD applications that include technology transfer to appropriate DoD organizations.  The NDCEE fosters an outreach program to describe its products and capabilities that include publication of results and participation in professional meetings, symposia, conferences, and appropriate coordination with industry.  The management strategy for the NDCEE centers on a DoD Executive Advisory Board (EAB) chaired by the DoD NDCEE Executive Agent on behalf of the Deputy Undersecretary of Defense for Installations and Environment and composed of senior DoD leadership to oversee NDCEE operations.  The EAB is supported by the NDCEE Technical Working Group (TWG) that includes senior level staff members from each of the offices represented on the EAB.  The NDCEE TWG coordinates all NDCEE activities, votes on proposed joint NDCEE projects, and reports back to the EAB Principals.  Working at the tactical levels, three Focus Groups (evironment, safety\/occupational health, and energy) were established to develop joint projects.  The Army's Environmental Quality Technology Program participating in the the Focus Groups also assists in the formulation of suggested environmental technology projects to be demonstrated within the NDCEE Program.  The contracting strategy of the NDCEE is based on using an NDCEE Contracting Officer's Representative to validate all the contractual portions of the NDCEE and by technical monitors (TM) to oversee the technical aspects of each contracted task.  A prime contractor operates NDCEE test facility to validate environmentally compatible technologies on a representative \"shop floor\".  The NDCEE accounts for and conducts work for: (1) direct funded Army tasks; (2) reimbursable tasks from within DoD and from other Government agencies; and (3) when applicable Congressionally directed and funded tasks."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RDECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.713"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.748"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.908"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.732"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.732"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "To Be Determined"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "To Be Determined"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "To Be Determined"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.797"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Data"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Concurrent Technologies Corporation (CTC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Johnstown, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.888"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.561"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.679"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.603"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.603"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development Testing and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Concurrent Technologies Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Johnstown, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "25.622"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.818"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.991"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.441"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.441"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76683-30.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NDCEE Management and Operations (Enduring)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NDCEE Env, Safety, Occ Health, and Energy Technology Dem\/Val (Enduring)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "04E"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Restoration Tech Validation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.417"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.308"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Environmental Information Technology Management (EITM) includes support for Knowledge Based Corporate Reporting system (KBCRS) and Defense Environmental Network Information Exchange (DENIX). This new request for research, development, test and evaluation (RDTE) is to enhance KBCRS to a net-centric all services transactional system of record and reporting tool set. Also includes EITM upgrades to incorporate new security and other requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Restoration Technology Validation"
                                    },
                                    "Description": {
                                        "val": "Conducts system enhancements as required to meet data management requirements for the Knowledge Based Corporate Reporting System and the Defense Environmental Network Information Exchange components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.417"
                                            },
                                            "Text": {
                                                "val": "Provided system upgrades to support users with reporting requirements, for example the Annual Report to Congress and Chemical Management Enterprise Information Integration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0205412A"
                                    },
                                    "Title": {
                                        "val": "Environmental Information Tech Modernization (EE6)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "0.280"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.280"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Environmental Information Technology Management (EITM) Program is an Office of the Secretary of Defense sponsored program that was assigned to the Deputy Assistant Secretary of the Army for Environment, Safety and Occupational Health as the Department of Defense (DoD) Executive Agent by the Under Secretary of Defense for Acquisition, Technology and Logistics in 2001.  The DoD Directive 4715.1E defined EITM mission is to ensure efficient use of enterprise environment, safety and occupational health (ESOH) corporate information management processes by providing and sustaining requirement-driven ESOH corporate data management, Congressional-reporting and public outreach tools to the DoD, and other DoD stakeholders.  Funding provided for this program will allow EITM to develop a Deputy Under Secretary of Defense for Installations and Environment directed Chemical Management Enterprise Information Integration capability that will allow Army net-centric hazardous material and ESOH 2.0 NetCentric data management capabilities per the Secretary of the Army Directive 2009-03 \"Army Data Management\" and DoD Directive 8320.2 \"Data Sharing in a Net-Centric Department of Defense.\"  Prior to funding being committed, Army and DoD environmental information technology stakeholders meet to determine which high priority EITM interface requirements need upgrades to incorporate new security and other information technology requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental testing and evaluation for required network interfaces."
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Delta Resources"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.728"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.417"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.145"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76683-31.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "System enhancements for KBCRS and DENIX systems (FY 2014)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System enhancements for KBCRS and DENIX systems (FY 2018)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "E21"
                    },
                    "ProjectTitle": {
                        "val": "POLLUTION PREVENTION TECHNOLOGY DEM\/VAL"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.248"
                        },
                        "BudgetYearOne": {
                            "val": "6.037"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.037"
                        },
                        "BudgetYearTwo": {
                            "val": "4.912"
                        },
                        "BudgetYearThree": {
                            "val": "4.131"
                        },
                        "BudgetYearFour": {
                            "val": "5.918"
                        },
                        "BudgetYearFive": {
                            "val": "5.599"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "New Starts FY 2016: Environmental quality technology demonstration and validation: SafePort, ESOH Impacts of Short-Term Noise Assessment Procedures, and Advanced Water Reuse Technology for Fixed Installations."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports Advanced Component Development and Prototypes of environmental quality technologies developed within the Army Environmental Quality Technology program.  The project increases operational sustainment and warfighter training capabilities by reducing soldier and worker health risks and environmental quality impacts that would otherwise result in restoration needs and compliance enforcement actions against installations while simultaneously increasing performance and standardization across the Army.  The project expedites technology transition from the laboratory to operational use by demonstrating new materials and processes to fulfill the performance requirements outlined in Material Specifications, Depot Maintenance Work Requirements, Technical Manuals, Drawings and other technical data.  Materials and processes demonstrated under this project are inherently more sustainable than the baseline with respect to environmental, safety and occupational health concerns, thereby reducing life cycle costs incurred by acquisition, industrial base and installation end users."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Toxic Metal Reduction in Surface Finishing of Army Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "Increase readiness and environmental sustainability of Army depots and maintenance facilities by reducing or eliminating the use of hexavalent chromium, cadmium and associated toxic or carcinogenic materials used in surface finishing processes."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.318"
                                            },
                                            "Text": {
                                                "val": "Conduct large-scale demonstrations of sustainable alternatives for mixed metal pretreatment, aluminum anodizing and hard chrome electroplating processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.638"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.638"
                                            },
                                            "Text": {
                                                "val": "Will conduct large-scale demonstrations of sustainable alternatives for conversion coating, surface activation and copper\/silver electroplating processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Airborne Lead Reduction from Army Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "Sustain soldier training readiness and ensure compliance at Army installations by reducing or eliminating the use of lead compounds in rocket and missile propellants and primary explosives (primers\/detonators\/initiators)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.930"
                                            },
                                            "Text": {
                                                "val": "Demonstrate large-scale producibility of a promising lead-free primary explosive composition and demonstrate a lead-free stab detonator in a relevant end item configuration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.467"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.467"
                                            },
                                            "Text": {
                                                "val": "Will qualify a promising lead-free primary explosive composition and will demonstrate a lead-free percussion primer in a relevant end item configuration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: SafePort"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and validate rapid detection capability of the SafePort portable water analysis system for quantitation of lead, cadmium, and perchlorate as well as dispersed oil detection and pathogenic water organism detection in laboratory and field usage greatly reducing environmental compliance costs using verified techniques."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.062"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.062"
                                            },
                                            "Text": {
                                                "val": "Will fund the initial field demonstration and performance testing of perchlorate and heavy metal technologies along with data to evaluate comparative costs and compliance detection thresholds. Also will fund continuing field demonstrations and performance testing of perchlorate and heavy metal technologies along with data to evaluate comparative costs and compliance detection thresholds."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: ESOH Impacts of Short-Term Noise Assessment Procedures"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and validate the technologies, including the underlying computational algorithms, for the impact of short-term noise assessment procedures on environmental footprint and Soldier readiness.  When completed the program will: 1) have validated short-term noise assessment procedures, including uncertainty metrics and 2) have on-line, self-guided trainig modules for Sustainable Range Program range officers on performing and interpreting short-term noise assessment results."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.429"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.429"
                                            },
                                            "Text": {
                                                "val": "Incorporate community response blast noise metrics into all short-term noise assessment tools.  Demonstration field studies will commence."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Advanced Water Reuse Technology for Fixed Installations"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and validate andvanced water reuse technology for fixed instalaltions and assess ESOH impacts.  At the completion of this program, the following will be accomplished: 1) demonstration of energy efficient advanced water reuse technology at installations, 2) ESOH analysis of three wate reuse technologies for installations including shower water recycling, distributed water reclamation, and centralized reclamation; 3) reports on best practices for permitting, design, and safe operation of advanced reuse technologies; and 4) marketing materials comparing quality of advanced reuse water to tap and bottled water to support technology adoption campaigns at installations and contingency bases."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.441"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.441"
                                            },
                                            "Text": {
                                                "val": "Analysis of toxicity and full suite of potential water contaminants (Disinfection By-Products, Pentachlorophenol, viruses, Total Organic Carbon) at Technology Enabled Capabilities Demonstration sites and at active Environmental Security Technology Certification Program demonstration sites; permitting of advanced water reuse technology demonstration; and contracting for a demonstration\/validation prototype."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0605857A"
                                    },
                                    "Title": {
                                        "val": "Pollution Prevention Tech Support (06I)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "0.272"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.272"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.272"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.436"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.533"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.391"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.514"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The project ultimately transitions successfully demonstrated environmental quality technologies to Army acquisition, industrial base and installation end users.  As part of the Army's Environmental Quality Technology Program, all technology efforts address a valid Army Environmental Requirements and Technology Assessments (AERTA) requirement.  The Army's Environmental Technology Integrated Product Team conducts a thorough assessment and makes funding recommendations to senior Army environmental leadership.  Efforts approved by senior Army environmental leadership receive Advanced Component Development and Prototype funding to fully demonstrate and validate the technology for transition to end users for follow on implementation."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Conduct Demonstrations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Varies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Varies"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.248"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.037"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.037"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76683-32.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Toxic Metals Redution Demonstration\/Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Airborne Lead Reduction Demonstration\/Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SafePort Demonstration\/Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ESOH Impacts of Short-Term Noise Assessment Procedures Demonstration\/Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Advanced Water Reuse Technology for Fixed Installations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}