{
    "id": "5071a185f273b6d35a5acad951a88ade2159b3a3",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604822A"
        },
        "ProgramElementTitle": {
            "val": "General Fund Enterprise Business System (GFEBS)"
        },
        "R1LineNumber": {
            "val": "106"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "3.218"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "15.700"
            },
            "BudgetYearOneBase": {
                "val": "15.700"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The GFEBS program received FY 2014 funding in PE 0605013A Project M05. The FY 2016 funding in PE 0604822A Project GF5 is a realignment of funding and a not a New Start.\nFY 2016 Project GF5 was increased $14.700 million to support the Headquarters Army Environmental System (HQAES) effort. \nFY 2016 Project DV6 was increased $1.000 million to complete testing of GFEBS-SA."
        },
        "ProgramElementMissionDescription": {
            "val": "The General Fund Business Enterprise System (GFEBS) is a Major Automated Information System program and is currently in the sustainment phase. It followed the DoD Business Enterprise Architecture which is aligned to the mandated Federal Enterprise Architecture. GFEBS was implemented to fulfill the needs and comply with the Federal Financial Management Improvement Act, The Chief Financial Officers Act of 1990, the Government Performance and Results Act of 1993, the Government Management Reform Act of 1994, and the Clinger-Cohen Act of 1996 and to fulfill the stated mission of the Assistant Secretary of the Army for Financial Management and Comptroller. GFEBS replaced, in full or in part, financial systems operating in excess of 40 years including the Standard Finance Systems and other costly feeder systems which do not allow the Department of Defense or the U.S. government to achieve an unqualified audit opinion on its financial statements. GFEBS is used to administering the Army's General Fund. GFEBS was developed using a commercial off-the-shelf Enterprise Resource Planning system that is certified by the Chief, Financial Officer Council and provides six core financial functions. GFEBS allows tactical commanders to make informed decisions on a virtually real time system.\n\nOn 1 October 2008, GFEBS deployed to Wave 1 end users at Fort Jackson Garrison, Defense Finance Accounting Service (DFAS) Indianapolis, Indiana and several other organizations. On 1 April 2009, GFEBS deployed to Wave 2 users at Fort Benning, Fort Stewart, DFAS Rome and several other organizations. Wave 3 deployed in October FY10, Wave 4 in January of FY11, Wave 5 in April 2011, Wave 6 in July 2011, Wave 7 in October 2011, Wave 8A in April 2012 and the final Wave 8B in July 2012. GFEBS is fielded to over 37,000 trained end users. Each fielded release subsumed the previous release keeping all deployed sites executing under the same GFEBS release. The Full Deployment Decision was received by the Milestone Decision Authority on 24 June 2011 and Full Deployment was Full Deployment was achieved on 1 July 2012.\n\nGFEBS-Sensitive Activities (SA): GFEBS is a commercial off-the-shelf Enterprise Resource Planning System certified by the Chief Financial Officers Council. GFEBS has trained and supports over 37,000 end users at 227 installations worldwide and is the Army's solution to the current capability gap in accounting and financial management. Army still has classified and sensitive financial activity remaining in legacy systems that cannot be processed in our new, fully-fielded GFEBS. To protect sensitive information and enable auditability, Army needs a separate instance of GFEBS operated on a secure network for processing sensitive and classified financial transactions. GFEBS-SA will be implemented in two functional releases to 3,000 users across 100 locations worldwide. GFEBS-SA will integrate seamlessly with GFEBS to provide secure, web-based financial execution and reporting capabilities to the Army's classified and sensitive activities. SA is envisioned as a fully functional GFEBS application operated on a secure network, including additional performance requirements designed to enhance security. SA is essential to comply with the Chief Financial Officers Act and the Federal Financial Management Improvement Act; includes the additional security controls; shall be delivered NLT 1QFY17 with all capability and required cross domain interfaces. SA will be accessible on SIPRnet domain, contain Secret Collateral level information, and below. SA will utilize a cross-domain solution to exchange summary level financial transaction data to GFEBS and other required systems, enabling total general ledger accountability in one system. In accordance with 2010 NDAA, GFEBS-SA willl support the legal requirements to achieve full audit readiness of all DOD finanical statement by 2017. Without the SA increment, GFEBS will be unable to achieve an unqualified audit opinion or achieve audit readiness. GFEBS and GFEBS-SA will provide Army's decision makers with relevant, reliable, and timely information for decision making. RDTE funds are required to execute the System Integrator contract to develop and test the SA solution. Sensitive Activities provides a classified version of the GFEBS program. Sensitive Activities allows processing of data in a secure environment to protect and manage classified data without causing risk to our national security.\n\nIntegration of Environmental Management will migrate HQAES capabilities for collection, analysis, and reporting of environmental clean-up, quality and hazardous waste data."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.226"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.218"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "15.700"
                },
                "BudgetYearOneBase": {
                    "val": "15.700"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.992"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "15.700"
                },
                "BudgetYearOneBase": {
                    "val": "15.700"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.992"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "14.700"
                                },
                                "BudgetYearOneBase": {
                                    "val": "14.700"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "GFEBS-SA"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DV6"
                    },
                    "ProjectTitle": {
                        "val": "General Fund Enterprise Business System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.218"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project DV6 is General Fund Enterprise Business System - Sensitive Activities."
                        },
                        "ProjectMissionDescription": {
                            "val": "Plan, develop, and manage GFEBS-SA as a separate instance from GFEBS base program to support evolutionary delivery of capabilities. SA is envisioned as a fully functional GFEBS application operated on a secure network (SIPRNET), including additional performance requirements designed to enhance security. SA is essential to comply with the Chief Financial Officers (CFO) Act and the Federal Financial Management Improvement Act (FFMIA). Fully integrated (across domains) secure GFEBS-SA capability with all required cross domain interfaces shall be delivered no later than 1QFY17."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Funding is for the following activities:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.218"
                                            },
                                            "Text": {
                                                "val": "Execution of systems Integrator contractor to develop and test functional, technical and configuration designs for secure solution of GFEBS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Complete system testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA"
                                    },
                                    "Title": {
                                        "val": "GFEBS Sensative Activites (OPA SSN B55511)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "13.728"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.455"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.455"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Plan, develop, and manage GFEBS-SA as a separate instance from GFEBS base program to support evolutionary delivery of capabilities.  SA is envisioned as a fully functional GFEBS application operated on a secure network (SIPRNET), including additional performance requirements designed to enhance security.  SA is essential to comply with the Chief Financial Officers (CFO) Act and the Federal Financial Management Improvement Act (FFMIA). Fully integrated (across domains) secure GFEBS-SA capability with all required cross domain interfaces."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Integrator Contract"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EDC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.056"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.218"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "20.274"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PdM GFEBS SA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.726"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.726"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC\/ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.960"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.960"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76651-149.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Limited Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "GF5"
                    },
                    "ProjectTitle": {
                        "val": "General Fund Enterprise Business System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "14.700"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.700"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.700"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The GFEBS program received FY 2014 funding in PE 0605013A Project M05. The FY 2016 funding in PE 0604822A Project GF5 is a realignment of funding and a not a New Start.\n\nIntegration of Environmental Management will migrate Headquarters Army Environmental System (HQAES) capabilities for collection, analysis, and reporting of environmental clean-up, quality and hazardous waste data."
                        },
                        "ProjectMissionDescription": {
                            "val": "The General Fund Business Enterprise System (GFEBS) is a Major Automated Information System program and is currently in the sustainment phase. It followed the DoD Business Enterprise Architecture which is aligned to the mandated Federal Enterprise Architecture. GFEBS was implemented to fulfill the needs and comply with the Federal Financial Management Improvement Act, The Chief Financial Officers Act of 1990, the Government Performance and Results Act of 1993, the Government Management Reform Act of 1994, and the Clinger-Cohen Act of 1996 and to fulfill the stated mission of the Assistant Secretary of the Army for Financial Management and Comptroller. GFEBS replaced, in full or in part, financial systems operating in excess of 40 years including the Standard Finance Systems and other costly feeder systems which do not allow the Department of Defense or the U.S. government to achieve an unqualified audit opinion on its financial statements. GFEBS is used to administering the Army's General Fund. GFEBS was developed using a commercial off-the-shelf Enterprise Resource Planning system that is certified by the Chief, Financial Officer Council and provides six core financial functions. GFEBS allows tactical commanders to make informed decisions on a virtually real time system.\n\nOn 1 October 2008, GFEBS deployed to Wave 1 end users at Fort Jackson Garrison, Defense Finance Accounting Service (DFAS) Indianapolis, Indiana and several other organizations. On 1 April 2009, GFEBS deployed to Wave 2 users at Fort Benning, Fort Stewart, DFAS Rome and several other organizations. Wave 3 deployed in October FY10, Wave 4 in January of FY11, Wave 5 in April 2011, Wave 6 in July 2011, Wave 7 in October 2011, Wave 8A in April 2012 and the final Wave 8B in July 2012. GFEBS is fielded to 53,000 trained end users. Each fielded release subsumes the previous release keeping all deployed sites executing under the same GFEBS release. The Full Deployment Decision was received by the Milestone Decision Authority on 24 June 2011 and Full Deployment was Full Deployment was achieved on 1 July 2012."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HQAES Development and Integration"
                                    },
                                    "Description": {
                                        "val": "Initial development and integration of HQAES capabilities for collection, analysis and reporting of environmental clean-up, quality and hazardous waste data."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.700"
                                            },
                                            "Text": {
                                                "val": "Development and integration of Environmental Management, Integrated Resource Management, and Total Cost Management. Integration of Environmental Management will migrate HQAES capabilities for collection, analysis, and reporting of environmental clean-up, quality and hazardous waste data."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA"
                                    },
                                    "Title": {
                                        "val": "OPA, SSN BE4168"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.614"
                                        },
                                        "CurrentYear": {
                                            "val": "2.853"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.540"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.540"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.209"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.242"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.320"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.402"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "41.180"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA"
                                    },
                                    "Title": {
                                        "val": "OMA,"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "56.707"
                                        },
                                        "CurrentYear": {
                                            "val": "52.155"
                                        },
                                        "BudgetYearOne": {
                                            "val": "59.030"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "59.030"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "59.288"
                                        },
                                        "BudgetYearThree": {
                                            "val": "61.398"
                                        },
                                        "BudgetYearFour": {
                                            "val": "61.573"
                                        },
                                        "BudgetYearFive": {
                                            "val": "62.804"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "412.955"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "GFEBS Program Management Office (PMO) requires a performance-based, hybrid fixed price and cost reimbursable) task order with a base period (one-year)and four (one-year) options for a full range of technical, functional, and managerial support to sustain GFEBS and develop and implement solutions in response to requests for new GFEBS functionality. GFEBS is in the Sustainment phase; wherein, the system's performance is continually assessed, updated, and audited for compliance to Federal Regulations, Federal Financial Management Improvement Act, Financial Improvement and Audit Readiness, and accounting standards.  The scope is comprised of a full range of services and solutions necessary to support, sustain, improve and maintain GFEBS, Army-wide.  Sustainment of the GFEBS\ninfrastructure consists of risk-based preventive, corrective and perfective maintenance of an Army financial system that is primarily Commercial Off-The-Shelf (COTS) based and thereby directly impacted by industry best practices, marketplace trends, and the evolution of commercial information technology capabilities.  \n\nGFEBS PMO anticipates awarding a task order under a Government-Wide Acquisition Contract (i.e. National Institutes of Health, Chief Information Officer - Solutions and Partners 3 (CIO-SP3)). A Request for Proposal will include requirements documents such as a Performance Work Statement, Service Level Agreements (SLAs), and a Quality Assurance Surveillance Plan and fair opportunity will be provided to all contract holders. The services will be grouped and referenced as Contract Line Item Numbers to include a hybrid of contract types (i.e. firm-fixed price, cost-plus- fixed fee, and cost-plus-incentive fee) with incentives (positive and negative). Costs(containment and reduction), quality (performance standards), and schedule (delivery) will all be incentivized through competition, options, contract\ntypes, and SLAs."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "FY16 Funds used for initial migration of HQAES capabilities for collection, analysis and reporting of environmental clean-up, quality and hazardous waste data; and to establish the GFEBS architecture and infrastructure for follow-on capabilities."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Accenture"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kingstowne VA 22305"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "120.968"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HQAES Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "14.700"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "14.700"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.700"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76651-150.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "HQAES Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}