{
    "id": "6a8cdbb31d97bff7b1e8e22a8cf48fcdc86379cd",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603456F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Advanced Technology Development"
        },
        "R1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.508"
            },
            "CurrentYear": {
                "val": "21.788"
            },
            "BudgetYearOne": {
                "val": "25.448"
            },
            "BudgetYearOneBase": {
                "val": "25.448"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "26.314"
            },
            "BudgetYearThree": {
                "val": "22.811"
            },
            "BudgetYearFour": {
                "val": "23.470"
            },
            "BudgetYearFive": {
                "val": "25.114"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates technologies to enhance airman performance and effectiveness in the aerospace force.  State-of-the-science advances are made in warfighter training, warfighter system interfaces, directed energy bioeffects, deployment and sustainment of warfighters in extreme environments, and understanding and shaping adversarial behavior.  The Directed Energy Bioeffects Parameters project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems.  The Human Dynamics and Terrain Demonstration project develops, demonstrates, and transitions human-centric technologies to address processing, exploitation, and dissemination of intelligence, surveillance, and reconnaissance (ISR) capability needs.  The Mission Effective Performance project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness.  The Warfighter Interfaces project develops, demonstrates, and transitions technologies to revolutionize the way airmen synergistically use Air Force systems, including autonomous machines and adaptive teams of airmen and machines.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  \n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.902"
                },
                "CurrentYear": {
                    "val": "21.788"
                },
                "BudgetYearOne": {
                    "val": "19.817"
                },
                "BudgetYearOneBase": {
                    "val": "19.817"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.508"
                },
                "CurrentYear": {
                    "val": "21.788"
                },
                "BudgetYearOne": {
                    "val": "25.448"
                },
                "BudgetYearOneBase": {
                    "val": "25.448"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.606"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.631"
                },
                "BudgetYearOneBase": {
                    "val": "5.631"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.001"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.395"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "5.631"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.631"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2014, funds were reprogrammed to support a high-priority live, virtual and constructive demonstration effort.\n\nFY 2016 increase to support high-priority live, virtual and constructive demonstration effort."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635323"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Bioeffects Parameters"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.615"
                        },
                        "CurrentYear": {
                            "val": "3.092"
                        },
                        "BudgetYearOne": {
                            "val": "2.439"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.439"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.731"
                        },
                        "BudgetYearThree": {
                            "val": "4.888"
                        },
                        "BudgetYearFour": {
                            "val": "5.115"
                        },
                        "BudgetYearFive": {
                            "val": "6.393"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems.  This project also develops the human components of the guidelines for testing, deployment, and protection from high power microwave and high energy laser systems and uses this information to enhance the effectiveness of these weapon systems in air, space, and cyber operations.  The optical radiation bioeffects thrust develops and demonstrates technologies that counter optical threats, while exploiting optical systems for non-lethal applications.  The radio frequency (RF) radiation bioeffects thrust develops and demonstrates technologies to assess RF bioeffects and collateral hazards from high power RF directed energy systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate optical protective technologies for aircrew and ground personnel to provide protection against directed energy threats.  Develop modeling capabilities to assess collateral hazards from high power directed energy laser systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.177"
                                            },
                                            "Text": {
                                                "val": "Merged a frame and format design capability with a visual performance metrics and modeling capability to create a single, integrated package allowing complete human systems integration of laser eye protection (LEP).  Used three-dimensional (3-D) optical modeling tools to quantify and visually render the effects of LEP filters on human vision.  Participated in demonstration of mission planning analysis tool for optimization of directed energy\/kinetic energy weapons use.  Validated bioeffects models.  Integrated probabilistic tools into high energy laser collateral damage models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Begin integration of physiological\/behavioral response models into engagement-level simulation capabilities for directed energy weapon threats and concepts.  Demonstrate modeling and simulation tools which transition engagement-level simulations to mission and campaign models to evaluate the utility and impact of directed energy systems.  Apply these models in the battlespace simulation at tactical levels with contribution of bioeffect human vulnerability models in a DoD standardized format.  Continue flight evaluation comparisons of predictive human system integration models to performance and acceptance of military users of these technologies in next-generation aircraft, identifying data gaps and optimizing future acquisitions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.622"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.622"
                                            },
                                            "Text": {
                                                "val": "Complete initial demonstration of physiological\/behavioral response model in engagement-level simulation within distributed simulation and Air Force modeling and simulation architecture for overall weapons evaluations.  Complete initial demonstration of human vulnerability model built within a DoD standardized format and continue additional component development, integrating vision effects along with probability of eye and skin injury.  Complete effort to design probabilistic risk assessment tools for lasers. Extend LEP evaluations to perform night visor aircrew acceptance testing, including laboratory testing, and ground and flight assessments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to assess RF bioeffects and collateral hazards from high power RF directed energy systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.438"
                                            },
                                            "Text": {
                                                "val": "Identified candidate directed energy weapons system and began to incorporate real-time collateral effects and hazard calculations into weapon systems.  Participated in demonstration of mission planning analysis tool for optimization of directed energy\/kinetic energy weapons use.  Validated bioeffects models.  Began integration of RF bioeffects real-time model and control algorithms into RF weapons to optimize non-lethal human effects while minimizing collateral damage from RF weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.592"
                                            },
                                            "Text": {
                                                "val": "Validate predictive capability of models against high average power scenarios and begin integration of high peak power models and high average power models into one software suite.  Continue integration of RF bioeffects real-time model and control algorithms into RF weapons to optimize non-lethal human effects while minimizing collateral damage from RF weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.817"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.817"
                                            },
                                            "Text": {
                                                "val": "Develop fast (near real-time) anatomy and physiology-based computational tool for RF-induced thermal response.  Complete prototype high peak power effects model integration into software suite and begin verification and validation studies.  Increase efficiency of human posing and morphing for electromagnetic analysis."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635324"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics and Terrain Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.459"
                        },
                        "CurrentYear": {
                            "val": "8.839"
                        },
                        "BudgetYearOne": {
                            "val": "7.149"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.149"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.759"
                        },
                        "BudgetYearThree": {
                            "val": "6.935"
                        },
                        "BudgetYearFour": {
                            "val": "7.068"
                        },
                        "BudgetYearFive": {
                            "val": "7.209"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to identify human threats within the air, space, and cyber domains.  These technologies will enhance Air Force capabilities in ISR, layered sensing, autonomous and adaptive decision-making systems, decision aids for computer network attack\/defense\/support, ISR force development and training, cross-cultural communication, human-centric exploitation of measurement and signatures intelligence, and advanced molecular diagnostic methodologies to assess airman performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate human-centered design processes and operational tools that optimize ISR information exploitation and analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.977"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and delivered work aids for intelligence analysts and tools for collaborative synthesis and social cognitive analysis.  Demonstrated and delivered human-centric analytic work environment for intelligence analysis by processing, exploitation, and dissemination teams.  Assessed effectiveness of analyst aids in the processing, exploitation, and dissemination process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.419"
                                            },
                                            "Text": {
                                                "val": "Develop analytical work environments and toolsets to create advanced situational performance for ISR work roles that span the processing, exploitation, and dissemination process from time-dominated tactical work situations to content-dominated operational and strategic reach back operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.194"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.194"
                                            },
                                            "Text": {
                                                "val": "Demonstrate initial analytical work environments and toolsets to advance performance for ISR work roles in contested environments that span the processing, exploitation, and dissemination process from time-dominated tactical work situations to content-dominated operational and strategic reach back operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate machine translation and speech-to-text tools to support the span of Air Force mission areas including ISR and cyber operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.349"
                                            },
                                            "Text": {
                                                "val": "Matured human language technologies to develop tools that improve the effectiveness of ISR operators and intelligence analysts.  Developed, assessed, and tested capabilities against specific customer data sets, especially those characterized by scientific and technical terminology.  Evaluated and integrated algorithms into frameworks supporting ISR collection and exploitation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.150"
                                            },
                                            "Text": {
                                                "val": "Develop advanced multimedia machine translation and automatic speech recognition tools.  Develop 'soft' and 'hard' fusion methodology experiments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.206"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.206"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and test advanced multimedia machine translation and automatic speech recognition tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Signatures"
                                    },
                                    "Description": {
                                        "val": "Develop automated and assisted methods to exploit human threat biosignatures to defeat terrorist activities and hidden person-borne threats.  Provide improved models of virtual humans to deliver mission-ready training for ISR analysts and create more immersive, realistic experiences in joint and coalition exercises."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.133"
                                            },
                                            "Text": {
                                                "val": "Initiated multimodal exploitation of signatures through fusion of radar, electro-optical, and infrared sensing.  Collected outdoor signatures for hyperspectral and polarized light with realistic background.  Initiated development of multimodal avatar with radar output and morphology governing size, shape, and motion definition and an on-the-job training platform for ISR analysts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.270"
                                            },
                                            "Text": {
                                                "val": "Demonstrate utility of integrated normative anthropometric-based human signatures data sets.  Demonstrate wearable wireless monitors for human performance real-time assessment for multiple operational settings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.749"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.749"
                                            },
                                            "Text": {
                                                "val": "Investigate integration of normative anthropometric-based human signatures algorithms into sensor system processors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635325"
                    },
                    "ProjectTitle": {
                        "val": "Mission Effective Performance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.279"
                        },
                        "CurrentYear": {
                            "val": "4.461"
                        },
                        "BudgetYearOne": {
                            "val": "10.724"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.724"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "10.141"
                        },
                        "BudgetYearThree": {
                            "val": "6.626"
                        },
                        "BudgetYearFour": {
                            "val": "6.846"
                        },
                        "BudgetYearFive": {
                            "val": "6.982"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness.  This project also develops advanced methods and technologies to enable interactive live, virtual, and constructive (LVC) environments for performance-aiding methods and technologies.  Focus areas include integrated high-fidelity weapon systems training technologies for air, space, and cyber; tailored immersive simulation environments for airmen at the tactical and operational levels; and incorporating performance assessment and feedback tools.  These methods and technologies facilitate the development of mission-essential competencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate secure, persistent, and standardized LVC training enterprise.  Utilize modeling capabilities for technology demonstration efforts focused on developing software-based tools for training that would replace human instructors.  This enables more efficient mission execution training in an LVC environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.279"
                                            },
                                            "Text": {
                                                "val": "Completed development, demonstration, and initial transition of learning management system for distributed mission operations (DMO) and LVC operations.  Initiated development of standards for shareable scenario content, data, and metrics.  Began development of operational LVC requirements and secure enterprise architecture to support LVC operational training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.461"
                                            },
                                            "Text": {
                                                "val": "Complete performance-based LVC environment fidelity assessment system.  Complete development of automated tools to analyze training utility for alternative ways to accomplish mixes of live and virtual training in and across mission sets.  Begin development of common scenario, learner performance, and after action review content tagging for training.  Develop learning management technologies for undergraduate pilot training.  Develop adaptive training and performance measurement system for ISR analysts.  Develop low-cost, multiple-platform remotely piloted aircraft (RPA) training system.  Initiate adaptive training for Red Flag preparation.  Develop deployable LVC capability for manned and unmanned aircraft as well as emergency responders."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.724"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.724"
                                            },
                                            "Text": {
                                                "val": "Complete operational trials of integrated LVC operations training and assessment methods in large force exercise. Demonstrate shareable content and metrics in joint and coalition mission training contexts.  Begin development of reusable models for improving adversary realism in DMO and LVC environments.  Demonstrate deployable LVC training in integrated manned and unmanned aircraft and ground operations exercise. Begin development of scenario and metrics specifications and standards for deployable LVC operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635327"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Interfaces"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.155"
                        },
                        "CurrentYear": {
                            "val": "5.396"
                        },
                        "BudgetYearOne": {
                            "val": "5.136"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.136"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.683"
                        },
                        "BudgetYearThree": {
                            "val": "4.362"
                        },
                        "BudgetYearFour": {
                            "val": "4.441"
                        },
                        "BudgetYearFive": {
                            "val": "4.530"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to revolutionize the way airmen optimize the capabilities of Air Force systems, including autonomous machines and adaptive teams of airmen and machines.  Improvements in the presentation of operational information to the community of users, from the system operator to the commander, must be developed in step with advancements in the acquisition, storage, and retrieval of information.  This project provides the advances in understanding of human cognitive abilities, as well as the utilization of human interfaces, multisensory fusion, high-resolution image displays, and 3-D audio to customize communications and enhance shared understanding across a diverse user community in air, space, and cyber for maximum situational awareness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Develop sense, assess, and augment technologies to facilitate efficient workflow in distributed operational environments.  Develop empirically validated cyber operator-centered tools for distributed cyber operations integrated into a single user interface."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.785"
                                            },
                                            "Text": {
                                                "val": "Completed analysis of human operator team composition and requisite skill sets based upon cyber tool set composition, operational information flow, and concept of operations.  Began initial design of an integrated offensive and defensive cyber operator tool set."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.729"
                                            },
                                            "Text": {
                                                "val": "Finalize design recommendations for an integrated offensive and defensive cyber operator tool set.  Integrate neurophysiological sensors and validated biofluid sensors capable of real-time assessment of human cognition, human-machine teaming status, and calibrated trust.  Conduct cognitive task analyses and cognitive work analyses in operational cyber and other operational domains to develop technical requirements and make operational recommendations based on findings.  Integrate sensors, methodologies, and approaches to assess operator functional state relating to stress, cognition, trust, and human-machine teaming."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.437"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.437"
                                            },
                                            "Text": {
                                                "val": "Verify and validate design recommendations for an integrated offensive and defensive cyber operator tool set. Finalize design of neurophysiological-based airman performance sensor suite. Refresh sensors, methodologies, and approaches to assess operator functional state relating to stress, cognition, trust, and airman-machine teaming."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Demonstrate ability to forecast acoustic profiles for any atmospheric\/terrain condition.  Demonstrate technologies to enhance the battlefield airman's situational awareness through wearable interfaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.398"
                                            },
                                            "Text": {
                                                "val": "Refined high-fidelity 3-D acoustic models for integration into mission planning tools.  Validated acoustic models against real-world data obtained from airborne platform measurements.  Incorporated weather effects, landscape sounds, and geography into acoustic models.  Developed prototype user interfaces based on pararescue jumper requirements and use-case scenarios.  Refined wearable interface designs based on battlefield airmen feedback."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.901"
                                            },
                                            "Text": {
                                                "val": "Integrate real-time 3-D acoustic models into mission planning tools.  Validate high-fidelity 3-D acoustic models against real-world data obtained from airborne platform measurements in different weather and terrain environments.  Validate weather effects, landscape sounds, and geography used in developed acoustic models.  Apply human factors and usability engineering methodologies to prototype and test wearable interfaces for seamless integration of data for battlefield airmen."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.119"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.119"
                                            },
                                            "Text": {
                                                "val": "Validate real-time 3-D acoustic models into mission planning tools. Evaluate high-fidelity 3-D acoustic models against real-world data obtained from airborne platform measurements in different weather and terrain environments. Conduct human panel validation studies of weather effects, landscape sounds, and geography used in developed acoustic models. Initiate applications of physiological sensors, usability engineering methodologies to prototype and test innovative solutions required for battlefield airmen and pararescue jumpers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an integrated human-centered interface to control multiple RPAs that have various levels of autonomy and that optimize net-centric information flow."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.972"
                                            },
                                            "Text": {
                                                "val": "Integrated, tested, and evaluated operator interface designs to support decision-making and situation awareness while controlling multiple advanced and legacy RPAs in a dynamic mission environment.  Developed multi-transit control station interface technology to enable a single pilot to simultaneously control multiple RPAs transiting through airspace. Began developing and evaluating interface controls for a networked RPA collaborative environment allowing teams of pilots along with sensor and payload operators to work together during stringent mission phases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.766"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and evaluate operator interface designs to support decision-making and situation awareness while controlling multiple advanced and legacy RPAs in a dynamic mission environment.  Perform initial evaluations of multi-transit control station interface technology to enable a single pilot to simultaneously control multiple RPAs transiting through airspace by using high-fidelity simulations.  Using high-fidelity simulations and flight tests, evaluate interfaces for a networked RPA collaborative environment to allow teams of pilot, sensor, and payload operators to work together during various RPA mission phases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.580"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.580"
                                            },
                                            "Text": {
                                                "val": "Foster advancements in the design, demonstration, and evaluation of novel airman interface designs that support decision-making and situation awareness while controlling multiple RPAs in a highly dynamic mission environment. Perform final evaluations of multi-transit control station interface technologies that will enable a single airman to simultaneously control multiple, heterogeneous RPAs transiting through airspace by using high-fidelity simulations and flight tests. Deliver mature prototype of RPA transit operations workstation. Enhance and evaluate initial designs of interfaces for a networked RPA collaborative environment to permit teams of pilot, sensor, and payload operators to collaborate for mission execution purposes, during various RPA mission phases in various threat environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}