{
    "id": "6e539eab66aad7a5bef3dbf7e214763e66530302",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603651M"
        },
        "ProgramElementTitle": {
            "val": "JT Non-Lethal Wpns Tech Dev"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "11.452"
            },
            "CurrentYear": {
                "val": "11.498"
            },
            "BudgetYearOne": {
                "val": "12.745"
            },
            "BudgetYearOneBase": {
                "val": "12.745"
            },
            "BudgetYearTwo": {
                "val": "13.117"
            },
            "BudgetYearThree": {
                "val": "13.448"
            },
            "BudgetYearFour": {
                "val": "13.387"
            },
            "BudgetYearFive": {
                "val": "13.387"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The DOD Non-Lethal Weapons Program was established by the Office of the Secretary of Defense, which designated the Commandant of the Marine Corps (CMC) as the DoD NLW Executive Agent (EA). The EA exercises centralized responsibility for joint research and development of non-lethal weapons and technology through the Joint Non-Lethal Weapons Program (JNLWP).  The Office of the Under Secretary of Defense for Acquisition, Technology and Logistics provides direct oversight of the JNLWP.\n\nThe efforts described in this Program Element (PE) reflect science and technology (S&T) investment decisions provided by the Joint Non-Lethal Weapons (NLW) Integrated Product Team, a multi-service flag level corporate board that provides executive oversight and management for the JNLWP for the CMC. This direction is based on the needs and capabilities of the Services, the Special Operations Command, and the Coast Guard, as identified in the DoD's Non-Lethal Weapons Joint Capabilities Based Assessment Document. This coordinated joint S&T development approach addresses mutual capability gaps and assures the best non-lethal technologies, capabilities and equipment are provided to the operating forces while eliminating duplicative service S&T investment. These advanced technology development initiatives feed non-lethal capabilities which directly support the three pillars of the 2014 Quadrennial Defense Review and comprise a fundamental part of DoD's security cooperation efforts to build partner capacity.  The resulting capabilities will facilitate a fully integrated non-lethal competency as a complement to lethal firepower, providing force application options for short-of-lethal scenarios.\n  \nThis program funds Advanced Technology Development of next-generation non-lethal capabilities and includes performing analysis, technology development efforts, and modeling and simulation necessary to ensure optimum weaponization and use of these capabilities.  Investment areas include research and development of next-generation NLWs such as: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal counter-personnel technologies (acoustic, optical, and human electro-muscular disruption technologies), and advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications). Next-generation non-lethal systems focus on long-range localized non-lethal effects to identified threat individuals (or groups of individuals) and\/or their threat weapons systems operating in complicated environments such as urban areas, crowds, buildings, vehicles, vessels, and also in close proximity to high-value civilian facilities. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.853"
                },
                "CurrentYear": {
                    "val": "11.506"
                },
                "BudgetYearOne": {
                    "val": "12.745"
                },
                "BudgetYearOneBase": {
                    "val": "12.745"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.452"
                },
                "CurrentYear": {
                    "val": "11.498"
                },
                "BudgetYearOne": {
                    "val": "12.745"
                },
                "BudgetYearOneBase": {
                    "val": "12.745"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.401"
                },
                "CurrentYear": {
                    "val": "-0.008"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.008"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.401"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3022"
                    },
                    "ProjectTitle": {
                        "val": "Joint Non Lethal Weapons"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "11.452"
                        },
                        "CurrentYear": {
                            "val": "11.498"
                        },
                        "BudgetYearOne": {
                            "val": "12.745"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.745"
                        },
                        "BudgetYearTwo": {
                            "val": "13.117"
                        },
                        "BudgetYearThree": {
                            "val": "13.448"
                        },
                        "BudgetYearFour": {
                            "val": "13.387"
                        },
                        "BudgetYearFive": {
                            "val": "13.387"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the research and development of next-generation NLWs and includes performing analysis, technical development efforts, and modeling and simulation necessary to ensure optimum weaponization and use of these NLWs.  Investment areas include research and development of next-generation NLWs such as: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal counter-personnel technologies (acoustic, optical, and human electro-muscular disruption technologies), and advanced non-lethal materiels (including materiels for vehicle\/vessel stopping and counter-facility applications). Next-generation NLW systems focus on long-range localized NL effects to identified threat individuals (or groups of individuals) and\/or their threat weapons systems operating in complicated environments such as urban areas, crowds, buildings, vehicles, vessels, and also in close proximity to high-value civilian facilities.\n\nThe FY2015 to FY2016 increase in funding in the Joint Non-Lethal Weapons Technology Development PE is due the initiation of  prototype development, demonstration, and transition to higher levels of technology development of the most promising candidate technologies addressing the extended range\/duration incapacitation capability gap."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JOINT NON-LETHAL WEAPONS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.452"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued effort to assess the general utility, effect, and effectiveness of technologies for incapacitating personnel, clearing facilities, stopping vehicles and vessels, and denying enemy access to protected areas.\n- Continued research to define and transition to higher levels of technology development the optimum approaches, technologies and tactics necessary to clear a facility\/building with and without entry.\n- Completed current modeling\/research to develop an understanding of the complex relationships between individual, group and crowd dynamics in order to predict the macro effects of NLWs. Specifically, investigated factors that cause crowds to move to violent behavior, and what non-lethal technologies will be effective in controlling or mitigating violent crowd behavior.\n- Completed effort to examine and optimize non-lethal effects and effectiveness of various non-lethal stimuli, to include light, acoustics, electrical, high power laser, high power microwave and active denial technology.  Continued NL human effects research to develop a suite of human effects models that can be used to predict effects, effectiveness, and risk of significant injury.\n- Continued prototype development and transition to higher levels of technology development of advanced payloads for candidate technological capabilities with applications relevant to emerging capability gaps.\n- Continued prototype development, demonstration, and transition to higher levels of technology development of the most promising candidate technologies addressing the extended range\/duration incapacitation capability gap.\n- Continued transition to higher levels of development and demonstration for the most promising candidate technologies employing multisensory stimuli.\n- Continued to address non-lethal counter-personnel capability gaps with alternative directed energy technologies.\n- Continued transition to higher levels of technology development and demonstrate the most promising directed energy technologies under consideration for counter-personnel and counter-materiel applications.\n- Continued technology development employing optimized electro-muscular disruption waveforms and mechanisms for an extended duration counter-personnel suppression capability.\n- Continued advanced prototype development and demonstration of a smaller, lighter active denial technology demonstrator based on most promising and mature 95 GHZ source technology.\n- Continued non-lethal effects characterization through modeling and effects testing for joint advanced technology development using HE-MAP.\n- Continued evaluation of alternative non-lethal prototype technologies offering operational utility and transition best candidates to higher levels of technology development and acquisition.\n- Completed prototype concepts for an integrated combined effects demonstration platform to provide scalable escalation of force capability using an integrated, systems of systems approach.\n- Initiated advanced system component research and development for integration into NLE systems (vehicle stopping, vessel stopping, and counter personnel systems)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.498"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from 2014, except those noted as completed.\n- Continue advanced prototype development and demonstration of a smaller, lighter active denial technology demonstrator based on the most promising and mature 95 GHz source technology.\n- Continue incorporation of suitable sensors capable of measuring NL stimuli into surrogate test models as part of the Human Effects Modeling Analysis Program (HEMAP).\n- Initiate modular prototyping of High Power Microwave (HPM) component hardware meeting development objectives for subsequent integration into an HPM-capable system configuration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.745"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.745"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from 2015, except those noted as completed.\n- Initiate prototype development, demonstration, and transition to higher levels of technology development of the most promising candidate technologies addressing the extended range\/duration incapacitation capability gap."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this Program Element is the development of technologies that lead to the next-generation of Non-Lethal Weapons which address identified and prioritized joint NLW capability gaps.  The program consists of a collection of projects for the development and evaluation of feasibility demonstration models.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include both the effectiveness of the technology, human effects and effectiveness, mitigation of high priority joint NLW capability gaps, and potential for compliance with policy and legislation.  Overarching considerations include the advancement of related Technology Readiness Levels and Human Effects Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                }
            ]
        }
    }
}