{
    "id": "6e63dd4f20ed6849385464744ee5eab019ef6009",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603788F"
        },
        "ProgramElementTitle": {
            "val": "Battlespace Knowledge Development and Demonstration"
        },
        "R1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "48.101"
            },
            "CurrentYear": {
                "val": "35.289"
            },
            "BudgetYearOne": {
                "val": "46.414"
            },
            "BudgetYearOneBase": {
                "val": "46.414"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "52.042"
            },
            "BudgetYearThree": {
                "val": "55.362"
            },
            "BudgetYearFour": {
                "val": "57.291"
            },
            "BudgetYearFive": {
                "val": "59.357"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates Air Force enterprise-centric information technologies for the warfighter. The Global Battlespace Awareness project develops, integrates, and demonstrates advanced technologies to achieve comprehensive net-centric operations and total battlespace awareness by using and exploiting information from all sources. The Assured Worldwide Connectivity project provides advanced net-enabled architectures and communications technologies in support of global military operations, including a secure information grid for worldwide information exchange of near-real-time multimedia (i.e., voice, data, video, and imagery) information. In addition, this project develops and demonstrates advanced optical networking and communications for Air Force air- and space-based information exchange on and between platforms. These optical networks will be rapidly deployable, mobile, interoperable, and seamless between Air and Space Operations Centers (AOCs) and air- and space- based platforms either en route or in theater. This project also provides tools and applications leading to the development and integration of cyber deterrence technologies resulting in a strategic capability of cyber dominance within the secure information grid. The Knowledge Management and Computing project develops the technology applications that will provide for a secure, tailored, seamless exchange of information among producers, consumers, and managers of information relevant to a particular community of interest (COI). The project also provides the development of interactive and real-time computing technologies that greatly improve the usability of high performance computing for the exchange, utilization, and management of information in the enterprise. The Anticipatory Operations Intent and Response project develops the technologies for dynamic planning and execution with the accuracy, fidelity, and timeliness needed to dominate the battlespace. This program has been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.079"
                },
                "CurrentYear": {
                    "val": "35.315"
                },
                "BudgetYearOne": {
                    "val": "44.531"
                },
                "BudgetYearOneBase": {
                    "val": "44.531"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.101"
                },
                "CurrentYear": {
                    "val": "35.289"
                },
                "BudgetYearOne": {
                    "val": "46.414"
                },
                "BudgetYearOneBase": {
                    "val": "46.414"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.978"
                },
                "CurrentYear": {
                    "val": "-0.026"
                },
                "BudgetYearOne": {
                    "val": "1.883"
                },
                "BudgetYearOneBase": {
                    "val": "1.883"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.026"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.449"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.427"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.883"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.883"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY16 is due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635319"
                    },
                    "ProjectTitle": {
                        "val": "Anticipatory OPS Intent and Response"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.997"
                        },
                        "CurrentYear": {
                            "val": "4.229"
                        },
                        "BudgetYearOne": {
                            "val": "3.661"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.661"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.128"
                        },
                        "BudgetYearThree": {
                            "val": "4.710"
                        },
                        "BudgetYearFour": {
                            "val": "6.144"
                        },
                        "BudgetYearFive": {
                            "val": "6.267"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In order to achieve information dominance, the Air Force must be able to monitor, assess, plan, and execute missions rapidly across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict (pre-conflict, conflict through stability operations). This project develops and integrates decision support technologies that will enhance the commander's ability to anticipate and dominate the future battlespace by more effectively forecasting the evolution of the battlespace and by more rapidly generating options to \"virtually checkmate\" the adversary. It develops the decision aid technologies and processes to plan the use of various assets and assess their effects in the battlespace. It provides a tailorable information environment to effectively portray complex data sets accurately in real-time."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Planning and Decision Tools"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate the integration of planning tools and information-based intelligent agents for adaptive replanning and decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.082"
                                            },
                                            "Text": {
                                                "val": "Developed integrated battle planning services across warfighting and security domains allowing geographically distributed decision makers to leverage the full spectrum of AF assets.   Developed air, space, and cyber constraint services enabling integration of federated and collaborative domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.548"
                                            },
                                            "Text": {
                                                "val": "Design and develop a set of planning tools and services that proactively build and shape the portion of cyberspace employed in support of mission assurance objectives. Develop a moving target defense (MTD) specification for integration into a Command and Control (C2) mission assurance framework. Continue development and experimentation of net-centric mission planning and execution concepts to provide a net-enabled dynamic decision support capability for a variety of air, space and cyber missions. Generate optimized means of synchronizing cross-domain effects while respecting hard and soft constraints within and across domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.257"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.257"
                                            },
                                            "Text": {
                                                "val": "Prototype mission assurance framework and integrated service oriented architecture for a set of planning tools and services that proactively build and shape the portion of cyberspace employed in support of mission assurance objectives. Demonstrate net-centric mission planning and execution concepts to support a net enabled dynamic decision support capability for a variety of air, space and cyber missions in support of combined, global operations. Validate ability to synchronize efforts across warfighting domains (air, space, cyber, land and maritime) to create desired effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Planning and Assessment Tools"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an effects-based approach for the next generation of planning and assessment techniques that enable decision makers to determine operational effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.915"
                                            },
                                            "Text": {
                                                "val": "Continued development of tools in machine learning to autonomously generate patterns of life in support of mission planning operations. Continued development of capabilities to rapidly and systematically decompose commander's intent into a set of measurable effects that result from actions taken in multiple domains (air, space, and cyber)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.681"
                                            },
                                            "Text": {
                                                "val": "Complete development of tools in machine learning for patterns of life generation. Demonstrate capabilities to rapidly and systematically decompose commander's intent into a set of measurable effects that result from actions taken in multiple domains (air, space, and cyber)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.404"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.404"
                                            },
                                            "Text": {
                                                "val": "Develop links and tools to effectively employ cyber, directed energy and electronic warfare weaponry within a target folder environment; providing a set of models that will give targeteers greater comprehension of the second and third order effects of targeting actions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635320"
                    },
                    "ProjectTitle": {
                        "val": "Assured Worldwide Connectivity"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.296"
                        },
                        "CurrentYear": {
                            "val": "19.397"
                        },
                        "BudgetYearOne": {
                            "val": "25.310"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.310"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "27.738"
                        },
                        "BudgetYearThree": {
                            "val": "34.024"
                        },
                        "BudgetYearFour": {
                            "val": "31.226"
                        },
                        "BudgetYearFive": {
                            "val": "32.773"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires advanced net-enabled architectures and communications technologies in support of global kinetic and non-kinetic military operations including a secure information grid for worldwide information delivery and exchange of near-real-time information including voice, data, video, and imagery.  This secure environment will be rapidly deployable, mobile, interoperable, and seamless between AOC and aircraft, either en route or in theater.  This project provides secure information transmission capabilities for a persistent, global, survivable communications backbone network accessible for warfighters operating in all domains. It provides self-healing, self-configuration, anti-jam communication networking capabilities, and provides enterprise networking capabilities for agile, policy-based network management.  In addition, this project develops and demonstrates flight ready systems consisting of high capacity radio frequency (RF) and optical components and architectures for next generation communications.  The Air Force also requires the ability to deliver sovereign options in cyberspace through the development and integration of cyber attack, cyber defense, and cyber support technologies for a strategic capability of cyber dominance.  This project develops the ability to deliver cyber attack capabilities (access, stealth and persistence, cyber intelligence, and weapons delivery), cyber defense capabilities (attack detection, attack attribution, and response automation), and cyber support capability (situational awareness and war gaming.)"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Offense"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate offensive cyber operations capabilities in a series of experimental technology demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.019"
                                            },
                                            "Text": {
                                                "val": "Initiated research to characterize emerging cyber environments to enable more proficient cyber operations. Continued enhancement of the Cyber Experimentation Environment (including extending its reach to the Stockbridge remote test range) to enable early trials of emerging technologies in realistic, large scale, contested environments. Initiated work on next generation of distributive and disruptive cyber technologies capable of achieving non-kinetic military objectives. Transitioned software to provide new capabilities to Big Safari program office (details classified). Developed Service oriented architecture (SOA) components for the Cyber Mission Framework to enable cross-service tool operation, mission reporting, and cyber use control constructs.  Initiated red-teaming analysis of this framework. Developed advanced space situational awareness signal processor which captured new targets that had never before been.  Researched, developed and tested Cyber Filter tool for high value target data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Text": {
                                                "val": "Continue development and delivery of a capability which processes available cyber observables to deliver operational preparation of the environment information vital to the warfighter.  Develop highly configurable cyber simulation environment which produces high fidelity cyber telemetry for analysis. Continue to assess military objectives for places were non-kinetic solutions can aid kinetic missions and enhance technologies for military relevant environments. Develop technologies to remain current with new waveforms and signals (details classified)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.543"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.543"
                                            },
                                            "Text": {
                                                "val": "Merge next generation cyber operations technologies with other relevant military programs and demonstrate enhanced capabilities that allow non-kinetic capabilities to aid kinetic missions. Develop technologies to remain current with new waveforms and signals (details classified). Continue SOA component development for use in the Air Force Lifecycle Management Center (AFLCMC) Cyber Mission Platform (CMP)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Connectivity Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate intelligent networking transport and management technology to provide assured, seamless, battlespace connectivity to the Air Force tailored to anti-access\/area denial environments and contested operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.635"
                                            },
                                            "Text": {
                                                "val": "Completed initial development of a network level encryptor\/Traffic Aware router to allow enclaves at different security levels to share common network.  Performed a technology assessment for Software Defined Networking and its applicability to the Aerial Layer. Developed a capability to effectively implement cross-layer protocol including efficient and robust routing capabilities. Conducted Triple Target Terminator (T3) Test with a live flight of the T3 system on live missiles. Conducted dynamic proxy radio test between Rome NY and Stockbridge NY."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.742"
                                            },
                                            "Text": {
                                                "val": "Continue development of a network level encryptor\/Traffic Aware router to allow enclaves  at different security levels to share common network. Demonstrate interference-tolerant waveform design, dissemination and utility on portable radio platform. Develop decentralized control algorithms and protocols for radio networks that optimally allocate resources from the bottom to higher layers of the protocol stack. Continue development of key technologies to be demonstrated in laboratory on software definable radio testbed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.415"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.415"
                                            },
                                            "Text": {
                                                "val": "Continue development of a network level encryptor\/Traffic Aware router to allow enclaves at different security levels to share common network. Continue research to push limits of technologies that improve the AF's Aerial Layer Networks. Develop optimal universal waveform sets for multipath multi-access communications. Initiate the integration, test\/evaluation and demonstration of an integrated version of the capabilities developed under this program. Perform an advanced technology demonstration of key technologies on tactical software radios."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resiliency"
                                    },
                                    "Description": {
                                        "val": "Integrate and demonstrate a resilient and self-regenerating information enterprise that dynamically recognizes, characterizes, and understands novel cyber attacks and reconfigures and self-optimizes to resist new attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.524"
                                            },
                                            "Text": {
                                                "val": "Extended IP hopping technology from IPv4 to IPv6, and enhanced with situational awareness sensor feed and interface with cyber C2 system. Extended configuration-based agility\/moving target capability extended from centralized to decentralized architecture, and added support for IPv6, Juniper devices in addition to Cisco, IP hopping control, limited quality of service (QoS), firewall verification, and improved resiliency. Extended polymorphic enclave technology from hypervisor-based host installation to external in-line device and added management console and improved policy flexibility, and gateway capability for access outside of the polymorphic network. Updated laboratory environment for demonstration and evaluation of Mission-Aware Cyber Command and Control(MACC2) integration, to include upgrading hardware and virtual machines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.011"
                                            },
                                            "Text": {
                                                "val": "Continue the enhancement, maturation, testing, and demonstration of cyber agility technologies through exercises and other user-focused venues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.247"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.247"
                                            },
                                            "Text": {
                                                "val": "Prototype demonstration deception capability to provide confusion to attacker. Complete high-speed IP hopping gateway. Continue automated tool for generation, verification, and deployment of secure system\/network configurations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Effects-based Cyber Defense"
                                    },
                                    "Description": {
                                        "val": "Integrate technology to demonstrate an effects-based strategic approach to cyber defense that focuses on avoiding, deterring, and minimizing the threat, and rendering the adversary ineffective."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.179"
                                            },
                                            "Text": {
                                                "val": "Developed SecureServe Beta software to securely consolidate multiple information domains on a single server using virtualization. Developed capability for self-regenerative code and demonstrated for PACOM with the result being a request to integrate this capability into GLobal Command and Control System (GCCS). Prototyped survivability architecture for continuous mission oriented assessment and management that is planned to be validated at Eglin Air Force Base's simulated Air Operations Center (AOC) environment. Initiated a new research direction focused on survivability in cyberspace using diverse replicas and game theory. Demonstrated active steganalysis functionality leading to insertion into software system that has passed acceptance testing and is now fielded and operational."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.344"
                                            },
                                            "Text": {
                                                "val": "Continue development and performance analysis of new enhancement for insertion into active steganalysis product."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.105"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.105"
                                            },
                                            "Text": {
                                                "val": "Complete development and demonstrate new enhancements into the active steganalysis product. Initiate research into novel resiliency technologies as a packaged adaptive systems solution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Airborne Communication Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate flight ready systems consisting of high capacity RF and optical components and architectures for next generation communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.939"
                                            },
                                            "Text": {
                                                "val": "Developed quantum key distribution sources and accurately measured the quantum states; conducted analysis and plans for performing site diversity radiometric testing for two sites with varying distances between the sites; continued effort in V\/W-band SATCOM technology includes the modeling effort for propagation characterization and the development of the W-band Traveling Wave Tube amplifier."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort terminated due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635321"
                    },
                    "ProjectTitle": {
                        "val": "Global Battlespace Awareness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.669"
                        },
                        "CurrentYear": {
                            "val": "7.953"
                        },
                        "BudgetYearOne": {
                            "val": "12.214"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.214"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.425"
                        },
                        "BudgetYearThree": {
                            "val": "12.739"
                        },
                        "BudgetYearFour": {
                            "val": "14.638"
                        },
                        "BudgetYearFive": {
                            "val": "14.929"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force must be able to process and exploit data and information from a variety of sources and domains to create a common operating picture of the battlespace to allow commanders to maintain information dominance.  This project develops, integrates, and demonstrates advanced technologies to achieve comprehensive net-centric operations and Predictive Battlespace Awareness using information from all sources.  Technology development includes:  tasking information collectors, such as intelligence, surveillance, and reconnaissance (ISR) platforms, national intelligence sources, etc; correlating and geo-registering the collected data; exploiting the data to extract information of military significance; fusing information from multiple sources to create a digital-and-dimensional representation of the battlespace; assessing the situation; predicting adversary COA; and archiving the results for ready use by decision-makers.  This is a dynamic, complex process that involves technologies for information exploitation, fusion, processing, storage, and retrieval, as well as technologies for machine reasoning, pattern recognition, and timeline analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Signal and Data Exploitation Technologies"
                                    },
                                    "Description": {
                                        "val": "Demonstrate advanced signal and data exploitation technologies for detection, tracking, identification, and targeting of time-critical targets, and information extraction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.082"
                                            },
                                            "Text": {
                                                "val": "Developed imagery intelligence (IMINT) exploitation and text-data extraction fusion techniques. Continued development of applications to augment existing manual, human intensive and error-prone processing, exploitation, and dissemination (PED) processes. Demonstrated active steganalysis functionality leading to insertion into software system that has passed acceptance testing and is now fielded and operational. Continued development of techniques for the collection and analysis of non-communication emitters, primarily radar and radar jammer signals, to parameterize, classify, and geolocate the system. Continued development of technology that will work on short segment lengths, multiple languages, hostile\/noisy signal environment enabling a time-critical response. Continued development of technologies to provide access, exploitation, and effects to communications and networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.284"
                                            },
                                            "Text": {
                                                "val": "Develop technologies to enhance ELINT detection and processing capabilities against emerging emitter weapon systems. Explore SIGINT, COMINT and other INTs signal exploitation for contested environments. Continue to develop speech processing algorithms will be investigated to improve feature extraction techniques, speed and efficiency of training\/testing algorithms, and classifiers that aid in improvements to component technologies.  Develop and perform an analysis of new enhancement for insertion into active steganalysis product. Develop technologies to remain current with new waveforms and signals. Research and development of full motion video object of interest signature detection and exploitation algorithms. Continue development of Multi-INT correlation approaches. Investigate and develop techniques to improve the motion imagery capabilities. Continue to develop automated capabilities to exploit signals of interest."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.503"
                                            },
                                            "Text": {
                                                "val": "Refine and test technologies to enhance ELINT detection and processing capabilities against emerging emitter weapon systems. Develop strategies for multi-INT exploitation. Investigate algorithms that can improve upon the audio prioritization capabilities, improvements to detection and correction methods, and mitigation techniques for modeling differences. Complete new enhancements and insertion into active steganalysis product. Develop technologies to remain current with new waveforms and signals. Integrate full motion video object of interest detection and exploitation algorithms with multi-INT correlation algorithms and demonstrate capability. Integrate enhanced motion imagery capabilities with existing imagery exploitation tools. Continue to develop automated capabilities to exploit signals of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Data Handling, Visualization and Distributed Data Fusion"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced data handling, event visualization technologies, and distributed data fusion to enable a more effective utilization of data available."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.134"
                                            },
                                            "Text": {
                                                "val": "Developed scalable pattern mining analytics for Multi-INT data (static and streaming).  Architected and developed prototype enhancements to the Web Enabled Temporal Analysis System Enterprise with scalable storage for Activity Based Intelligence. Completed enhancements to the existing Pattern Learning software to increase the utility of the current software baseline for multi-INT analysts across multiple Air Force applications. Transitioned STARGate multi-mission sensor metadata management system and Knowledge Association SIGINT Toolkit to BIG SAFARI and 55th Wing.  Analyzed performance of Level Zero fusion algorithms with both simulated and recorded data.  Performance indicates the benefit of Level Zero Fusion.  Developed computational and bandwidth requirements for developed algorithms. Provided a web service that supports the mission and PED management of all AF RPA missions.  Provided automatic optimization of a tracker against multiple sensor sources. Completed secure MLS video streaming effort for transition to ISSE Guard PMO."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.354"
                                            },
                                            "Text": {
                                                "val": "Continue analysis of recorded multi-intelligence test data with developed algorithms.  Apply object based processing and activity based intelligence tradecraft to selected domains and intelligence problems. Develop approaches of filtering multi-intelligence data for ingestion into machine learning approaches for the purpose of event discovery. Mature capabilities to provide graph-based approaches for handling large and complex relationships observed across various sources. Deliver automatic optimization of tracking algorithms across sensors, modes, and regions. Migrate tools and data to distributed (cloud) computing to extract additional performance gains. Complete an improved cross domain solution independent file filtering capability within Cross Domain Solution (CDS) systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.092"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.092"
                                            },
                                            "Text": {
                                                "val": "Continue to apply object based processing and activity based intelligence tradecraft to selected domains and intelligence problems. Provide advanced activity-based intelligence (ABI) tools with built-in optimization tailored against operator objectives transitioning to National Air and Space Intelligence Center (NASIC) and National Geospatial-Intelligence Agency (NGA). Continue to develop, demonstrate, and transition technology solutions for automated recognition of indicators to associate potential and emerging threats against Blue assets. Continue to develop computational capabilities that automate the decision-making process that encompasses sensing, data mining and analysis, information extraction and understanding, and activity recognition. Continue to develop technologies to create activity based intelligence from motion data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Text Exploitation"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate capabilities for reasoning and learning, text understanding, link and group discovery, and advanced analysis for situational awareness and understanding."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.588"
                                            },
                                            "Text": {
                                                "val": "Delivered techniques to analyze evolving social networks.  Developed plug and play framework for dynamic social network analysis, pattern discovery and social media analysis.  Continue to developed Text Exploitation transition platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.178"
                                            },
                                            "Text": {
                                                "val": "Continue to develop cross-document co-reference capability integrated into document processing pipeline. Continue to develop web-based Text Exploitation and Analysis framework."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.724"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.724"
                                            },
                                            "Text": {
                                                "val": "Continue to develop cross-document co-reference capability integrated into document processing pipeline. Continue to develop web-based Text Exploitation and Analysis framework.  Initiate research and development for plug and play modules for deeper text understanding and large scale, time dependent, network based analytics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adversary Courses of Action"
                                    },
                                    "Description": {
                                        "val": "Develop models to provide detailed understanding of the adversary's probable intent and future strategy to identify adversary COAs, the most likely COA, and the COA most dangerous to friendly forces and mission accomplishment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.865"
                                            },
                                            "Text": {
                                                "val": "Continued to develop links and tools to effectively employ cyber, directed energy and electronic warfare weaponry within a target folder environment; developing a set of models that will give targeteers greater comprehension of the second and third order effects of targeting actions.\nContinued development of a functional graphical user environment to support output analysis and complete investigations in developing screening techniques that give the analyst\/decision-maker insight into the contribution or sensitivity of various factors on a given observable\/response Initiated development of technologies that identify causal linkages of executing mission results to achievement of effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.137"
                                            },
                                            "Text": {
                                                "val": "Continue development of a demonstration of advanced analytical capabilities that integrate kinetic and non-kinetic options for full spectrum targeting. Initiate the development of assessment tools that assist the analyst\/operator in determining the success\/failure of a given target set and\/or plan in meeting a stated set of mission objectives. Continue to add targeting capabilities to increase the full range of options available."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.895"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.895"
                                            },
                                            "Text": {
                                                "val": "Continue to develop links and tools to effectively employ cyber, directed energy and electronic warfare weaponry within a target folder environment; developing a set of models that will give targeteers greater comprehension of the second and third order effects of targeting actions. Continue development of a demonstration of advanced analytical capabilities that integrate kinetic and non-kinetic options for full spectrum targeting. Continue the development of tools that assist the analyst\/operator in determining the success\/failure of a given target set and\/or plan in meeting a stated set of mission objectives. Continue to add targeting capabilities to increase the full range of options available."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635322"
                    },
                    "ProjectTitle": {
                        "val": "Knowledge Management and Computing"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.139"
                        },
                        "CurrentYear": {
                            "val": "3.710"
                        },
                        "BudgetYearOne": {
                            "val": "5.229"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.229"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.751"
                        },
                        "BudgetYearThree": {
                            "val": "3.889"
                        },
                        "BudgetYearFour": {
                            "val": "5.283"
                        },
                        "BudgetYearFive": {
                            "val": "5.388"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies that will provide the decision maker and staff with seamless access to tailored information within a mobile, dynamic, and scalable, globally distributed AOC, as well as among other producers, consumers, and managers of information relevant to other particular communities of interest (COI).  This project demonstrates the enterprise management capabilities needed for the rapid distribution of actionable information, as well as the needed advances in high performance computing to ensure this complex capability.  This project develops an agile information environment that focuses on quality of service, transformation and brokering, a federated information environment focusing the relationship among the members of the environment, a secure cross-domain information sharing capability that focuses on the security layer and inter-COI information exchange in different security domains, and a collaboration environment focusing on the information workflow layer of the enterprise.  This project will also develop:  1) a computational science and engineering capability demonstrating new models of computation; 2) novel approaches for high performance, interactive, net-centric, distributed, and embedded computing systems; and 3) the technological tools enabling affordable, large-scale, complex, software intensive systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Game Changing Computing Power"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate computer architectures with greater capacity and sophistication to enable game changing computing power to the warfighter, anywhere, anytime."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.124"
                                            },
                                            "Text": {
                                                "val": "Demonstrated the stacking of logic chips on other logic chips while using standard processor fabrication lines. Developed computational models\/approaches for increased system processing efficiency and increased on-board, improved photon sources and new approaches to coupling\/processing qubits. Demonstrated a secure processor that provides a foundation for a trusted computing system by using hardware techniques and features, such as remappable opcodes, encryption and authentication to drastically reduce major vulnerabilities.  Demonstrated increased levels of mission assurance in critical network centric operations by using advanced information management concepts with a hardware root of trust designed to support communication by means of managed information objects (MIO) and a minimal set of standard protocols to maintain interoperability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.924"
                                            },
                                            "Text": {
                                                "val": "Continue the design, development and demonstration of affordable, high performance, interactive, parallel data exploitation and massively parallel systems. Develop and demonstrate embedded high performance computing systems and integrate bio-inspired embedded computing hardware that delivers a set of autonomous sensing capabilities for Air Force ISR missions in the contested and anti-access\/area denial (A2\/AD) environments. Initiate development of trusted resilient legacy systems that can continuously and simultaneously assess and reestablish warfighter trust as the resilient system dynamically responds to fight through failures and attacks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.695"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.695"
                                            },
                                            "Text": {
                                                "val": "Continue the design, development and demonstration of affordable, high performance, interactive, parallel data exploitation and massively parallel systems. Develop and demonstrate embedded high performance computing systems and integrate bio-inspired embedded computing hardware that delivers a set of autonomous sensing capabilities for Air Force ISR missions in the contested and A2\/AD environments. Continue development of capabilities to simultaneously assess, maintain or reestablish trust as resiliency actions respond to failures and\/or attacks. Continue development of new approaches to building trusted and resilient systems. Demonstrate trusted and resilient systems in a realistic operational environment. Initiate the development of technologies for neuromorphic co-processing, memristive technologies for use in reducing the size weight and power of conventional processing while providing intrinsic, hardware based cyber security features for encryption, anti-tamper and unique identification, algorithm and system operation control for continuous, dynamic autonomous operations and the development of a processor to achieve universal quantum computation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Information Management"
                                    },
                                    "Description": {
                                        "val": "Demonstrate how a publish, subscribe, and query information management (IM) paradigm can enable vertical and horizontal integration of Air Force information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.695"
                                            },
                                            "Text": {
                                                "val": "Successfully demonstrated a point-to-point multiple levels of security (MLS) secure VTC capability at 2014 joint exercise experiment. Completed the multi-point VTC capability and is transitioning full cross-domain video teleconferencing (CD-VTC) capability to certification and accreditation and fielding to EUCOM and CENTCOM."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.980"
                                            },
                                            "Text": {
                                                "val": "Develop and deliver a suite of new collaboration capabilities for US and Coalition Multiple Levels of Security (MLS) environments  producing four new cross-domain collaboration tools in: Voice over IP (VoIP) \/ Video Teleconferencing; Secure Full Motion Video (FMV) streaming; Automated & resilient data content inspection; Global trusted remote monitoring & management. Initiate the development of information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared situational awareness (SA) across the theater of war for targeting and force protection operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.534"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, demonstrate and transition information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared Situational Awareness (SA) across the theater of war for targeting and force protection operations. Continue the development of information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared situational awareness (SA) across the theater of war for targeting and force protection operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Agile Information Management Services"
                                    },
                                    "Description": {
                                        "val": "Demonstrate how agile information management services enable effective information sharing in a tactical environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.320"
                                            },
                                            "Text": {
                                                "val": "Continued development of information management services embedded with the sensor that will boost the effective communication bandwidth available to tactical users and link pilots, remotely piloted aircraft and ground assets in the field. Completed research to develop and demonstrate resource-aware information management services that are responsive to the information needs of active missions by ensuring delivery of the most relevant, high priority information to the warfighter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.806"
                                            },
                                            "Text": {
                                                "val": "Complete development of information management services embedded with the sensor that will boost the effective communication bandwidth available to tactical users and link pilots, remotely piloted aircraft and ground assets in the field."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort terminated due to higher Department of Defense priorities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}