{
    "id": "89b13b1e892c39eca776962e0fbc55d55a1e5abd",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604746A"
        },
        "ProgramElementTitle": {
            "val": "Automatic Test Equipment Development"
        },
        "R1LineNumber": {
            "val": "94"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.498"
            },
            "CurrentYear": {
                "val": "11.079"
            },
            "BudgetYearOne": {
                "val": "8.960"
            },
            "BudgetYearOneBase": {
                "val": "8.960"
            },
            "BudgetYearTwo": {
                "val": "11.014"
            },
            "BudgetYearThree": {
                "val": "10.740"
            },
            "BudgetYearFour": {
                "val": "10.227"
            },
            "BudgetYearFive": {
                "val": "10.127"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2016, $5.222 million reduction to support higher priority projects"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides for development and testing of general-purpose test equipment, state-of-the-art diagnostics and prognostics technologies, and software and systems to support the increasingly complex electronic components of the Army's new and upgraded weapon systems.  It focuses on implementation of commercial test and diagnostic technologies across multiple weapon platforms to minimize the cost of troubleshooting and maintenance of Army equipment in the field.  \n\nModular, reconfigurable automatic and semi-automatic systems are being developed under this program to satisfy weapon system test and diagnostics requirements.  The Next Generation Automatic Test System (NGATS), currently under development, provides state-of-the-art test and diagnostic capabilities to support current and future weapon systems.  It is the platform for transitioning Agile Rapid Global Combat Support System (ARGCS) technologies into the Army weapon system support structure, and it will replace several aging automatic test systems (ATS) that are becoming prohibitively expensive to operate and maintain.  \n\nThis PE also provides for continued development and improvement of general-purpose test equipment and calibration standards with emphasis on the incorporation of digital electronics and tailoring of configurations to improve deployability, mobility and survivability of the support equipment. \n\nFY 2016 Base funding for this program continues development of the Army's standard NGATS which will improve deployability and mobility of test and diagnostic equipment.  The NGATS provides state-of-the-art test and diagnostic capabilities and a means for reducing the Army's test equipment operating and support costs and the costs for supporting a number of the Army's vital warfighting systems.  The FY 2016 funding will develop or significantly modify test equipment to satisfy modular force and homeland security support requirements that cannot be accommodated with test equipment currently available in the commercial marketplace such as radio frequency (RF) and electro-optic (EO) testing capability.  It will also provide for technology enhancements to the Army's standard at-system tester to meet test and diagnostoic requirements of the supported weapon systems, develop\/redesign test program sets and hardware for support of legacy and emerging weapon systems, and develop a network centric software framework for NGATS.\n\nThe FY 2016 funding request was reduced for $2.002 million to account for the availability of prior year execution balances."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.697"
                },
                "CurrentYear": {
                    "val": "11.084"
                },
                "BudgetYearOne": {
                    "val": "14.182"
                },
                "BudgetYearOneBase": {
                    "val": "14.182"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.498"
                },
                "CurrentYear": {
                    "val": "11.079"
                },
                "BudgetYearOne": {
                    "val": "8.960"
                },
                "BudgetYearOneBase": {
                    "val": "8.960"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.199"
                },
                "CurrentYear": {
                    "val": "-0.005"
                },
                "BudgetYearOne": {
                    "val": "-5.222"
                },
                "BudgetYearOneBase": {
                    "val": "-5.222"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.199"
                    },
                    "CurrentYear": {
                        "val": "-0.005"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-5.222"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.222"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "L59"
                    },
                    "ProjectTitle": {
                        "val": "Diagnost\/Expert Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.548"
                        },
                        "CurrentYear": {
                            "val": "7.072"
                        },
                        "BudgetYearOne": {
                            "val": "4.699"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.699"
                        },
                        "BudgetYearTwo": {
                            "val": "7.304"
                        },
                        "BudgetYearThree": {
                            "val": "6.626"
                        },
                        "BudgetYearFour": {
                            "val": "5.894"
                        },
                        "BudgetYearFive": {
                            "val": "5.958"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds development of and system enhancements for the Next Generation Automatic Test System (NGATS) and the Maintenance Support Device (MSD).  The NGATS is a general-purpose automatic test system (ATS) that provides test and diagnostic capabilities required to support current and future weapons and combat support systems and will facilitate retirement of aging and obsolete test equipment that is imposing increasing logistics and operations and support cost burdens.  It is the platform for transitioning Agile Rapid Global Combat Support System (ARGCS) technologies into the Army weapon system support structure.  The ARGCS initiative was sponsored by the Department of Defense, and all Services are expected to transition demonstrated technologies into their ATS programs.  The MSD is the Army's standard at-system tester and requires continuing upgrades to support technology advancements in the supported weapon systems.  This project funds development projects to incorporate the most current relevant technology into the next generation MSD, supports capability enhancement of the wireless at-platform test set (WATS), develops capabilities to minimize or eliminate Army dependency on expensive proprietary software to support tactical vehicles, integrates MSD into the Brigade Combat Team information structure as the at-platform data collection device for the Army's condition-based maintenance plus (CBM+) initiative and maintains compatibility with emerging aviation platform hardware bus technology and aviation notebook software interface requirements.  This project also provides for continuing efforts in the development and testing of common procedures utilizing existing test program sets and software applications; and market surveys of commercially available test equipment, methods and procedures to determine applicability to Army requirements.  The test and diagnostic systems and procedures developed under this project are essential for ensuring the operational readiness, accuracy and effectiveness of the Army's warfighting systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NGATS System Level Calibration\/Verification Program"
                                    },
                                    "Description": {
                                        "val": "Develop and test the NGATS system level calibration\/verification program"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Develop and test the NGATS system level calibration\/verification program"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of the NGATS system level calibration\/verification program"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Logistics Support Products"
                                    },
                                    "Description": {
                                        "val": "Develop NGATS initial logistics support products (including provisioning, technical manuals and calibration)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Continue development of initial logistics support products."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Continue development of initial logistics support products."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Complete development of initial logistics support products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Developmental and Operational Follow-on Testing"
                                    },
                                    "Description": {
                                        "val": "Complete Increment 1 developmental and operational follow-on testing activities"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Complete Increment 1 developmental and operational follow-on testing activities to include assessment\/verification of the development of remaining, needed capability of existing low-rate initial production systems to operate with all existing test program sets used with legacy automatic test equipment, along with any necessary follow-on system testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Radio Frequency (RF) Test Capability"
                                    },
                                    "Description": {
                                        "val": "Develop and integrate NGATS RF test capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Initiate development and integration of NGATS RF test capability"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue development and integration of NGATS RF test capability"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue development and integration of NGATS RF test capability"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Increment 2"
                                    },
                                    "Description": {
                                        "val": "Develop and test hardware and software for NGATS Increment 2 system"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.868"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for support of Increment 2 systems (Avenger, Multiple Launch Rocket System, TOW Missile System, Paladin and CROWS II)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for support of Increment 2 systems (Avenger, Multiple Launch Rocket System, TOW Missile System, Paladin and CROWS II)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.885"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.885"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for support of Increment 2 systems (Stryker, Common Remotely Operated Weapons Station (CROWS II), Counter RCIED (Radio-Controlled Improvised Explosive Device) Electronic Warfare (CREW) Duke, Precision Fires, and Joint Assault Bridge (JAB)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Electro-Optics Subsystem"
                                    },
                                    "Description": {
                                        "val": "Develop and test hardware and software for NGATS electro-optics (EO) subsystem (to include the capability to support new ground and aerial sensors for unmanned air and ground vehicles)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for NGATS EO subsystem and for support of Increment 3 systems (Apache, Kiowa Warrior, CROWS II and Stryker Remote Weapons Station)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for NGATS EO subsystem and for support of Increment 3 systems (Apache, Kiowa Warrior, CROWS II and Stryker Remote Weapons Station)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for NGATS EO subsystem and for support of Increment 3 systems (Apache, Kiowa Warrior, CROWS II and Stryker Remote Weapons Station)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additional Software Capabilities"
                                    },
                                    "Description": {
                                        "val": "Develop software capabilities to incorporate common logistics operating environment (CLOE)\/netcentric and embedded diagnostics data collection and analysis for closed loop diagnostic maintenance in support of condition-based maintenance"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Continue development of expanded software capabilities"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Continue development of a network centric software framework to facilitate message communication, configuration status accounting, and data exchange with other components of the global information grid (GIG)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Continue development of a network centric software framework to facilitate message communication, configuration status accounting, and data exchange with other components of the global information grid (GIG)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Weight Enhancements"
                                    },
                                    "Description": {
                                        "val": "Develop power and weight enhancements for NGATS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.030"
                                            },
                                            "Text": {
                                                "val": "Complete development of power and weight enhancements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Performance Enhancement"
                                    },
                                    "Description": {
                                        "val": "NGATS core instrument\/software modifications to increase NGATS performance."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.217"
                                            },
                                            "Text": {
                                                "val": "Initiate development of NGATS core instrument\/software modifications to increase NGATS performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Continue development of NGATS core instrument\/software modifications to increase NGATS performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MSD Technology Enhancements"
                                    },
                                    "Description": {
                                        "val": "Incorporate current relevant technology into the next-generation MSD and support capability enhacement of the wireless at-platform test set (WATS).  Develop capabilities to minimize or eliminate Army dependency on proprietary software to support tactical vehicles, integrate MSD into the Brigade Combat Team information structure as the at-platform data collection device for the Army's CBM+ initiative, and maintain compatibility with emerging aviation platform hardware bus technology and aviation notebook software interface requirements."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.805"
                                            },
                                            "Text": {
                                                "val": "Continue enhancement of WATS radio technology and common electronics package augmentation to provide at-platform wireless test support for Army vehicle and weapon systems platforms to include CBM+.  Devise methods to minimize or eliminate Army dependency on proprietary software to support current and future tactical vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.864"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.864"
                                            },
                                            "Text": {
                                                "val": "Complete enhancement of WATS radio technology and common electronics package augmentation to provide at-platform wireless test support for Army vehicle and weapon systems platforms to include CBM+.  Devise methods to minimize or eliminate Army dependency on proprietary software to support current and future tactical vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Smart TPSs\/Enhanced Self Test"
                                    },
                                    "Description": {
                                        "val": "Develop enhanced smart TPS hardware and software and enhanced self test"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Initiate development of enhanced self test strategy for NGATS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Abrams\/Bradley Test Program Set (TPS) Design"
                                    },
                                    "Description": {
                                        "val": "Design, test and evaluate Abrams\/Bradley TPSs"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Complete design, test and evaluation of Abrams\/Bradley TPSs"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Abrams\/Bradley EO TPS Development"
                                    },
                                    "Description": {
                                        "val": "Develop Abrams\/Bradley TPSs for use with NGATS EO asset"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Continue development of Abrams\/Bradley TPSs"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EO TPS Development"
                                    },
                                    "Description": {
                                        "val": "Develop EO TPSs for use with NGATS EO asset"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Initiate development of TPSs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "."
                                    },
                                    "Title": {
                                        "val": "OPA3, SSN MB4000, Integrated Family of Test Equipment (IFTE)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "42.460"
                                        },
                                        "CurrentYear": {
                                            "val": "37.482"
                                        },
                                        "BudgetYearOne": {
                                            "val": "34.487"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "34.487"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "30.511"
                                        },
                                        "BudgetYearThree": {
                                            "val": "27.254"
                                        },
                                        "BudgetYearFour": {
                                            "val": "26.981"
                                        },
                                        "BudgetYearFive": {
                                            "val": "27.540"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "None."
                        },
                        "AcquisitionStrategy": {
                            "val": "This developmental project consists of organic and contractual actions.  When the necessary expertise and capability are available within the Department of Defense, services required for the individual development projects are ordered from the government source; otherwise, commercial contracts are used.  Equipment required for developmental projects is obtained by contract from the commercial supplier.  Developmental efforts for the Next Generation Automatic Test System (NGATS) are being completed under a number of contracts awarded to the prime contractor for the Integrated Family of Test Equipment off-platform testers and other contractors with automatic test equipment (ATE) and test program set development capabilities.  Full-rate production of the system was a competitive award.  NGATS is following an evolutionary acquisition strategy using incremental development to satisfy Army depot and field testing requirements for new and existing systems.  It will replace existing legacy Army ATE (i.e., Base Shop Test Facility (BSTF)(V)3, BSTF(V)5, and Direct Support Electrical System Test Set) as well as Army depot system-specific ATE."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development\/ Verification\/Validation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "32.360"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.343"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.200"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.101"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.101"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hardware\/Support Items Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "58.884"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.368"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.822"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.591"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.591"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "47.891"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.637"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.850"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.657"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.657"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Direct"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.590"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Test program set (TPS) and contractor developmental test and evalutation are included in the product development cost."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.046"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76651-57.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Production for First Article"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Testing (Increment 1 Follow-On DT\/OT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Materiel Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "First Unit Equipped"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Rate Production Decision Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Full-Rate Production (Increment 1)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS System Development and Demonstration (SDD) (Increment 2)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Testing (Increment 2)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS SDD (EO & RF Subsystems)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Testing (EO & RF Subsystems)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NGATS Product Improvements - Netcentric"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "New Systems Test Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MSD Technology Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L65"
                    },
                    "ProjectTitle": {
                        "val": "Test Equipment Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.950"
                        },
                        "CurrentYear": {
                            "val": "4.007"
                        },
                        "BudgetYearOne": {
                            "val": "4.261"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.261"
                        },
                        "BudgetYearTwo": {
                            "val": "3.710"
                        },
                        "BudgetYearThree": {
                            "val": "4.114"
                        },
                        "BudgetYearFour": {
                            "val": "4.333"
                        },
                        "BudgetYearFive": {
                            "val": "4.169"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports development and demonstration of state-of-the-art calibration standards and techniques, and upgrades\/improvements to existing Army calibration systems.  It provides for feasibility studies, market research, inventory analyses, bid sample testing, and prototyping to support calibration systems and general-purpose test and diagnostic equipment acquisitions.  Primary efforts under this project include development of calibration software, development of calibration capability for chemical and biological agent detection systems, improvement of test and measurement equipment performance envelopes via product improvements, and development\/evaluation of advance technology and higher reliability calibration systems and general-purpose test, measurement and diagnostic equipment (TMDE).  Product improvements are underway to current test and measurement systems to overcome deficiencies and voids in existing organic capabilities and to ensure the operational readiness, accuracy, effectiveness, and safety of Army weapons and combat support systems.  These improvements will employ reconfigurable open electronics architecture and computer-based instrumentation wherever feasible and will be focused on reducing the test equipment footprints to improve deployability and mobility in areas of operation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Calibration Sets (CALSETS) Software Environment and Calibration"
                                    },
                                    "Description": {
                                        "val": "Develop and test an Army automated calibration environment and develop calibration procedures.  Test efforts in support of DoD Information Assurance Certification and Accreditation Process (DIACAP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "Continue development and evaluation of calibration procedures.  Perform testing and evaluation to support calibration software environment.  Develop and test DIACAP for calibration instrument controllers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.960"
                                            },
                                            "Text": {
                                                "val": "Continue development and evaluation of calibration procedures.  Develop, test and evaluate enhanced calibration software environment.  Develop and test DIACAP for calibration instrument controllers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.320"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.320"
                                            },
                                            "Text": {
                                                "val": "Develop and evaluate automated calibration procedures.  Evaluate feasibility of incorporating commercial procedures and calibration system performance monitoring within the software environment.  Test and evaluate prototype calibration procedure development engine.   Perform tests to support DIACAP for calibration systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Instruments"
                                    },
                                    "Description": {
                                        "val": "Research, develop, and test physical parameter calibration instrumentation to support areas such as chemical\/biological agent detection systems, night vision testers, small arms gauges, pneumatic pressure systems, temperature, etc."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.702"
                                            },
                                            "Text": {
                                                "val": "Continue development and test of hydrocarbon flow calibration and test standards.  Develop requirements and prototype testers for small arms gage calibration standards.  Continue development and test of chemical agent detectors and protective equipment testers and calibrators."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.357"
                                            },
                                            "Text": {
                                                "val": "Complete development and test of hydrocarbon flow calibration and test standards. Continue development, automate, and test prototype small arms gage calibration standards.  Complete development and test of chemical agent detectors and protective equipment testers and calibrators.  Initiate development of pneumatic standards to support avionic systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.238"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.238"
                                            },
                                            "Text": {
                                                "val": "Continue development and test of prototype small arms gage calibration standards.  Initiate development and test of calibration systems for biological agent detectors and protective equipment.  Continue development of pneumatic standards to support avionic systems.  Perform market research, evaluate commercial equipment, and complete specifications for acquisition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electrical Instruments"
                                    },
                                    "Description": {
                                        "val": "Research, develop, and test electrical parameter calibration instrumentation to support areas such as deployable recertification set, intrinsic electrical standards, electrical transport standards, etc."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.637"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluate commercial equipment and develop performance specifications for acquisition.  Continue development and testing of direct current (DC) and alternating current (AC) intrinsic voltage system.  Develop and test electronic transport standards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.305"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluate commercial equipment and develop performance specifications for acquisition.  Complete testing of DC intrinsic voltage system and continue testing of AC system.  Complete testing of electronic transport standards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.318"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.318"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluate commercial equipment and develop performance specifications for acquisition.  Complete development and test of high voltage multiplier for AC intrinsic voltage system.  Develop and test prototype microwave reference standard."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test Equipment Modernization"
                                    },
                                    "Description": {
                                        "val": "Perform market research, bid sample testing,  and evaluation of commercial equipment and develop performance specifications for acquisition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.161"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial equipment and develop performance specifications for  future general-purpose test equipment acquisitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial equipment and develop performance specifications for future general-purpose test equipment acquisitions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.385"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial equipment and develop performance specifications for acquisition.  Conduct bid sample testing to support acquisition program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "SSN N10000"
                                    },
                                    "Title": {
                                        "val": "Calibration Sets Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.244"
                                        },
                                        "CurrentYear": {
                                            "val": "5.726"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.650"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.650"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.735"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.542"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.590"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.499"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SSN N11000"
                                    },
                                    "Title": {
                                        "val": "Test Equipment Modernization"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.881"
                                        },
                                        "CurrentYear": {
                                            "val": "13.061"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.083"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.083"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.354"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.816"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.771"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.363"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects are focused on use of commercial and nondevelopmental item technologies.  When programmatic and engineering expertise and capability are available within the Department of Defense, services required for the individual development projects are acquired from the government source; otherwise, commercial service contracts are used to provide these capabilities.  Equipment required for development projects is obtained from the commercial supplier.  Candidate commercial equipment and nondevelopmental items are identified and evaluated through market research and government testing and evaluation."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "In-house Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Civ Labor"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.716"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.715"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.744"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.760"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.760"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AN\/GSM-421(V2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.346"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CALSETS Software Environment and Calibration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.607"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.211"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.590"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.590"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Physical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.155"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.210"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.578"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.556"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.556"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Electrical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.736"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.293"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.552"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.527"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.527"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test Equipment Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.280"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.090"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.160"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.208"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.208"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "University of Alabama, Huntsville"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.837"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.140"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.245"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AN\/GSM-421(V2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.620"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CALSETS Software Environment and Calibration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.500"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.070"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.360"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.430"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.430"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Physical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.375"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.088"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.407"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.407"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.407"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Electrical Instruments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.468"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.047"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.351"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.331"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.331"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test Equipment Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.250"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.086"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.210"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.177"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.177"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76651-58.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Physical Instruments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2007"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CALSETS Software Environment and Calibration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2007"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Electrical Instruments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2007"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Test Equipment Modernization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}