{
    "id": "9abd7b61c45701df2a6428fc95b60de15ed6b5cf",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602303E"
        },
        "ProgramElementTitle": {
            "val": "INFORMATION & COMMUNICATIONS TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "370.643"
            },
            "CurrentYear": {
                "val": "324.407"
            },
            "BudgetYearOne": {
                "val": "356.358"
            },
            "BudgetYearOneBase": {
                "val": "356.358"
            },
            "BudgetYearTwo": {
                "val": "364.076"
            },
            "BudgetYearThree": {
                "val": "355.357"
            },
            "BudgetYearFour": {
                "val": "368.535"
            },
            "BudgetYearFive": {
                "val": "368.091"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Information and Communications Technology program element is budgeted in the applied research budget activity because it is directed toward the application of advanced, innovative computing systems and communications technologies.  \n\n     The High Productivity, High-Performance Responsive Architectures project is developing the necessary computing hardware and the associated software technology base required to support future critical national security needs for computationally-intensive and data-intensive applications.  These technologies will lead to new multi-generation product lines of commercially viable, sustainable computing systems for a broad spectrum of scientific and engineering applications; it will include supercomputer, embedded computing systems, and novel design tools for manufacturing of defense systems.\n\n     The Information Assurance and Survivability project is developing the core computing and networking technologies required to protect DoD's information, information infrastructure, and mission-critical information systems.  The technologies will provide cost-effective security and survivability solutions that enable DoD information systems to operate correctly and continuously even under attack.  \n\n     The Language Technology project will develop human language technologies to provide critical capabilities for a wide range of national security needs ranging from knowledge management to low-resource language understanding.  This project develops technologies to automatically translate, collate, filter, synthesize, summarize, and present relevant information in timely and relevant forms.  The Language Technology project is addressing these diverse requirements by developing core language processing technologies and integrating these technologies into operational prototypes suitable for use in the field.\n\n     The Cyber Technology project develops technology to increase the security of military information systems and the effectiveness of cyber operations.  Over the past decade the DoD has embraced net-centric warfare by integrating people, platforms, weapons, sensors, and decision aids.  Adversaries seek to limit this force multiplier through cyber attacks intended to degrade, disrupt, or deny military computing, communications, and networking systems.  Technologies developed under the Cyber Technology project will ensure DoD net-centric capabilities survive adversary cyber attacks and will enable new cyber-warfighting capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "399.597"
                },
                "CurrentYear": {
                    "val": "334.407"
                },
                "BudgetYearOne": {
                    "val": "339.844"
                },
                "BudgetYearOneBase": {
                    "val": "339.844"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "370.643"
                },
                "CurrentYear": {
                    "val": "324.407"
                },
                "BudgetYearOne": {
                    "val": "356.358"
                },
                "BudgetYearOneBase": {
                    "val": "356.358"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-28.954"
                },
                "CurrentYear": {
                    "val": "-10.000"
                },
                "BudgetYearOne": {
                    "val": "16.514"
                },
                "BudgetYearOneBase": {
                    "val": "16.514"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-10.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-17.142"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-11.812"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "16.514"
                                },
                                "BudgetYearOneBase": {
                                    "val": "16.514"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014:  Decrease reflects below threshold and omnibus reprogrammings and the SBIR\/STTR transfer. \nFY 2015:  Decrease reflects congressional reduction.\nFY 2016:  Increase reflects initiation of new start programs in the High-Productivity, High-Performance Responsive Architectures project and expansion of the Low Resource Languages for Emergent Incidents (LORELEI) Technology effort."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "IT-02"
                    },
                    "ProjectTitle": {
                        "val": "HIGH PRODUCTIVITY, HIGH-PERFORMANCE RESPONSIVE ARCHITECTURES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "66.481"
                        },
                        "CurrentYear": {
                            "val": "29.800"
                        },
                        "BudgetYearOne": {
                            "val": "51.490"
                        },
                        "BudgetYearOneBase": {
                            "val": "51.490"
                        },
                        "BudgetYearTwo": {
                            "val": "58.659"
                        },
                        "BudgetYearThree": {
                            "val": "58.379"
                        },
                        "BudgetYearFour": {
                            "val": "63.846"
                        },
                        "BudgetYearFive": {
                            "val": "58.413"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The High Productivity, High-Performance Responsive Architectures project is developing high-productivity, high-performance computer hardware and the associated software technology base required to support future critical national security needs for computationally-intensive and data-intensive applications.  These technologies will lead to new multi-generation product lines of commercially viable, sustainable computing systems for a broad spectrum of scientific and engineering applications; it will include both supercomputer and embedded computing systems.  One of the major challenges currently facing the DoD is the prohibitively high cost, time, and expertise required to build large complex software systems.  Powerful new approaches and tools are needed to enable the rapid and efficient production of new software, including software that can be easily changed to address new requirements and can adjust dynamically to platform and environmental perturbations.  The project will ensure accessibility and usability to a wide range of application developers, not just computational science experts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Power Efficiency Revolution For Embedded Computing Technologies (PERFECT)"
                                    },
                                    "Description": {
                                        "val": "The Power Efficiency Revolution For Embedded Computing Technologies (PERFECT) program will provide the technologies and techniques to overcome the power efficiency barriers which currently constrain embedded computing systems capabilities and limit the potential of future embedded systems.  The warfighting problem this program will solve is the inability to process future real time data streams within real-world embedded system power constraints.  This is a challenge for embedded applications, from Intelligence, Surveillance and Reconnaissance (ISR) systems on unmanned air vehicles through combat and control systems on submarines.  The PERFECT program will overcome processing power efficiency limitations by developing approaches including near threshold voltage operation, massive and heterogeneous processing concurrency, new architecture concepts, and hardware and software approaches to address system resiliency, combined with software approaches to effectively utilize resulting system concurrency and data placement to provide the required embedded system processing power efficiency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "41.253"
                                            },
                                            "Text": {
                                                "val": "-  Developed an analytical modeling framework for fundamental design trade-off analysis and documentation for local resilience and power optimizations and global optimization methodologies and techniques.  Included delivery of initial IBM layered analytical framework addressing concept specification of cross-layer resiliency optimization methodologies, power performance\/optimal voltage selection, and throughput performance that developed fundamental trade-off capabilities for power, performance, and reliability for a given embedded system and application space.  Included release of improved generation of UC Berkeley Chisel 2.0 hardware construction language for design exploration and generation.\n-  Established algorithmic analysis and design methodologies for power efficient and resilient processing.  Included first practical implementation of communication-avoiding rectangular matrix multiplication using a communication-optimal recursive algorithm, outperforming the Intel Math Kernel Library hand-optimized implementation by up to 10x.\n-  Defined power efficient, heterogeneous, highly concurrent conceptual architectural design approaches.  Test and verification team evaluation report of results to date confirmed collective capabilities to obtain program goal of 75 GFLOPS\/W embedded system performance.  The evaluation was based on design concepts for power efficient architecture implementations.\n-  Defined and evaluated the impact of 3D approaches for power efficient processing, including design and simulation of a 3D-stacked Logic-in-Memory (LiM) system architecture to accelerate the processing of sparse matrix data.  Simulation results outperform state-of-the-art server and GPU systems by 100x in performance and 1000x in energy efficiency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.800"
                                            },
                                            "Text": {
                                                "val": "-  Incorporate test chip results - circuit, architecture, communication, power management, 3D - for design optimization and simulation refinement for continuing architectural development efforts.\n-  Develop compiler algorithms supporting communication-avoiding optimization, concepts for optimizing parallel codes and language-based auto-tuning.\n-  Deliver system-level integrated analytical modeling methodology and software analysis toolset for cross-layer, energy-constrained resilience optimization, processor, memory, and energy-reliability trade-offs.\n-  Publically release new hardware description language and modeling\/simulation infrastructure incorporating the evaluation and development of algorithms, specializers, hardware architectures, and resiliency techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.800"
                                            },
                                            "Text": {
                                                "val": "-  Identify and select implementation and transition targets and establish collective PERFECT teams technologies to support target requirements.\n-  Extend device models to include different physical device scattering mechanisms including acoustic phonon scattering and the impact of quantum mechanical effects on device level characteristics and provide updated device models and libraries of logic gates and memory bit cells incorporating optimization methodologies for super threshold and near threshold operation.\n-  Complete hardware design evaluations for: low voltage on-chip RAM; adaptive clocking; low-energy signaling; energy-efficient architecture hierarchies; application-specific processing; specialized DRAM architectures; diverse heterogeneous architectures.\n-  Develop the language constructs and compiler technology supporting the implementation of communication avoiding algorithms and the optimizing and managing of processor heterogeneity, concurrency, data locality, and language based autotuning.\n-  Implement modeling and evaluation environment integration combining separate optimization tools for power, communication avoidance, and resiliency to provide detailed trade-off analysis results and insight and demonstrate on a range of (1) ISR kernels (2) PERFECT hardware targets, and (3) problem instance sizes to support 20X power savings incorporating resiliency requirements relative to classical compilers on representative PERFECT hardware architectures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Complexity Management Hardware*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Cortical Processor\n\nThe battlefield of the future will have more data generators and sensors to provide information required for successful combat operations.  With networked sensors, the variety and complexity of the information streams will be even further extended.  In this project, we will develop silicon designs which help alleviate the complexity inherent in next generation systems.  These systems will have increasingly large data sets generated by their own multidomain sensors (such as RF and Electro-Optical\/Infrared (EO\/IR) payloads) as well as potentially new inputs from external sensors.  With current programming approaches, there are laborious coding requirements needed to accommodate new data streams.  Additionally, the context provided by these data sets is ever changing, and it is imperative for the integrated electronics to adapt to new information without a prolonged programming cycle.  Providing contextual cues for processing of data streams will alleviate the fusion challenges that are currently faced, and which stress networked battlefield systems.  As opposed to the intuition and future-proofing that is required at the programming stage of a current system, the silicon circuit of the future will be able to use contextual cues to adapt accordingly to new information as it is provided.\n\nThe applied research aspects of this program will look at the circuit design which can exploit the algorithms showing benefit for complexity management.  This will entail various sparse versus dense data manipulations with hardware implementations catered to both types of data.  The program will show hardware implementations that gracefully handle multiple data streams and limit the programming burden for a complex scenario.  Basic research for the program is budgeted in PE 0601101E, Project CCS-02."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Design complexity management processor algorithm and benchmark tests for object recognition in still images and action recognition in video.\n-  Demonstrate critical features of algorithm including ability to learn and adapt while operating.\n-  Quantify impact of using low precision, sparse network connectivity on accuracy of results."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.190"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.190"
                                            },
                                            "Text": {
                                                "val": "-  Design transistor level circuits implementing the complexity management algorithms.\n-  Demonstrate the ability to manage multiple data streams with interlaced information.\n-  Create initial hardware verification of concepts for both sparse and hardware demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scalable Optical Nodes for Networked Edge Traversal (SONNET)"
                                    },
                                    "Description": {
                                        "val": "Graph analytics on large data sets is currently performed on leadership-class supercomputers that are designed for other purposes.  These machines are required because they have the memory capacity required for large graph problems, but the demand on the processors is low, resulting in extremely low compute efficiency.  Computationally, graph analysis is characterized by many short, random accesses to memory which is inefficient on current systems that are optimized for regular, predictable access.  The SONNET program will build a silicon photonics-based graph processor that will perform graph analysis on Terabytes (TBs) of data with performance comparable to peta-scale supercomputers in a significantly smaller size, weight, and power (SWAP) envelope.  SONNET will optimize the design of the graph processor by co-designing processor and photonic hardware, and the computer and network architectures to exploit the high bandwidth provided by silicon photonics.  SONNET will demonstrate a scalable, power efficient prototype of such a graph processor and quantify performance for DoD-relevant applications.  The performance, efficiency, and size will be transformational for big data analytics and enable real-time analysis on dynamic graphs in the fields of cyber security, threat detection, and numerous others.  This program will explore the efficient processing of local information using stacked memory and integrated circuits specially made for specific tasks, as well as the efficient transfer of data between local information processors.  \n\nThe SONNET program will optimize the design of a graph processor and design and demonstrate high performance processor cores to accelerate graph primitives and photonic hardware required for high bandwidth, low diameter photonic networks.  The program will design and evaluate a Graph processor capable of analyzing large data sets relevant to future DoD requirements.  This program has advanced technology development efforts funded in PE 0603760E, CCC-02."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "-  Identify common graph primitives that would accelerate the execution of DoD-specific applications. \n-  Explore the applications benefitting from the unique architecture and whether unique hardware design allows for processors for unique military applications.\n-  Design corresponding hardware, e.g. processor cores, to optimize performance for high bandwidth photonic networks.\n-  Design algorithms to execute DoD problems on a SONNET system and estimate system performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Globalization"
                                    },
                                    "Description": {
                                        "val": "Approximately 66% of all installed semiconductor wafer capacity is in Asia.  This creates a significant risk for the DoD as off-shore manufacturing of microelectronic components could introduce various vulnerabilities to DoD systems that utilize these non-U.S. fabricated electronic components.  As the DoD is faced with this globalization reality, it is essential to prevent potential consequences such as reverse engineering, theft of U.S. intellectual property, and non-authorized use of these electronic components in adversary defense systems.\n\nNew applied research technology enablement will be developed in the Electronics Globalization program to provide the desired responses such as special chip packaging, on-board infrastructures, process modifications, and the use of Supply Chain Hardware Intercepts for Electronics Defense (SHIELD)-monitor dielet.  Applied research will focus on the engineering of unique devices and circuit technologies. Concepts and design flows which enable trust in an untrusted environment will be developed and applied.  Basic research for the program is budgeted in PE 0601101E, Project ES-01."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a specific CONOP using the proposed structure, and identifying key enablers needed to realize it.\n-  Model designs such as encryption engines used to enable authorized chip operation.\n-  Create and model process module modifications for a standard fab gate recipe that result in desired behaviors.\n-  Demonstrate proof-of-concept of the ability of SHIELD-like devices to selectively authorize chip operation.\n-  Complete a high level design of piggyback chips which can monitor and alter instruction execution of the host component."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Instant Foundry Adaptive Through Bits (iFAB)"
                                    },
                                    "Description": {
                                        "val": "Instant Foundry Adaptive Through Bits (iFAB), provided the groundwork for the development of a foundry-style manufacturing capability--taking as input a verified system design--capable of rapid reconfiguration to accommodate a wide range of design variability and specifically targeted at the fabrication of military ground vehicles.  The iFAB vision was to move away from wrapping a capital-intensive manufacturing facility around a single defense product, and toward the creation of a flexible, programmable, potentially distributed production capability able to accommodate a wide range of systems and system variants with extremely rapid reconfiguration timescales.  The specific goals of the iFAB program were to rapidly design and configure manufacturing capabilities to support the fabrication of a wide array of infantry fighting vehicle models and variants.\n\nOnce a given design was developed and verified, iFAB took the formal design representation and automatically configured a digitally-programmable manufacturing facility, including the selection of participating manufacturing facilities and equipment, the sequencing of the product flow and production steps, and the generation of computer-numerically-controlled (CNC) machine instruction sets as well as human instructions and training modules.  iFAB was mostly an information architecture.  Only the final assembly capability needed to be co-located under a single roof in anything resembling a conventional fabrication facility; the rest of iFAB could be geographically distributed and can extend across corporate and industrial boundaries, united only by a common model architecture and certain rules of behavior and business practices.  The final assembly node of the iFAB Foundry was the Joint Manufacturing and Technology Center (JMTC) at the Rock Island Arsenal (RIA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.734"
                                            },
                                            "Text": {
                                                "val": "-  Completed the manufacture and assembly of the winning drivetrain and mobility subsystem design from the first FANG Challenge.\n-  Provided manufacturability feedback to the META design process in support of the tool validation testing.\n-  Transitioned iFAB software tool suite and associated technology to the Digital Manufacturing and Design Innovation Institute (DMDII) through the co-funded research and formal technology transition activities for industry use.\n-  Transitioned all physical infrastructure for the iFAB Foundry final assembly node at RIA to JMTC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "META"
                                    },
                                    "Description": {
                                        "val": "The goal of the META program was to develop novel design flows, tools, and processes to enable a significant improvement in the ability to design complex defense systems that could be verified by virtual testing. The program sought to develop a design representation from which system designs can quickly be assembled and their correctness verified with a high degree of certainty. Such a \"fab-less\" design approach was complemented by a foundry-style manufacturing capability, consisting of a factory capable of rapid reconfiguration between a large number of products and product variants through bitstream re-programmability, with minimal or no resultant learning curve effects. Together, the fab-less design and foundry-style manufacturing capability was anticipated to yield substantial---by a factor of five ---compression in the time to develop and field complex defense and aerospace systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.494"
                                            },
                                            "Text": {
                                                "val": "-  Concluded expanded development of META tool suite to include qualitative and relational abstraction modeling, probabilistic certificate of correctness calculations, complexity metric evaluation, non-linear Partial Differential Equation (PDE) analysis, and cyber design evaluation.\n-  Conducted preliminary developmental Beta testing and integrated demonstration testing for the expanded META tool suite including expanded capability features.\n-  Conducted META tool transition activity to commercial Product Lifecycle Management (PLM) tool suites.\n-  Transitioned META software tool suite and associated technology to the Digital Manufacturing and Design Innovation Institute (DMDII) through the use of co-funded research and formal technology transition activities for industry use.\n-  Further expanded META Software tool suite accessibility by developing a web-based solution for the Generic Modeling Environment (GME)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "IT-03"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION ASSURANCE AND SURVIVABILITY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "172.063"
                        },
                        "CurrentYear": {
                            "val": "179.947"
                        },
                        "BudgetYearOne": {
                            "val": "208.957"
                        },
                        "BudgetYearOneBase": {
                            "val": "208.957"
                        },
                        "BudgetYearTwo": {
                            "val": "240.177"
                        },
                        "BudgetYearThree": {
                            "val": "245.501"
                        },
                        "BudgetYearFour": {
                            "val": "249.833"
                        },
                        "BudgetYearFive": {
                            "val": "254.923"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Information Assurance and Survivability project is developing the core computing and networking technologies required to protect DoD's information, information infrastructure, and mission-critical information systems.  The technologies will provide cost-effective security and survivability solutions that enable DoD information systems to operate correctly and continuously even under attack.  Technologies developed under this project will benefit other projects within this program element as well as projects in the Command, Control, and Communications program element (PE 0603760E), the Network-Centric Warfare Technology program element (PE 0603766E), the Sensor Technology program element (PE 0603767E), and other projects that require secure, survivable, network-centric information systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Assurance Cyber Military Systems"
                                    },
                                    "Description": {
                                        "val": "The High Assurance Cyber Military Systems program will develop and demonstrate technologies to secure mission-critical embedded computing systems.  The DoD is making increasing use of networked computing in systems such as military vehicles, weapon systems, ground sensors, smartphones, personal digital assistants, and other communication devices.  This dependence makes it critically important that the embedded operating system provides high levels of inherent assurance.  This operating system must also integrate the computational, physical, and networking elements of the system while running on a processor with very limited size, weight, and power.  Consequently, it can only devote a limited share of its computational resources to security while satisfying hard real-time constraints.  Recent advances in program synthesis, formal verification techniques, low-level and domain-specific programming languages, and operating systems mean that fully verified operating systems for embedded devices may be within reach at reasonable costs.  The program will develop, mature, and integrate these technologies to produce an embedded computing platform that provides a high level of assurance for mission-critical military applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.889"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated compositionality, which is the ability to construct high assurance systems out of high assurance components.\n-  Extended the core high-assurance embedded operating system with additional functionality, including automatically generated device drivers and communication protocols.\n-  Automatically synthesized correct-by-construction control systems from high-level specifications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "-  Formally verify full functional correctness for the extended core operating system and the automatically synthesized control systems for selected vehicles.\n-  Demonstrate required security properties that follow from correctness for the extended core operating system and the automatically synthesized control systems.\n-  Perform static and dynamic assessments after modifications are made on militarily-relevant vehicles to evaluate the effectiveness of the synthesis and formal methods tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.500"
                                            },
                                            "Text": {
                                                "val": "-  Apply an architecture-based approach to high-assurance system development to develop a large fraction of the software for a two-processor open-source quadcopter, a helicopter, an unmanned ground vehicle, and an American-built car.\n-  Demonstrate machine-tracked assurance cases for at least six system-wide security properties on targeted vehicles.\n-  Evaluate the effectiveness of approaches by having a red team conduct penetration-testing exercises on the targeted vehicles.\n-  Increase the level of automation of proof generation in theorem provers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vetting Commodity Computing Systems for the DoD (VET)"
                                    },
                                    "Description": {
                                        "val": "The Vetting Commodity Computing Systems for the DoD (VET) program will develop tools and methods to uncover backdoors and other hidden malicious functionality in the software and firmware on commodity IT devices.  The international supply chain that produces the computer workstations, routers, printers, and mobile devices on which DoD depends provides many opportunities for our adversaries to insert hidden malicious functionality.  VET technologies will also enable the detection of software and firmware defects and vulnerabilities that can facilitate adversary attack."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.954"
                                            },
                                            "Text": {
                                                "val": "-  Developed relevant application programming interfaces and defined formal semantics for the programming languages to be analyzed.\n-  Produced initial prototype attack scenario generation, program analysis, and diagnostic tools.\n-  Produced initial set of challenge programs for use in a competitive evaluation.\n-  Performed a competitive engagement between research and adversarial challenge performers to produce measurements of research progress against program metrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.760"
                                            },
                                            "Text": {
                                                "val": "-  Improve the effectiveness of prototype tools, in particular by reducing the rates of false alarms and missed detections, through further competitive engagements.\n-  Expand the set of challenge programs to explore more complex forms of malicious hidden functionality including race conditions, information leakage, and defective encryption.\n-  Replace initial experimental platforms with more complex devices that are more operationally representative."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.325"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.325"
                                            },
                                            "Text": {
                                                "val": "-  Use measurements against the program metrics, probabilities of false and missed detection and human analysis time, to identify the new techniques that are likely candidates for integration into an end-to-end DoD vetting application.\n-  Initiate development of an integrated vetting application that incorporates the most promising new techniques and scales to problems of operationally relevant size.\n-  Conduct an integrated end-to-end software\/firmware-vetting technology demonstration relevant to potential transition partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Supply Chain Hardware Intercepts for Electronics Defense (SHIELD)"
                                    },
                                    "Description": {
                                        "val": "Counterfeit electronic parts are becoming ubiquitous, and pose a threat to the integrity and reliability of DoD systems. Detection of counterfeit components by current means is expensive, time-consuming, and of limited effectiveness. Maintaining complete control of the supply chain using administrative controls incurs substantial costs and has limitations. Current methods of detection involve a wide variety of techniques ranging from functional testing to physical inspections which may still miss certain classes of counterfeits.  There have also been attempts by the semiconductor market to protect electronic components through the use of technology embedded in the component or its packaging.  However, most methods are specific to a manufacturer's component and as such address only those issues deemed critical to that manufacturer. Some methods can be circumvented, or require slow, expensive, off-site forensic analysis to verify authenticity.\n\nThe Supply Chain Hardware Intercepts for Electronics Defense (SHIELD) program, leveraging and expanding on previous activities in the IRIS program, will develop a technology capable of confirming, at any time, the authenticity of once-trusted parts, even after they have transited a complex global supply chain.  SHIELD will prevent counterfeit component substitution by incorporating a small, inexpensive additional silicon chip (\"dielet\") within the Integrated Circuit (IC) package. The dielet will provide a unique and encrypted ID as well as anti-tamper features.  The microscopic-size dielet embedded in the electronic component packaging will be inductively powered and scanned by an authentication induction coil brought into very close proximity to the packaged chip, thus allowing for verification of chip identity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Defined dielet power consumption and transaction timing specifications.\n-  Defined physical form factor for dielet.\n-  Defined concept of operation for dielet to server communications.\n-  Selected target encryption standard for dielet."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.250"
                                            },
                                            "Text": {
                                                "val": "-  Develop behavioral models for SHIELD dielet performance\n-  Establish a power budget for all dielet electronics.\n-  Define server communication protocols, encryption scheme, and network architectures.\n-  Develop proof of concept for sensor, power and communications technologies.\n-  Design surrogate dielet for package tests.\n-  Define process modifications needed to accommodate SHIELD insertions.\n-  Develop technologies to allow secure key and ID storage and prevent tampering with the dielet.\n-  Design a compact encryption engine that enables a very small, low power, and low-cost dielet.\n-  Simulate and prototype dielet package-insertion techniques for placing SHIELD dielet on product."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.000"
                                            },
                                            "Text": {
                                                "val": "-  Build prototype hardware.\n-  Develop infrastructure needed to execute SHIELD concept of operations.\n-  Design and build network appliance needed for remote interrogation of components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Cyber Defense (ACD)"
                                    },
                                    "Description": {
                                        "val": "The Active Cyber Defense (ACD) program will enable DoD cyber operators to fully leverage our inherent home field advantage when defending the DoD cyber battlespace.  In the cyber environment, defenders have detailed knowledge of, and unlimited access to, the system resources that attackers wish to gain.  The ACD program will exploit emerging technologies to facilitate the conduct of defensive operations that involve immediate and direct engagement between DoD cyber operators and sophisticated cyber adversaries.  Through these active engagements, DoD cyber defenders will be able to more readily disrupt, counter, and neutralize adversary cyber tradecraft in real time.  Moreover, ACD-facilitated operations should cause adversaries to be more cautious and increase their work factor by limiting success from their efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "-  Developed techniques for countering adversary cyber tradecraft and implemented early prototype software applications.\n-  Developed detailed system designs and design documentation.\n-  Finalized test plans and performed initial evaluations of active cyber defense prototypes in risk reduction assessments.\n-  Provided capabilities to support exercises with transition partners and to perform preliminary operational assessments of technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.828"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of system components.\n-  Begin integration of technologies into complete prototype platforms.\n-  Test integrated capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.914"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.914"
                                            },
                                            "Text": {
                                                "val": "-  Complete integration of system platforms and demonstrate capabilities to transition partners.\n-  Perform final test and evaluation of integrated capabilities and obtain approval for operational deployment.\n-  Support initial operational fielding of capability to facilitate transition to DoD cyber operators."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission-oriented Resilient Clouds (MRC)"
                                    },
                                    "Description": {
                                        "val": "The Mission-oriented Resilient Clouds (MRC) program will create technologies to enable cloud computing systems to survive and operate through cyber attacks.  Vulnerabilities found in current standalone and networked systems can be amplified in cloud computing environments.  MRC will address this risk by creating advanced network protocols and new approaches to computing in potentially compromised distributed environments.  Particular attention will be focused on adapting defenses and allocating resources dynamically in response to attacks and compromises.  MRC will create new approaches to measuring trust, reaching consensus in compromised environments, and allocating resources in response to current threats and computational requirements.  MRC will develop new verification and control techniques for networks embedded in clouds that must function reliably in complex adversarial environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.571"
                                            },
                                            "Text": {
                                                "val": "-  Produced a cloud task allocation system that maximizes mission effectiveness in the context of current system loads without significantly increasing hardware costs.\n-  Implemented and evaluated a packet-level monitoring tool that enables flexible, on-the-fly path analysis for network troubleshooting and attack detection.\n-  Validated and deployed an intrusion-tolerant overlay network for cloud monitoring and control.\n-  Transitioned a minimalist library microkernel into open source and commercial hypervisor products.\n-  Evaluated a network path diversity research product for potential transition into USPACOM distributed computing environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.892"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate automated construction of diverse, redundant network flow paths that maximize communication resilience in clouds.\n-  Evaluate the scalability and resilience of a high-assurance cloud computing application development library in terms of number of concurrent replicas supported and volume of data handled.\n-  Develop and demonstrate hardened network services through fine-grained memory access controls that determine what valid memory addresses are read or written to by each instruction in a program.\n-  Insert MRC technologies into USPACOM distributed computing environments.\n-  Evaluate technologies in Defense Information Systems Agency (DISA) testbeds to facilitate transitions into DoD clouds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.627"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.627"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate correct, disruption-free upgrading of software defined networking controllers in live networks.\n-  Complete transition of one or more technologies into operational use by USPACOM and DISA."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Edge-Directed Cyber Technologies for Reliable Mission Communication (EdgeCT)*"
                                    },
                                    "Description": {
                                        "val": "*Previously Secure Distributed Dynamic Computing (SDDC) funded in PE 0603766E, Project NET-01\n\nThe Edge-Directed Cyber Technologies for Reliable Mission Communication (EdgeCT) program will enable reliable communications for military forces that operate in disrupted\/disadvantaged, intermittent, high-latency environments.  The program will create algorithms and software prototypes for use exclusively at the network edge, specifically, on end hosts and\/or on proxy servers (middleboxes) fronting groups of such end hosts within a user enclave.  EdgeCT systems will sense and respond rapidly to network failures and attacks by dynamically adapting protocols utilized to exchange packets among these hosts, thereby implementing work-arounds (fight-through strategies) that restore networked communication.  This will enable highly reliable networked communication for the military in the face of a wide variety of common network failure modes as well as cyber attacks against network infrastructure.  EdgeCT technologies will be developed in collaboration with and transitioned to operational commands."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a host-based architecture for reliable communications in disrupted\/disadvantaged, intermittent, high-latency military environments.\n-  Develop techniques to sense and respond rapidly to network failures and attacks by dynamically adapting protocols utilized to exchange packets among hosts.\n-  Explore modes of user interaction and system concepts of operation with one or more operational commands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of software prototypes suitable for laboratory experimentation with operational commands.\n-  Develop work-arounds (fight-through strategies) that rapidly restore networked communication in the face of a wide variety of common network failure modes as well as cyber attacks against network infrastructure.\n-  Bring software prototypes to an initial field experiment in collaboration with an operational command."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Fault-tolerant Attack Recovery (CFAR)"
                                    },
                                    "Description": {
                                        "val": "Building upon previous work in the Clean-slate design of Resilient, Adaptive, Secure Hosts (CRASH) program, the Cyber Fault-tolerant Attack Recovery (CFAR) program will develop novel architectures to achieve cyber fault-tolerance with commodity computing technologies.  Current approaches to handling cyber-induced faults in mission-critical systems are inadequate, as perimeter defenses wrapped around vulnerable monocultures do not scale, while zero-day exploits evade signature-based defenses.  The proliferation of processing cores in multi-core central processing units provides the opportunity to adapt fault-tolerant architectures proven in aerospace applications to mission-critical, embedded, and real-time computing systems.  The CFAR program will combine techniques for detecting differences across functionally replicated systems with novel variants that guarantee differences in behavior under attack.  The resulting CFAR-enabled computing systems will quickly detect deviations in processing elements at attack onset and rapidly reboot to restore affected services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Formulate novel architectures that achieve cyber fault-tolerance with commodity computing technologies without requiring changes to the system concept of operations.\n-  Develop techniques for detecting differences across functionally replicated systems.\n-  Develop novel variants that guarantee differences in behavior under attack."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.149"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.149"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate functionally replicated systems and novel variants that provide performance close to optimal and exhibit sufficient variability to guarantee differences in behavior under attack.\n-  Implement and test techniques for quickly detecting differences across replicated systems.\n-  Implement and evaluate alternative architectures for achieving cyber fault-tolerance for mission-critical military applications with commodity computing technologies.\n-  Work with potential transition sponsors to evaluate military computing systems as candidates for technology refresh with CFAR technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptable Information Access and Control (AIAC)"
                                    },
                                    "Description": {
                                        "val": "The Adaptable Information Access and Control (AIAC) program will create the capability to dynamically, flexibly, and securely share highly selective information across enterprise boundaries.  In the civilian sphere, there is a recognized need for technologies that limit the sharing of information between commercial entities and U.S. government agencies to the greatest extent possible consistent with national security requirements.  Similarly, the U.S. military is increasingly involved in humanitarian operations that require highly selective sharing of data with a heterogeneous mix of allies, coalition partners, and other stakeholders.  AIAC will create confidentiality, privacy, multi-level security, discretionary access control, and policy engine technologies to allow tailored access to specific data and analytic results but not an entire database\/file system\/corpus.  AIAC is timely due to recent progress on cryptographic techniques such as homomorphic encryption, secure multiparty computation, and differential privacy.  Additional technologies that will be developed and incorporated include automated policy-driven releasability assessment and redaction, tactical obfuscation, and time-limited-access controls. The program will address the diverse and stringent legal and ethical requirements related to security, privacy, authentication, authorization, auditing, monitoring, access, and control encountered in both civilian and military environments.  To facilitate deployment, AIAC technologies will be designed to work with the virtualization, cloud computing, and software-defined networking technologies now widely used in both civilian and military environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.093"
                                            },
                                            "Text": {
                                                "val": "-  Formulate access control schemes appropriate for diverse civilian, intelligence, law enforcement, and coalition use cases with particular focus on privacy-preserving analytics.\n-  Architect an access control policy engine for seamless interoperability with common computing and networking infrastructure software.\n-  Create technologies for confidentiality, privacy, multi-level security, discretionary access controls, automated policy-driven releasability assessment and redaction, tactical obfuscation, computing on encrypted data, and time-limited-access controls."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.600"
                                            },
                                            "Text": {
                                                "val": "-  Implement access control software prototypes with flexibility adequate to support diverse civilian, intelligence, law enforcement, and coalition use cases and with scalability adequate for big data applications.\n-  Develop an access control policy engine and demonstrate interoperability with common cloud computing and software-defined networking infrastructure and services as appropriate.\n-  Evaluate and refine technologies for confidentiality, privacy, multi-level security, discretionary access controls, automated policy-driven releasability assessment and redaction, tactical obfuscation, computing on encrypted data, and time-limited-access controls."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Protecting Cyber Physical Infrastructure (PCPI)"
                                    },
                                    "Description": {
                                        "val": "* Formerly Protecting Cyber Physical Systems (PCPS)\n\nThe Protecting Cyber Physical Infrastructure (PCPI) program will create new technologies for ensuring the availability and integrity of critical U.S. cyber-physical infrastructure.  The near-ubiquitous use of computers to monitor and control U.S. civilian and military critical infrastructure and the dependence of our society on electric power, clean water, waste processing, petroleum refining, chemical production, and other utilities\/industries make this a national security issue.  PCPI will develop technologies to monitor heterogeneous distributed control system networks, detect anomalies that require rapid assessment, and mitigate sensor spoofing and denial of service attacks.  Hardware-in-the-loop simulation techniques will be developed to enable the discovery of emergent vulnerabilities and the development and optimization of mitigation strategies.  This will include understanding the potential role of electric power markets in propagating or damping power grid anomalies.  PCPI technologies will transition to military installations and commercial industry."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.525"
                                            },
                                            "Text": {
                                                "val": "-  Create a hardware-in-the-loop simulation capability to enable the discovery of emergent vulnerabilities and the development and optimization of mitigation strategies.\n-  Formulate resilient architectures for real-time monitoring, analysis, and assessment of distributed industrial control systems and physical infrastructure.\n-  Investigate rapid re-provisioning techniques to quickly re-deploy firmware and operating system images to restore compromised devices back to a pristine, known state of operation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.513"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.513"
                                            },
                                            "Text": {
                                                "val": "-  Develop technologies to monitor heterogeneous distributed industrial control system networks, detect anomalies that require rapid assessment, and mitigate sensor spoofing and denial of service attacks.\n-  Extend simulation capabilities to understand the potential role of electric power markets in propagating or damping power grid anomalies. \n-  Develop techniques that use organic sensors, remote instrumentation, and other sources of cyber situation awareness information to continuously optimize cyber defenses.\n-  Explore defensive measures\/counter-measures that can mitigate\/thwart a coordinated cyber attack on national critical infrastructure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Grand Challenge (CGC)"
                                    },
                                    "Description": {
                                        "val": "The Cyber Grand Challenge (CGC) program will create automated defenses that can identify and respond to cyber attacks more rapidly than human operators.  CGC technology will monitor defended software and networks during operations, reason about flawed software, formulate effective defenses, and deploy defenses automatically.  Technologies to be developed and integrated may include anomaly detection, Monte Carlo input generation, case-based reasoning, heuristics, game theory, and stochastic optimization.  The CGC capability is needed because highly-scripted, distributed cyber attacks exhibit speed, complexity, and scale that exceed the capability of human cyber defenders to respond in a timely manner.  DARPA will incentivize competition through a Grand Challenge in which CGC technologies compete head-to-head.  Principal funding for this effort is provided in Project IT-05. Additional funding is being provided in IT-03 to enable the creation of the more robust competition infrastructure necessary to accommodate the large number of competitors."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.233"
                                            },
                                            "Text": {
                                                "val": "-  Create a robust competition infrastructure as required to accommodate the large number of competitors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.329"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.329"
                                            },
                                            "Text": {
                                                "val": "-  Conduct world's first automated computer security contest: Cyber Grand Challenge Final Event.\n-  Release event results as cyber research corpus to measure and challenge future automated cyber capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clean-slate design of Resilient, Adaptive, Secure Hosts (CRASH)"
                                    },
                                    "Description": {
                                        "val": "The Clean-slate design of Resilient, Adaptive, Secure Hosts (CRASH) program will develop cyber security technologies using the mechanisms of biological systems as inspiration for radically re-thinking basic hardware and system designs.  Higher level organisms have two distinct immune systems: the innate system is fast and deadly but is only effective against a fixed set of pathogens; the adaptive system is slower, but can learn to recognize novel pathogens.  Similarly, CRASH will develop mechanisms at the hardware and operating system level that eliminate known vulnerabilities exploited by attackers.  However, because novel attacks will be developed, CRASH will also develop software techniques that allow a computer system to defend itself, to maintain its capabilities, and even heal itself.  Finally, biological systems show that diversity is an effective population defense; CRASH will develop techniques that make each computer system appear unique to the attacker and allow each system to change over time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.626"
                                            },
                                            "Text": {
                                                "val": "-  Completed the implementation of three novel, secure processors, developed the associated security extensions to one operating system, and subjected each to independent red-team assessment.\n-  Demonstrated the capability to wrap integrated defense software and protect it from cyber attacks launched by an independent red team.\n-  Demonstrated the ability of two or more complete systems to block, survive, and recover from multiple attacks and automatically repair vulnerabilities.\n-  Developed and implemented multiple technologies for adding diversity to applications and assessed the impacts of these technologies on security and performance.\n-  Automatically produced diverse instantiations of one complete operating system and multiple large applications for multiple operating systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.182"
                                            },
                                            "Text": {
                                                "val": "-  Deliver a hardened web server and browser that enable the creation of secure web applications from untrusted code.\n-  Demonstrate policy-based application monitoring and hardware-assisted self-healing of multiple applications.\n-  Demonstrate hardware-based detection of malicious software."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Software Development using Binary Components (RAPID)"
                                    },
                                    "Description": {
                                        "val": "The Rapid Software Development using Binary Components (RAPID) program will develop a system to identify and extract software components for reuse in new applications.  The DoD has critical applications that must be ported to future operating systems.  In many cases, the application source code is no longer available requiring these applications to continue to run on insecure and outdated operating systems, potentially impacting operations.  Advanced technology research for the program is budgeted in PE 0603760E, Project CCC-04."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.198"
                                            },
                                            "Text": {
                                                "val": "-  Fully integrated technologies into a single architecture and standardized interfaces to enable partners to interoperate with the system.\n-  Developed a single user interface that combines technical area views for monitoring system performance with a constructive interface for specifying desired products."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.396"
                                            },
                                            "Text": {
                                                "val": "-  Develop new software component reuse capabilities to extend application performance to a wider range of realistic scenarios and enable an expanded concept of operations.  \n-  Implement new capabilities in modules designed to interoperate seamlessly with deployed RAPID prototype systems.\n-  Integrate new modules into prototype RAPID systems deployed at transition partner sites and support initial operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anomaly Detection at Multiple Scales (ADAMS)"
                                    },
                                    "Description": {
                                        "val": "The Anomaly Detection at Multiple Scales (ADAMS) program will develop and apply algorithms for detecting anomalous, threat-related behavior of systems, individuals, and groups over hours, days, months, and years.  ADAMS will develop flexible, scalable, and highly interactive approaches to extracting actionable information from information system log files, sensors, and other instrumentation.  ADAMS will integrate these anomaly detection algorithms to produce adaptable systems for timely insider threat detection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.272"
                                            },
                                            "Text": {
                                                "val": "-  Created the capability to incorporate direct user feedback to improve coverage of threat types.\n-  Developed and implemented technology that is adaptable to a wide variety of organizational structures, workflows, and data sources.\n-  Developed techniques to provide the evidence needed to initiate focused response activities.\n-  Developed two integrated prototype anomaly\/threat detection systems suitable for rapid deployment in an operational environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and implement technology to capture analyst expertise for assessing and explaining detected anomalies and incorporate such user feedback in decision loops for operators without highly specialized computer science knowledge.\n-  Harden prototype and obtain DoD Information Assurance Certification and Accreditation Process approval for use on military networks.\n-  Conduct and evaluate initial prototype in a large scale environment with operational partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Authentication"
                                    },
                                    "Description": {
                                        "val": "The Active Authentication program will develop more effective user identification and authentication technologies.  Current authentication approaches are typically based on long, complex passwords and incorporate no mechanism to verify the user originally authenticated is the user still in control of the session.  The Active Authentication program will address these issues by focusing on the unique aspects of the individual (i.e., the cognitive fingerprint) through the use of software-based biometrics that continuously validate the identity of the user.  Active Authentication will integrate multiple biometric modalities to create an authentication system that is accurate, robust, and transparent to the user."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.100"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated enhanced authentication using multiple biometrics representing complementary aspects of the individual.\n-  Evaluated the level of confidence that is achievable using multiple advanced authentication mechanisms and quantified the resulting level of security using red teaming and other techniques.\n-  Prototyped an authentication platform suitable for DoD use in collaboration with potential transition sponsors.\n-  Initiated development of multiple authentication biometrics suitable for deployment on mobile hardware for potential use by the DoD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.025"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate multiple authentication biometrics suitable for deployment on mobile hardware for potential use by the DoD.\n-  Prove flexibility of underlying prototype platform by creating an additional authentication platform suitable for DoD.\n-  Prototype an authentication platform suitable for use on mobile hardware in collaboration with potential transition sponsors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Safer Warfighter Computing (SAFER)"
                                    },
                                    "Description": {
                                        "val": "The Safer Warfighter Computing (SAFER) program is creating a technology base for assured and trustworthy Internet communications and computation, particularly in untrustworthy and adversarial environments.  SAFER creates automated processes and technologies to enable military users to send and receive content on the Internet, utilizing commercially available hardware and software, in ways that avoid efforts to deny, locate, or corrupt communications.  SAFER is also developing technology for performing computations on encrypted data without decrypting it first through fully homomorphic encryption and interactive, secure multi-party computation schemes.  This will enable, for example, the capability to encrypt queries and compute an encrypted search result without decrypting the query.  This technology will advance the capability to run programs on untrusted hardware while keeping programs, data, and results encrypted and confidential.  This mitigates the important aspect of supply chain compromise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.150"
                                            },
                                            "Text": {
                                                "val": "-  Improved software performance in fully homomorphic encryption, garbled-circuit secure multiparty computation, and secret-sharing secure multiparty computation, and performed independent benchmarks.\n-  Demonstrated an additional two orders of magnitude improvement in the performance of fully homomorphic encryption.\n-  Refined field programmable gate array implementation of fully homomorphic encryption to yield a further order of magnitude performance improvement over optimized software implementation.\n-  Demonstrated safe, encrypted Internet communications application: secure Voice over Internet Protocol (VOIP) teleconferencing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.066"
                                            },
                                            "Text": {
                                                "val": "-  Develop improved decoy routing, parallelized group messaging, dynamic traffic camouflage, and rendezvous strategy technologies.\n-  Further optimize field programmable gate array and software implementations of fully homomorphic encryption to double performance over prior implementations.\n-  Conduct the final independent, adversarial assessment of the effectiveness of technologies to prevent communication localization and detection, including newly developed adversarial techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Cyber Analysis System (ICAS)"
                                    },
                                    "Description": {
                                        "val": "The Integrated Cyber Analysis System (ICAS) program will develop techniques to automatically discover probes, intrusions, and persistent attacks on enterprise networks.  At present, discovering the actions of capable adversaries requires painstaking forensic analysis of numerous system logs by highly skilled security analysts and system administrators.  ICAS will develop technologies to facilitate the correlation of interactions and behavior patterns across all system data sources and thereby rapidly uncover aberrant events and detect system compromise.  This includes technologies for automatically representing, indexing, and reasoning over diverse, distributed, security-related data and system files."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed a multi-tiered approach to device identification and information extraction by transcoding Simple Protocol and Resource description framework Query Language (SPARQL).\n-  Developed SQL transcoding support to enable Relational Database Management System (RDBMS) information extraction. \n-  Conducted initial demonstrations of core technologies including automatic indexing of data sources, common language integration, and reasoning across federated databases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and implement algorithms for automatically identifying and quantifying specific security risks on enterprise networks.\n-  Conduct initial technology demonstrations including automatic indexing of data sources, common language integration, and reasoning across federated databases.\n-  Integrate, evaluate, and optimize algorithms via testing against attacks\/persistent threats provided by transition partners.\n-  Complete fully functional beta versions of the applications with operational stability suitable for testing at transition partner locations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logan"
                                    },
                                    "Description": {
                                        "val": "The Logan program will provide DoD enhanced capabilities to conduct Computer Network Attack (CNA). Techniques will be developed to disrupt and degrade adversary information systems and network operations, with particular interest in techniques likely to be robust to adversary countermeasure strategies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.803"
                                            },
                                            "Text": {
                                                "val": "-  Automated and tested prototypes in conjunction with transition partner.\n-  Optimized and hardened prototypes and initiated transition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.697"
                                            },
                                            "Text": {
                                                "val": "-  Transition automated prototype system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrity and Reliability of Integrated CircuitS (IRIS)"
                                    },
                                    "Description": {
                                        "val": "Integrated circuits (ICs) are core components of most electronic systems developed for the Department of Defense.  However, the DoD consumes a very small percentage of the total IC production in the world.  As a result of the globalization of the IC marketplace, much of the advanced IC production has moved to offshore foundries, and these parts make up the majority of ICs used in today's military systems.\nWithout the ability to influence and regulate the off-shore fabrication of ICs, there is a risk that parts acquired for DoD systems may not meet stated specifications for performance and reliability.  This risk increases considerably with the proliferation of counterfeit ICs in the marketplace, as well as the potential for the introduction of malicious circuits into a design.\n\nThe Integrity and Reliability of Integrated CircuitS (IRIS) program developed techniques that will provide electronic system developers the ability to validate the function of digital, analog and mixed-signal ICs non-destructively, given limited data about the chip's detailed design  specifications.  These techniques included advanced imaging for identification of functional elements in deep sub-micrometer Complementary Metal-Oxide Semiconductor (CMOS) circuits, as well as computational methods to deal with the extremely difficult problem of determining device connectivity.\n\nFinally, the IRIS program developed innovative methods to determine the reliability of an IC by testing a limited number of samples.  The current understanding of IC aging mechanisms, including negative bias temperature instability (NBTI), hot carrier injection (HCI), time-dependent dielectric breakdown (TDDB) and electromigration (EM) was leveraged to develop unique diagnostic test techniques."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "-  Exercised completed methods for non-destructive imaging, circuit extraction and functional derivation.\n-  Demonstrated methods for reliability analysis for improved accuracy, functionality and efficacy.\n-  Combined analysis methods for imaging, circuit extraction and reliability modeling to identify anomalies on an integrated circuit test article, and to determine the impact of those anomalies on the reliability of the test article.\n-  Transitioned technology to the Navy and the Air Force Research Lab for deployment in existing programs to analyze circuits for counterfeit issues.\n-  Completed testing and evaluation of performers and test chips by government virtual lab highlighting advancements in program closeout and gaps to be addressed."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "IT-04"
                    },
                    "ProjectTitle": {
                        "val": "LANGUAGE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "74.332"
                        },
                        "CurrentYear": {
                            "val": "45.511"
                        },
                        "BudgetYearOne": {
                            "val": "60.897"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.897"
                        },
                        "BudgetYearTwo": {
                            "val": "65.240"
                        },
                        "BudgetYearThree": {
                            "val": "51.477"
                        },
                        "BudgetYearFour": {
                            "val": "54.856"
                        },
                        "BudgetYearFive": {
                            "val": "54.755"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Language Technology project will develop human language technologies to provide critical capabilities for a wide range of national security needs ranging from knowledge management to low-resource language understanding.  Foreign-language news broadcasts, web-posted content, and foreign-language hard-copy documents could provide insights regarding regional and local events, attitudes and activities, if there was a system that could automatically process large volumes of speech and text in multiple languages obtained through a variety of means.  The project develops technologies to automatically translate, collate, filter, synthesize, summarize, and present relevant information in timely and relevant forms.  In addition, current U.S. military operations often require warfighters on the ground to understand speech and text in foreign languages for which there may be no available linguists.  The Language Technology project is addressing these diverse requirements by developing core language processing technologies and integrating these technologies into operational prototypes suitable for use in the field."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Deep Exploration and Filtering of Text (DEFT)"
                                    },
                                    "Description": {
                                        "val": "The Deep Exploration and Filtering of Text (DEFT) program will enable automated extraction, processing, and inference of information from text in operationally relevant application domains.  A key DEFT emphasis is to determine explicit and implicit meaning in text through probabilistic inference, anomaly detection, and other techniques.  To accomplish this, DEFT will develop and apply formal representations for basic facts, spatial, temporal, and associative relationships, causal and process knowledge, textually entailed information, and derived relationships and correlated actions\/events.  DEFT inputs may be in English or in a foreign language and sources may be completely free-text or semi-structured reports, messages, documents, or databases.  DEFT will extract knowledge at scale for open source intelligence and threat analysis.  Planned transition partners include the intelligence community and operational commands."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.369"
                                            },
                                            "Text": {
                                                "val": "-  Developed initial methods and algorithms for reasoning about both explicitly and implicitly expressed opinions and beliefs, for extracting causal knowledge, and for finding implicit meaning based on anomalous usages and disfluencies in a document or set of documents.\n-  Conducted performance evaluations on data sets related to event representation and inference.\n-  Expanded capabilities to additional application problems and domains such as target information augmentation in collaboration with end-users.\n-  Demonstrated feasibility of deep extraction and filtering for selected end-user applications and transitioned initial sets of algorithms to the intelligence community and a Combatant Command."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.333"
                                            },
                                            "Text": {
                                                "val": "-  Develop technology for extracting belief, sentiment, and intent; for representing geo-spatial features and temporal events; and for inference and alerting from a set of documents.\n-  Integrate multiple complementary algorithms into a comprehensive and consistent functional suite to support end-user workflows and problems.\n-  Increase algorithm development focus towards knowledge base representation in preparation for embedding algorithms in workflows to enable reasoning and downstream analysis.\n-  Extend algorithms to additional foreign languages such as Spanish and Chinese.\n-  Conduct performance evaluations on data sets related to event representation, anomaly detection, and knowledge base population.\n-  Transition algorithm suites and conduct effectiveness assessments at end-user sites.\n-  Enlarge the scope of event coverage to include increasingly complex events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.223"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.223"
                                            },
                                            "Text": {
                                                "val": "-  Improve algorithm performance on current functions and expand to new functions such as extending currently single-document algorithms to function across documents.\n-  Optimize algorithm coverage and improve performance for foreign languages such as Spanish and Chinese.\n-  Join and optimize combined output of algorithms focused on different tasks such as belief and sentiment extraction, event argument and attribute identification, and relation mapping.\n-  Transition system-level prototype to end-user site for effectiveness assessment.\n-  Refine areas of focus based on results of transition site evaluations and open evaluation performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robust Automatic Translation of Speech (RATS)"
                                    },
                                    "Description": {
                                        "val": "The Robust Automatic Transcription of Speech (RATS) program is developing robust speech processing techniques for conditions in which speech signals are degraded by distortion, reverberation, and\/or competing conversation.  Robust speech processing technologies enable soldiers to hear or read clear English versions of what is being said in their vicinity, despite a noisy or reverberant environment.  Techniques of interest include speech activity detection, language identification, speaker identification, and keyword spotting.  RATS technology is being developed and optimized on real world data in conjunction with several operational users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.850"
                                            },
                                            "Text": {
                                                "val": "-  Evaluated performance showing substantial progress on noisy and degraded speech signals from the program-generated data corpus.\n-  Collected and annotated classified field data for training and testing.\n-  Evaluated technologies on field-collected data and tested the system for in-the-field adaptation.\n-  Obtained real world data from operational users and performed testing on site at the user location.\n-  Established relationships with various DoD and intelligence community agencies as potential transition partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.178"
                                            },
                                            "Text": {
                                                "val": "-  Develop new methods for field adaptations which include lightly supervised and unsupervised adaptation of the algorithms to new channels and environments.\n-  Develop methods for coping with extraneous signals found in field data.\n-  Develop techniques to significantly reduce the amount of data from hours to minutes for adapting algorithms to new channels.\n-  Produce a software integrated platform with a set of Application Programming Interfaces (APIs) and Graphical User Interfaces (GUIs) to be inserted at DoD and intelligence community partner sites and tested in the working environment of the partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop, integrate and test techniques to deal with multiple speakers and overlapping speaker channels.\n-  Collect and annotate additional field collected data.\n-  Integrate technologies in transition partner platforms, adjusting systems to fit partner needs.\n-  Evaluate technologies on specialized operational scenarios."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Resource Languages for Emergent Incidents (LORELEI)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Foreign Language Rapid Response (FLRR)\n\nThe Low Resource Languages for Emergent Incidents (LORELEI) program will develop the capability to rapidly construct machine translation and other human language technologies for low-resource foreign languages.  The United States military operates globally and frequently encounters low-resource languages, i.e., languages for which few linguists are available and no automated human language technology capability exists.  Historically, exploiting foreign language materials required protracted effort, and as a result systems exist only for languages in widespread use and in high demand.  The goal of the LORELEI program is to dramatically advance the state of computational linguistics and human language technology to enable rapid, low-cost development of language processing capabilities for low-resource languages.  To achieve this LORELEI will eliminate reliance on huge, manually-translated, manually-transcribed, or manually-annotated corpora and instead will leverage language-universal resources, project from related-language resources, and fully exploit a broad range of language-specific resources. These capabilities will be exercised to provide situational awareness based on information from any language, in support of emergent missions such as humanitarian assistance\/disaster relief, terrorist attack response, peacekeeping, and infectious disease response."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop techniques for quantifying the linguistic similarity of language usage in diverse documents and media.\n-  Develop semantic techniques for identifying the common topics, themes, and sentiment in speech and text in diverse foreign languages.\n-  Explore techniques for optimizing combinations of existing resources to eliminate reliance on large parallel corpora in the context of exploiting foreign language sources in low-resource languages."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.174"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.174"
                                            },
                                            "Text": {
                                                "val": "-  Develop algorithms to exploit the universal properties of languages when rapidly ramping up for a low-resource language.\n-  Collect, generate, and annotate data for an initial set of resources in typologically representative medium-resource languages.\n-  Create a baseline toolkit to rapidly develop an initial situational awareness capability given a new low-resource language document collection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Broad Operational Language Translation (BOLT)"
                                    },
                                    "Description": {
                                        "val": "The Broad Operational Language Translation (BOLT) program enabled language processing of informal and dialectal genres.  Historically, foreign language translation technology was geared toward formal content, like broadcast media and newswire, but did not address informal or dialectal genres.  BOLT developed new approaches to automated language translation, human-machine multimodal dialogue, and language generation and applied these to informal genres such as online discussion groups, messaging, and telephone conversation.  While Chinese and dialectal Arabic were the two languages addressed directly in BOLT, techniques developed for these two languages have wide applicability to other languages and dialects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "38.913"
                                            },
                                            "Text": {
                                                "val": "-  Developed improved algorithms for translating two informal genres of Arabic and Chinese text, online discussion groups and messaging, to enable comprehension of colloquialisms and idiomatic speech and added a third genre, telephone conversation.\n-  Used methods developed for Egyptian dialectal Arabic to create databases, tools, and algorithms for additional Arabic dialects.\n-  Developed dialogue management techniques such as computer-moderated turn-taking to avoid divergence as an approach for improving the performance of bi-directional Arabic-English dialogue systems.\n-  Completed the annotated corpora of Arabic and Chinese informal genre data by adding new dialects and enhanced their utility by incorporating additional annotations.\n-  Formalized government purpose rights and transitioned software for translating informal genres of Arabic and Chinese to a Combatant Command and the Intelligence Community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multilingual Automatic Document Classification, Analysis and Translation (MADCAT)"
                                    },
                                    "Description": {
                                        "val": "The Multilingual Automatic Document Classification, Analysis and Translation (MADCAT) program developed and integrated technology to enable exploitation of foreign language hand-written documents.  This technology is crucial to the warfighter, as documents such as notebooks, letters, ledgers, annotated maps, newspapers, newsletters, leaflets, pictures of graffiti, and document images captured in the field may contain extremely important time-sensitive information.  The MADCAT program addressed this need by producing devices to convert such captured documents from Arabic into readable English in the field.  MADCAT substantially improved applicable technologies, in particular document analysis and optical character recognition\/optical handwriting recognition.  MADCAT integrated these improved technologies with translation technology and created prototypes for field trials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Text": {
                                                "val": "-  Fielded MADCAT to multiple Korean sites as an off-line capability for evaluation and routine use by end users.\n-  Evaluated performance of MADCAT in the end user environment showing substantial progress in machine translation of Korean to English and English to Korean on end user provided documents in exercises conducted on site.\n-  Distributed the MADCAT framework for access to the entire U.S. military on the Korean peninsula via the CENTRIX-K network and demonstrated the system during major annual combined U.S.-Korean Forces exercise Ulchi Freedom Guardian.\n-  Developed and deployed a new machine translation capability enabling model adaptation using onsite data and continued to enhance end user learning and recall capabilities with translation memory capabilities.\n-  Signed an MOU with the U.S. Army Chief of Staff in Korea which establishes responsibilities and commitments for MADCAT technology in Korea."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "IT-05"
                    },
                    "ProjectTitle": {
                        "val": "CYBER TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "57.767"
                        },
                        "CurrentYear": {
                            "val": "69.149"
                        },
                        "BudgetYearOne": {
                            "val": "35.014"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.014"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Technology project develops technology to increase the security of military information systems and the effectiveness of cyber operations.  Over the past decade the DoD has embraced net-centric warfare by integrating people, platforms, weapons, sensors, and decision aids.  Adversaries seek to limit this force multiplier through cyber attacks intended to degrade, disrupt, or deny military computing, communications, and networking systems.  Technologies developed under the Cyber Technology project will ensure DoD net-centric capabilities survive adversary cyber attacks and will enable new cyber-warfighting capabilities.  Promising technologies will transition to system-level projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Plan X"
                                    },
                                    "Description": {
                                        "val": "The Plan X program will develop technologies to enable comprehensive awareness and understanding of the cyber battlespace as required for visualizing, planning, and executing military cyber warfare operations.  This includes intelligence preparation of the cyber battlespace, indications and warning of adversary cyber actions, detection of cyber-attack onset, cyber-attacker identification, and cyber battle damage assessment.  Plan X will create new graphical interfaces that enable intuitive visualization of events on hosts and networks to aid in the planning and execution of cyber warfare.  Plan X will extend operationally meaningful measures to project quantitatively the collateral damage of executed cyber warfare missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "35.599"
                                            },
                                            "Text": {
                                                "val": "-  Created preliminary end-to-end system prototype that supports efficient network mapping, measurement, and network change detection applications.\n-  Hosted private cloud infrastructure with automated provisioning of computing resources on a standalone closed network that enables a massively distributed data and event store.\n-  Developed approaches to host Plan X control plane in a wide variety of network architectures using diverse scalable platforms.\n-  Designed and implemented first generation prototypes of the commander, planner, and operator views for the graphical user interface.\n-  Created automated network simulation technology to model the cyber battlespace, generate cyber warfare mission plans, and script cyber warfare missions using a domain specific language for programming at Internet scale.\n-  Collaborated with operators from Air Force, Navy, Marine Corps, and Army cyber components and U.S. Cyber Command."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "43.419"
                                            },
                                            "Text": {
                                                "val": "-  Create runtime environment and platforms capable of supporting a large scale user base, massive-scale deployments, resiliency to failures of any system component, and managing high ingest rates.\n-  Demonstrate cyber battle damage assessment from algorithmically placed vantage points.\n-  Demonstrate military network tactical situational awareness applications and use cases.\n-  Release Plan X 1.0 Alpha system and field test capabilities at military cyber exercises such as Cyber Flag and Red Flag.\n-  Conduct field tests of computer network operations scenario development and training capabilities.\n-  Create technical roadmap for transition to operational environment, including understanding of transition partner networks and integration points."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.150"
                                            },
                                            "Text": {
                                                "val": "-  Release Plan X 1.0 Beta system and field test with military transition partners at cyber exercises such as Cyber Flag and Red Flag.\n-  Publish application store software development kit and integrate third party cyber capabilities.\n-  Demonstrate large-scale deployment of the end-to-end system with users and roles running on multiple devices in disparate locations.\n-  Integrate with existing military command and control\/intel systems to allow bidirectional flow of data to and from Plan X to provide visualization and insights into the cyber battlespace.\n-  Develop and implement technologies for multi-level security access and use privileges.\n-  Integrate multi-level security access and use privileges and initiate technology transition with USCYBERCOM and Service components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Grand Challenge (CGC)"
                                    },
                                    "Description": {
                                        "val": "The Cyber Grand Challenge (CGC) program will create automated defenses that can identify and respond to cyber attacks more rapidly than human operators.  CGC technology will monitor defended software and networks during operations, reason about flawed software, formulate effective defenses, and deploy defenses automatically.  Technologies to be developed and integrated may include anomaly detection, Monte Carlo input generation, case-based reasoning, heuristics, game theory, and stochastic optimization.  The CGC capability is needed because highly-scripted, distributed cyber attacks exhibit speed, complexity, and scale that exceed the capability of human cyber defenders to respond in a timely manner.  DARPA will incentivize competition through a Grand Challenge in which CGC technologies compete head-to-head.  Additional funding for this effort is provided in Project IT-03."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.438"
                                            },
                                            "Text": {
                                                "val": "-  Developed host phase of instrumented competition framework for automated cyber defense.\n-  Initiated development of automated cyber defenders to identify flaws and formulate defenses.\n-  Conducted competitive assessments to identify the most promising technology solutions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.832"
                                            },
                                            "Text": {
                                                "val": "-  Extend development of automated cyber defenders to allow real time in situ network defense decision making.\n-  Develop a cyber research corpus using techniques from game theory, other quantitative disciplines, and emergent behavior.\n-  Conduct mid-term qualification evaluation of cyber technologies through competitive challenges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.864"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.864"
                                            },
                                            "Text": {
                                                "val": "-  Conduct world's first automated computer security contest: Cyber Grand Challenge Final Event.\n-  Release event results as cyber research corpus to measure and challenge future automated cyber capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Crowd Sourced Formal Verification (CSFV)"
                                    },
                                    "Description": {
                                        "val": "The Crowd-Sourced Formal Verification (CSFV) program will create technologies that enable crowd-sourced approaches to securing software systems through formal verification.  Formal software verification is a rigorous method for proving that software has specified properties, but formal verification does not currently scale to the size of software found in modern weapon systems.  CSFV will enable non-specialists to participate productively in the formal verification process by transforming formal verification problems into user-driven simulations that are intuitively understandable."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.730"
                                            },
                                            "Text": {
                                                "val": "-  Developed five web-based interactive computer simulations based on mapped high-level software specifications and codes.\n-  Launched and maintained public web site to attract the widest possible base for crowd-sourcing formal verifications.\n-  Applied simulations to large Java and C computer programs consisting of hundreds of thousands of lines of source code.\n-  Mapped solutions as code annotations back into formal verification tools and assessed the effectiveness of these solutions by verifying the absence of errors on the MITRE Common Weakness Enumeration\/SANS Institute Top 25 lists.\n-  Refined initial simulations and began design and development of five new simulations for greater verification effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.898"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of five new simulations.\n-  Refine simulations to make them accessible to a large set of non-specialists.\n-  Augment simulations to handle very large Java and C computer programs consisting of millions of lines of source code.\n-  Enhance public web site to include these new simulations.\n-  Assess effectiveness of the new simulations on the large-sized code targets."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}