{
    "id": "a1a9588c856221abd2d00787ac090aa973c5f167",
    "meta": {
        "filename": "dod-2016_RDTE_2016_MDA_RDTE_JustificationBook_Missile_Defense_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Missile_Defense_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603178C"
        },
        "ProgramElementTitle": {
            "val": "Weapons Technology"
        },
        "R1LineNumber": {
            "val": "32"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "45.268"
            },
            "CurrentYear": {
                "val": "54.068"
            },
            "BudgetYearOne": {
                "val": "45.389"
            },
            "BudgetYearOneBase": {
                "val": "45.389"
            },
            "BudgetYearTwo": {
                "val": "48.912"
            },
            "BudgetYearThree": {
                "val": "70.115"
            },
            "BudgetYearFour": {
                "val": "54.595"
            },
            "BudgetYearFive": {
                "val": "66.797"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The net decrease for Weapons Technology from FY 2015 to FY 2016 reflects a realignment of Department of Defense priorities.\n\nThe FY 2016 MD69 increase from FY 2015 to FY 2016 funds increased laser test bed power, laser packaging demonstrations, system robustness and megawatt-class scaling designs based on a successful Fiber Combining Laser 34 kilowatt demonstration and a Diode Pumped Alkali Laser 10 kilowatt system first light."
        },
        "ProgramElementMissionDescription": {
            "val": "The Weapons Technology Program Element focuses on reducing the cost of an engagement by developing compact, efficient High Energy Lasers (HEL) and the novel beam propagation technology required for low-power to strategic-class Ballistic Missile Defense System (BMDS) applications. Weapons Technology works closely with Discrimination Sensor Technology to correlate threat identification and engagement hand over requirements to build the foundation for multi-mission directed energy platforms.\n\nThe Missile Defense Agency (MDA) collaborates with the Office of the Assistant Secretary of Defense for Research and Engineering, the Defense Advanced Research Projects Agency (DARPA), the High Energy Laser Joint Technology Office, and the Air Force in a systems engineering based strategy to research, develop and test Directed Energy weapons technology. \n\nWithin the Directed Energy Research Technology area (MD69), the MDA is conducting research into the transmission and control of directed energy largely above the atmosphere for mid-term (FY 2019) missile defense applications and, ultimately, boost phase intercepts. The MDA is pursuing promising laser technologies in a competitive environment with Industry, supported by breakthrough research at the Nation's premier laboratories. The MDA will accelerate Directed Energy technology development with the goal of scaling to power levels required for robust, speed of light missile defense.  The MDA is collaborating with the DARPA and the United States Air Force to develop a set of common core technologies that will enable both Missile Defense and air dominance missions. These core technologies include fiber launchers; high brightness, high efficiency diode pump modules; and high power, high efficiency fiber amplifiers.  The DARPA and the MDA will jointly build and test an approximately 50kW class combined fiber laser at the Massachusetts Institute of Technology Lincoln Laboratory (MIT LL), scaling up from the successful 34 kW the laboratory demonstration achieved in FY 2014. \n\nWithin the Interceptor Technology area (MD72), the MDA develops technology that enhances the capability to hit-to-kill within current and future BMDS architectures. The MDA also focus on developing the enabling technology necessary to make game-changing breakthroughs.  In FY 2016, the Agency will make technology investments for the next generation solid Divert Attitude Control System (DACS) in support of the Multi-Object Kill Vehicle.  The Agency will competitively develop the next generation solid DACS.  This project will also investigate rail gun suitability and integration requirements for ballistic missile defense applications. \n\nMD40 Program-Wide Support (PWS) consists of essential non-headquarters management efforts providing integrated and efficient support to the MDA functions and activities across the entire Ballistic Missile Defense System (BMDS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "46.708"
                },
                "CurrentYear": {
                    "val": "14.068"
                },
                "BudgetYearOne": {
                    "val": "36.494"
                },
                "BudgetYearOneBase": {
                    "val": "36.494"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "45.268"
                },
                "CurrentYear": {
                    "val": "54.068"
                },
                "BudgetYearOne": {
                    "val": "45.389"
                },
                "BudgetYearOneBase": {
                    "val": "45.389"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.440"
                },
                "CurrentYear": {
                    "val": "40.000"
                },
                "BudgetYearOne": {
                    "val": "8.895"
                },
                "BudgetYearOneBase": {
                    "val": "8.895"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "40.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.889"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.551"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.895"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.895"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015 change reflects Public Law 113-235, FY2015 Omnibus; Consolidated and Further Continuing Appropriations Act.\n\nThe FY 2016 net increase of $8.895 million reflects:\n\n- An increase of $12.967 million for advanced technology efforts in interceptor technology to address an emerging threat. \n- A decrease of $4.185 million of funding and content transferred to the Technology Maturation Initiatives program element, 0604115C, for prototype development. Low power laser concepts and hardware developed under this Weapons Technology program element and by Industry are technically mature enough for prototype development under the Technology Maturation Initiative program element\n- $0.113 million was added from multiple Missile Defense Agency program elements to MD40 Program Wide Support"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD69"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.315"
                        },
                        "CurrentYear": {
                            "val": "13.348"
                        },
                        "BudgetYearOne": {
                            "val": "30.291"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.291"
                        },
                        "BudgetYearTwo": {
                            "val": "46.477"
                        },
                        "BudgetYearThree": {
                            "val": "66.382"
                        },
                        "BudgetYearFour": {
                            "val": "51.572"
                        },
                        "BudgetYearFive": {
                            "val": "62.996"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Based on a successful Fiber Combining Laser 34 kilowatt demonstration and a Diode Pumped Alkali Laser 10 kilowatt system first light,  the increase from FY 2015 to FY 2016 funds increased laser test bed power, laser packaging demonstrations, system robustness and megawatt-class scaling designs.\n\nIn FY 2016, $4.185 million of funding and content transferred to the Technology Maturation Initiatives program element, 0604115C, for prototype development. Low power laser concepts and hardware developed under this Weapons Technology program element and by Industry are technically mature enough for prototype development under the Technology Maturation Initiative program element."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Missile Defense Agency (MDA) mission is to develop a robust system to defend the United States against ballistic missile attacks at all ranges, in all phases of flight.  Negating a ballistic missile in boost phase, before a threat missile can spawn countermeasures, will revolutionize missile defense by dramatically reducing the role of interceptors.  In FY 2010, the Airborne Laser (ABL) proved we could acquire, track and destroy a boosting missile, addressing many aspects of the boost phase kill, but also underscored the complexity and challenges of fielding such a weapon system.  \n\nThe experience we gained from that successful first foray into directed energy weapons is pointing us along a new path that integrates a highly efficient, compact electric laser into a high altitude, long endurance Unmanned Aerial Vehicle (UAV) capable of flying in the stratosphere above the clouds which diffuse the laser energy.  Flying at low speed in the relatively calm air at 60,000 feet significantly reduces the complex beam pointing and atmospheric jitter compensation systems, that were so troublesome on the ABL. \n\nWith these lessons learned and breakthrough research at our nation's premier scientific laboratories, the Agency is implementing an incremental roadmap that will prove the technology is ready to execute Missile Defense missions before 2020.  This roadmap jointly develops with the Defense Advanced Research Projects Agency (DARPA) and the Air Force a set of core technologies common to both Air Force and missile defense missions; including  fiber launchers; high brightness, high efficiency diode pump modules; and high power, high efficiency fiber amplifiers.\n\nFunds are also developing two high energy laser technologies, the Diode Pumped Alkali Laser System (DPALS) with Lawrence Livermore National Laboratory (LLNL) and Fiber Combining Lasers (FCLs) with the Massachusetts Institute of Technology Lincoln Laboratory (MIT LL).  Both laser technologies have considerable promise for scaling to very high average power while simultaneously achieving high system electrical-to-optical efficiencies, exceeding 40 percent, and very low system weight and volume. These key investments are targeted at driving the weight per kW of power in the fiber amplifier from a 5kg per kW to 1 kg per kW.   The resources funded in this Program Element fund the joint MDA, DARPA and Air Force development of a 50kW compact, packaged, combined fiber laser system, scaling up from the successful 34 kW laboratory laser demonstrated in the laboratory in FY 2015. In FY 2016, MIT LL will complete the Critical Design Review (CDR) and begin fabrication and integration of the 5 kilograms (kg) per kW low size weight and power Fiber Combining Laser (FCL) system. In FY 2016, LLNL will demonstrate a DPALS at 30 kilowatts average power. In FY 2017 and FY 2018, each laser will demonstrate the technology necessary to scale the laser power to hundreds of kilowatts.  Multiple Industry partners continue to make steady progress in high power lasers.  The MDA will select the best available high energy laser technology from the National Laboratories and\/or Industry for a follow-on prototype high power laser demonstration in FY 2019 with a CDR in FY 2020."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Directed Energy Research"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.315"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Demonstrated the efficiency, producibility, and scaling potential of candidate laser technology\n\n- Developed the Diode Pumped Alkali Laser System (DPALS) to produce high efficiency and excellent beam quality. Completed window, diode and wave guide development in support of the Alpha unit build\n\n- Improved operability and performance of the DPALS to increase average laser power, increase laser system efficiency, measure beam quality and reduce risks to system performance from chemical interactions\n  -- Achieved more than 4 kilowatt (kW) output power from the DPALS in FY 2014 and re-designed, fabricated, and assembled the hardware for the next step in power-scaling\n\n- In conjunction with the Defense Advanced Research Projects Agency, demonstrated a > 34 (kW) Fiber Combining Laser (FCL) scalable to high power with high efficiency and near-ideal beam quality to efficiently deliver energy to targets at long range \n  -- Successfully demonstrated the first phase of engineering packaging of the compact fiber amplifier, a critical step toward achieving compact, lightweight, power scalable fiber lasers for missile defense applications\n\n- Conducted experiments using a high altitude, low mach platform to validate directed energy lethality models and to characterize the flight environment and prototype platform performance\n   -- Conducted four flight tests and collected over 21 hours of data from take-off to altitudes of over 54,000 feet \n   -- Data collected confirmed a benign payload environment essential to directed energy platforms\n   -- Collected lessons learned for improving potential future platform design and employment\n\n- Received Industry concepts that could be used to develop and integrate a multi-kilowatt class laser into an Unmanned Aerial Vehicle for multi-mission demonstrations"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.348"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate a 10 kW subscale DPALS design with high efficiency and excellent beam quality\n\n- In conjunction with the Defense Advanced Research Projects Agency: \n-- Complete the engineering development unit for the next-generation FCL compact amplifier and complete the system concept for a mid-power flight system\n-- Upgrade the efficiency of the 42 element (34kW) FCL laboratory system and demonstrate a 40kW average power output with near-ideal beam quality\n\n- Analyze and evaluate DPALS and FCL laboratory test data, as well as power and efficiency analysis for scaling to Ballistic Missile Defense System relevant power levels\n\n- Compete contracts with Industry to define concepts that could be used to develop and integrate a multi-kilowatt class laser into an Unmanned Aerial Vehicle for multi-mission demonstrations"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.291"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.291"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Based on a successful Fiber Combining Laser 34 kilowatt (kW) demonstration and a Diode Pumped Alkali Laser 10 kW system first light,  the increase from FY 2015 to FY 2016 funds increased laser test bed power, laser packaging demonstrations, system robustness and megawatt-class scaling designs.\n\nIn FY 2016, $4.185 million of funding and content transferred to the Technology Maturation Initiatives program element, 0604115C, for prototype development. Low power laser concepts and hardware developed under this Weapons Technology program element and by Industry are technically mature enough for prototype development under the Technology Maturation Initiative program element\n\n\n- Upgrade the 10 kW DPALS laboratory demonstration system to a 30 kW-class test bed \n  -- Demonstrate a 30 kW operation with 30% electrical-to-optical (E-O) efficiency\n  -- Conduct beam quality characterization testing to validate gain cell flow uniformity\n  -- Demonstrate at low power a laser beam with the ability to tightly focus on the target (beam quality at 1.5X diffraction limited)  \n  -- Validate gain cell waveguide scaling path to higher power operation \n  -- Demonstrate improved robustness and reliability of pump diode modules\n  -- Initiate design for a 120 kW DPALS gain cell and pump delivery system\n\n- In collaboration with the Defense Advanced Research Projects Agency and the Air Force, complete the critical design review and begin fabrication and integration of the 5 kilograms (kg) per kW low size weight and power Fiber Combining Laser (FCL) system\n  -- Conduct FCL advanced beam combiner high power demonstration to verify the combiner can scale to required performance levels\n  -- Analyze and evaluate laboratory and Industry high energy laser test data for scaling to ballistic missile defense system relevant power levels\n  -- Deliver a flight qualified 1kg per kW compact fiber amplifier traceable to Ballistic Missile Defense System high energy laser system requirements\n  -- Complete the concept definition for a 100's of kW FCL system\n\n- Engage with the other Services and Industry to identify laser scaling technologies with application to the BMDS\n  -- Issue a Request for Information to Industry for alternative high energy laser technologies with scaling potential to compact, efficient, megawatt-class laser systems\n\n- Implement directed energy models and simulations to assess technology capability against expected threats, define technology gaps and identify and mitigate technical risks\n  -- In conjunction with the High Energy Laser Joint Technology Office (HEL JTO) address real-time laser deconfliction procedures and implementation mechanisms"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603176C"
                                    },
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.919"
                                        },
                                        "CurrentYear": {
                                            "val": "8.470"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.139"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.139"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.227"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.932"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.249"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.219"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603177C"
                                    },
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.642"
                                        },
                                        "CurrentYear": {
                                            "val": "36.610"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.200"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.200"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603179C"
                                    },
                                    "Title": {
                                        "val": "Advanced C4ISR"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.421"
                                        },
                                        "CurrentYear": {
                                            "val": "13.284"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.876"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.876"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.723"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "62.3040"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603180C"
                                    },
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.025"
                                        },
                                        "CurrentYear": {
                                            "val": "16.584"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.364"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.364"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.919"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.380"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.069"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.457"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603890C"
                                    },
                                    "Title": {
                                        "val": "BMD Enabling Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "368.965"
                                        },
                                        "CurrentYear": {
                                            "val": "401.971"
                                        },
                                        "BudgetYearOne": {
                                            "val": "409.088"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "409.088"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "423.092"
                                        },
                                        "BudgetYearThree": {
                                            "val": "417.831"
                                        },
                                        "BudgetYearFour": {
                                            "val": "420.104"
                                        },
                                        "BudgetYearFive": {
                                            "val": "433.604"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0604115C"
                                    },
                                    "Title": {
                                        "val": "Technology Maturation Initiatives"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "96.300"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "96.300"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "109.674"
                                        },
                                        "BudgetYearThree": {
                                            "val": "117.106"
                                        },
                                        "BudgetYearFour": {
                                            "val": "208.531"
                                        },
                                        "BudgetYearFive": {
                                            "val": "198.363"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy for Directed Energy Research consists of partnering with Industry, the Defense Advanced Research Projects Agency, the Air Force, Federally Funded Research and Development Centers and University Affiliated Research Centers.  The Missile Defense Agency (MDA) will leverage Agency and partner subject matter experts and use government model based assessments to inform Better Buying Power philosophy acquisition decisions. The MDA will then award contracts to industry and universities via the Advanced Technology Innovation Broad Agency Announcement and competitive procurements to develop and demonstrate promising components and integrated systems in realistic test environments. Directed Energy Research shapes future Ballistic Missile Defense System (BMDS) acquisition decisions by advancing and documenting the technology readiness levels of emerging and developing technology, while simultaneously assessing the performance and contributions of the technology to the BMDS architecture."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD72"
                    },
                    "ProjectTitle": {
                        "val": "Interceptor Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.953"
                        },
                        "CurrentYear": {
                            "val": "40.000"
                        },
                        "BudgetYearOne": {
                            "val": "12.967"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.967"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "FY 2015 funding was increased by $40 million for Interceptor Technology as a result of Public Law 113-235, FY2015 Omnibus; Consolidated and Further Continuing Appropriations Act.  The Electromagnetic Rail Gun effort is a continuation of systems engineering and analysis that began under the Ballistic Missile Defense Enabling Programs Program Element, 0603890C in FY 2014.\n\nIn FY 2016, $12.967 million is for advance technology efforts in interceptor technology to address an emerging threat."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Interceptor Technology project focuses on development of divert and attitude control systems (DACS) technology to enhance operational performance of future Multi-Object Kill Vehicle (MOKV). Technology investment will focus on DACS subsystem and system elements (propellant tanks, Attitude Control System and divert thrusters, and pressurant subsystems) that support longer operation, multiple discrete events, precision attitude control, safe operation and minimum kill vehicle mass.  In FY 2016, the Agency will invest in a competitive next generation solid DACS development with industry.  The Agency will define the baseline DACS requirements using analytical tools to identify mature technology capable of supporting the MOKV development. In FY 2016, the Agency will evaluate the potential contributions of DACS technology alternatives to the Ballistic Missile Defense System. The DACS concept(s) being developed for multiple object kill vehicle application will transition to implementation with the industry MOKV developers.   \n\nWe will also model and assess rail gun technology readiness, suitability, and integration requirements for ballistic missile defense applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interceptor Technology"
                                    },
                                    "Description": {
                                        "val": "The Interceptor Technology project focuses on development and test of component and sub-systems for solid propulsion divert and attitude control systems.  This project will also investigate rail gun suitability and integration requirements for ballistic missile defense applications, this is a continuation of systems engineering and analysis that began under the Ballistic Missile Defense Enabling Programs Program Element, 0603890C in FY 2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.953"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed the Cooled Gas Attitude Control System development and material characterization for a larger diameter Third Stage Rocket Motor for future Standard Missile - 3 (SM-3) interceptors.  Achieved integrated subsystem level demonstration\n\n- Conducted material characterization and component level tests to mature a multiple gas generator solid Divert and Attitude Control System (DACS) design for use in future SM-3 interceptor\n\n- Conducted material screening and characterization testing of ultra-high temperature composite materials to enable operation of a longer duration solid DACS, while also reducing mass and weight\n\n- Completed detailed design of an extinguishable solid DACS divert thruster that utilized enabling components in its design to meet stressing high temperature and pressure environments of future longer duration operations"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Develop performance measures based on multi-object kill vehicle (MOKV) government concepts \n\n- Assess solid DACS concepts\n\n- Identify solid DACS technology gaps for MOKV application and potential technology solutions\n\n- Invest with industry to develop gap filling technology solutions leading to a next generation initial DACS design for MOKV \n\n- Conduct additional material and sub-component level tests (Valve, Thruster, Accumulator) to mature a multiple gas generator solid (SDACS) design for use in future Ballistic Missile Defense System (BMDS) interceptors"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.967"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.967"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- In FY 2016, $12.967 million is for advanced technology efforts in interceptor technology to address an emerging threat.\n\n- Deliver initial design of a next generation solid DACS technology concept(s) that support multiple object kill vehicle development\n\n- Conduct initial government review and assessment of contractor(s) concepts to determine utility of alternative technology\n\n- Initiate component development testing to support government assessment and finalize concept design\n\n- Conduct government review and update assessment of contractor's final concept(s) to identify remaining gaps\n\n- Investigate preliminary rail gun technology suitability for ballistic missile defense applications"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603176C"
                                    },
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.919"
                                        },
                                        "CurrentYear": {
                                            "val": "8.470"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.139"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.139"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.227"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.932"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.249"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.219"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603177C"
                                    },
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.642"
                                        },
                                        "CurrentYear": {
                                            "val": "36.610"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.200"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.200"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603179C"
                                    },
                                    "Title": {
                                        "val": "Advanced C4ISR"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.421"
                                        },
                                        "CurrentYear": {
                                            "val": "13.284"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.876"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.876"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.723"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "62.3040"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603180C"
                                    },
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.025"
                                        },
                                        "CurrentYear": {
                                            "val": "16.584"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.364"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.364"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.919"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.380"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.069"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.457"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603890C"
                                    },
                                    "Title": {
                                        "val": "BMD Enabling Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "368.965"
                                        },
                                        "CurrentYear": {
                                            "val": "401.971"
                                        },
                                        "BudgetYearOne": {
                                            "val": "409.088"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "409.088"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "423.092"
                                        },
                                        "BudgetYearThree": {
                                            "val": "417.831"
                                        },
                                        "BudgetYearFour": {
                                            "val": "420.104"
                                        },
                                        "BudgetYearFive": {
                                            "val": "433.604"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603892C"
                                    },
                                    "Title": {
                                        "val": "AEGIS BMD"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "885.704"
                                        },
                                        "CurrentYear": {
                                            "val": "764.224"
                                        },
                                        "BudgetYearOne": {
                                            "val": "843.355"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "843.355"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "762.740"
                                        },
                                        "BudgetYearThree": {
                                            "val": "748.354"
                                        },
                                        "BudgetYearFour": {
                                            "val": "564.827"
                                        },
                                        "BudgetYearFive": {
                                            "val": "579.585"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603904C"
                                    },
                                    "Title": {
                                        "val": "Missile Defense Integration and Operations Center (MDIOC)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "50.271"
                                        },
                                        "CurrentYear": {
                                            "val": "58.503"
                                        },
                                        "BudgetYearOne": {
                                            "val": "49.211"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "49.211"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "58.074"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.655"
                                        },
                                        "BudgetYearFour": {
                                            "val": "55.194"
                                        },
                                        "BudgetYearFive": {
                                            "val": "57.162"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This effort leverages Agency and partner subject matter experts and government model based assessments to inform Better Buying Power philosophy acquisition decisions. The Agency through a competition with industry contractors will develop a next generation divert and attitude controls system based on future multiple object kill vehicle architecture and interfaces.  This Program Element shapes future Ballistic Missile Defense System acquisition decisions by advancing and documenting the technology readiness levels of emerging and developing technology, while simultaneously assessing the performance and contributions of the technology to the BMDS architecture."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.720"
                        },
                        "BudgetYearOne": {
                            "val": "2.131"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.131"
                        },
                        "BudgetYearTwo": {
                            "val": "2.435"
                        },
                        "BudgetYearThree": {
                            "val": "3.733"
                        },
                        "BudgetYearFour": {
                            "val": "3.023"
                        },
                        "BudgetYearFive": {
                            "val": "3.801"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Program-Wide Support (PWS) contains non-headquarters management costs in support of Missile Defense Agency (MDA) functions and activities across the entire Ballistic Missile Defense System (BMDS). It Includes Government Civilians, Contract Support Services, and Federally Funded Research and Development Center (FFRDC) support.  This provides integrity and oversight of the BMDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes Global Deployment personnel and support performing deployment site preparation and activation and, provides facility capabilities for MDA Executing Agent locations.  Other MDA wide costs includes:  physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office and equipment leases; utilities; data and unified communications support; supplies and maintenance; materiel and readiness and central property management of equipment; and similar operating expenses. Program Wide Support is allocated on a pro-rata basis and therefore, fluctuates by year based on the adjusted RDT&E profile (which excludes:0305103C Cyber Security Initiative, 0603274C Special Program, 0603913C Israeli Cooperative Program and 0901598C Management Headquarters)."
                        }
                    }
                }
            ]
        }
    }
}