{
    "id": "ae5e33febce0850aab482f518f06e39c78ded11a",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DLA_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603712S"
        },
        "ProgramElementTitle": {
            "val": "Logistics Research and Development Technology (Log R&D)"
        },
        "R1LineNumber": {
            "val": "52"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "66.275"
            },
            "PriorYear": {
                "val": "16.531"
            },
            "CurrentYear": {
                "val": "21.331"
            },
            "BudgetYearOne": {
                "val": "16.543"
            },
            "BudgetYearOneBase": {
                "val": "16.543"
            },
            "BudgetYearTwo": {
                "val": "16.949"
            },
            "BudgetYearThree": {
                "val": "15.989"
            },
            "BudgetYearFour": {
                "val": "16.289"
            },
            "BudgetYearFive": {
                "val": "16.625"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Logistics Agency is responsible for providing the Military Services, other Federal Agencies, along with the combined and allied forces the full spectrum of logistics, acquisition and technical services. DLA sources and provides nearly 100 percent of the consumable items the military forces need to operate – including food, fuel and energy, uniforms, medical supplies, as well as construction and barrier equipment. DLA supplies more than 85 percent of the military’s spare parts, provides logistics information data and products, manages the reutilization of military equipment, and offers document automation and production services. DLA’s Research and Development (R&D) program helps ensure that advanced logistics concepts and business processes are available in order to accomplish the Agency’s mission with the leanest possible infrastructure, using the best commercial and government sources, and applying most effective business processes.  The Logistics R&D program develops and demonstrates high risk, high payoff technology that provides a significantly higher level of support at lower costs, than would be otherwise attainable.  The program has a proven track record of implementation and benefits.  \n\nIn December 2013, the DLA Director called for greater flexibility within the R&D program in support of the Agency’s efforts to achieve its’ mission.  As a result, the R&D program is evolving from single supply chain efforts to   Strategic Focus Areas (SFAs) that will support DLA’s efforts to achieve the improvements needed to maintain mission readiness and continue fiscal stewardship while supporting the Department’s transition to peacetime operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.000"
                },
                "CurrentYear": {
                    "val": "16.836"
                },
                "BudgetYearOne": {
                    "val": "17.207"
                },
                "BudgetYearOneBase": {
                    "val": "17.207"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.531"
                },
                "CurrentYear": {
                    "val": "21.331"
                },
                "BudgetYearOne": {
                    "val": "16.543"
                },
                "BudgetYearOneBase": {
                    "val": "16.543"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.469"
                },
                "CurrentYear": {
                    "val": "4.495"
                },
                "BudgetYearOne": {
                    "val": "-0.664"
                },
                "BudgetYearOneBase": {
                    "val": "-0.664"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.951"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.518"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Appropriated Bill Increase"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "4.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.005"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.664"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.664"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The Medical On-line Business Analytics capability will be delayed depriving DLA of the ability to properly plan and monitor orders to critical medical customers.  The Supply Chain management project reductions means additional anti-counterfeiting technology will not be fully developed and implemented, increasing the risk that counterfeit parts will enter the DOD supply system. In addition, emerging additive manufacturing technology will not be available for low volume parts.  The Strategic Distribution and Reutilization reductions mean that DLA support to the COCOM’s deployments will be more costly because they will not be able to access regional suppliers through the IBEX2 system.  Reductions to the Energy readiness program mean cost increases to the Services for fuel because fewer alternative fuel additives will be available.  Finally, the reductions to the Defense Logistics Information project means DLA will not be capable of taking advantage of major advancements in Computer Aided Design\/Computer Aided Manufacturing.   \n\nFY2016 – FY2020 Restructuring: In December 2013, the DLA Director called for changes to the R&D program that would allow greater flexibility to support the Agency’s mission.  As a result, the R&D program is evolving from single supply chain efforts to a few overarching Strategic Focus Areas (SFAs) that will support its efforts to achieve the needed improvements in order to maintain mission readiness and fiscal stewardship as the Department continues transition to peacetime operations. The three Strategic Focus Areas are: \n\n1. Analytic and Decision Support:  R&D efforts undertaken to develop and implement advanced analytical tools, modeling, and simulation of logistics and supply chain processes.  These tools will improve DLA forecasting and procurement strategy decisions and lead to faster and more flexible response to emerging market and customer requirements. \n2. Logistics Processes: R&D efforts undertaken to develop and implement advanced technology in the internal DLA logistics processes. To qualify for R&D funding, the R&D effort must develop and apply technology and processes over and above current baseline IT systems and continuous improvements efforts. \n3. Innovative Products and Services for Customers: R&D efforts undertaken to develop new products and services for DLA customers including helping to achieve the operational energy strategy goals of increasing sources of supply, developing and implementing alternative fuels and emerging,  out of cycle requirements that always occur and new products and services developed by DLA.  \n\nFY2016 – FY2020  Reprogramming to Industrial Preparedness – Manufacturing Technology Program (P.E. 0708011S) \nThis change will better align the technical work with the OSD Manufacturing Technology Program initiative for the Model Based Enterprise (MBE).  The MBE will help DOD move to a completely digital environment for design and engineering data needed to conceive, design, build and support weapon systems.  The MBE is important because much of the data currently developed during the design and production weapon system life cycle is lost and has to be recreated."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Medical Logistics Network (MLN)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "6.850"
                        },
                        "PriorYear": {
                            "val": "1.532"
                        },
                        "CurrentYear": {
                            "val": "2.266"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "FY2016-FY2020 funding for this effort is split and realigned to Strategic Focus Areas #7. Analytic and Decision Support, and #8. Logistics Processes depending on the nature of the specific R&D activity being performed.  \n\nThe Medical Logistics Network (MLN)  program supports the Medical Directorate’s mission to develop and implement the critical logistics and medical supply chain business practices that ensure the cost-effective and efficient distribution of medical materiel to the full range of Military Health System operations.\n\nThe Medical Logistics Network (MLN) program anticipates future medical logistical requirements and develops strategies and tools to meet these requirements.  Operating in the unique DoD-Commercial medical logistics environment, the Medical Logistics Network program develops processes for management of DoD Medical Logistics to ensure effective and safe medical supplies support the warfighter. These business process improvements may have potential extension to other supply chains."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Logistics Network Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.532"
                                            },
                                            "Text": {
                                                "val": "Continued to deliver enhancements to extend the initial accomplishments, and the clinical standardization initiative will begin with its focus on medical\/surgical product knowledge and process improvements. Investigated the extension of the processes and capabilities for fair and reasonable pricing to other supply classes such as Subsistence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.266"
                                            },
                                            "Text": {
                                                "val": "In FY2015 the On-Demand Business Analytics (ODBA) project and possibly the Cost & Pricing project will be transitioning to sustainment. We will look to broaden the scope of Clinical Standardization to other classes of medical products such as medical equipment. Advancing Cold Chain Management (ACCM), funded and executed as multiple sub-projects, will continue into this year."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts related to MLN have been moved to the Analytic and Decision Support (A&DS) and Logistics Processes Strategic Focus Areas."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The On-Demand Business Analytics (ODBA) project was competitively bid as a task order on the Defense Logistics Standard Support Blanket Purchase Agreement (DMLSS-W BPA).  All new project execution work is being solicited through the DLA R&D Emergent Requirements 2 Broad Agency Announcement (BAA)."
                        },
                        "PerformanceMetrics": {
                            "val": "Defense Medical Logistics Transformation (DMLT):  1) The percentage of requirements supported by architecture products – Eighty-seven percent of the MedSurg Prime Vendor Program’s Gen IV Requirements are supported by architecture products.  2) Measurement of compliance with laws and regulations (e.g. Clinger-Cohen Act) that require complete enterprise architecture- 93.0% of required products passed first certification review (based on MS-B and CDR). 3) Percentage alignment between Balanced Scorecard Transformation Initiatives and Enterprise Architecture - data to be determined as initiatives are further refined."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "Weapon System Sustainment (WSS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.732"
                        },
                        "PriorYear": {
                            "val": "5.259"
                        },
                        "CurrentYear": {
                            "val": "6.074"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "FY2016-FY2020 funding for this effort is split and realigned to Strategic Focus Areas #7. Analytic and Decision Support, and #8. Logistics processes depending on the nature of the specific R&D being performed.  \n\nSupport Defense Logistics Agency (DLA) Strategic Plans Goals 1.)  Warfighter Support) and 2.)  Stewardship Excellence.  The program spans multiple weapon systems and supply chains to improve internal processes, provide new methods, reduce costs and lead times, and ultimately, improve readiness for DLA customers.  \n\nThe program is focused in three initiatives:\n1.)  Planning Process Improvement:  The program improves elements of current inventory policy models, assesses potential benefits of new technologies and seeks more efficient approaches to deliver customer requirements while reducing inventory and order fulfillment costs.  \n\n2.)  Technical\/Quality Process Improvement:  The program improves internal efficiency and customer satisfaction through new tools and methods to proactively address supply issues resulting from current technical\/quality processes.  \n\n3.)  Procurement Process Improvement:  The program will demonstrate tailored data collection and business processes for well-defined subsets of suppliers and procurement types to improve supplier responsiveness, cycle time and cost."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Weapon System Sustainment Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.259"
                                            },
                                            "Text": {
                                                "val": "Planning Process Improvements:  Customer Collaboration and Supplier Initiated Orders projects were successfully completed and transitioned.  Phase 1 of the Exchange Sale of Economic Retention Stock (ESERS) project was successfully complete by selling a sample of NIINs through the GSA.  Financial and Inventory Simulation (FINISIM) upgrades requested by DLA were successfully completed, and efforts to transition FINISIM through the J6 Front Door process were initiated by J34 and likely will continue in FY 2015.  Some enhancements to Peak\/Next Gen requested by DLA were completed, and others initiated which will be completed in FY 2015.  An assessment of the Returns process was initiated and scheduled for completion in early FY 2015.  Several Challenges from the Planning community were received, and efforts were begun to structure projects based on them.\n\nTechnical\/Quality Process Improvements:  Completed an analysis of the potential benefits of changing the definition of Critical Application Items (CAI) to “critical in engineering design or manufacturing requirements” that showed the potential of saving millions of dollars and substantial Administrative Lead Time by avoiding unnecessary Engineering Support Activity reviews.  Completed an analysis of new results-based metrics for the Technical\/Quality process, and worked with the Technical\/quality team to transition them.  Several Challenges from the Technical\/Quality community were received, and efforts were begun to structure projects based on them\n\nProcurement Process Improvements:  The Matching Acquisition Strategies to Industry Capabilities (MASIC) project was successfully completed and transitioned to J7.  WSS successfully completed an assessment of the ship recycling industry and DLA’s potential future role, and reported the results to the DLA Director as input to his decision whether or not to get back into the ship recycling business."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.074"
                                            },
                                            "Text": {
                                                "val": "Planning Process Improvements:  The ESERS, Returns, FINISIM and Peak\/Next Gen projects that were active in FY 2014 will be completed and transition efforts conducted as appropriate.  A Collaborative Planning with Military Service Industrial Maintenance Sites project will be initiated that promises to substantially improve the accuracy of demand forecasts and greatly improve support to warfighters.  New projects will be initiated based on the Challenges in the Planning area that were received in FY 2014.  In addition, collaborative efforts will be continued with the Planning Process team to develop additional new projects targeting FY 2016 awards.\n\nTechnical\/Quality Process Improvements:  A follow-on project to the CAI effort completed in FY 2014 will be initiated to work with DLA experts to develop a set of recommendation for the joint DLA\/Military Service Engineering Support Working Group to match engineering support \/ risk reduction with item criticality and procurement risk.  New projects will be initiated based on the Challenges in the Technical\/Quality area that were received in FY 2014.  In addition, collaborative efforts will be continued with the Technical\/Quality Process team to develop additional new projects targeting FY 2016 awards.\n\nProcurement Process Improvements:  A Low Demand Parts project will be initiated to improve support to items seeing low demand by identifying and assessing approaches to group such parts and recommending methods to implement approaches to acquire parts in the groups, with a goal of reducing backorders while increasing participation by small businesses.  A concerted effort will be made to identify additional projects for FY 2015 or FY 2016 starts by working with J7 personnel."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Funding and efforts related to Weapon Systems Sustainment have been moved to the Analytic and Decision Support and Logistics Processes Strategic Focus areas."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A competitive BAA was issued and awarded in FY 14.  Delivery orders will be placed against the contract."
                        },
                        "PerformanceMetrics": {
                            "val": "The WSS program supports the Director’s objectives of lower material costs, lower inventory levels and better customer support.  \n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3"
                    },
                    "ProjectTitle": {
                        "val": "Supply Chain Management (SCM)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.671"
                        },
                        "PriorYear": {
                            "val": "4.173"
                        },
                        "CurrentYear": {
                            "val": "7.022"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DLA operates in a very dynamic environment.  To meet customer expectations DLA must be able to address problems in a timely manner and be able to respond to emerging opportunities.  The Supply Chain Management Program within R&D provides the Agency with the resources needed to quickly take advantage of new ideas emerging from the Center Commanders, Process Owners, or Staff Directors."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Supply Chain Management Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.173"
                                            },
                                            "Text": {
                                                "val": "Invested in the technologies to implement advanced Supply Chain Management techniques into DLA’s Supply Chains.  DLA continued to work on reducing the Production Lead-time needed to produce critical DLA Land and Maritime items."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.022"
                                            },
                                            "Text": {
                                                "val": "During FY2015 Supply Chain Management will invest in the technologies to implement advanced Supply Chain Management techniques into DLA’s Supply Chains.  DLA is expecting to reduce the Production Lead-time needed to produce critical DLA Land and Maritime items."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY 2016 Plans: \nFunding and effort related to Supply Chain Management have been moved to the Innovative Products and Services for Customers Strategic Focus area."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects are awarded following competitive Broad Agency Announcement acquisition processes and delivery orders against competitively awarded IDIQ contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "SCM is measured on the ability to meet emerging needs that occur out of phase with the budget cycle.  \n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "4"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Distribution & Reutilization (SDR)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "15.057"
                        },
                        "PriorYear": {
                            "val": "2.288"
                        },
                        "CurrentYear": {
                            "val": "2.383"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program improves DLA’s distribution and disposition capabilities, operational effectiveness, and efficiency, in support of the Services, COCOMs, and DOD in CONUS, OCONUS, and deployed locations.  Its long-range objectives include but are not limited to: 1)  Continued improvement and integration of DLA, TRANSCOM, and Joint Service logistics planning, visibility, and Command and Control (C2) capabilities for military and humanitarian deployments; 2)  Development and integration of advanced deployable distribution and disposition capabilities, reducing DLA’s expeditionary footprint, while improving Warfighter support and resource stewardship; 3)  Improvements to DLA Distribution centers and DLA Disposition Services through insertion of state-of-the-art technologies, including intelligent material handling equipment, communications, and workload forecasting tools; 4)  Distribution and Disposition workforce developments through advanced training methods and technologies; and 5)  Intelligent end-to-end supply chain management from DLA’s inventory control points, through its distribution centers, to customers, and back to DLA Disposition for final disposition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Distribution & Reutilization (SDR) Accomplishments \/ Planned Program"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.288"
                                            },
                                            "Text": {
                                                "val": "Completed transition of First-Destination Transportation and Packaging Initiative (FDTPI) and Humanitarian Assistance\/Disaster Relief (HA\/DR) capabilities. Supported technology planning and insertions into disposition and distribution operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.383"
                                            },
                                            "Text": {
                                                "val": "Complete transition of IBex2 capabilities. Address inadequate legacy capabilities for worldwide distribution, disposition, reutilization, and retrograde operations via technology planning and insertion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts related to the SDD Program have been moved to the Analytic and Decision Support (A&DS) and Logistics Processes Strategic Focus Areas (SFA)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "SDD improves DLA distribution capability to respond to contingency and humanitarian relief operations.  \n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "5"
                    },
                    "ProjectTitle": {
                        "val": "Energy Readiness Program (ERP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "9.340"
                        },
                        "PriorYear": {
                            "val": "1.395"
                        },
                        "CurrentYear": {
                            "val": "1.743"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Program Management Office Support (PMO) for developing program strategies and goals, preparing documentation for the program, and performing quick reaction studies, including Congressionally Mandated Studies (CMS), and analysis.  Alternate Energy Development (AED) to include test and certification to support the addition of synthetic and alternative fuels to mobility fuel specifications and acquisition plan; renewable fuels studies and planning; continued study of directives related to the implementation of alternative fuels and renewable energy.  Improving Class IIIB supply chain through Current Product Improvement (CPI) (e.g. the study and development of fuel additives; studies to increase sources of supply), and Infrastructure & Process Improvement (IPI) (e.g. the development of analytical tools)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Energy Readiness Program (ERP) Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.395"
                                            },
                                            "Text": {
                                                "val": "Continued PMO support in program implementation and planning ($0.318M PMO\/CMS). Continued support of alternative\/renewable energy solution study, test, and demonstration ($0.570M AED).  Continued support Class IIIB supply chain through product improvement to increase sources, improve quality, and reduce cost. ($0.800M CPI).  Continue to support infrastructure & process improvements ($0.570M IPI)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.743"
                                            },
                                            "Text": {
                                                "val": "Continued PMO support in program implementation and planning ($0.240M PMO\/CMS). Continued support of alternative\/renewable energy solution study, test, and demonstration ($0.440M AED).  Continued support Class IIIB supply chain through product improvement to increase sources, improve quality, and reduce cost. ($0.620M CPI).  Continue to support infrastructure & process improvements ($0.440M IPI)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts funding related to Energy Readiness have been moved to the Innovative Products and Services for Customers Strategic Focus area. Continued PMO support in program implementation and planning ($0.365M PMO\/CMS). Continued support of alternative\/renewable energy solution study, test, and demonstration ($0.656M AED).  Continued support Class IIIB supply chain through product improvement to increase sources, improve quality, and reduce cost. ($0.914M CPI).  Continue to support infrastructure & process improvements ($0.656M IPI)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "At least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6"
                    },
                    "ProjectTitle": {
                        "val": "Defense Logistics Information Research (DLIR)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.625"
                        },
                        "PriorYear": {
                            "val": "1.884"
                        },
                        "CurrentYear": {
                            "val": "1.843"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "FY2016-FY2020 funding for this DLIR have been reprogrammed to the DLA Manufacturing Technology Program (P.E. 0708011S). This change will better align the technical work with the OSD Manufacturing Technology Program initiative for the Model Based Enterprise (MBE).  The MBE will help DOD move to a completely digital environment for design and engineering data needed to conceive, design, build and support weapon systems. \n\nThe Defense Logistics Information Research (DLIR) program objective is to research, identify, and implement potential or existing technologies using high-risk, high-payoff tools, methods, techniques, and products.  The DLIR program partners with commercial industry to perform short-term projects (STPs) in various logistics business areas which align with the Defense Logistics Agency’s (DLA’s) strategic vision. DLIR improves functional and business processes using the latest technologies available, which support the nation’s warfighter. The technical areas of interest are: 1.) Development of Logistics Data Interoperability & Availability. Enhances the functionality and compatibility of data in a complex data environment using supply chain relationships and lifecycle management to allow flexible visibility.  2.)  Next Generation Automated Electronic Commerce and Sourcing.  The Next Generation Automated Electronic Commerce and Sourcing technical area of interest focuses on employing the best of breed processes, practices, and technology to enable and\/or streamline electronic commerce from the customer’s point-of-need to point-of-satisfaction.\n\nDLIR is working several short term projects in the first area of interest only. They are positioning DLA to move towards a model-based enterprise (MBE), using and acquiring 3-Dimensional model-based data instead of 2-Dimensional hardcopy for weapon system sustainment and support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Logistics Information Research (DLIR) Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.884"
                                            },
                                            "Text": {
                                                "val": "Continued to identify ways for DLA to utilize the recommendations for using automated tools and processes for obtaining and exchanging technical data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.843"
                                            },
                                            "Text": {
                                                "val": "Continue work on a concept of operations (CONOPS) for using Model based technical data in Procurement\n\nDevelop automated tools and methodologies to store and deliver 3 Dimensional model data to customers so they can use Additive Manufacturing to make the part. The goal is that DLA will store, stock, and ship the model, not the part."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts related to DLIR have been moved to the Industry and Customer Collaboration Strategic Focus Area.  P.E. 0708011S"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "At least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "7"
                    },
                    "ProjectTitle": {
                        "val": "Analytic and Decision Support (A&DS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.428"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.428"
                        },
                        "BudgetYearTwo": {
                            "val": "3.616"
                        },
                        "BudgetYearThree": {
                            "val": "3.605"
                        },
                        "BudgetYearFour": {
                            "val": "3.669"
                        },
                        "BudgetYearFive": {
                            "val": "3.741"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "R&D efforts undertaken to develop and implement advanced analytical tools, modeling, and simulation of logistics and supply chain processes.  These tools will improve DLA forecasting and procurement strategy decisions and lead to faster and more flexible response to emerging market and customer requirements. Currently there are three major analytical thrusts: Planning Processes, Medical Supply Chain, and Distribution\/Disposition.  Planning processes model and simulate item and customer demand patterns to improve customer support, lower inventories and acquisition costs, and acquisition lead-times for hardware (Class IX items).  Medical Supply Chain Modeling will provide DLA the capability to integrate DLA logistics data and commercial data with satellite and political maps; it will automate for DLA Medical planners the ability to identify entities such as suppliers, customers and vendor distribution centers to enhance spatial awareness of incidents such as catastrophic events and military contingencies.  The Distribution\/Disposition thrust will develop, and implement analytical tools, models, and simulations of logistics and supply chain processes related to distribution and disposition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Analytic and Decision Support (A&DS)"
                                    },
                                    "Description": {
                                        "val": "E-Mall Access for TENTNET:  This project will make it possible for MilSpec Tent information to be available to all EMALL users.  It will expand the number of tent and shelter products that have rich technical and performance information available on DOD EMALL. The project is structured to benefit the entire tent manufacturing community by making their product more visible and, more importantly, it will improve the quality of product information available to the warfighter.  Plans include completing data collection and web design for three additional MILSPEC tents, complete modifications, and develop web-based training capability.  \n\nExtension of Supply Chain Simulation project:  This represents additional tasking for an existing project.  The project will simulate the capability of the tent supply chain to surge production under varying conditions and requirements.  We expect this project to produce an effective decision making tool for DLA’s Industrial Capabilities Programs allowing program management to evaluate the effect of placing buffer stocks at various levels within the supply chain.  Anticipate completion by Sept 2011."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "New start in FY 16"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "New start in FY 16"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.428"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.428"
                                            },
                                            "Text": {
                                                "val": "Planning Process will focus on initial capabilities of Supply chain risk management and examine the potential benefits of alternative ownership strategies for inventory.  \nFY 17: 3.616\tFY 18: 3.605\tFY 19: 3.669\tFY 20:3.741\n\nMedical Supply Chain will transition the Fair & Reasonable Evaluation (FRE) application, on the Cost & Pricing charter, to sustainment. A new project for assembly data management could be undertaken this year. \nFY 17: 0.735\tFY 18: 0.748\tFY 19: 0.765\tFY 20: 0.780\n\nDistribution and Disposition will examine alternatives to accurately account for outsourcing costs and benefits of emergency management planning.  Additionally, Distribution and Disposition will support integrated analytic and decision support to enhance decision making processes and boost the strategic value of the procurement strategy.  \nFY 17: 0. 945\tFY 18: 0. 885\tFY 19: 0. 906\tFY 20: 0. 924"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Delivery orders will be issued against competitively awarded contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "Improvements in the planning processes for DLA managed items, more accurate estimates of the cost of medical material and improvements will be made in DLA’s capability to plan for contingencies.  \n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8"
                    },
                    "ProjectTitle": {
                        "val": "Logistics Processes (LP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "7.543"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.543"
                        },
                        "BudgetYearTwo": {
                            "val": "7.956"
                        },
                        "BudgetYearThree": {
                            "val": "7.929"
                        },
                        "BudgetYearFour": {
                            "val": "8.071"
                        },
                        "BudgetYearFive": {
                            "val": "8.233"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Logistics Processes are R&D efforts undertaken to develop and implement advanced technology in the internal DLA logistics processes. To qualify for R&D funding, the R&D effort must develop and apply technology and processes over and above current baseline IT systems and continuous improvements efforts. \nThis strategic focus area has 4 thrusts: Technical\/Quality Process Improvements, Selected Process Improvements, Medical Processes, and Distribution\/Disposition Processes.  \n\nT\/Q process improvements to reduce material and internal costs and improve support to warfighters.  Specifically, Cost of Quality processes, increasing use of DOD organic manufacturing capabilities, reduction of ESA reviews caused by Critical Item Reviews.\n\nSelected process improvements cover processes outside the scope of the Technical\/Quality (T\/Q) Function including identifying improved methods for improving support for Low demand parts, accurate material receipt processes and eCommerce and catalog items as an alternative to stocking items.  \n\nMedical Processes will expand work in critical mechanisms to guarantee product quality of temperature-sensitive medical materiel distributed to our customers, and identify the most efficient and cost-effective means to deliver those medical products in accordance with FDA-labeled and other regulatory requirements.  \n\nDistribution and Disposition logistics processes deal with improving distribution and disposition capabilities, operational effectiveness, and efficiency. While numerous technologies and applications have been developed and exploited, DLA has not kept pace with the commercial industry in regards to modernizing its technology systems infrastructure, processes, or mobilizing information for personnel, customers, and processes."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "*** PLEASE ENTER CONGRESSIONAL ADD TITLE ***"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "[*** PLEASE ENTER CONGRESSIONAL ADD TEXT FOR PRIOR YEAR. ***]"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Logistics Processes (LP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "New Start in FY 16"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "New Start in FY 16"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.543"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.543"
                                            },
                                            "Text": {
                                                "val": "T\/Q efforts will include transition of the Quality cost, organic manufacturing process and Critical Application item projects initiated in FY 15.  In addition, a new effort will begin in expanding DNA Marking and developing methods to guard against malicious code entering the supply system through acquired items.  \n\nSelected Process initiatives for FY 16 include expanding the use of supplier owned and managed inventory, exploring the use of mobile technology in logistics processes and adapting commercial practices to DLA internal operations. \nFY 17: 4.318\tFY 18: 4.398\tFY 19: 4.457\tFY 20: 4.546\n\nMedical Processes could initiate a new project in real-time assembly data management to notify all Services that the items in their assemblages are obsolete and the assemblages must be modified.  \nFY 17: 1.618\tFY 18: 1.645\tFY 19: 1.683\tFY 20: 1.717\n\nThe Distribution and Disposition initiative will leverage emerging distribution and disposal technologies and state of the art reverse logistics.  \nFY 17: 2.080\tFY 18: 1.947\tFY 19: 1.993\tFY 20: 2.033"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "At least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9"
                    },
                    "ProjectTitle": {
                        "val": "Innovative Products and Services for Customers (IPSC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.572"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.572"
                        },
                        "BudgetYearTwo": {
                            "val": "5.377"
                        },
                        "BudgetYearThree": {
                            "val": "4.455"
                        },
                        "BudgetYearFour": {
                            "val": "4.549"
                        },
                        "BudgetYearFive": {
                            "val": "4.651"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Innovative Products and Services for Customers Strategic Focus Area includes R&D efforts to develop new products and services for DLA customers.  The Energy Roadmap helps to achieve the operational energy strategy goals of increasing sources of supply, developing and implementing alternative fuels.  The Supply Chain Management Roadmap addresses emerging and out of cycle requirements that always occur and new products and services developed by DLA.   \n\n\nIncluded in the budget ($1.250M) is the Print on Demand (POD) project for Mapping Enterprise Business System (MEBS) enhancements.\nDLA Headquarters\/CC mandated the POD process to establish a web-based tool for DLA Document Services to receive, order and print maps on demand.  \n\nThe enhancements improve system capabilities by implementing new and improved program data, user interface, and rules to integrate the POD business process.  These enhancements will greatly improve map services to the warfighter while significantly reducing lead times and lowering overhead costs attributed to printing, storage and shipping.  The POD Project will require an RMD to transfer funds to a new program element prior to the PB16 submission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Innovative Products and Services for Customers (IPSC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "New start in FY 16"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "New start in FY 16"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.572"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.572"
                                            },
                                            "Text": {
                                                "val": "Energy Readiness will focus on providing additional alternatives for military unique fuels, working with the Service customers to improve specifications and standards for fuel quality, engage in modeling and simulation of the energy supply chain and identifying alternative energy sources for Military Customers.  \nFY 17: 5.377\tFY 18: 4.455\tFY 19: 4.549\tFY 20: 4.651\n\nSupply Chain Management addresses the emerging technology opportunities that occur out of the budget cycle.  This allows DLA to get a head start undertaking new technological advances without disrupting ongoing programs.  In the past DLA R&D has been able to cut 12 to 24 months off the project starting lead-times.  Saving the lead-time allows the Agency to begin to realize the benefits of implementing new technology sooner than would otherwise be the case and maintain continuity of funding and activity for baseline programs.  \nFY 17: 2.607\tFY 18: 2.649\tFY 19: 2.711\tFY 20: 2.765"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive awards against a DLA BAA or Delivery Orders against MILSVC IDIQ contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "Implementing new fuel supply technology into the industrial base and meeting emerging requirements and opportunities for logistics technologies that will provide better support to the DLA mission.  \n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                }
            ]
        }
    }
}