{
    "id": "baa71398fee7f52c4e5cf68f345e6dda78954e8a",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603225D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint DOD\/DOE Munitions Technology Development"
        },
        "R1LineNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "37.366"
            },
            "PriorYear": {
                "val": "18.595"
            },
            "CurrentYear": {
                "val": "19.308"
            },
            "BudgetYearOne": {
                "val": "18.802"
            },
            "BudgetYearOneBase": {
                "val": "18.802"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "18.867"
            },
            "BudgetYearThree": {
                "val": "18.935"
            },
            "BudgetYearFour": {
                "val": "19.078"
            },
            "BudgetYearFive": {
                "val": "19.335"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, explosive, fuzing, and lifecycle technologies and tools to enable major improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment to this effort.  The JMP funds budgeted in this justification are matched dollar for dollar by DOE funds.  Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP seeks to develop technological advances in several munitions subject areas.  These include:  1) improved modeling and simulation tools for munitions design and evaluation, including evaluation of vulnerability and the design of insensitive munitions (IM), 2) novel experimental techniques and material property databases to support modeling and simulation, 3) higher power and safer explosives and propellants, 4) miniaturized, lower-cost, and higher reliability fuzes, initiators, power systems, and sensors, 5) design tools to enable development of higher performance warheads and weapons, such as penetrators, that are hardened against high impact loads, and 6) tools to assess the health and reliability of the munitions stockpile and predict lifetimes based on these assessments.  The supporting experimental research requires the development of new technologies related to the synthesis, processing, and characterization of advanced munition materials, components, and systems.  This involves energetic material research, new fuzing concepts, dynamic testing of munition materials, and advanced characterization including high-rate in-situ diagnostics.\n\nThe JMP is aligned with Department strategic plans and policies such as:\n\n•  Munitions for contingency operations, particularly for the reduction of unintended collateral effects.\n•  Reducing time and cost for acquisition of munitions.\n•  Rapidly transitioning science and technology (S&T) to support the warfighter in today’s conflicts.\n•  Establishing future core capabilities and maintaining our national S&T capabilities through joint investment and interagency cooperation and teaming.\n•  Aiding in recruiting and retaining high-caliber scientists and engineers at DoD S&T organizations.\n•  Developing advanced munitions technologies to support the increased role of conventional weapons to deter and respond to non-nuclear attack, as described in the Nuclear Posture Review report.\n•  Developing safer munitions that are compliant with IM standards to meet statutory and Department policy requirements.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers.  This community develops technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Secretary of Defense (OSD) and reviewed annually by the Munitions Technical Advisory Committee (TAC), which is comprised of over 25 senior executives from the Army, Navy, Air Force, Special Operations Command, the Defense Threat Reduction Agency, OSD, and DOE.  Projects are organized in eight Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCGs conduct semi-annual technical peer reviews of JMP projects and plans.  DoD Service laboratory technical experts lead each of the TCGs to ensure that the technologies under development address high-priority DoD needs.  The JMP also promotes more in-depth technical exchange via short-term visiting scientist and engineer assignments at both the DOE and the DoD laboratories.\n\nThe JMP has a long history of successful transitions and significant Return on Investment (ROI).\n\n•  The JMP is the primary developer of high-performance structural mechanics computer codes used by DoD, and the primary source for transitioning these codes to the DoD.  JMP computational tools are critical to the development and support of DoD programs; a recent tabulation shows that well over 50 DoD programs have been supported by these DOE codes.  For FY 2014 it is projected by the High Performance Computing Modernization Program (HPCMP) that JMP-supported codes will have accounted for 82 percent of all HPCMP Central Processing Unit (CPU) hours, including virtually all HPCMP classified computing.  The total CPU hours represents an eight-fold increase from FY 2012.  The Department expects this heavy reliance on DOE codes to continue for several reasons, including: preference for using DOE codes because they are export-controlled; DOE codes are scalable, incorporate multiphysics, and run on massively parallel computer systems; and the Department can obtain source codes to modify for individual Service needs.\n     -  A significant number of defense industrial contractors also use the DOE structural mechanics computer codes.\n     -  CHEETAH, a standalone thermochemical computer code, is the most widely used code by DoD and defense contractors for predicting performance of energetic materials.\n     -  The Army Armament Research, Development & Engineering Center (ARDEC) has stated that the DOE computer codes are now routinely used to design all new warheads.  The use of these tools has reduced the number of validation tests required for each new warhead from about five to one with concomitant cost and time savings.\n     -  The Army Research Laboratory has used DOE computer codes to develop and deploy new armor solutions to Iraq and Afghanistan with unprecedented speed.\n•  New munitions’ case material and explosive fill technologies provide the warfighter with a lethal and low collateral damage capability.  These technologies have been transitioned to the Focused Lethality Munition variant of the Small Diameter Bomb, which is currently fielded.  The technologies were also the basis for a new GBU 129 weapon that has been developed to meet a Joint Urgent Operational Need requirement for a low-collateral MK-82 class weapon.  The GBU-129\/B received the 2014 William J. Perry Award from the Precision Strike Association, recognizing significant contributions to the development, introduction, or support of precision strike systems.\n•  The Joint Improvised Explosive Device Defeat Organization (JIEDDO) has supported applications of JMP technologies, including:  compact synthetic aperture radar (SAR) systems for counter-Improvised Explosive Device (IED) efforts; pre-deployment training of military personnel by DOE explosive experts on how to recognize feed stocks and processes for homemade explosives; and use of massively parallel, multiphysics computer codes to understand how explosive blast waves cause brain injury and how to mitigate these injuries.\n•  The JMP-supported CTH and Sierra codes were used for the Air Force Massive Ordnance Penetrator (MOP) Quick Reaction Effort (QRC), and the Air Force Research Laboratory Conventional Survivable Ordnance Package (CSOP).\n•  An erosive initiator technology developed under the JMP has been transitioned to the Services for use in selectable output weapons and self-destruct capabilities.\n•  A novel approach to controlling the sensitivity and therefore the initiability of explosives using microwave energy, as well two new, insensitive energetic materials have transitioned to development projects in the Joint IM Technology and Joint Fuze Technology Programs.\n•  Reliability analysis tools were used by Army Missile Command to assess Rolling Airframe Missile (RAM), Advanced Medium Range Air to Air Missile (AMRAAM), and Tube-launched, Optically-tracked, Wire command data-linked guided Missile (TOW).\n•  Robotic demilitarization processing systems were installed at several locations, including a system at Hawthorne Army Depot to recover copper shape charge liners, Comp A5, and grenade bodies. \n•  Characterization and analysis of the Army’s Excalibur fusible plug resulted in a savings of at least $2.000 million.\n\nThe JMP also works with the Defense Ordnance Technology Consortium (DOTC) and the National Armaments Consortium (NAC) of industrial suppliers to equitably and efficiently transition JMP technologies to defense industrial contractors.  In addition to the computer codes mentioned earlier, the JMP has transitioned case technology for low-collateral weapons, low-temperature co-fired ceramic technology for smaller, less expensive fuze electronic components, and erosive initiator technology for selectable effects weapons to defense industrial suppliers.\n\nThe integrated DoD and DOE efforts within the JMP are transitioning new munitions’ technologies to the Department and the defense industrial base through the advanced development process.  The JMP is a focal point for collaborative work by nearly 300 DoD and DOE scientists and engineers.  Technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments.  The highly challenging technical objectives of the 33 current JMP projects require multi-year efforts and sustained, long-term investments to achieve success.\n\nThe JMP projects are divided into five technical focus areas:  1) Computational Mechanics and Material Modeling, 2) Energetic Materials, 3) Initiators, Fuzes, and Sensors, 4) Warhead and Penetration Technology, and 5) Munitions Lifecycle Technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.292"
                },
                "CurrentYear": {
                    "val": "19.335"
                },
                "BudgetYearOne": {
                    "val": "19.514"
                },
                "BudgetYearOneBase": {
                    "val": "19.514"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.595"
                },
                "CurrentYear": {
                    "val": "19.308"
                },
                "BudgetYearOne": {
                    "val": "18.802"
                },
                "BudgetYearOneBase": {
                    "val": "18.802"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.697"
                },
                "CurrentYear": {
                    "val": "-0.027"
                },
                "BudgetYearOne": {
                    "val": "-0.712"
                },
                "BudgetYearOneBase": {
                    "val": "-0.712"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.009"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.688"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment for Higher Priority Programs"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.659"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.659"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC SEC 8104"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.027"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.053"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.053"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding decreases were used to pay for higher priority DoD Bills."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P225"
                    },
                    "ProjectTitle": {
                        "val": "Joint DOD\/DOE Munitions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "37.366"
                        },
                        "PriorYear": {
                            "val": "18.595"
                        },
                        "CurrentYear": {
                            "val": "19.308"
                        },
                        "BudgetYearOne": {
                            "val": "18.802"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.802"
                        },
                        "BudgetYearTwo": {
                            "val": "18.867"
                        },
                        "BudgetYearThree": {
                            "val": "18.935"
                        },
                        "BudgetYearFour": {
                            "val": "19.078"
                        },
                        "BudgetYearFive": {
                            "val": "19.335"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, explosive, fuzing, and lifecycle technologies and tools to enable major improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment to this effort.  The JMP funds budgeted in this justification are matched dollar for dollar by DOE funds.  Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP seeks to develop technological advances in several munitions subject areas.  These include:  1) improved modeling and simulation tools for munitions design and evaluation, including evaluation of vulnerability and the design of insensitive munitions (IM), 2) novel experimental techniques and material property databases to support modeling and simulation, 3) higher power and safer explosives and propellants, 4) miniaturized, lower-cost, and higher reliability fuzes, initiators, power systems, and sensors, 5) design tools to enable development of higher performance warheads and weapons, such as penetrators, that are hardened against high impact loads, and 6) tools to assess the health and reliability of the munitions stockpile and predict lifetimes based on these assessments.  The supporting experimental research requires the development of new technologies related to the synthesis, processing, and characterization of advanced munition materials, components, and systems.  This involves energetic material research, new fuzing concepts, dynamic testing of munition materials, and advanced characterization including high-rate in-situ diagnostics.\n\nThe JMP is aligned with Department strategic plans and policies such as:\n\n•  Munitions for contingency operations, particularly for the reduction of unintended collateral effects.\n•  Reducing time and cost for acquisition of munitions.\n•  Rapidly transitioning science and technology (S&T) to support the warfighter in today’s conflicts.\n•  Establishing future core capabilities and maintaining our national S&T capabilities through joint investment and interagency cooperation and teaming.\n•  Aiding in recruiting and retaining high-caliber scientists and engineers at DoD S&T organizations.\n•  Developing advanced munitions technologies to support the increased role of conventional weapons to deter and respond to non-nuclear attack, as described in the Nuclear Posture Review report.\n•  Developing safer munitions that are compliant with IM standards to meet statutory and Department policy requirements.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers.  This community develops technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Secretary of Defense (OSD) and reviewed annually by the Munitions Technical Advisory Committee (TAC), which is comprised of over 25 senior executives from the Army, Navy, Air Force, Special Operations Command, the Defense Threat Reduction Agency, OSD, and DOE.  Projects are organized in eight Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCGs conduct semi-annual technical peer reviews of JMP projects and plans.  DoD Service laboratory technical experts lead each of the TCGs to ensure that the technologies under development address high-priority DoD needs.  The JMP also promotes more in-depth technical exchange via short-term visiting scientist and engineer assignments at both the DOE and the DoD laboratories.\n\nThe JMP has a long history of successful transitions and significant Return on Investment (ROI).\n\n•  The JMP is the primary developer of high-performance structural mechanics computer codes used by DoD, and the primary source for transitioning these codes to the DoD.  JMP computational tools are critical to the development and support of DoD programs; a recent tabulation shows that well over 50 DoD programs have been supported by these DOE codes.  For FY 2014 it is projected by the High Performance Computing Modernization Program (HPCMP) that JMP-supported codes will have accounted for 82 percent of all HPCMP Central Processing Unit (CPU) hours, including virtually all HPCMP classified computing.  The total CPU hours represents an eight-fold increase from FY 2012.  The Department expects this heavy reliance on DOE codes to continue for several reasons, including: preference for using DOE codes because they are export-controlled; DOE codes are scalable, incorporate multiphysics, and run on massively parallel computer systems; and the Department can obtain source codes to modify for individual Service needs.\n     -  A significant number of defense industrial contractors also use the DOE structural mechanics computer codes.\n     -  Cheetah, a standalone thermochemical computer code, is the most widely used code by DoD and defense contractors for predicting performance of energetic materials.\n     -  The Army Armament Research, Development & Engineering Center (ARDEC) has stated that the DOE computer codes are now routinely used to design all new warheads.  The use of these tools has reduced the number of validation tests required for each new warhead from about five to one with concomitant cost and time savings.\n     -  The Army Research Laboratory has used DOE computer codes to develop and deploy new armor solutions to Iraq and Afghanistan with unprecedented speed.\n•  New munitions’ case material and explosive fill technologies provide the warfighter with a lethal and low collateral damage capability.  These technologies have been transitioned to the Focused Lethality Munition variant of the Small Diameter Bomb, which is currently fielded.  The technologies were also the basis for a new GBU 129 weapon that has been developed to meet a Joint Urgent Operational Need requirement for a low-collateral MK-82 class weapon.  The GBU-129\/B received the 2014 William J. Perry Award from the Precision Strike Association, recognizing significant contributions to the development, introduction, or support of precision strike systems.\n•  The Joint Improvised Explosive Device Defeat Organization (JIEDDO) has supported applications of JMP technologies, including:  compact synthetic aperture radar (SAR) systems for counter-Improvised Explosive Device (IED) efforts; pre-deployment training of military personnel by DOE explosive experts on how to recognize feed stocks and processes for homemade explosives; and use of massively parallel, multiphysics computer codes to understand how explosive blast waves cause brain injury and how to mitigate these injuries.\n•  The JMP-supported CTH and Sierra codes were used for the Air Force Massive Ordnance Penetrator (MOP) Quick Reaction Effort (QRC), and the Air Force Research Laboratory Conventional Survivable Ordnance Package (CSOP).\n•  An erosive initiator technology developed under the JMP has been transitioned to the Services for use in selectable output weapons and self-destruct capabilities.\n•  A novel approach to controlling the sensitivity and therefore the initiability of explosives using microwave energy, as well two new, insensitive energetic materials have transitioned to development projects in the Joint IM Technology and Joint Fuze Technology Programs.\n•  Reliability analysis tools were used by Army Missile Command to assess Rolling Airframe Missile (RAM), Advanced Medium Range Air to Air Missile (AMRAAM), and Tube-launched, Optically-tracked, Wire command data-linked guided Missile (TOW).\n•  Robotic demilitarization processing systems were installed at several locations, including a system at Hawthorne Army Depot to recover copper shape charge liners, Comp A5, and grenade bodies. \n•  Characterization and analysis of the Army’s Excalibur fusible plug resulted in a savings of at least $2.000 million.\n\nThe JMP also works with the Defense Ordnance Technology Consortium (DOTC) and the National Armaments Consortium (NAC) of industrial suppliers to equitably and efficiently transition JMP technologies to defense industrial contractors.  In addition to the computer codes mentioned earlier, the JMP has transitioned case technology for low-collateral weapons, low-temperature co-fired ceramic technology for smaller, less expensive fuze electronic components, and erosive initiator technology for selectable effects weapons to defense industrial suppliers.\n\nThe integrated DoD and DOE efforts within the JMP are transitioning new munitions’ technologies to the Department and the defense industrial base through the advanced development process.  The JMP is a focal point for collaborative work by nearly 300 DoD and DOE scientists and engineers.  Technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments.  The highly challenging technical objectives of the 33 current JMP projects require multi-year efforts and sustained, long-term investments to achieve success.\n\nThe JMP projects are divided into five technical focus areas:  1) Computational Mechanics and Material Modeling, 2) Energetic Materials, 3) Initiators, Fuzes, and Sensors, 4) Warhead and Penetration Technology, and 5) Munitions Lifecycle Technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Computational Mechanics and Material Modeling"
                                    },
                                    "Description": {
                                        "val": "Projects in this technical focus area develop physics-based computational tools, material models, and calibration and validation databases that support the design and development of weapon systems.  These capabilities are intended to predict the complex phenomena across significant length, meso to continuum, and time, microsecond to minute, scales.  The tools will provide coupled, multi-physics and chemistry modeling capabilities that are scalable to massively parallel architectures for solving very diverse problems across the weapons systems’ research and development and acquisition communities.  Numeric tools are the foundation that makes possible the integration of mechanics, materials science, physics, and chemistry.  This focus area also includes an extensive experimental component consisting of either:  1) phenomenological or “discovery” experiments that provide the physics basis for model development, 2) experiments directly coupled to model development and application, such as characterization, calibration, and validation experiments, or 3) the development of advanced test methods or device development.\n\nThe specific projects in computational mechanics and material modeling are:\n\n-  CTH shock physics and Sierra\/Solid Mechanics (SM) codes & model development and supporting experiments.\n-  Arbitrary Lagrangian-Eulerian Three-Dimensional (ALE3D) code and model development.\n-  Composite case technology and modeling.\n-  Dynamic properties of materials.\n-  Energetic materials and polymers under dynamic and thermal loading.\n-  Fragment impact and response experiments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.838"
                                            },
                                            "Text": {
                                                "val": "-  Completed Taylor impact investigation examining the friability of explosives and propellants.  This work is a required step to quantifying damage in explosives relevant to high explosive (HE) safety assessments.  A broad range of explosives and propellants were included such that material-to-material variations could be investigated.\n-  Completed energetics damage experiments, including rubbery tear, interfacial damage, friability, and shear-dominated impact experiments, on PBX 9501 and Composition B explosives with accompanying simulations.  This work is critical to determining a HE ignition criterion under dynamic impact events. \n-  Completed analysis of PBXN-9 data set to provide consistent parameter sets for DoD and the DOE codes.\n-  Performed impact and direct initiation experiments on off-specification PBXN-9 to ascertain change in performance and safety.\n-  Launched larger-diameter steel balls into PBX 9502 targets to collect data for Generalized Initiation Criteria.\n-  Incorporated shear into two-component localization model to move toward a general damage model capability.\n-  Developed and applied methods to incorporate three-dimensional microstructure data into continuum calculations.\n-  Responded to and provided support for 300-400 inquiries to the ALE3D help line.  Distributed ALE3D 4.20 code suite to approximately 50 sites.\n-  Released ALE3D with improvements in updated high explosive lighting times, with detonation shock dynamics as the analysis progresses.\n-  Developed User Defined Functions (UDF) for “plug-in” material models.\n-  Provided ability to seed damage initiation sites to Polycrystalline models for capturing spall failure.\n-  Implemented rate-sensitive damage model into ALE3D validated against experimental data.\n-  Completed initial manufacturing variable study of composite materials.\n-  Finished Nano-indentation tests on samples prepared from the standard filament wound carbon fiber tube in FY 2014.\n-  Enhanced the ALE3D\/ALE3D code coupling through FEusion interface by providing a parallel implementation.\n-  CTH Version 11.0 released with several new constitutive models.  \n-  Implemented robust and accurate coupling between Sierra\/Structural Mechanics (Sierra\/SM) and CTH, including documented examples. \n-  Sierra\/SM released 4.32 in April 2014.\n-  Performed experiments on detonation propagation through inert materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.703"
                                            },
                                            "Text": {
                                                "val": "-  Transition Mechanically Activated Thermal Chemistry (MATCH)-ignition model to DOE code teams.\n-  Develop capability to launch fragment with multiple impact points.\n-  Complete integrated 3D damage simulation w\/ mesoscale input for CartaBlanca calculation.  Begin transition of CartaBlanca as general tool for use in typical DoD weapon calculations.\n-  Complete supporting experiments on quasi-static shear localization, in situ 3D damage evolution, and mini-bulge damage test and interaction with modeling community regarding results.\n-  Enhance ALE3D code capabilities through continued development of implicit multi-physics.\n-  Develop improved continuum models that couple void nucleation to shear band failure.\n-  Enhance the modeling of material failure and fragmentation via void insertion coupled directly through the GursonD model.\n-  Account for dynamic strength increase characterized by modeling and simulation with theoretical treatment available in internal prerelease ALE3D. \n-  Characterize shock and damping response of commonly used carbon fiber materials, and explore relevant modeling techniques. \n-  Test munition representative filament-wound carbon fiber composite tubes using a split Hopkinson apparatus.\n-  Demonstration of structural collapse capabilities utilizing Sierra\/CTH coupling with advanced material modeling capabilities.\n-  Release CTH Versions 11.1 and 11.2 with improved reactive flow modeling, enhanced algorithms for multimaterial behavior, and emphasis on hardware, software environments for developing\/emerging technologies for use with CTH.\n-  Sierra\/SM versions 4.36 and 4.38 planned for FY 2015 release.\n-  Design and conduct new experiments to further validate or refine the Generalized Initiation Criterion.\n-  Perform experiments utilizing near-field High Energy Diffraction Microscopy (HEDM) and tomography on void nucleation in titanium.\n-  Complete supporting experiments on quasi-static shear localization, in situ 3D damage evolution, and mini-bulge damage test and interaction with modeling community regarding results."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.588"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.588"
                                            },
                                            "Text": {
                                                "val": "-  Final report on experimental quantification of microstructure, interfaces, and damage in relation to mechanical behavior for energetic materials.\n-  Glassy Amorphous Polymer (GAP) Damage model transition to DOE code teams.\n-  Coupled Fast Fourier Transform (FFT) and\/or ViscoPlasticSelfConsistent (VPSC) models with Damage Evolution implemented in ALE3D for use by DoD community in calculations requiring efficient treatment of plasticity.\n-  Complete meso-scale study of stress conditions and statistics of loading in the vicinity of grain boundaries for DoD tantalum (Ta).\n-  Demonstration of Uncertainty Quantification (UQ) Capabilities in Sierra coupled codes through integration with the Sierra user interface (UI).\n-  Enhance High-Energy Diffraction Microscopy (HEDM) capability to larger plastic deformation.\n-  Incorporate Thermal\/Equation of State (EOS) data in material model parameter database.\n-  Enable 2D corner turning in Detonation Shock Dynamics (DSD) code.\n-  Test and model damping response in composite specimens.\n-  Minimum Signature Propellant-1 (MSP-1) characterized for Reactive Flow Model(s) and analysis of Army Burn-to-Violent-Reaction (ABVR) test and integrated experiments.\n-  Over-driven EOS and sound speed experiments on relevant energetic materials using two-stage or three-stage gun.\n-  Demonstration of Uncertainty Quantification (UQ) Capabilities in Sierra coupled codes through integration with the Sierra UI.\n-  Release CTH versions 11.3 and 12.0.  Incorporate exascale improvements in version 12.0."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energetic Materials (EM)"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new EMs and supporting technologies to satisfy the competing requirements for smaller, more lethal, and safer munitions.  Work is primarily focused on explosives, gun and rocket propellants, and, to a lesser extent, pyrotechnics.  The projects include development of: 1) new EMs, including new molecules in a range of particle sizes and morphologies, 2) new EM formulations, 3) a fundamental understanding of energetic properties and performance, and 4) computational tools for analysis of performance and sensitivity.  New materials and formulations are developed with the recognition that costs must be reasonable, chemical feed stocks reliable, and manufacturing processes suitable for scale-up to production levels.\n\nBoth Federal statute and Department policy direct the development of safer, less sensitive munitions.  Making munitions less sensitive while maintaining explosive or propellant performance is a difficult challenge.  This goal is best attained through a combination of new EM development, EM characterization, and more sophisticated modeling and simulation tools.  It is cost prohibitive to qualify weapons for compliance with insensitive munitions requirements through testing alone.  A better, and in many cases the only means, to qualify these weapons is with the combination of analysis based on validated computational tools and a few well-designed tests.\n\nThe Department also needs munitions that provide selectable effects.  To achieve these effects, weapons designers need to thoroughly understand the performance of EMs used in both the main weapon fill and the initiation systems.  Distributed fuzing systems can provide selectable effects as well as safer munitions, but such complex, small-scale systems require more complete knowledge of EM detonation physics and in some cases, new EMs designed for this application.\n\nThe desire for smaller and lighter munitions is driven in large part by the increasing dependence on unmanned weapons platforms and to some extent by the need to reduce logistical burden, especially energy consumption.  New EMs are needed to meet the munitions weight and size requirements while maintaining lethality and safety.\n\nThe Department is working to increase the range and velocity of weapons and to develop weapons against hardened targets.  These applications subject EMs to high accelerations and shock loads.  To support the development of these new systems, we need to improve our ability to model EM under higher impact loads and to characterize relevant properties to determine their ability to survive in these aggressive environments.  We may also need to develop new, more robust EMs that survive impact loads while maintaining lethality and initiability.\n\nThe specific projects in the energetic materials technical focus area are:\n-  Synthesis, properties, and scale-up of new energetic compounds.\n-  Insensitive munitions and surety.\n-  Cheetah thermochemical code development and experiments.\n-  Micro and nano-energetics synthesis and initiation.\n-  Hazards analysis of energetic materials.\n-  Reactive processes in energetic materials.\n-  Development of tools for energetic material performance characterization.\n-  Explosives chemistry and properties, and new energetic materials formulation.\n-  Thermal response of energetic materials.\n-  Electromagnetic response of energetic materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.162"
                                            },
                                            "Text": {
                                                "val": "-  Investigated the complex permittivity of PBX 9502, Composition B (CompB) and IMX 101 under x-ray exposure.\n-  Performed burn rate studies on promising burn rate modifiers including tetranitrobiimidazole (N4BIM) salts.\n-  Captured reaction (ignition) front measurements in damaged energetic materials.\n-  Performed porous and pristine minimum signature propellant (MSP) shock initiation experiments for recompaction ignition of damaged material detonation transition model.\n-  Synthesized 25-50 grams of LLM-196 and LLM-198 and their nitrogenous salts for evaluation by Navy partners.\n-  Characterized the damage evolution of PBX 9502 and Ammonium Perchlorate (AP) propellant, including the determination of permeability as a function of temperature history.\n-  Synthesized the target explosive compounds LLM-212, LLM-215, LLM-217, and LLM-221 scaled-up to the 10 grams level, and the compounds characterized by small-scale safety test, density, and heat-of-formation measurements. \n-  Based on data from One-Dimensional Time to Explosion (ODTX) and Sandia Instrumented Thermal Ignition (SITI) experiments, developed an ignition model for PBX 9502 that replicates the effects of ullage and venting over a range of conditions.\n-  Completed development of Ignition and Growth reactive flow model parameterization for a Minimum Signature Propellant. \n-  Completed short-pulse shock initiation in HMX-based explosives with reactive meso-scale simulations.  Delivered completed Disc Acceleration eXperiment (DAX) design for conventional energetic materials.\n-  Continued validation of post-detonation carbon kinetics and application to cylinder experiments for carbon rich explosives.\n-  Continued development of bismuth and antimony thermochemistry, and expanded alkaline thermochemistry. \n-  Developed a deposition condition that allows higher throughput deposition of hexanitrostilbene (HNS) with film thickness >200 μm and thick enough to detonate.\n-  Reported on chemical interactions that control thermal response of IMX-104 (Army Explosive), aging of RDX (DoD Explosive), processes that control release of reactive oxygen in KClO4 pyrotechnic oxidizers, and interaction between FOX-12 and RDX (Navy Propellants).\n-  Delivered report on burn rate studies on promising burn rate modifiers including tetranitrobiimidazole (N4BIM) salts.\n-  Conducted pre-ignition x-ray experiments on IMX-104 and Comp B explosives to help inform potential replacement issues.\n-  Dynamic radiographic experimental series performed on PBX 9502 explosive to interrogate insensitivity mechanism.\n-  Determined conditions for multiple material (e.g., co-crystal) formation and test for homogeneous or heterogeneous nucleation.\n-  Reported on interaction between two Navy Propellants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.364"
                                            },
                                            "Text": {
                                                "val": "-  Deliver a fully integrated, electromagnetic, heat transport, kinetic, mechanical, and hydrodynamic, model for down-selected energetic materials.\n-  Report on the overall performance results for shock and thermal initiation, including environmental effects, model predictions, etc. of down-selected energetic materials.\n-  Investigate the sensitivity properties of synthesized C, H, N, O oxidizers.\n-  Systematically evaluate and improve code predictions at low pressure\/high temperature for specific impulse calculations and gun propellants by expanding library of gaseous and condensed products available for such calculations, as well as available ingredients.\n-  Benchmark High Explosive Reaction to Mechanical Stimulus (HERMES) model to sub-detonative fragment impact response experiments.\n-  Perform cook-off-induced Deflagration to Detonation Transition (DDT) experiments.\n-  Deliver completed DAX design for non-ideal EMs.\n-  Scale-up the synthesis of new compounds (e.g., LLM-200, LLM-196, LLM-198, LLM-175 and LLM-201) to produce 20-30 grams for performance testing and heat-of-formation measurements.\n-  Understand effects of incorporated metal films on propagation and detonation phenomena.  Complete experiments on incorporation of metal films; one metal, two configurations, into deposited explosive.\n-  Publish best available models and SITI data for pressure dependence and gas generation rates of thermal decomposition of a representative MSP and Pentaerythritol tetranitrate (PETN).\n-  Complete aging study of underwater explosive formulations and\/or ingredients.\n-  Investigate reactive processes that occur during shock loading of PETN and\/or HNAB. \n-  Perform MSP shock initiation experiments on pristine and damaged powder for Unknown-to-Detonation Transition (XTD) model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.949"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.949"
                                            },
                                            "Text": {
                                                "val": "-  Synthesize and characterize new tri-, quadri-, and penta-cyclic oxadiazoles as both high-power and insensitive target molecules.\n-  Experimentally correlate burn rates to thermal damage state and publish results.\n-  Experimentally benchmark High Explosive Response to Mechanical Stimulus (HERMES) sub-detonative response model, including sensitivity study. \n-  Deliver first kinetics tool for non‐ideal energetic materials (Front Curvature).\n-  Model DAX data together with kinetics data, enabling Jones-Wilkins-Lee Equation-of-State model (JWL ++) validation.\n-  Release Cheetah 8.0 code.\n-  Report on initiation properties study on deposited explosive. \n-  Report demonstrating use of laser heating and fast mass spectrometry to investigate ignition in energetic materials. \n-  Characterize polymeric energetic binder candidates.\n-  Full dynamic radiographic comparison of CompB and IMX 104 explosives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Initiators, Fuzes, and Sensors"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new materials, components, diagnostic techniques, and modeling and simulation tools for fuzing systems.  Initiators, fuzes, and sensors must work reliably together to prevent unintended detonation, to correctly detect intended targets, and to initiate detonation when required.  Projects in this focus area support the Department’s needs to miniaturize fuzing systems.  Smaller systems are required for several reasons including: 1) compatibility with smaller and lighter weapons systems, 2) trading volume in munitions for other components such as additional explosives, higher energy and power density power sources, or enhanced guidance systems, 3) increasing reliability through redundancy, for example, using of two or more smaller initiating systems, and 4) upgrading existing sub-munitions with smarter and more reliable fuzing systems. \n\nThe miniaturization of fuzing systems requires new material and components, new power systems, new diagnostic techniques, and improved modeling tools for microdetonics.  The Department also needs weapons systems with selectable effects, and these effects may be achieved with multi-point initiation systems.  Such systems are inherently more complex and require improved characterization of initiator materials and components, as well as more sophisticated modeling and simulation tools.  To attain greater precision and to avoid unintended collateral effects when weapons are used in the complex environment of counter-insurgency or counter-terrorist operations, target sensors must be reliable and provide high-fidelity discrimination.  Projects in this focus area are developing technologies to achieve this level of performance in compact packages.\n\nThe specific projects in the initiators, fuzes, and sensors technical focus area are:\n\n-  Firing Systems Technology, comprising FireMod firing set code model development and validation, 1.6 hazard classification detonator development, and initiation and detonation physics on the millimeter scale.\n-  Safe, Arm, Fuze and Fire Technology, comprising Initiation and Detonation, and Advanced Firing System Components.\n-  Advanced Initiation Systems, comprising diagnostics development, microdetonics, miniature initiation systems, and detonators for enhanced safety.\n-  Thermal Battery Performance Modeling to develop a multi-physics modeling capability for thermal batteries.\n-  Thin Film Thermal Batteries (new start for FY 2015) to develop, mature, and transition a method to produce a thin, conformal, low-cost thermal battery.\n-  Vertical-Cavity Surface-Emitting Laser (VCSEL) sensors for proximity fuzing of munitions.\n-  Enabling Robust, Mode-Agile GPS-Denied Weapon Guidance through High-Efficiency Data Processing (new start for FY 2015)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.104"
                                            },
                                            "Text": {
                                                "val": "-  Delivered data packages on DoD detonators to the respective technical POCs as the tests were completed.\n-  Built and released tabular equation of state (EOS) for CL-20 explosive.\n-  Demonstrated electrochemical modeling for a single-cell battery within the Sierra code framework.\n-  Demonstrated methodology for using microstructural data and performance data in grain-scale and continuum simulations.\n-  Performed microstructural characterization of CL-20 and HMX.\n-  Validated ALEGRA-MHD, magneto hydrodynamics, simulations of flyer launch for Explosive Foil Initiators (EFIs). \n-  Optimized tape-cast barium titanate (BTO) device using nanoparticle precursors.\n-  Developed platform and process for measuring the permittivity of discrete nanoparticles in solution.\n-  Completed several major capability enhancements to the Thermally Activated Battery Simulator (TABS) software.  Building on the previous thermal system modeling capability, TABS V3, includes support for center hole fired geometries, burn front modeling of battery activation and electrochemistry prediction.  \n-  Fired two additional gas-gun shots for high-pressure, unreacted LX-17 explosive to establish shock Hugoniot.\n-  Tested three commercial Number-eight Blasting Caps.\n-  Released series of packaging design guides covering material characterization, component residual stress, fuze residual stress, coupled physics stress, and model validation experiments.\n-  Applied Shock Wave Image Framing Technique (SWIFT) diagnostic to study the performance of Hiper detonator housings containing a variable density of RSI-007 high explosive.\n-  Identified and integrated new laser backlight into SWIFT. \n-  Completed series of experiments at the Advanced Photon Source (APS) to study the interaction between initiators and detonator explosives with the goal to definitively establish initiation mechanisms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.668"
                                            },
                                            "Text": {
                                                "val": "-  Measurement of temperature dependent impedance of battery separator as a function of applied load.\n-  Delivery of desktop code with a Graphical User Interface (GUI) for coupled thermal & mechanical capability for axisymmetric battery geometry materials designed to start explosive decomposition via photo-dissociation.\n-  Perform experiments to assess wave divergence in charge transfer systems by measuring the effect of corner turning on booster diameter for insensitive explosives.\n-  Develop next generation of the four-channel embedded Fiber Bragg Grating (FBG) for detonation wave diagnostics.\n-  Determine the performance parameters, including combustion  and detonation, deposition surface mobility and susceptibility to boundary conditions of energetic materials deposited using microelectromechanical systems (MEMS) compatible techniques.\n-  Develop tabular equations of state for explosives, e.g., TATB, PETN and binder\/HE combinations, e.g., RSI-007, PBX’s.\n-  Assess performance of encapsulated components in fuze-like geometries in quasi-static and dynamic environments.\n-  Develop lower-divergence 980 nanometer emitter arrays for Vertical-Cavity Surface-Emitting Laser (VCSEL) based proximity fuze.\n-  Develop low-divergence VCSEL emitters that enable two times improvement in array pitch density, four times greater power.\n-  Unreacted Hugoniot measurements using gas-gun on LX-17 and IMX-101 explosives.\n-  Demonstrate high-Weibull modulus electric breakdown behavior in chemically thinned glass dielectrics and scale Weibull parameters to designed multilayer glass capacitor (MLGC). \n-  Demonstrate multilayer processing technology for glass dielectrics to produce 20nF capacitors able to withstand 2000Vdc.\n-  Determine continuum burn model parameters for detonator-grade explosives.\n-  Report summarizing sensor parameter space coupled with customer weapons guidance requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.645"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.645"
                                            },
                                            "Text": {
                                                "val": "-  Deliver modeling capability of coupled thermal, mechanical and electrochemical simulation for a single cell battery.\n-  Plan experiments required to validate coupled models at the battery scale.\n-  Use spot-size data to extend James Model to account for area effect in LX-10, LX-16, and EDF-11 explosives.\n-  Design Probabilistic Shock Threshold Criterion (PSTC) Validation Experiments to demonstrate validity in arbitrary shock analysis, e.g., Taylor wave and fragment impact.\n-  Analysis and theoretical model of wave divergence using PSTC.\n-  Perform small-scale shock experiments on energetic materials for equation of state and burn model validation.\n-  Improved equations of state and conductivity models for electrical bridge elements, aluminum, copper, gold, nickel, etc.\n-  Build prototype 200nF multilayer glass capacitors that can withstand 2000Vdc.\n-  Determine statistical basis and initial algorithm for generating threshold curves from detonator experimental data.  Determine whether task may proceed based on findings.\n-  Completion of Particle Imaging Velocimetry (PIV) diagnostic development.\n-  Fabricate custom Si Avalanche PhotoDetectors (APDs) optimized for low-voltage performance and integration for the Photonic Proximity Fuze (PPF) sensor.\n-  Demonstrate in thin-film thermal battery 500mA\/cm2 performance with <0.5V polarization at 525C."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warhead and Penetration Technology"
                                    },
                                    "Description": {
                                        "val": "This focus area supports the development of new warheads and penetrator weapons through advances in materials processing and characterization, instrumentation, and computational codes.  In recent years there have been significant increases in warhead performance directly attributed to our ability to understand and accurately model the physics and fine details of new warhead designs, and to advances in increasingly sophisticated material processing.  The Department’s requirement to achieve more precise weapon effects with minimum collateral damage is supported by work on controlled fragmentation, non-fragmenting warhead cases, and multiphase blast explosives (MBX).  More recently, increases in performance and reductions in vulnerability are being achieved through improved warhead integration into munitions using a systems-oriented approach. \n\nThe goals for penetrator weapons are to investigate, develop, and transition advanced technologies for the design, development, and performance assessment of the next generation of high performance, precision strike weapons.  This effort directly supports national initiatives to defeat hard and deeply buried targets, which are proliferating worldwide, and to deny\/defeat weapons of mass destruction.  The work addresses high-velocity penetration into granular materials (sand and soil), penetration into advanced high-strength and ultra-high-performance concretes, new penetrator materials and designs, and non-inertial onboard instrumentation.\n\nThe specific projects in the warhead and penetration technology focus area are:\n\n-  Multiphase blast munitions (MBX) technology.\n-  Dynamic behavior of sand.\n-  Integrated munitions modeling & experimentation.\n-  Modeling of strategic structures subject to ballistic impact or blast.\n-  Concrete perforation and penetration modeling and experiments.\n-  Explosive\/metal interactions.\n-  Structure, mechanical & shock-loading response, and modeling of materials.\n-  Controlled effects warhead materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.487"
                                            },
                                            "Text": {
                                                "val": "-  Completed baseline data collection on alloy steel 4340, titanium, and copper to determine the effects that geometric scale, shell thickness (strain rate), heat treatment \/ annealing states and defect density have on fragment size, homogeneous background strain, and time to fragmentation.\n-  Completed oblique high explosive-driven shock hardening and damage microstructural quantification on tantalum, zirconium, and completed initial oblique HE-driven spall on U-6Nb.\n-  Implemented TEnsile PLAsticity (TEPLA) model into CartaBlanca and compared improved representation of plate impact response to Lagrange code representation.\n-  Conducted a parametric study on the laser-based shock experiments using ALE3D with microstructures generated through Particle Pack.\n-  Completed cylinder-expansion and perforation-test simulations using Sierra Solid Mechanics and assessed the capability of peridynamics for this class of problems.\n-  Implemented a methodology that has shown to be stable in solving the Multifield model equations.  \n-  Incorporated the second iteration of the multifield theory into CTH with advanced Lagrangian and Eulerian numerics.\n-  Completed feasibility study of methods to measure or calculate the full projectile trajectory into complex targets.\n-  Designed new ball-screw torsion bar to preclude spurious bending modes for dynamic interfacial friction measurements.\n-  Developed analytical method that computes the energy transferred and dissipated across a threaded interface due to impact tension loads in the time and frequency domains.\n-  Completed terminal ballistic validation studies using penetration data obtained from experiments.  In these PeriDynamics MultiScale (PDMS) simulations, the high strength concrete target material was discretized into multiple scales.\n-  Reported model implementation in the GEODYN material library as well as results of Verification and Validation (V&V) using scaled penetrator tests; delivered an improved constitutive model to the GEODYN material library.\n-  Updated GEODYN model for ALE3D full-scale penetration simulations.\n-  Performed cylinder expansion and perforation simulations, documented analyses, and assessed Kraken code capabilities.\n-  Processed first batch of 4340 steel powder samples with low melting point Cu-Sn bronze powders using additive manufacturing methods.\n-  Analyzed iron phase-transition data collected at  Dual-Axis Radiography Hydrodynamic Test facility (DARHT) with results submitted for publication in the Journal of Applied Physics.  \n-  Improved the imaging IR (Infra-Red) full-field temperature diagnostic, incorporating simultaneous emissivity, and radiance measurement.  \n-  Added several improvements to ALE3D’s multiphase model.  These include:  Dense-Transitional-Dilute drag law, Pressure gradient force term, Particle-particle interaction model, second order interpolation of fluid quantities to particle location, Two-way momentum and energy coupling between particles and fluids, Spherical and cylindrical domain decomposition, and Bundled communication of particles between domains.\n-  Completed initial sweeping shockwave experiment on zirconium."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.509"
                                            },
                                            "Text": {
                                                "val": "-  Investigate the jet formation melting of eutectic Ag-Cu to probe the effects of allotropic and thermal phase transitions.\n-  Complete oblique HE driven shock hardening and damage microstructural characterization on zirconium & copper-lead alloy.\n-  Develop modeling and simulation (M&S) tools that will enable optimization of engineering microstructures with multi-phase material fragmentation. \n-  Implement improvements to the multiphase model in ALE3D.\n-  Complete the incorporation of the multi-field theory into CTH; this will allow for multiple material interactions controlled through internal boundary conditions that are inherent to the numerical techniques.\n-  Complete full-scale simulations into sand and update model.\n-  Develop experimental dynamic friction database containing characterizations of mechanical, shear, compression and tensile, interfaces.\n-  Issue final report on Dynamic Behavior of Sand project.\n-  Simulate Army Armament Research, Development, and Engineering Center (ARDEC) tests with Kraken implemented in Sierra\/Solid Mechanics and document results.\n-  Enable ALE3D version with improved and validated detonics capability informed by meso-scale simulations.\n-  Exercise de-coupled ALE3D Multi-phase Blast eXplosives (MBX) modeling capability to interact with rigid targets.\n-  Simulations of structured architectures with, and without, volume gradients produced through additive manufacturing.\n-  Add Parallel and Adaptive Mesh Refinement to Multifield model.\n-  Complete oblique HE-driven shock hardening & damage microstructural quantification on tantalum on flat and curved plate samples to quantify the joint effects of obliquity and curvature.\n-  Conduct sphere extrusion testing on nano-crystalline copper and copper-tantalum alloys.\n-  Collect data with speckle imaging on Filled Hemi geometry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.349"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.349"
                                            },
                                            "Text": {
                                                "val": "-  Issue report on technology gaps for interface models.\n-  Complete design of hardware system for trajectory reconstruction or commercial hardware option.\n-  Implement improvements into CTH Material Point Method (MPM) Multifield for penetration problems.\n-  Complete transition of peridynamic capability to Sierra\/SM.\n-  Close out Integrated Munitions Modeling and Experimentation project with final documentation.\n-  Produce ALE3D version of MBX model with enhanced multiphase modeling capability.\n-  Exercise ALE3D MBX capability to interact with flexible targets.\n-  Determine the efficacy of additive manufacturing methods.\n-  Inclusion of porosity in fragmentation simulations.\n-  Complete oblique HE-driven shock hardening and damage microstructural characterization on zirconium & copper-lead alloy. \n-  Link Electron BackScatter Diffraction (EBSD) data to Dream3D software for meso-scale model representation of metallic materials.\n-  High magnification IR (Infra-Red) imaging of titanium sample."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Lifecycle Technologies"
                                    },
                                    "Description": {
                                        "val": "This focus area supports improving the Department’s ability to understand, measure, predict, and mitigate safety and reliability problems caused by materials aging and degradation in weapons systems.  Current stockpile assessment methods typically focus on addressing materials aging and reliability problems after they occur, rather than anticipating and avoiding future problems or failure mechanisms.  The overall objective of this work is to develop a toolset of computational models that are able to quantitatively predict materials aging processes and ultimately improve the long-term reliability of weapons systems, subassemblies, and\/or components.  These objectives are achieved by:  identifying aging mechanisms, quantifying the rates at which those aging mechanisms occur, developing predictive models, and using these models to predict the munitions stockpile reliability.  An additional objective of this work is to develop technologies and methodologies to enable munitions health management and condition-based maintenance.\n\nThe specific projects in the munitions lifecycle technologies focus area are:\n\n-  Predictive Materials Aging, including solder interconnect reliability, corrosion of electronics, and adhesive degradation.\n-  Microelectromechanical systems (MEMS) reliability.\n-  Military use of commercial off-the-shelf (COTS) electronics.\n-  Complex system health assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "-  Validated bondpad corrosion model with modified plastic encapsulated microelectronics (PEM) parts.\n-  Developed a method for measuring a packaged MEMS device seal strength.\n-  Assessed the role of adhesive swelling due to water absorption on the stress state of the adhesive. \n-  Quantified initial predictive aging and reliability model with results from COTS MEMS device testing.\n-  Developed methodology and software to perform multiple objective assessments of resource allocation and general management strategies of weapon system usage.\n-  Validated a general model to connect condition-based measures, age, environmental factors, at the component level failure mode to system reliability.\n-  Collaborated with Army Armament Research, Development, and Engineering Center (ARDEC) to test and validate methodology on 50 caliber round stockpile, and with Aviation and Missile Research, Development, and Engineering Center (AMRDEC) to test and validate methodology on Hellfire missiles.\n-  Demonstrated the ability to measure and computationally predict macroscopic load-displacement response of the napkin-ring joint.\n-  Demonstrated the effectiveness of a commercial coating that contains nickel platelets coated with an electrically insulating material toward tin-whisker mitigation.\n-  Confirmed Dynamic Recrystallization (DRX), and not long-range diffusion, was the controlling mechanism in long tin-whisker and hillock growth using tin-on-silicon test samples, together with focused ion beam (FIB) cross sections.\n-  Demonstrated that spray-coated components exhibit no whiskers after 1,500 cycles (-55 to 85C)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.064"
                                            },
                                            "Text": {
                                                "val": "-  Develop a software program for general reliability resource allocation problems that will allow the user to understand the robustness of different choices.\n-  Develop a methodology to combine the multiple failure mode models at the component level into an overall model, capable of estimating and predicting system reliability.\n-  Build GUI for connector and bondpad corrosion models.\n-  Assess the role of adhesive swelling due to water absorption on the stress state of the adhesive within the napkin-ring joint and on the stress at failure observed for the joint.\n-  Compile the dormant storage data both internal and external to the Hellfire missile case.\n-  Validate the most promising tin whisker mitigation methods in actual operating environments.\n-  Complete report on MEMS Gyroscope Mechanical Reliability experiments.\n-  Develop 3-D fracture model to evaluate the connection between cracking and residual stress in MEMS packages.\n-  Develop software for identifying best resource allocation for maintenance software and documentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.271"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.271"
                                            },
                                            "Text": {
                                                "val": "-  Package-on-Package-on-Package (PoPoP) final report and recommendation.\n-  Generalize success model for use in other circuits.\n-  Validate the most promising tin-whisker mitigation methods in actual operating environments.\n-  Refine predictions of adhesive failure using napkin ring tests to identify additional parameters necessary for predictive model, for example, cure, thermal, and\/or dynamic loadings.\n-  Release early prototype of physics-based lifetime predictive model based on Physics of Failure (PoF) approach to the DoD customer.\n-  Software tool for integration Prognostics and Health Monitoring (PHM) and System Assessment (SA) methodologies and strategies, software and documentation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1.  Transition of technologies developed by the Joint DoD\/DOE Munitions Technology Program are tracked and documented.  In FY 2014 there have been 47 transitions to DoD weapons programs and personnel.\n2.  Attendance and technical interactions at the biannual meetings of the eight Technology Coordinating Groups (TCGs) are tracked and documented.\n3.  Laboratory Five-Year Plans are prepared, evaluated, and analyzed by management and technical staff.\n4.  TCG Chairmen's Annual Assessments for each TCG are critically reviewed by the Technical Advisory Committee (TAC) to determine progress, validate transition plans, and verify relevance of each project.\n5.  Project progress toward goals and milestones is assessed at each biannual TCG meeting and critically reviewed annually by the TAC.\n6.  Annual technical reports and papers are tracked and documented."
                        }
                    }
                }
            ]
        }
    }
}