{
    "id": "bb5774b6df272afe00affa24eaa55d5c7ed1402e",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605100D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Mission Environment Test Capability (JMETC)"
        },
        "R1LineNumber": {
            "val": "138"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "31.270"
            },
            "PriorYear": {
                "val": "27.491"
            },
            "CurrentYear": {
                "val": "27.124"
            },
            "BudgetYearOne": {
                "val": "45.235"
            },
            "BudgetYearOneBase": {
                "val": "45.235"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "47.163"
            },
            "BudgetYearThree": {
                "val": "49.253"
            },
            "BudgetYearFour": {
                "val": "53.076"
            },
            "BudgetYearFive": {
                "val": "53.806"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Mission Environment Test Capability (JMETC) program was established for the purpose of implementing the Department’s strategy to move to an enterprise-centric, distributed test capability that results in acquisition systems fielded with enhanced joint capabilities, reduced program costs, and improved acquisition timelines.  The JMETC program implements the infrastructure capabilities defined in the Department of Defense’s “Testing in a Joint Environment Roadmap” to provide acquisition program managers a robust nation-wide capability to “test like we fight.”  JMETC provides a persistent, distributed test and evaluation (T&E) capability; supporting system development, interoperability testing, and cyber testing; that otherwise would not be readily available to Service\/Component acquisition programs.  The JMETC program is funded within the Research, Development, Test and Evaluation (RDT&E) Management Support Budget Activity because it is intended to provide test capability in support of RDT&E programs. By linking distributed facilities, JMETC allows acquisition programs to efficiently evaluate their warfighting capability in a realistic joint mission environment.  This enables a customer-defined joint mission test environment for systems engineering and testing, extensible to training and experimentation, in a timely and cost effective manner.\n\nOn October 1, 2012, the Under Secretary Defense for Acquisition, Technology and Logistics (USD(AT&L)) directed Test Resource Management Center (TRMC) to take responsibility for operations and resources of the National Cyber Range (NCR).  TRMC undertook management oversight of the NCR, including all operational activities and sustainment of resources, transitioning it from a Defense Advanced Research Projects Agency (DARPA) Science & Technology project to an operational capability supporting cyber test, experimentation, and training events. The NCR mission is to provide secure facilities, technology, processes, and workforce to rapidly create hi-fidelity, mission representative cyberspace environments and facilitate integration\/federation of cyberspace T&E infrastructure in support of the TRMC Mission.  In FY-14 the NCR demonstrated robust operational capability supporting 20 different events for a diverse set of customers including US Cyber Command, Joint Staff J-7, Director, Operational Test & Evaluation (DOT&E) and US Naval Air Systems Command (NAVAIR). The NCR was critical to the successful execution of CyberFlag 14-1, CyberGuard 14-1, 14-2 and 14-3 and just completed CyberFlag 15-1 in the 1QFY15. In 3QFY14 the NCR team executed the first Cybersecurity Developmental Test & Evaluation (DT&E) event supporting a Major Defense Acquisition Program (MDAP), the MQ-4C Triton Program. In the 1QFY-15 the NCR executed a second MDAP Cybersecurity DT&E Event in support of the P-8A Increment Three. In FY-15, a Systems of Systems Cybersecurity DT&E Event will be conducted involving triton, the P-8A and Tactical Mobile (TACMobile) Program. Additional events are planned in support of Cost Assessment and Program Evaluation (CAPE), F-35 (Re-programming Center West) Joint Space Operations Center (JSpOC) Mission Space (JMS) Program and other acquisition and operational customers. Concurrent with these NCR Events are engineering activities to sustain and upgrade NCR Computing Resources, improve the automated software tool suite and improve operational capabilities to satisfy increasing customer demand.      \n\nThe Test Resource Management Center (TRMC) is the Department’s lead for the JMETC program, the National Cyber Range, and oversees both their development and operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.878"
                },
                "CurrentYear": {
                    "val": "27.162"
                },
                "BudgetYearOne": {
                    "val": "27.253"
                },
                "BudgetYearOneBase": {
                    "val": "27.253"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "27.491"
                },
                "CurrentYear": {
                    "val": "27.124"
                },
                "BudgetYearOne": {
                    "val": "45.235"
                },
                "BudgetYearOneBase": {
                    "val": "45.235"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.387"
                },
                "CurrentYear": {
                    "val": "-0.038"
                },
                "BudgetYearOne": {
                    "val": "17.982"
                },
                "BudgetYearOneBase": {
                    "val": "17.982"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.038"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.375"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Internal Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.012"
                                },
                                "BudgetYearOne": {
                                    "val": "17.982"
                                },
                                "BudgetYearOneBase": {
                                    "val": "17.982"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "•  Strategic efficiency reductions in management headquarters funding and staffing for better alignment and to provide support to a smaller military force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "100"
                    },
                    "ProjectTitle": {
                        "val": "Joint Mission Environment Test Capability Distributed Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "31.270"
                        },
                        "PriorYear": {
                            "val": "17.491"
                        },
                        "CurrentYear": {
                            "val": "16.843"
                        },
                        "BudgetYearOne": {
                            "val": "25.583"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.583"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "26.751"
                        },
                        "BudgetYearThree": {
                            "val": "28.305"
                        },
                        "BudgetYearFour": {
                            "val": "31.139"
                        },
                        "BudgetYearFive": {
                            "val": "31.376"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The JMETC mission is to provide an enterprise-level, persistent capability for linking distributed facilities, enabling Department of Defense (DoD) customers to develop and test warfighting capabilities in a Joint Context. JMETC provides a test infrastructure consisting of the components necessary to conduct Joint distributed test events by cost-effectively integrating live, virtual, and constructive (LVC) test resources that are configured to support the users' needs.  The JMETC program provides its customers a support team to assist with JMETC products and the conduct of distributed testing.  JMETC’s institutional funding builds, maintains, and operates the JMETC infrastructure and pays for persistent availability of national connectivity for testing; data communications middleware; identification and development of interface standards; common software tools and components; and a reuse repository.  JMETC Program funding also provides JMETC program management, facilities, equipment, operating costs, and special studies and analysis related to distributed test capabilities and infrastructure.  Key attributes of the JMETC include:  persistency; interoperability; reuse; various combinations of distributed capabilities (reconfigurable infrastructure to meet customer requirements); modeling and simulation (M&S) linkage; Live-Virtual-Constructive (LVC) test resource integration; and distributed test support to satisfy both Service and Joint needs.  System engineering, training, and experimentation all benefit from a corporate JMETC developed for T&E.  JMETC has grown from four sites in 2007 to 77 sites, 12 peering points to other networks, and an additional 12 planned sites.  JMETC will reduce the cost and time to plan and prepare for distributed joint testing by providing a readily-available, persistent connectivity with network security accreditation support, common integration software for linking sites, and accredited test tools for distributed testing. To support its customers, JMETC also provides extensive expertise in planning, preparing for, and executing the infrastructure for distributed test events.  In the past year, JMETC has used this expertise and infrastructure to support over 65 customer events.\nAdditionally in FY 2013, the JMETC PE was funded to develop and build the Regional Service Deliver Points (RSDP).  The RSDPs are a set of distributed computing and storage platforms designed to efficiently meet DoD capacity and capability demands for distributed and cyber test and evaluation (T&E) requirements as part of the Test Resource Management Center (TRMC).  They provide services (i.e. traffic generation, simulation, instrumentation, visualization, and integrated event management), a scalable architecture to increase capacity and capabilities as needed by the user community, a flexible and adaptable infrastructure to support users requirements which are prone to frequent change, and to deliver cost and performance efficiencies (virtualization, rapid reconstitution).  At a high-level architecture view, the RSDP adds enterprise compute and storage resources as well as a platform for distributed and cyber T&E tools and services at multiple classifications necessary to create high fidelity, operationally representative virtual environments, previously unavailable."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Mission Environment Test Capability Distributed Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.491"
                                            },
                                            "Text": {
                                                "val": "- Provided the distributed test infrastructure for acquisition programs and projects testing to include F-35 Joint Strike Fighter interoperability tests, Apache Block III Link-16 Interoperability tests, Small Diameter Bomb II developmental tests, Advanced Anti-Radiation Guided Missile operational testing, MQ-4C Triton developmental testing, Joint Integrated Air and Missile Defense Organization (JIAMDO) project testing, five Joint Interoperability Tests (JITS) for DISA’s Joint Interoperability Test Command, Air Force Air Ground Integrated Layer Exploration (AGILE) Fire VIII, US Naval Air Systems Command (NAVAIR) Integrated Warfare Capability (IWC) test events, Naval Sea Systems Command (NAVSEA) Advanced Mid-Term Interoperability Improvement Program test events, Marine Corps Virtual Rapid Prototyping Laboratory (VRPL) experiments, five Air Force Interoperability Tests (AFSIT), and numerous smaller test activities, as well as continuous interconnectivity between distributed test resources for day-to-day exchange of test data.\n\n- Provided planning support for future distributed testing to other and on-going acquisition programs and projects including;  F-35 Joint Strike Fighter, CVN-78, P-8A Poseidon, Integrated Defensive Electronic Countermeasures (IDECM), Unmanned Carrier Launched Airborne Surveillance & Strike (UCLASS), Common Aviation Command and Control System (CAC2S), Joint Space Operations Center (JSpOC) Mission Space (JMS), Marine Corps Combat Operations Center (CoC), and Tactical Mobile(TacMobile), Army Network Integration Event (NIE)\/Brigade Modernization, Counter Remote Controlled Improvised Explosive Device (IED) Electronic Warfare (CREW), Joint Tactical Networking Center (JTNC), Joint Reference Implementation Laboratory (JRIL).\n\n- Completed the Cyber T&E Roadmap draft and started the coordination and approval process.  Began working with the newly chartered DoD Enterprise Cyber Range Environment Senior Steering Group to integrate capabilities across the four (4) Congressionally identified “Cyber Ranges” to support the communities of interest (COI) – testing, experimentation, training, and mission rehearsal – in an effective and efficient execution of cyber events.\n\n- Continued collaboration with the Training community by providing distributed test planning support to the Joint Staff J7, the Joint Staff J6 Command, Control, and Interoperability (C2I), and to other customers for their distributed test events.\n\n- Conducted strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter (NR-KPP) and Cybersecurity requirements.\n\n- Continued coordination efforts to integrate DoD\/Service\/Industry\/Academia distributed test and evaluation infrastructure to the JMETC infrastructure.\n\n- Continued the planning, alignment, and coordination to establish and improve the test infrastructure for cyber tests and assessments by leveraging activities across the Cyber communities.  Identified several on-going efforts to improve capabilities in the areas of visualization and instrumentation.\n\n- Enhanced the User Interface and content of the web-based JMETC Reuse Repository to store distributed test tools, utilities, lessons learned, and test metadata making all available to the DoD test community.\n\n- Assisted customers with the use of distributed test tools and troubleshooting of local network infrastructures.  Provided remote and on-site support for the planning and execution of distributed events.\n\n- The Cyber Range Interoperability Standards (CRIS) initiative used the CRIS working group to develop a common lexicon and Cyber event planning and execution process.  Identified the Test Specification Tool, modified to receive and output in other formats, as the first priority key areas in which investment would result in efficiencies and improved scalability on Cyber ranges across the community.\n\n- Initiated planning of distributed test infrastructure enhancements that will support multiple, concurrent classification up to and including TS\/\/SCI with a focus on leveraging the Regional Service Delivery Point computing and storage capabilities and incorporating both conventional and cyber weapon systems to address growing interoperability and cyber T&E requirements.  Supported pilot tests with three DoD programs.\n\n- Initiated RSDP #2 operations in June 2014, beginning support to the Littoral Combat Ship, and completed the build-up of the 2nd RSDP which will provide enterprise compute, storage, and common services resources.  Identified Patuxent Naval Air Station as the site for RSDP 2 and conducted the site survey for installation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.843"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide distributed test support for major customer events such as the Joint Tactical Networking Center (JTNC), Joint Reference Implementation Laboratory (JRIL), MQ-4C Triton, Army Integrated Air and Missile Defense (AIAMD), Joint Interoperability Tests (JITs), AGILE Fire, NAVAIR Integrated Warfare Capability (IWC), and numerous smaller test activities, as well as, continuous interconnectivity between distributed test resources for day-to-day exchange of test data.\n\n- Continue planning support to new and on-going acquisition programs including: Program Executive Office, Intelligence, Surveillance, and Sensor Systems (PEO IEW&S) (multiple programs), F-35, Small Diameter Bomb (SDB) II, MQ-4C Triton,P-8A Poseidon, Advanced Anti-Radiation Guided Missile (AARGM), Integrated Defensive Electronic Countermeasures (IDECM), Unmanned Carrier Launched Airborne Surveillance & Strike (UCLASS), Common Aviation Command and Control System (CAC2S, Joint Space Operations Center (JSpOC) Mission Space (JMS), Tactical Mobile (TacMobile), and Marine Corps Tactical Operations Center (CoC).\n\n- Continue strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter (NR-KPP) and Cyber security requirements.\n\n- Continue coordination efforts to integrate DoD\/Service\/Industry\/Academia distributed test and evaluation infrastructure to the JMETC infrastructure.\n\n- Continue the planning, alignment, and coordination to establish and improve the test infrastructure for cyber tests and assessments by leveraging other TRMC investments (i.e., Central Test and Evaluation Investment Program (CTEIP) and Test & Evaluation\/Science & Test (T&E\/S&T) and capabilities of existing cyber ranges (DoD\/Services\/Industry\/Academia).\n\n- Continue to assist customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures.  Continue providing remote and on-site support for the planning and execution of distributed events.\n\n- Begin implementation of distributed test infrastructure enhancements that will support multiple, concurrent classifications up to and including TS\/\/SCI with a focus on leveraging the RSDP capabilities and incorporating both kinetic (weapon systems) and non-kinetic (cyber weapons) assets to address growing interoperability and cyber T&E requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.583"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.583"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide distributed interoperability and cyber test support for major customer events such as the F-35 Joint Strike Fighter, Apache Block III testing, Small Diameter Bomb II tests, Advanced Anti-Radiation Guided Missile, MQ-4C Triton testing, JIAMDO project testing, Joint Interoperability Tests (JITS) for DISA’s Joint Interoperability Test Command, Air Force AGILE Fire VIII, NAVAIR Integrated Warfare Capability (IWC) test events, NAVSEA Advanced Mid-Term Interoperability Improvement Program events, Marine Corps Virtual Rapid Prototyping Laboratory (VRPL) experiments, five Air Force Interoperability Tests (AFSIT), and numerous smaller test activities.\n\n- Continue planning support to new and on-going acquisition programs including: Program Executive Office, Intelligence, Surveillance, and Sensor Systems (PEO IEW&S) (multiple programs), Mobile User Objective System, Joint Strike Fighter, Small Diameter Bomb (SDB) II, MQ-4C Triton,P-8A Poseidon, Advanced Anti-Radiation Guided Missile (AARGM), Integrated Defensive Electronic Countermeasures (IDECM), Unmanned Carrier Launched Airborne Surveillance & Strike (UCLASS), Common Aviation Command and Control System (CAC2S, Joint Space Operations Center (JSpOC) Mission Space (JMS), Tactical Mobile (TacMobile), and Marine Corps Tactical Operations Center (CoC).\n\n- Continue strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter (NR-KPP) and Cyber security requirements.\n\n- Continue to assist customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures.  Continue providing remote and on-site support for the planning and execution of distributed events.\n\n- Continue the planning, alignment, and coordination to establish and improve the test infrastructure for cyber tests and assessments by leveraging other TRMC investments (i.e. CTEIP and T&E\/S&T) and capabilities of existing cyber ranges (DoD\/Services\/Industry\/Academia).\n\n- Increase cyber test capacity by speeding up acquisition of Regional Service Delivery Points (RSDPs), acquire additional storage capacity for the RSDPs, develop a central library for blue and red environments to promote reuse, begin development of in-line Type one encryption capability, and promote infrastructure for a quick-reaction cyber test capability.  Fulfill implementation of distributed test infrastructure enhancements that will support multiple, concurrent classifications up to and including TS\/\/SCI and provide for connectivity to coalition partners."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Number of Distributed test sites\n - Number of events conducted\n - Number of acquisition programs supported"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "200"
                    },
                    "ProjectTitle": {
                        "val": "Joint Mission Environment Test Capability National Cyber Range (NCR) Sustainment"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "10.000"
                        },
                        "CurrentYear": {
                            "val": "10.281"
                        },
                        "BudgetYearOne": {
                            "val": "19.652"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.652"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "20.412"
                        },
                        "BudgetYearThree": {
                            "val": "20.948"
                        },
                        "BudgetYearFour": {
                            "val": "21.937"
                        },
                        "BudgetYearFive": {
                            "val": "22.430"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In FY 2013, responsibility for the National Cyber Range (NCR) was given to the Test Resource Management Center (TRMC) and subsequently put under the Joint Mission Environment Test Capability (JMETC) management team.  The NCR was funded in FY 2013 through funds provided by Defense Advanced Research Projects Agency (DARPA), Director, Operational Test & Evaluation (DOT&E), Assistant Secretary of Defense (Research & Engineering)(ASD(R&E)) reprogramming, and the TRMC investment programs.  In FY 2014, the NCR was funded from the JMETC Program Element.  The NCR provides secure facilities, technology, processes, and workforce to rapidly create hi-fidelity, mission representative cyberspace environments and facilitate integration\/federation of cyberspace test and evaluation (T&E) infrastructure in support of the TRMC Mission.  It supports a diverse user base and accommodates a wide variety of event types (R&D, Developmental Test & Evaluation (DT&E), Operational Test & Evaluation (OT&E), Security Control Assessor (SCA)  Compliance, Defensive Cyber Operations (DCO), Offensive Cyber Operations (OCO), Tactics, Techniques Procedures (TTP) Development, Forensics\/Malware Analysis) and communities (research, systems engineering, testing, operations, training, etc.).  The NCR has the capability to support up to 4 concurrent events at different classification levels using Multiple Independent Levels of Security (MILS) architecture.  It is accredited to operate at TS\/\/SI-G\/TK\/HCS-P\/\/SAR.  In support of a variety of customers, the NCR has emulated complex (Red\/Blue\/Gray) operationally representative network environments at a scale up to ~50K high-fidelity virtual nodes.  The NCR can operate in conjunction with other ranges through remote connectivity via JMETC connectivity infrastructure.  The NCR’s Test Automation Tools minimize human error, enable verification of test environment, ensure repeatable results and can reduce event timelines from weeks\/months to hours\/days.  Range assets can be sanitized after exposure to malicious attacks\/malware to restore exposed systems to a known, clean state.\n\nThe JMETC-funded National Cyber Range allows acquisition programs and operational forces to efficiently evaluate their cyber warfighting capability in a realistic joint mission environment.  This enables a customer-defined joint mission test environment for systems engineering and testing, extensible to training and experimentation, in a timely and cost effective manner."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Mission Environment Test Capability NCR Sustainment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "- Operated and sustained the National Cyber Range’s (NCR) capabilities to meet growing customer requirements. In FY-14 the NCR demonstrated robust operational capability supporting 20 different events for a diverse set of customers including US Cyber Command, Joint Staff J-7, DOT&E and NAVAIR. The NCR was critical to the successful execution of CyberFlag 14-1, CyberGuard 14-1, 14-2 and 14-3. In 3QFY14 the NCR team executed the first Cybersecurity DT&E event supporting an MDAP Acquisition Program, the MQ-4C Triton Program. The NCR was utilized at 82% of available capacity for FY 2014. In the 4QFY14 and 1QFY15 the NCR was utilized at 98% of available capacity.   \n\n- Completed the NCR tools study to evaluate NCR tools for expansion for enterprise use. The NCR Test Specification Tool should be modified to receive input from multiple formats and sources and then output in a standard data format to make it usable on all Cyber Ranges. Near term focus was Interoperability with the RSDPs.  \n\n- Completed plans to sustain the NCR Security Posture in accordance with the DIA Approved POA&M. Work will commence in 1QFY15 to be completed by the end of the quarter. \n\n- Implemented a wireless cyber test capability at the NCR which was used for a classified test customer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.281"
                                            },
                                            "Text": {
                                                "val": "- Continue to 0perate and sustain the National Cyber Range (NCR) capabilities to meet growing customer requirements.  Support test planning and execution for acquisition programs such as TRITON, P-8A, USMC TacMobile, F-35, Littoral Combat Ship, and Joint Space Operations Center Mission Systems (JMS).  Continue to support other DoD organizations providing cyber test capability to agencies such as Army Intelligence and Information Warfare Directorate; Office of Naval Intelligence; Cost Assessment and Program Evaluation (CAPE); Director Operational Test and Evaluation; and the Army Communications and Electronics Research, Development and Engineering Command (CERDEC).  \n\n- Provide red and gray environments for Cyber Flag 15-1 and 15-2.  Support one Cyber Knight event each month.  Continue support to the DOT&E sponsored Enterprise Cyber Range Environment with one event per month.  \n\n- Provide cyber T&E planning support to acquisition programs such as CVN 78, F-35 Joint Strike Fighter, and KC-46A Tanker to aid in building-in cyber security during early development.\n\n- Continue the high utilization for the NCR. \n\n- Continue to sustain the NCR capabilities and processes to support customer demand. Assess improvements needed in encryption, and increase capacity to support increased demand.  Begin to modify the NCR’s Test Specification Tool to make it interoperable with other cyber ranges. Begin technical refreshment of the hardware in the existing NCR to further increase capacity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.652"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.652"
                                            },
                                            "Text": {
                                                "val": "- Continue to operate and sustain the National Cyber Range (NCR) capabilities to meet growing customer requirements.  Support test planning and execution for acquisition programs such as TRITON, P-8A, TacMobile, Littoral Combat Ship, F-35 Joint Strike Fighter, and Joint Space Operations Center Mission Systems (JMS).  Continue to support other DoD organizations providing cyber test capability to agencies such as Army Intelligence and Information Warfare Directorate, Office of Naval Intelligence, National Assessment Group, Director Operational Test and Evaluation, Army CERDEC, Navy SPAWAR, and Air Force 46th Test Squadron.  \n\n- Continue to provide blue, red, and gray environments for Cyber Flag 16-1 and 16-2.  Support one Cyber Knight event each month.  Continue support to the DOT&E sponsored Enterprise Cyber Range Environment with one event per month.  Support operational units such as the 780 MI Brigade, as called upon.\n\n- Continue to provide cyber T&E planning support to acquisition programs such as CVN 78 and KC-46A Tanker to aid in building-in cyber security during early development.\n\n- Continue to sustain the NCR capabilities and processes to support customer demand. Assess improvements needed in encryption, and increase capacity to support increased demand.  Continue modification and development of the NCR’s Test Specification Tool to make it interoperable with the RSDPs and other cyber ranges. Continue technical refreshment of the hardware in the existing NCR to further increase capacity.\n\n- Begin acquisition of additional NCR capacity to satisfy steadily increasing demands for cyber test and training capabilities. This effort would replicate the current NCR capacity and, through acquisition of more advanced hardware, significantly exceed current capacity."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Number of events conducted\n- Utilization rate\n- Number of acquisition programs supported\n- Number of events supported for other DoD communities"
                        }
                    }
                }
            ]
        }
    }
}