{
    "id": "c7021ac23114a1ae1a649009aad550ef824f0038",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603662D8Z"
        },
        "ProgramElementTitle": {
            "val": "Networked Communications Capability"
        },
        "R1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.075"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "6.980"
            },
            "BudgetYearOneBase": {
                "val": "6.980"
            },
            "BudgetYearTwo": {
                "val": "9.931"
            },
            "BudgetYearThree": {
                "val": "12.892"
            },
            "BudgetYearFour": {
                "val": "7.931"
            },
            "BudgetYearFive": {
                "val": "2.974"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Department made the decision to sunset the initial thrust of this program in fiscal year (FY) 2014.  The program element (PE) has been refocused in FY 2016."
        },
        "ProgramElementMissionDescription": {
            "val": "Currently fielded satellite communications (SATCOM), terrestrial, and Tactical Data Links (TDLs) would be adversely effected in operations in Anti-Access\/Area-Denial (A2\/AD) environments.  The primary threat is from sophisticated electronic warfare whose effects may be enhanced by other techniques.  Therefore, in FY 2016 the Network Communications Capability Program (NCCP) will return with a new focus that seeks to enable the development and deployment of Joint robust\/resilient and assured communications.  The goal is to mitigate degradation across the operational tiers (strategic, operational, and tactical) and domains (nuclear, intelligence surveillance and reconnaissance [ISR], command and control [C2], etc.) to ultimately support the mission needs of Joint Functional Component Commanders (JFCCs), Joint Force Commanders (JFCs), and deployed forces. \n\nThe DoD has large investments in TDLs that may have to operate in an A2\/AD environment.  Examples include communications planning systems (across multiple domains and echelons), situational awareness capabilities with limited automation support for highly dynamic A2\/AD environments, aerial networking technologies that create Beyond-Line-of-Sight(BLOS)communications, and networking backbone technologies for disruptive environments.  This research will develop new technology and exploit existing methodologies to ensure performance in A2\/AD environments.  Additionally, this will enable standardization of military network communications capabilities across the Department.\n\nBeginning in FY 2016, the Robust Tactical Data Links Modernization (RTDLM) project will specifically address the need for improvements in robustness and efficiency to the current Link-16, which is the primary data link deployed over 10,000 radios with United States (U.S.) and Allied militaries.  It will focus mainly on developing ways to improve the resiliency and range\/reachability of the tactical data links lost due to conditions in an A2\/AD environment.  This will include advanced and improved Link 16 waveform designs, receiver processing algorithms, and advanced data forwarding and routing overlay technologies as well as alternative antenna systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.075"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "6.980"
                },
                "BudgetYearOneBase": {
                    "val": "6.980"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.075"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "6.980"
                },
                "BudgetYearOneBase": {
                    "val": "6.980"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.228"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.153"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment for Higher Priority Programs"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "7.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.020"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.020"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016 internal realignment reflects funding for higher Departmental priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P663"
                    },
                    "ProjectTitle": {
                        "val": "Network Communications Analysis"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.075"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.980"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.980"
                        },
                        "BudgetYearTwo": {
                            "val": "9.931"
                        },
                        "BudgetYearThree": {
                            "val": "12.892"
                        },
                        "BudgetYearFour": {
                            "val": "7.931"
                        },
                        "BudgetYearFive": {
                            "val": "2.974"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department made the decision to sunset the initial thrust of this program in FY 2014. Tactical Mobile Networking, Spectrum Management Tools and Analysis, and Tactical Networking Evolution and Expansion projects completed the final tasks as listed below.\n\nCurrently fielded satellite communications (SATCOM), terrestrial, and Tactical Data Links (TDLs) would be adversely effected in operations in Anti-Access\/Area-Denial (A2\/AD) environments.  Therefore, in FY 2016 the Network Communications Capability Program (NCCP) will return with a new focus that seeks to enable the development and deployment of Joint robust and assured communications.  \n\nRobust Tactical Data Links Modernization (RTDLM) – In a contested environment, especially when conducting forward operations, platforms face a significant electronic warfare threat.  Improvements in tactical communication systems for Joint airborne networking are required to mitigate advances in threat electronic warfare systems.  The RTDLM project will develop advanced technologies to address these needs, design and build prototype systems to verify the technology in operationally relevant environments against representative threats, and manage the migration and transition of these technologies to service platforms, radios, and other combat mission systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Mobile Networking"
                                    },
                                    "Description": {
                                        "val": "(NCCP Sunset - Final Report)\nThis project is for the development of new applications and standards that can be used on existing tactical networks to improve data retrieval and discovery by the tactical warfighter.  In addition, research is conducted into tactical communications architectures to develop models useful for optimizing and exploiting tactical networks.  New applications and architectures will be tested in a joint federated experimental emulation test bed being developed within this program.  Project collaboratively executed by the Navy and Air Force.  Results planned for transition to programs of record as maturity of models allow.  Research efforts include Wireless Computational Networking Architectures (WCNA), Tactical Edge Protocol Evaluation and Experimentation (TEPEE), Mission Aware Reasoning for Tactical Edge Network Services (MARTENS)\/Semantically Augmented Resource Manager (SARM), Dynamic Transport Protocol, Satellite Communications (SATCOM) and Tactical NetOps, Mobile Ad Hoc Networking (MANET) Project (with the National Security Agency [NSA]), Cooperative Heterogeneous Communications, Inter-domain Routing, Communications for Autonomous Systems, Network Visualization, Tactical Edge Group-Wise Networking, Advanced Tactical Data Links, Reliable Data Transport, Channel Modeling for Software Defined Radios in Real Atmospheric Environments, and Loss Tolerant Transmission Control Protocol (LT-TCP) for Mobile Wireless Networks.\n \nOverall goals:  Increase understanding of the condition of tactical mobile networking technologies.  Improve specification of technical standards and policy for tactical mobile networking.  Refine fidelity modeling and simulation to support operations analysis and the articulation of operational requirements and performance parameters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Text": {
                                                "val": "- Completed research for Adaptive Rate Video Service (ARViS), Nack-oriented Reliable Multicast (NORM) and NORM Proxy (NORP), Distributed Service Discovery (iNDI\/ProtoSD), and Extendable Mobile Ad-hoc Network Emulator (EMANE).\n- Produced final reports and documentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectrum Management Tools and Analysis"
                                    },
                                    "Description": {
                                        "val": "(NCCP Sunset - Final Report)\nThis project is for the development of measurement-based spectrum management tools.  Applications will be developed and tested in a laboratory environment.  Project is executed by the Army and results are available to the Navy and Air Force through the Joint NETOPS Integrated Collaborative Working Group.  Research efforts include Spectrum Analysis and Experimentation in Dynamic Operational Environments (SAEDOE), Agile Spectrum and Network Testbench (ASPECT), Dynamic Spectrum Access (DSA) Spectrum Analysis Software, Cognitive Networking Radio Algorithmic Fusion, Integrating Comm and Electronic Attack, SIGINT-assisted Spectrum Management and Control, Cognitive Radio Technology, Networking for Spectrum Aware Cognitive Radios, DSA Enhancements, Spectrum Sharing Trade Study, and Directional Ad hoc Networking Technology - 2 (DANTE - 2).\n \nOverall goal:  Develop the technical basis to support changes regarding the operational use of spectrum both within the military and among spectrum regulatory bodies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "- Integrated spectrum sensing effort, Advanced Real-Time Global Surveillance User Surveillance (ARGUS), with Network End-to-End Monitoring (NEEMO), Intelligent Situational Awareness (ISA), and SATCOM Planning and Execution Services (SPES).\n- Transitioned spectrum sharing demonstrations for ongoing LTE (Long-Term Evolution) Test and the Soldier Radio Waveform (SRW) Real-Time Frequency Management (SRFM) effort.\n- Researched spectrum sharing options for cross military and commercial LTE integrated usage.\n- Conducted two transition demonstrations at the AFRL Stockbridge Spectrum Testing Facility."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Networking Evolution and Expansion"
                                    },
                                    "Description": {
                                        "val": "(NCCP Sunset - Final Report)\nThis project is for the development of new applications and approaches that can be used on existing tactical networks to improve the physical and networking layers for the tactical warfighter.  It will explore new ways to build architectures, antennas, and signal and data processing or exploit waveforms to improve Anti-Jam resistance, network throughput and scale, or network packet routing, and improve these metrics at low cost and without sacrificing interoperability.  Research efforts include Joint Aerial Layer Network (JALN) Network Management\/Control Concept Analysis, Advanced Tactical High-Performance Network Architecture (ATHENA), Network Radio Characterization Limited Objective Experiment (LOE), Multi-Function Wave Form (Resilient Electronic Warfare [EW] \/Communications[Comms]), and the Asymmetric Broadcast Command and Control System (ABC2) Anti-Access\/Area Denial (A2\/AD) Demonstration.\n\nOverall goal:  Next generation tactical networking in the fielded tactical systems, with vastly increased capabilities, at the lowest cost possible to the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.375"
                                            },
                                            "Text": {
                                                "val": "- Transitioned ATHENA to the Robust TDL Modernization (RTDLM) effort.\n- Transitioned Networks Program network management and situational awareness tools to the Joint Multilayer Command and Control at the Tactical Edge (JMC2TE) effort.\n- Transferred network management testbeds and CORE\/EMANE Tools to the Joint Assessment Research Testbed (JART) in support of JALN-Asia Pacific (JALN-AP) and JALN-NarrowBand (JALN-NB) efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robust Tactical Data Links Modernization (RTDLM)"
                                    },
                                    "Description": {
                                        "val": "(NCCP New Focus – Initial Project)\nThis program will address both the need for improvements to the current Link-16 data link and the need for advanced directional network systems for current and future advanced tactical fighters and unmanned systems.  This project will create effective networking in contested A2\/AD environments.  Spectrum awareness and adaptive networking significantly mitigates the effectiveness of interference and retains reliable connectivity and C2.  The RTDLM project will develop and provide the framework, technologies, experimentation, and analytical efforts to support advances in DoD Tactical Data Links (TDLs).  It will develop and mature technologies to support direct transition of the algorithms, prototype implementations, waveform improvements, and system design improvements to radio, waveform, and weapon systems programs managed by each Military Department via fully instrumented field demonstrations and assessments.\n\nOverall Goal: Increase communication and network performance (i.e. “Buy-Back” degraded capabilities) while improving robustness and availability of these communication waveforms and robust\/resilient networks to adversary electronic warfare attack."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.980"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.980"
                                            },
                                            "Text": {
                                                "val": "- Develop adaptive antenna and antenna control subsystems for integration in existing 4th generation fighters and bomber aircraft, 5th generation fighter aircraft, and emerging unmanned and weapons platforms.\n- Develop improved Link 16 waveform designs, receiver processing algorithms, and advanced data forwarding and routing overlay technologies for improved operations in contested electromagnetic environments.\n- Develop a flexible prototype implementation of the technologies for development and performance testing in the laboratory and field environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Robust Tactical Data Links Modernization (RTDLM) project will address capability gaps for Joint TDL networks by developing the technologies that the Military Departments can incorporate in future platform and radio acquisitions.  The proposed experimentation, with field demonstrations and modeling, will increase the Technology Readiness Level (TRL) of critical technology components, suitable for transition to acquisition programs."
                        },
                        "PerformanceMetrics": {
                            "val": "The RDT&E goal for Robust Tactical Data Links Modernization (RTDLM) is capability improvements that achieve 70% “Buy-Back” of the tactical data link range ratio and 80% of the area of operation lost in the A2\/AD environment.\n\nAchieve significant DoD savings for radio modifications or integration into new terminals (economies of scale), as Services share non-recurring development costs for common and successful Tactical Data Link enhancements.\n\nEnable DoD leadership with the supporting technical and cost details to identify candidate “building blocks” for timely incremental improvements.\n\nActual Performance Improvement:  Prototype and transition-able designs, software, and hardware; usage of federated test beds; and demonstration of radio prototypes and modeling tools."
                        }
                    }
                }
            ]
        }
    }
}