{
    "id": "cd7c09f2c0df2852055cf6a49035141587108d28",
    "meta": {
        "filename": "dod-2016_RDTE_2016_SOCOM_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2016.zzz_unzipped_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160402BB"
        },
        "ProgramElementTitle": {
            "val": "SOF Advanced Technology Development"
        },
        "R1LineNumber": {
            "val": "70"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "1045.274"
            },
            "PriorYear": {
                "val": "44.496"
            },
            "CurrentYear": {
                "val": "51.622"
            },
            "BudgetYearOne": {
                "val": "57.741"
            },
            "BudgetYearOneBase": {
                "val": "57.741"
            },
            "BudgetYearTwo": {
                "val": "61.333"
            },
            "BudgetYearThree": {
                "val": "71.587"
            },
            "BudgetYearFour": {
                "val": "73.666"
            },
            "BudgetYearFive": {
                "val": "76.042"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Advanced Technology Development (project S200) conducts rapid prototyping and Advanced Technology Demonstrations (ATDs).  ATDs provide a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by Special Operations Forces (SOF) users.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  Advanced Technology Development also addresses projects that are a result of unique joint special mission or area-specific needs for which a few-of-a-kind prototypes must be developed on a rapid response basis, or are of sufficient time sensitivity to accelerate the prototyping effort of a normal acquisition program in any phase.  \n\nEngineering Analysis (project SF101) provides rapid response capability for the investigation, evaluation, and demonstration of technologies for SOF platform (ground, air, and maritime) and soldier system unique requirements. Timely application of SOF-unique technology is critical and necessary to meet requirements in such areas as: sensor integration; enhanced situational awareness; near-real-time intelligence to include data fusion, threat detection and avoidance; electronic support measures for threat geo-location and specific emitter identification; navigation; target detection; weapon performance integration; and future SOF platform and soldier system requirements.  Provides additional engineering analysis and testing required to transition items from national forces to theater forces.\n\nInformation and Broadcast Systems Advanced Technology (project S225) conducts rapid prototyping, advanced technology demonstrations, and advanced concept technology demonstrations of information and broadcast systems technology.  Includes planning, analyzing, evaluating, and production information systems capabilities and distribution\/dissemination broadcast systems capabilities.  It provides a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by SOF users.  This project also integrates efforts with each other and conducts technology demonstrations in conjunction with joint experiments and other assessment events.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  The project also addresses unique, joint special mission or area-specific needs for which prototypes must be developed on a rapid response basis, or are of sufficient time sensitivity to accelerate the prototyping effort of a normal acquisition program in any phase."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "45.306"
                },
                "CurrentYear": {
                    "val": "57.622"
                },
                "BudgetYearOne": {
                    "val": "56.177"
                },
                "BudgetYearOneBase": {
                    "val": "56.177"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "44.496"
                },
                "CurrentYear": {
                    "val": "51.622"
                },
                "BudgetYearOne": {
                    "val": "57.741"
                },
                "BudgetYearOneBase": {
                    "val": "57.741"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.810"
                },
                "CurrentYear": {
                    "val": "-6.000"
                },
                "BudgetYearOne": {
                    "val": "1.564"
                },
                "BudgetYearOneBase": {
                    "val": "1.564"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-6.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.810"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.564"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.564"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:\n\nFY 2014:  Net decrease of $0.810 million is due to an increase for rotary wing low visibility flare development ($0.066 million) and a reprogramming to higher command priorities (-$0.876 million).\n\nFY 2015:  This program element was reduced due to a Congressional Directed Reduction of $-6.000 million to the Engineering Analysis project.\n\nFY 2016:  Net increase of $1.564 million supports classified rapid reaction technology gap capabilities ($2.000 million) and a decrease of $0.436 million due to a Departmental economic assumption.\n\n\nSchedule:  None.\n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S200"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1045.274"
                        },
                        "PriorYear": {
                            "val": "38.736"
                        },
                        "CurrentYear": {
                            "val": "39.515"
                        },
                        "BudgetYearOne": {
                            "val": "45.137"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.137"
                        },
                        "BudgetYearTwo": {
                            "val": "48.459"
                        },
                        "BudgetYearThree": {
                            "val": "52.785"
                        },
                        "BudgetYearFour": {
                            "val": "54.514"
                        },
                        "BudgetYearFive": {
                            "val": "56.506"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for rapid prototyping, Advanced Technology Demonstrations (ATDs) and Joint Capability Technology Demonstrations.  It is a means for demonstrating and evaluating the utility of emerging\/advanced technologies in operationally relevant environments with Special Operations Forces (SOF) users.  This project integrates emerging technologies and presents them in technology demonstrations, in conjunction with joint experiments and other assessment events.  Evaluation results often facilitate the initiation of new programs and the insertion of appropriate technologies to acquisition programs.   The element also addresses unique, joint special mission or area-specific needs for which a few rapid prototypes must be developed on a responsive basis, or are of sufficient time sensitivity to accelerate prototyping efforts of a normal acquisition program in any phase.  Sub-projects within the SOF Special Technology Development efforts include:  \n\n  •  Special Operations Special Technology Sub-Project.  This sub-project integrates emerging technologies and presents them in technology demonstrations, in conjunction with joint experiments and other assessment events.\n\n  • Tagging, Tracking, and Locating (TTL) Technologies Sub-Project.  TTL funds SOF unique ATDs identified in the USSOCOM Quick Look Capabilities Based Assessments (QL-CBA).  TTL rapidly prototypes and expeditiously transitions projects from laboratory to acquisition Programs of Record\/operational use to address SOF capability deficiencies.\n\n  • National to Theater Transition Sub-Project.  Conduct additional testing required to transition items from national forces to theater forces. \n  \n  • Classified Sub-Project (provided under separate cover).\n\n  • Signature Management Technology Demonstrator (details provided under separate cover)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOF Special Technology Sub-Project"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.437"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and insert technology into existing programs.  Technologies included reduced signature profiles, improved weapons, lightweight armor and materials, conformable antenna technology, area denial applications, first-pass lethality technology, human performance optimization analysis, and technologies that reduce the load of the operator.  Initiated development of technologies supporting undersea mobility; developed ground mobility solutions for improved endurance and survivability; and rotary wing low visibility flares.  Evaluated and developed sensors across the electromagnetic spectrum to meet operational requirements.  Based upon agreed technology maturity metrics, transferred successful projects into programs of record, and conducted field experimentations at various venues to facilitate technology insertion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.018"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and insert technology into existing programs.  Technologies include, but are not limited to reduced signature profiles; improved weapons, communications, command, and control systems, sensors, and situational awareness tools; lightweight armor and materials; alternative power systems; eco-friendly sustainable energy devices; long duration, reduced size, high output power supplies; and technologies that reduce the load of the operator.  Continue development of technologies supporting undersea and ground mobility.  Evaluate and develop sensors across the electromagnetic spectrum to meet operational requirements.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record, and conduct field experimentations at various venues to facilitate technology insertion.  Continue the integration of critical technologies focused on providing the dismounted special operator leap ahead capabilities via innovative collaborative processes.  Begin initial effort for field prototype system incorporating technologies likely to transition to fielded systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.570"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.570"
                                            },
                                            "Text": {
                                                "val": "Continues to develop and insert technology into existing programs.  Technologies include, but are not limited to reduced signature profiles; improved weapons, communications, command, and control systems, sensors, and situational awareness tools; lightweight armor and materials, alternative power systems, eco-friendly sustainable energy devices, long duration, reduced size, high output power supplies, and technologies that reduce the load of the operator.  Continues development of technologies supporting undersea and ground mobility.  Evaluates and develops sensors across the electromagnetic spectrum to meet operational requirements.  Based upon agreed technology maturity metrics, transfers successful projects into programs of record, and conduct field experimentations at various venues to facilitate technology insertion.  Continues the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes.  Begins initial effort for field prototype system incorporating technologies likely to transition to fielded systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging, Tracking, and Locating Technologies (TTL) Sub-Project"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.721"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Exploited and integrated recently-proven and emerging technologies for TTL and TTL-enabling systems. Continued projects toward maturity that are linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL QL-CBA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.852"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Exploit and integrate recently-proven and emerging technologies for TTL and TTL-enabling systems. Continue projects toward maturity that are linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL QL-CBA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.940"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.940"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Exploits and integrates recently-proven and emerging technologies for TTL and TTL-enabling systems. Continues projects toward maturity that are linked to the USSOCOM\/DoD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL QL-CBA.  Increases focus on tactical sensors and enabling technologies in support of the special reconnaissance mission set."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National to Theater Transition"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.613"
                                            },
                                            "Text": {
                                                "val": "Conducted additional testing and evaluation required on various equipment items transitioned to the SOF Theater Forces.  Several projects involving Scalable Effects Weapons, Maritime Platform Enhancements, and Operator Protection systems were successfully transitioned to Theater SOF Forces using these funds.  In FY 2015 this program moved to the Engineering Analysis RDT&E project SF101."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Classified Sub-Project"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.043"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.645"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.627"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.627"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Signature Management Technology Demonstrator"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.547"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed Container Delivery System"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.375"
                                            },
                                            "Text": {
                                                "val": "Completed flight testing and certification of High Speed Container Delivery System for use on MC-130J aircraft."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SF101"
                    },
                    "ProjectTitle": {
                        "val": "Engineering Analysis"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.847"
                        },
                        "CurrentYear": {
                            "val": "6.978"
                        },
                        "BudgetYearOne": {
                            "val": "7.457"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.457"
                        },
                        "BudgetYearTwo": {
                            "val": "7.624"
                        },
                        "BudgetYearThree": {
                            "val": "13.444"
                        },
                        "BudgetYearFour": {
                            "val": "13.697"
                        },
                        "BudgetYearFive": {
                            "val": "13.972"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides a rapid response capability to support Special Operations Forces (SOF) platforms (ground, air and maritime) , Unmanned Aerial Vehicle (UAV) payload sensors and soldier systems.  The purpose is to correct system deficiencies, improve asset life, and enhance mission capability through the means of feasibility studies, analysis of alternatives, pre-developmental risk reduction studies, and engineering analyses. This project provides the engineering required to improve the design and performance integrity of the SOF platforms, UAV payload sensors and soldier support systems, sub-systems, equipment, and embedded computer software as they relate to the maintenance, overhaul, repair, quality assurance, modifications, materiel improvements, and service life extensions.  This project also conducts risk reduction studies, analyses, and demonstrations to support emerging, time-critical weapons and sensor enhancements.\n\nPlatform Engineering Analysis:  Funding supports engineering assessments and evaluation of technology, manufacturing, and integration readiness in six distinct areas: 1) small Unmanned Aerial System (UAS) payloads; 2) air-to-ground interoperability; 3) mission suite architectures; 4) common sensor suites; 5) low-cost, high-load-out Special Operations Precision Guided Munitions (SOPGMs) and air-launched UAS; and 6) next generation Intelligence, Surveillance, and Reconnaissance (ISR) capabilities.\n\nSoldier System Engineering Analysis:  Funding supports engineering assessments and evaluation of technology feasibility, producibility, and integration readiness in the following areas: 1) next generation lightweight low-cost body armor and ballistic helmets 2) ballistic and laser variable light transmission protective eyewear 3) soldier worn sensors to assess ballistic and blast events as well as soldier health 4) next generation soldier worn load carriage systems 5) soldier worn head borne communications that provide greater situational awareness and hearing protection.\n\nNational to Theater Transition Engineering Analysis:  Provides additional engineering analysis and testing required to transition items from national forces to theater forces."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platform Engineering Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.847"
                                            },
                                            "Text": {
                                                "val": "Developed and adapted the government owned 3D Geographic Information Systems software to augment current full motion video (FMV) displays with geographic information and real-time intelligence overlays.  Initial work showed the feasibility of its adaptation to UAVs.  Developed SOF-unique fixed wing enterprise architectures of the current fleet and equipment.  These Phase 1 activities culminated in the delivery of a SOF-unique fixed wing Operational View-1 architecture overview.  Developed a quieter propeller for UAVs.  Baselined existing propeller noise and began testing of quieter propellers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.390"
                                            },
                                            "Text": {
                                                "val": "For small UAS payloads, identify, assess, and evaluate the risks\/benefits of efforts to reduce the size, weight, and power of current capabilities to be integrated into Group I-III UAS.  Air-to-ground interoperability efforts identify shortfalls and gaps in current SOF air-to-ground communications architecture and recommend and evaluate interoperability enhancements.  For mission suite architectures, identify, assess, and evaluate open architecture approaches to reduce life-cycle costs, increase responsive integration of new capabilities, and increase competition. In the area of common sensor suites, assess and evaluate individual sensors and suites of sensors to optimize the commonality of sensors between our manned Intelligence, Surveillance, and Reconnaissance (ISR) fleet and our Group IV\/V UAS.  Identify low-cost and high load-out SOPGM and air-launched UAS commodities to reduce costs and provide force multipliers.  Identify, assess, and evaluate risks\/benefits\/suitability of emerging ISR products and suites.  This includes but not limited to: hyper-spectral imaging, moving target indication, Light Detection and Ranging (LIDAR), Signals Intelligence (SIGINT) and high definition Electro-Optical\/Infrared (EO\/IR) capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.865"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.865"
                                            },
                                            "Text": {
                                                "val": "For small UAS payloads, identifies, assesses, and evaluates the risks\/benefits of efforts to reduce the size, weight, and power of current capabilities to be integrated into Group I-III UAS.  Air-to-ground interoperability efforts identifies shortfalls and gaps in current SOF air-to-ground communications architecture and recommends and evaluates interoperability enhancements.  For mission suite architectures, identifies, assesses, and evaluates open architecture approaches to reduce life-cycle costs, increase responsive integration of new capabilities, and increase competition.  In the area of common sensor suites, assesses and evaluates individual sensors and suites of sensors to optimize the commonality of sensors between manned ISR fleet and Group IV\/V UAS.  Identifies low-cost and high load-out SOPGM and air-launched UAS commodities to reduce costs and provide force multipliers.  Identifies, assesses, and evaluates risks\/benefits\/suitability of emerging ISR products and suites.  This includes but not limited to: hyper-spectral imaging, moving target indication, LIDAR, SIGINT and high definition EO\/IR capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Engineering Analysis"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue to assess advanced body armor and ballistic helmet materials, concepts and prototypes to reduce soldier load and provide increased ballistic protection against the latest emerging threats.  For eye protection, efforts will reduce the number of eyewear lenses needed and to have one lens that provides ballistic and laser protection, as well as automatically darkens\/lightens based on combat conditions. Evaluate soldier worn sensors and heads up display for operability within soldier worn components and subsystems. Assess technology feasibility and integration readiness of next generation load carriage systems such as exoskeletons and load-assist devices. Assess proof of concepts and technology for next generation head borne communications systems that provide reliable and secure wireless transmission in all combat conditions, as well as provide 360 degree situational awareness and noise attenuation while increasing hearing protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.496"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.496"
                                            },
                                            "Text": {
                                                "val": "Continues to assess advanced body armor and ballistic helmet materials, concepts and prototypes to reduce soldier load and provide increased ballistic protection against the latest emerging threats. Reduces the number of eyewear lenses needed and to have one lens that provides ballistic and laser protection as well as automatically darkens\/lightens based on combat conditions. Evaluate soldier worn sensors and heads up displays for operability within soldier worn components and subsystems.  Assess technologies feasibility and integration readiness of next generation load carriage systems such as exoskeletons and load-assist devices. Assesses proof of concepts and technologies for next generation head borne communications systems that provide reliable and secure wireless transmission in all combat conditions, as well as provide 360 degree situational awareness and noise attenuation while increasing hearing protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National to Theater Engineering Analysis"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.088"
                                            },
                                            "Text": {
                                                "val": "Conduct additional testing and evaluation required on various equipment items such as communications, intelligence, weapons, and operator protection planned for transition to SOF Theater Forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.096"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.096"
                                            },
                                            "Text": {
                                                "val": "Conducts additional testing and evaluation required on various equipment items such as communications, intelligence, weapons, and operator protection planned for transition to SOF Theater Forces."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S225"
                    },
                    "ProjectTitle": {
                        "val": "Information and Broadcast Systems Adv Tech"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.913"
                        },
                        "CurrentYear": {
                            "val": "5.129"
                        },
                        "BudgetYearOne": {
                            "val": "5.147"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.147"
                        },
                        "BudgetYearTwo": {
                            "val": "5.250"
                        },
                        "BudgetYearThree": {
                            "val": "5.358"
                        },
                        "BudgetYearFour": {
                            "val": "5.455"
                        },
                        "BudgetYearFive": {
                            "val": "5.564"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts rapid prototyping of information and broadcast system technology.  Includes cyber capabilities that predict the best media channels to reach potential target audiences, data mining and information collections tools, propaganda and social behavior analytical tools, cultural analysis tool sets and emerging technologies that support the planning and analytical needs for the Military Information Support Operations (MISO) forces.  It provides a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by SOF users.  This project integrates efforts and conducts technology demonstrations in conjunction with joint experiments and other assessment events and performs market research on emerging technologies that support all phases of MISO.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  The project also addresses unique, joint special mission or area-specific needs.  Seeks technologies that will transform current MISO capabilities through two major objectives: 1) Exploit technologies capable of disseminating products to reach target audiences across a variety of media to include audiences in denied areas.  2) Automate and improve MISO planning and analytical capability through technologies that are integrated into SOF planning systems (Cultural Analysis, Targeting, Theme Development, Media & Product Selection, Distribution & Dissemination, and Measures of Effectiveness).  Develops software applications that increases the efficiency and shortens the timeline to get MISO dissemination packages approved.  Develops hardware\/software tools that facilitate the collaboration and sharing of information and other critical data.  \n\nBroadcast and Dissemination Modernization.  This initiative will initiate and continue development of emergent technologies available in the marketplace to transform and modernize planning, analysis, development, broadcast, distribution, dissemination, and feedback capabilities for MISO forces. This initiative will also continue development of appropriate emerging technologies initially identified by Advance Technology Demonstrations and Joint Capability Technology Demonstrations to transition to acquisition programs. Technologies include: multi-frequency broadcast systems; digital broadcast capabilities; remote controlled electronic paper; near-real-time command and control of unattended systems, especially in denied areas; focused\/beam speaker sound technologies; visual projection technologies; advanced commercial broadcast technologies including amplitude modulation and frequency modulation radio transmitters and antenna; television transmitter and antenna systems; internet and telephony dissemination and broadcast systems; technologies capable of long-loiter broadcast and delivery in denied and permissive environment; and technologies that automate and improve planning and analytical capability through integrated capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Broadcast and Dissemination Modernization"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.913"
                                            },
                                            "Text": {
                                                "val": "Continued to perform engineering studies, development, and demonstrations of planning, analysis, distribution, and broadcast capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.129"
                                            },
                                            "Text": {
                                                "val": "Continue to perform engineering studies, development, and demonstrations of planning, analysis, distribution, and broadcast capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.147"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.147"
                                            },
                                            "Text": {
                                                "val": "Continues to perform engineering studies, development, and demonstrations of planning, analysis, distribution, and broadcast capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}