{
    "id": "e413a48d7e474820447f982025912020b015694b",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602304E"
        },
        "ProgramElementTitle": {
            "val": "COGNITIVE COMPUTING SYSTEMS"
        },
        "R1LineNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "15.847"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Cognitive Computing Systems program element was budgeted in the Applied Research budget activity because it developed the next revolution in computing and information processing technology that enabled computational systems to have reasoning and learning capabilities and levels of autonomy far beyond those of today's systems.  The ability to reason, learn and adapt raised computing to new levels of capability and powerful new applications. \n\nThe Cognitive Computing project developed core technologies that enabled computing and autonomy systems to learn and apply knowledge gained through experience.  These technologies led to systems with increased self-reliance and the capacity to operate with reduced programmer and operator intervention.  In resource-limited settings, these capabilities made the difference between mission success and mission degradation or failure, increased safety by allowing warfighters to operate systems from greater standoff distances, and reduced staffing requirements by providing greater autonomy.\n\nThe Collective Cognitive Systems and Interfaces project dramatically improved warfighter and commander effectiveness and productivity using advanced cognitive approaches that enabled faster, better informed, and more highly coordinated actions than those of our enemies.  This was accomplished by developing revolutionary methods that increased our information processing capabilities, enhanced our situational awareness, and enabled more cohesive group action by our forces.  Critical technical areas addressed in this project included automated decision support, information sharing, ensured communications, and advanced informatics."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.330"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.847"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.483"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.483"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014:  Decrease reflects the SBIR\/STTR transfer."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "COG-02"
                    },
                    "ProjectTitle": {
                        "val": "COGNITIVE COMPUTING"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.503"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cognitive Computing project developed core technologies that enabled computing and autonomy systems to learn and apply knowledge gained through experience.  These technologies led to systems with increased self-reliance and the capacity to operate with reduced programmer and operator intervention.  In resource-limited settings, these capabilities made the difference between mission success and mission degradation or failure, increased safety by allowing warfighters to operate systems from greater standoff distances, and reduced staffing requirements by providing greater autonomy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Robotic Manipulation (ARM)"
                                    },
                                    "Description": {
                                        "val": "The Autonomous Robotic Manipulation (ARM) program developed advanced robotic technologies that enabled autonomous (unmanned) mobile platforms to manipulate objects without human control or intervention.  A key objective was intelligent control of manipulators to independently perform subtasks over a broad range of domains of interest to the warfighter, thereby reducing operator workload, time on target, training time, bandwidth, and hardware complexity.  Former manipulation systems had many limitations.  For example, while they performed well in certain mission environments, they had yet to demonstrate proficiency and flexibility across multiple mission environments; they required burdensome human interaction and the full attention of the operator; and the time required to complete tasks generally exceeded military users' desires.  ARM created manipulators with a high degree of autonomy capable of serving multiple military purposes across a wide variety of application domains to include, but not limited to, counter-improvised explosive devices, countermine, search and rescue, weapons support, checkpoint and access control, explosive ordnance disposal, and combat casualty care (including battlefield extraction).  ARM enabled autonomous manipulation systems to surpass the performance level of remote manipulation systems that are controlled directly by a human operator."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.503"
                                            },
                                            "Text": {
                                                "val": "-  Developed and demonstrated robust algorithms that locate and identify objects in various real-world scenarios.\n-  Evaluated all performer autonomous algorithms through a series of experiments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "COG-03"
                    },
                    "ProjectTitle": {
                        "val": "COLLECTIVE COGNITIVE SYSTEMS AND INTERFACES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.344"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Collective Cognitive Systems and Interfaces project dramatically improved warfighter and commander effectiveness and productivity using advanced cognitive approaches that enable faster, better informed, and more highly coordinated actions than those of our enemies.  This was accomplished by developing revolutionary methods that increase our information processing capabilities, enhance our situational awareness, and enable more cohesive group action by our forces.  Critical technical areas addressed in this project included automated decision support, information sharing, ensured communications, and advanced informatics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Transformative Apps"
                                    },
                                    "Description": {
                                        "val": "Transformative Apps created the information infrastructure required to enable mission support and tactical applications (apps) to meet the efficiency, security, and availability requirements for use on mobile military networks.  Particularly noteworthy was the development of a new data synchronization architecture between handheld devices and backend computing\/storage nodes.  Additionally, appropriate middleware services and libraries were developed to facilitate shared capabilities such as map viewing, apps management, and collection of logs, usage statistics, and user feedback.  Apps, together with handhelds and networks, were tested in different training environments as well as in deployed environments.  Performance and usage were carefully tracked and user feedback collected to guide rapid enhancement of apps.  The effort created a military apps development community by reaching out to non-traditional performers and explored new models for software acquisition based on end-user empowerment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.344"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated full interoperability across hybrid network topologies in a range of operationally relevant contexts.\n-  Refined decentralized imagery processing and dissemination methods for below-brigade users.\n-  Investigated enhanced counter-IED and situational awareness apps for training and CONUS exercises."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}