{
    "id": "f1ed981b2d59487fb65ab764cb15c57d038141aa",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602201F"
        },
        "ProgramElementTitle": {
            "val": "Aerospace Vehicle Technologies"
        },
        "R1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "117.724"
            },
            "CurrentYear": {
                "val": "105.673"
            },
            "BudgetYearOne": {
                "val": "123.438"
            },
            "BudgetYearOneBase": {
                "val": "123.438"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "122.766"
            },
            "BudgetYearThree": {
                "val": "129.556"
            },
            "BudgetYearFour": {
                "val": "133.505"
            },
            "BudgetYearFive": {
                "val": "142.228"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program investigates, develops, and analyzes aerospace vehicle technologies in the three primary areas of structures, controls, and aerodynamics for legacy and future aerospace vehicles. Advanced structures concepts are explored and developed to exploit new materials, fabrication processes, and design techniques. Flight control technologies are developed and simulated for aerospace vehicles. Advanced aerodynamic vehicle configurations are developed and analyzed through simulations, experiments, and multi-disciplinary analyses. Resulting technologies improve performance of existing and future manned and remotely piloted air vehicles, sustained high speed, and space access vehicles. Improvements include, but are not limited to, reduced energy use by efficient air platform designs, use of lightweight composite structures and improved sustainment methods based on the condition of the platform and sub-systems. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "119.624"
                },
                "CurrentYear": {
                    "val": "105.747"
                },
                "BudgetYearOne": {
                    "val": "121.690"
                },
                "BudgetYearOneBase": {
                    "val": "121.690"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "117.724"
                },
                "CurrentYear": {
                    "val": "105.673"
                },
                "BudgetYearOne": {
                    "val": "123.438"
                },
                "BudgetYearOneBase": {
                    "val": "123.438"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.900"
                },
                "CurrentYear": {
                    "val": "-0.074"
                },
                "BudgetYearOne": {
                    "val": "1.748"
                },
                "BudgetYearOneBase": {
                    "val": "1.748"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.074"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.900"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.748"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.748"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY16 increase due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "622401"
                    },
                    "ProjectTitle": {
                        "val": "Structures"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.346"
                        },
                        "CurrentYear": {
                            "val": "32.756"
                        },
                        "BudgetYearOne": {
                            "val": "52.257"
                        },
                        "BudgetYearOneBase": {
                            "val": "52.257"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "49.685"
                        },
                        "BudgetYearThree": {
                            "val": "53.509"
                        },
                        "BudgetYearFour": {
                            "val": "55.185"
                        },
                        "BudgetYearFive": {
                            "val": "57.812"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY2015, Project 622401 Structures, Extreme Flight Technologies major thrust efforts, were moved to Project 622405 High Speed Systems Technology to better align efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops advanced structures concepts to exploit new materials and fabrication processes and investigates new concepts and design techniques.  New structural concepts include incorporating subsystem hardware items and adaptive mechanisms into the aerospace structures and\/or skin of the platform."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircraft Service Life Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop an economic service life analysis capability comprised of analysis tools, methodologies, and structural health monitoring technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.779"
                                            },
                                            "Text": {
                                                "val": "Completed development of engineered residual stress concepts, analysis, and applications. Continued the technology development concepts for risk informed decision-making. Continued technology efforts for condition-based maintenance of structural integrity. Continued the technology development of failure criteria tools for advanced aircraft composite and metallic components.  Continued efforts in certification of advanced composite for aircraft structures.  Developed an integrated system of data, models, and analysis tools that enable better decisions regarding fleet lifecycle management and sustainment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.934"
                                            },
                                            "Text": {
                                                "val": "Complete technology development concepts for risk informed decision-making. Complete technology efforts for condition- based maintenance of structural integrity. Initiate development of engineered residual stress methods for airframe life extension. Continue the technology development of failure criteria methods and tools for advanced aircraft composite and metallic components. Continue efforts in certification of advanced composite for aircraft structures. Continue efforts in Airframe Digital Twin to develop an integrated system of data, models, and analysis tools that enable better decisions regarding fleet lifecycle management and sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.717"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.717"
                                            },
                                            "Text": {
                                                "val": "Continue development of engineered residual stress methods for airframe life extension.  Continue the technology development of failure criteria methods and tools for advanced aircraft composite and metallic components.  Continue efforts in certification of advanced composite for aircraft structures. Continue efforts in Airframe Digital Twin to develop an integrated system of data, models, and analysis tools that enable better decisions regarding fleet lifecycle management and sustainment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Design Technologies"
                                    },
                                    "Description": {
                                        "val": "Vehicle Design Technologies\nDevelop methodologies to reduce the cost and time involved from design to full-scale testing of structural concepts and aircraft systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.641"
                                            },
                                            "Text": {
                                                "val": "Continued development of multi-disciplinary methodologies that will allow for lower cost advanced structures. Continued the development of advanced high fidelity aircraft design analysis tools. Continued development of high fidelity multidisciplinary design methods to enable efficient supersonic air vehicle technologies.  Completed development of a design framework for design of small Remotely Piloted Aircraft (RPA) including noise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.656"
                                            },
                                            "Text": {
                                                "val": "Complete high fidelity multidisciplinary design methods to enable efficient supersonic air vehicle technologies.  Complete development of multi-disciplinary methodologies that will allow for lower cost advanced structures. Continue the development of advanced high fidelity aircraft design analysis tools.  Initiate design methods for innovative control of supersonic tailless aircraft.  Initiate parametric modeling methods for integrated multidiscipline collaborative design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.709"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.709"
                                            },
                                            "Text": {
                                                "val": "Continue the development of advanced high fidelity aircraft design analysis tools.  Continue design methods for innovative control of supersonic tailless aircraft.  Continue parametric modeling methods for integrated multidiscipline collaborative design.  Continue high-fidelity technology assessment and design of next generation mobility concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Structural Concepts"
                                    },
                                    "Description": {
                                        "val": "Structural Concepts.  \nDevelop design methods, processes, and lightweight, adaptive, and multifunctional structural concepts to capitalize on new materials, multi-role considerations, and technology integration into aircraft systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.816"
                                            },
                                            "Text": {
                                                "val": "Completed the development of low-cost technologies to increase the survivability and performance of future systems. Developed innovative energy efficient conformal load bearing antenna structural concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.166"
                                            },
                                            "Text": {
                                                "val": "Continue innovative energy efficient conformal load bearing antenna structural concepts. Initiate development of lightweight, adaptive, and efficient structural concepts for mobility and special operations.  Initiate ultra low cost airframe design and manufacturing methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.831"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.831"
                                            },
                                            "Text": {
                                                "val": "Continue innovative energy efficient conformal load bearing antenna structural concepts.  Continue development of lightweight, adaptive, and efficient structural concepts for mobility and special operations.  Continue ultra low cost airframe design and manufacturing methods.  Initiate development of lightweight aircraft structural concepts for future air dominance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extreme Flight Environment Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies that will permit the structural development of platforms that can operate at an extreme altitude, while at sustained speeds greater than Mach 2."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.110"
                                            },
                                            "Text": {
                                                "val": "Continued to develop structural design concepts that incorporate promising materials and components for the creation of an integrated vehicle structure that can withstand extreme flight environments.  Validated extreme environment prediction methods to develop key hot structure design data.  Continued development of analytical methods for predicting structural response needed for design and evaluation of hot primary structure for hypersonic vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY2015, Project 622401 Structures, Extreme Flight Technologies major thrust efforts, were moved to Project 622405 High Speed Systems Technology to better align efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622403"
                    },
                    "ProjectTitle": {
                        "val": "Flight Controls and Pilot-Vehicle Interface"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.663"
                        },
                        "CurrentYear": {
                            "val": "29.478"
                        },
                        "BudgetYearOne": {
                            "val": "27.578"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.578"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "28.465"
                        },
                        "BudgetYearThree": {
                            "val": "29.921"
                        },
                        "BudgetYearFour": {
                            "val": "30.480"
                        },
                        "BudgetYearFive": {
                            "val": "31.107"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies that enable maximum affordable capability from manned and remotely piloted aerospace vehicles.  Advanced flight control technologies are developed for maximum vehicle performance throughout the flight envelope and simulated in virtual environments.  Resulting technologies contribute significantly towards the development of reliable autonomous remotely piloted air vehicles, hypersonic aircraft,and extended-life legacy aircraft."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Flight Controls Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for advanced control-enabled capabilities, including flight controls, components, and integrated vehicle monitoring systems for both manned and remotely piloted aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.650"
                                            },
                                            "Text": {
                                                "val": "Continued the development, demonstration, and assessment of advanced flight control mechanization technologies for trusted and certifiable operations under adverse and contested environments. Continued development of survivable and health-adaptive control system architectures. Completed the assessment of adaptive guidance and control technologies for fault\/damage tolerance in unmanned space access systems. Completed development of control configurations for small remotely piloted aerospace systems. Initiate development of adaptive guidance and control technologies for small-scale hypersonic air vehicles"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.846"
                                            },
                                            "Text": {
                                                "val": "Continue the development, demonstration, and assessment of advanced flight control mechanization technologies for trusted and certifiable operations under adverse and contested environments. Continue the development of survivable and health-adaptive control system architecture; developing new methods and expanding to include more aircraft systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.152"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.152"
                                            },
                                            "Text": {
                                                "val": "Continue the development, demonstration, and assessment of advanced flight control mechanization technologies for trusted and certifiable operations under adverse and contested environments. Continue the development of survivable and health-adaptive control system architecture; developing new methods and expanding to include more aircraft systems. Complete the development of adaptive guidance and control technologies for small-scale hypersonic air vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manned and Unmanned Teaming Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technology for flight control systems that will permit safe interoperability between manned and remotely piloted aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.792"
                                            },
                                            "Text": {
                                                "val": "Continued development, demonstration, and assessment of advanced control automation techniques. Continued the development of mixed initiative control techniques for multiple remotely piloted aircraft teams in dynamic mission environments, as well as for the integration of unmanned systems into controlled airspace and airbase operations. Developed and assessed manned-unmanned aircraft teams in tactical environments.  Completed proof of concept demonstration of autonomous aircraft operations on an airfield."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.297"
                                            },
                                            "Text": {
                                                "val": "Continue development, demonstration, and assessment of advanced control automation techniques. Continue the development of mixed initiative control techniques for teams of remotely piloted aircraft and\/or manned-unmanned teams in contested,dynamic mission environments, as well as for the integration of unmanned systems into controlled airspace and airbase operations.  Complete study of airbase infrastructure options and implications, and initiate systems prototype development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.101"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.101"
                                            },
                                            "Text": {
                                                "val": "Continue development, demonstration, and assessment of advanced control automation techniques. Continue the development of mixed initiative control techniques for teams of remotely piloted aircraft and\/or manned-unmanned teams in contested, dynamic mission environments, as well as for the integration of unmanned systems into controlled airspace and airbase operations. Complete development of airborne control of Unmanned Air Systems (UAS) in preparation for flight test activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Controls Technologies Modeling and Simulation"
                                    },
                                    "Description": {
                                        "val": "Develop tools and methods for capitalizing on simulation-based research and development of future aerospace vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.221"
                                            },
                                            "Text": {
                                                "val": "Continued modeling and simulation efforts to evaluate emerging autonomous and robust flight control technologies and concepts, as well as assess mission-level performance of integrated aerospace systems. Continued analyses of automated unmanned air systems in controlled airspace and airbase operations, as well as in adversarial mission environments. Continued trade studies of vehicle concepts for strike, mobility and reconnaissance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.335"
                                            },
                                            "Text": {
                                                "val": "Continue modeling and simulation efforts to evaluate emerging autonomous and robust flight control technologies and concepts, as well as assess mission-level performance of integrated aerospace systems. Continue analyses of automated unmanned air systems and manned-unmanned teams in controlled airspace and airbase operations, as well as in adversarial mission environments, initiating development of testbed for emerging technologies. Continue trade studies of vehicle concepts for strike, mobility and reconnaissance. Complete autonomy in mobility testbed and begin evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.325"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.325"
                                            },
                                            "Text": {
                                                "val": "Continue modeling and simulation efforts to evaluate emerging autonomous and robust flight control technologies and concepts, as well as assess mission-level performance of integrated aerospace systems. Continue analyses of automated unmanned air systems and manned-unmanned teams in controlled airspace and airbase operations, as well as in adversarial mission environments. Continue trade studies of vehicle concepts for strike, mobility and reconnaissance.\nComplete manned-unmanned teaming testbed and begin evaluations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622404"
                    },
                    "ProjectTitle": {
                        "val": "Aeromechanics and Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.715"
                        },
                        "CurrentYear": {
                            "val": "27.287"
                        },
                        "BudgetYearOne": {
                            "val": "28.674"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.674"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "28.691"
                        },
                        "BudgetYearThree": {
                            "val": "29.579"
                        },
                        "BudgetYearFour": {
                            "val": "29.617"
                        },
                        "BudgetYearFive": {
                            "val": "29.780"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY2015, Project 622404 Aeromechanics and Integration, Concepts, Designs, and Analysis of High Speed Technologies major thrust efforts, were moved to Project 622405 High Speed Systems Technology to better align efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops aerodynamic configurations of a broad range of revolutionary, affordable aerospace vehicles.  It matures and applies modeling and numerical simulation methods for fast and affordable aerodynamics prediction and integrates and demonstrates multi-disciplinary advances in airframe, propulsion, weapon and air vehicle control integration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aerodynamic Systems Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop aerodynamic assessment prediction methods centered on expanding the design capabilities of future air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.506"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and assess aeronautical technologies that enable broad use of unmanned aircraft.  Completed demonstration of flow control techniques to enable unsteady load suppression for unmanned ISR platforms and future fleet mobility aircraft to increase aerodynamic efficiency.  Continued development of innovative aerodynamic control methods for integrating high bypass propulsion for unmanned ISR platforms and future mobility aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.245"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and assess aerodynamic technologies that enable future revolutionary manned and unmanned air vehicles. Continue to develop and assess advanced aircraft configurations for Mobility and Future Air Dominance. Complete technology assessments on Future Air Dominance vehicle concepts. Initiate technology assessments on next generation tanker systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.689"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.689"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and assess aerodynamic technologies that enable future revolutionary manned and unmanned air vehicles. Complete development and assessment of advanced aircraft configurations for Mobility. Continue to develop and assess advanced aircraft configurations for Future Air Dominance.  Complete technology assessments on next generation tanker systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Concepts, Designs, and Analysis of High Speed Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop new and improved concepts, designs, and analysis of technologies to enable revolutionary capabilities for sustained high-speed re-useable high altitude vehicle efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.447"
                                            },
                                            "Text": {
                                                "val": "Continued to develop technologies to enable high-speed flight. Continued development of analysis\/design techniques and tools to enable shock\/boundary layer interaction flow control and enhanced stability for high-speed propulsion concepts. Continued efforts to characterize high-speed phenomena and develop and validate fundamental high-speed component technologies through experimental testing in a relevant environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY2015, Concepts, Designs, and Analysis of High Speed Technologies major thrust efforts, were moved to Project 622405 High Speed Systems Technology to better align efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Aerodynamic Technologies"
                                    },
                                    "Description": {
                                        "val": "To develop and assess technologies for the next generation of multi-role large aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.762"
                                            },
                                            "Text": {
                                                "val": "Continued high fidelity aerodynamic analysis and method development for Mobility and Future Air Dominance. Continued development of practical laminar flow technologies for highly swept wings. Completed studies and analysis to investigate more extensive legacy fleet fuel savings opportunities for drag reduction and formation flight."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.929"
                                            },
                                            "Text": {
                                                "val": "Continue development of high fidelity aerodynamic analysis and method development for Mobility and Future Air Dominance. Continue development of practical laminar flow technologies for highly swept wings.  Initiate aerodynamics technologies to enable control of supersonic tailless aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.415"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.415"
                                            },
                                            "Text": {
                                                "val": "Continue development of high fidelity aerodynamic analysis and method development for Mobility and Future Air Dominance.  Continue development of practical laminar flow technologies for highly swept wings.  Continue development of aerodynamics technologies to enable control of supersonic tailless aircraft.  Initiate development of flow control techniques to increase the efficiency of practical laminar flow technologies for highly swept wings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Integration Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop enabling technologies to allow efficient and effective integration of propulsion, weapons, and subsystems into current and future air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.113"
                                            },
                                            "Text": {
                                                "val": "Develop aerodynamic and propulsion integration technologies that enable future mobility and fighter aircraft. Develop analyses and experiments to investigate propulsion integration flow control to enhance Mobility and Future Air Dominance vehicle performance. Develop innovative aerodynamic design methods for integrating high bypass propulsion for future mobility aircraft. Develop advanced kinetic and directed energy weapons integration technologies for Future Air Dominance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.570"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.570"
                                            },
                                            "Text": {
                                                "val": "Continue to develop aerodynamic and propulsion integration technologies that enable future mobility and fighter aircraft. Continue to develop analyses and experiments to investigate propulsion integration flow control to enhance Mobility and Future Air Dominance vehicle performance. Continue innovative aerodynamic design methods for integrating high bypass propulsion for future mobility aircraft. Continue development of advanced kinetic and directed energy weapons integration technologies for Future Air Dominance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622405"
                    },
                    "ProjectTitle": {
                        "val": "High Speed Systems Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "16.152"
                        },
                        "BudgetYearOne": {
                            "val": "14.929"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.929"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "15.925"
                        },
                        "BudgetYearThree": {
                            "val": "16.547"
                        },
                        "BudgetYearFour": {
                            "val": "18.223"
                        },
                        "BudgetYearFive": {
                            "val": "23.529"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY2015, Project 622401 Structures, Extreme Flight Technologies major thrust efforts, were moved to Project 622405 High Speed Systems Technology to better align efforts.\n\nIn FY2015, Project 622404 Aeromechanics and Integration, Concepts, Designs, and Analysis of High Speed Technologies major thrust efforts, were moved to Project 622405 High Speed Systems Technology to better align efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program investigates, analyzes and develops high speed\/hypersonic aerospace vehicle technologies. Advanced high temperature structures concepts are explored and developed to exploit new materials, fabrication processes, and design techniques. Advanced aerodynamic vehicle configurations are developed and analyzed through simulations, experiments, and multi-disciplinary analyses. Advanced flight control technologies are developed and simulated for hypersonic vehicles. These technologies will enable future high speed weapons; intelligence, surveillance and reconnaissance systems; and space access vehicles"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Speed Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Develop high temperature structural analysis methods and technologies for extreme operating conditions in current and future air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.231"
                                            },
                                            "Text": {
                                                "val": "Initiate development of innovative structural concepts for high speed\/hypersonic air vehicles.  Initiate development of analytical methods for predicting structural response needed for design and evaluation of hot primary structure for hypersonic vehicles.   Initiate the impact of path dependent structural behavior on the service life prediction for hot structures encountering extreme environments. Initiate the development and integrate model uncertainty methods into multi-disciplinary simulations and quantify its impact on the structural margin. Initiate development of structural analysis methods and technology for hot structure concepts under extreme environment loading conditions. Initiate the assessment of the aerospace community to quantify the structural margins for extreme environment hot structure through experimental validation of ground test articles. Complete fabrication and initiate testing of representative vehicle structures for combined aero, thermal, and acoustic loads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.425"
                                            },
                                            "Text": {
                                                "val": "Continue development of innovative structural concepts for high speed\/hypersonic air vehicles. Continue development of analytical methods for predicting structural response needed for design and evaluation of hot primary structure for hypersonic vehicles. Continue to assess the impact of path dependent structural behavior on the service life prediction for hot structures encountering extreme environments. Continue to develop and integrate model uncertainty methods into multi-disciplinary simulations and quantify its impact on the structural margin. Continue development of structural analysis methods and technology for hot structure concepts under extreme environment loading conditions. Continue the assessment of the aerospace community to quantify the structural margins for extreme environment hot structure through experimental validation of ground test articles. Complete testing of representative vehicle structures for combined aero, thermal, and acoustic loads. Validate combined loads methodology to predict structural response."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed Vehicle Aeromechanics and Integration"
                                    },
                                    "Description": {
                                        "val": "Develop new and improved components, concepts, and designs for sustained flight of high-speed\/hypersonic expendable and re-useable vehicles. Conduct analyses of high speed\/hypersonic vehicles to enable revolutionary capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.921"
                                            },
                                            "Text": {
                                                "val": "Mature critical technologies for high speed\/hypersonic flight. Begin development of design\/analysis techniques\/tools and experimental approaches to enable enhanced high-speed air induction system starting, operability, and performance for propulsion integration concepts over a wide range of flight conditions. Begin development of high speed system concepts that provide revolutionary capabilities. Investigate aeromechanic technologies to reduced drag and enable robust stability & control at low dynamic pressure flight conditions. Initiate efforts to characterize high-speed phenomena and develop and validate fundamental high-speed technologies through experimental testing. As part of international collaborative effort, conduct flight tests  boundary layer transition experiment. Develop design of multi-functional terminal sensor integrated flight experiment. Assess mission-level effectiveness and refine definition of preferred high speed weapon alternatives. Develop campaign-level modeling and simulation of high speed weapon alternatives. Assess campaign-level benefits of preferred high speed weapon alternatives"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.504"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.504"
                                            },
                                            "Text": {
                                                "val": "Mature critical technologies for high speed\/hypersonic flight. Continue development of design\/analysis techniques\/tools and experimental approaches to enable enhanced high-speed air induction system starting, operability, and performance for propulsion integration concepts over a wide range of flight conditions. Complete performance and operability ground testing of advanced high contraction ratio inlets. Continue development of high speed system concepts that provide revolutionary capabilities. Investigate aeromechanic technologies to reduced drag and enable robust stability and control at low dynamic pressure flight conditions. Continue efforts to characterize high-speed phenomena and develop and validate fundamental high-speed technologies through experimental testing. As part of international collaborative effort, conduct flight tests of Mach 6 adaptive guidance and control flight experiment. Assess mission-level effectiveness and refine definition of preferred high speed weapon alternatives and limited life hypersonic intelligence, surveillance, and reconnaissance vehicles. Assess campaign-level benefits of preferred high speed weapon alternatives."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}