{
    "id": "f9ddd3f681469f9993859459732492e511f9bbe2",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602750N"
        },
        "ProgramElementTitle": {
            "val": "(U)Future Naval Capabilities Applied Research"
        },
        "R1LineNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "162.580"
            },
            "CurrentYear": {
                "val": "175.924"
            },
            "BudgetYearOne": {
                "val": "179.686"
            },
            "BudgetYearOneBase": {
                "val": "179.686"
            },
            "BudgetYearTwo": {
                "val": "178.954"
            },
            "BudgetYearThree": {
                "val": "182.122"
            },
            "BudgetYearFour": {
                "val": "186.155"
            },
            "BudgetYearFive": {
                "val": "185.155"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) address the Applied Research associated with the Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the Navy Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are identified by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders. The Enabling Capabilities (ECs) and associated technology product investments of the FNC Program are competitively selected by a 3-star Technology Oversight Group (TOG), chartered by the S&T Corporate Board and representing the requirements, acquisition, research and fleet\/forces communities of the Navy and the Marine Corps.  \n\nThis was a new PE in FY 2013 that consolidated all Navy 6.2 FNC Program investments into a single Navy 6.2 PE.  Marine Corps FNC 6.2 investments are consolidated in a single Marine Corps 6.2 PE (0602131M). In FY 2011 and FY 2012, Navy 6.2 FNC Program investments were spread across 7 separate 6.2 PEs:  0602114N, 0602123N, 0602235N, 0602236N, 0602271N, 0602747N and 0602782N.  The consolidation in this PE allows all investments to be viewed by FNC Pillar, Enabling Capability (EC) and Technology Product.  It greatly enhances the visibility of the FNC Program by providing an easily navigable overview of all 6.2 FNC investments in a single place."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "169.710"
                },
                "CurrentYear": {
                    "val": "170.786"
                },
                "BudgetYearOne": {
                    "val": "175.936"
                },
                "BudgetYearOneBase": {
                    "val": "175.936"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "162.580"
                },
                "CurrentYear": {
                    "val": "175.924"
                },
                "BudgetYearOne": {
                    "val": "179.686"
                },
                "BudgetYearOneBase": {
                    "val": "179.686"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.130"
                },
                "CurrentYear": {
                    "val": "5.138"
                },
                "BudgetYearOne": {
                    "val": "3.750"
                },
                "BudgetYearOneBase": {
                    "val": "3.750"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.162"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "5.300"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-7.130"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.341"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.341"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "6.091"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.091"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "(U)Future Naval Capabilities Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "162.580"
                        },
                        "CurrentYear": {
                            "val": "170.624"
                        },
                        "BudgetYearOne": {
                            "val": "179.686"
                        },
                        "BudgetYearOneBase": {
                            "val": "179.686"
                        },
                        "BudgetYearTwo": {
                            "val": "178.954"
                        },
                        "BudgetYearThree": {
                            "val": "182.122"
                        },
                        "BudgetYearFour": {
                            "val": "186.155"
                        },
                        "BudgetYearFive": {
                            "val": "185.155"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "FNC investments are typically 3-5 years in duration.  They provide a continuance of basic research by maturing technologies from a Technology Readiness Level (TRL) of 3 or 4 to a TRL of 6.  All FNC products require BA2 and BA3 funded technology development, which is coordinated to ensure tangible technology products are delivered upon completion of each investment.  Each year the TOG refreshes the FNC Program by approving new ECs and technology products as older ones get delivered.  After transition to an acquisition program, FNC products are further engineered, integrated and, ultimately, delivered to the warfighter. The development and delivery of each FNC product is guided by a Technology Transition Agreement (TTA) that is signed by the requirements and acquisition sponsors, as well as the S&T developer.\n\nThis project supports the naval pillars of Capable Manpower, Enterprise and Platform Enablers, Expeditionary Maneuver Warfare, Force Health Protection, Forcenet, Power and Energy, Sea Basing, Sea Shield and Sea Strike.  Each of these pillars is listed as a separate R-2 Activity, as is FNC Management.  Under each R-2 Activity, the BA 6.2 accomplishments and plans for every Enabling Capability (EC) and Technology Product in the FNC Program are listed.  ECs are composed of one or more interrelated technology products, so for clarity, each product is shown under its EC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CAPABLE MANPOWER (CMP)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Capable Manpower (CMP) FNC pillar.  The CMP Pillar develops deliverable technologies that provide new capabilities in manpower and personnel management, training and education, and human-systems integration for more intuitive systems.\n\nThe FY 2015 to FY 2016 increase was due primarily to the ramp-up of CMP-FY15-01 and CMP-FY15-02, and the initiation of CMP-FY16-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  CMP-FY10-01 INFORMATION ARCHITECTURE FOR IMPROVED DECISION MAKING\n-  Complete Data Triage - Develop an information architecture that merges the data 'behind the glass' in support of a submarine mission planning toolset.  \n- Complete Display Information with Uncertainty - Develop an intuitive submarine mission planning display that combines navigation planning, intelligence tasking, search planning, bathymetry and operational planning.\n\nEC:  CMP-FY10-02 ADAPTIVE TRAINING TO ENHANCE INDIVIDUAL AND TEAM LEARNING AND PERFORMANCE\n-  Complete Adaptive Training for Combat Information Center Teams - Develop adaptive training system components to enhance individual and team training for surface ship Combat Information Center personnel.\n-  Complete Adaptive Training for Submarine Navigation & Piloting Teams - Develop an operator assessment framework that consists of performance measures, performance algorithms, and expert models to help instructors better judge performance and provide tailored, meaningful feedback to the sailor.\n\nEC:  CMP-FY11-01 NAVAL NEXT-GENERATION IMMERSIVE TECHNOLOGY (N2IT) \n- Continue Augmented Immersive Team Training (AITT) - Identify perceptual cues and expand the virtual training architecture for immersive training in urban and dense infrastructure environments.   \n- Continue Perceptual Training Systems and Tools (PercepTs) - Identify the perceptual cues in the urban and dense infrastructure and environment that may improve warfighter performance.\n\nEC:  CMP-FY11-02 PERFORMANCE SHAPING FUNCTIONS FOR ENVIRONMENTAL STRESSORS\n- Complete Performance Shaping Functions - Evaluate the impact of incorporating environmental stressors (fatigue, motion, vibration and extreme temperatures) into systems engineering tools for the development of complex Navy systems.\n\nEC:  CMP-FY12-01 LIVE, VIRTUAL, & CONSTRUCTIVE TRAINING FIDELITY\n- Continue Cognitive Fidelity Synthetic Environment - Develop optimal characteristics for virtual simulations to elicit the appropriate perceptual-cognitive responses for Naval aviation training.\n- Continue Tactics & Speech Capable Semi-Automated Forces - Conduct applied research to develop learner-aware semi autonomous forces.\n- Continue Virtual-Constructive Representations on Live Avionics Displays - Develop design guidelines for effective and safe representation of virtual and constructive assets on live displays. \n\nEC:  CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Platform Design and Acquisition Toolset - Develop methods and models to identify the crew capabilities required to operate a specific ship design during various missions under varying physical and cognitive loads.\n\nEC:  CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Initiate Dynamic, Adaptive & Modular Training for Unmanned Aerial Systems (UAS) - Characterize knowledge structures for semi-automated forces source data.\n- Initiate Selection for UAS Personnel (SUPer) - Characterize the knowledge skills and abilities required for operating Navy unmanned aircraft systems.\n- Initiate Unmanned Aerial Systems (UAS) Control Station Human Machine Interface - Identify the core platform-common and platform-specific information requirements leading to successful unmanned aircraft system operation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.296"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: CMP-FY11-01 NAVAL NEXT-GENERATION IMMERSIVE TECHNOLOGY (N2IT) \n- Complete Augmented Immersive Team Training (AITT) - Design and demonstrate software technology to deliver augmented reality scenarios tailored to the skills of the training audience for infantry operations.\n- Complete Perceptual Training Systems and Tools (PercepTs) - Identify the perceptual cues in the urban and dense infrastructure environments that may improve warfighter performance.\n\nEC: CMP-FY12-01 LIVE, VIRTUAL, & CONSTRUCTIVE TRAINING FIDELITY\n- Continue Cognitive Fidelity Synthetic Environment - Develop optimal characteristics for virtual simulations to elicit the appropriate perceptual-cognitive responses for Naval aviation training.\n- Continue Tactics & Speech Capable Semi-Automated Forces - Conduct applied research to develop learner-aware semi-autonomous forces.\n- Continue Virtual-Constructive Representations on Live Avionics Displays - Develop design guidelines for effective and safe representation of virtual and constructive assets on live displays.\n\nEC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Manpower Planning and Optimization Toolset - Develop analytical techniques, data collection methodologies, and procedures to create optimized manpower requirements for the platform. \n- Continue Platform Design and Acquisition Toolset - Develop scenario-based models that characterize crew performance to operate ship systems during 60\/90 day missions under varying physical and cognitive loads.\n\nEC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Continue Dynamic, Adaptive & Modular Training for UAS - Expand Activity Learning capability to allow automatic matching between UAS operator training objectives, specific training contexts, and semi-automated forces behaviors.\n- Continue Selection for UAS Personnel (SUPer) - Develop mission scenarios to enable testing for the knowledge, skills and abilities required for operating Navy unmanned aircraft systems and integrate into an appropriate UAS simulator.\n- Continue UAS Control Station Human Machine Interface - Develop metrics that assess UAS Operator performance in terms of the likelihood of leading to successful unmanned aircraft system operation.\n\nEC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Initiate Decision Making-Learning Management System (DM-LMS) - Identify S&T solutions for Decision Making (DM) and instructional method guidelines and develop software products to plan, assess, and track decision making skill development.\n- Initiate Digital Integrated Representation of Tactical Environment (DIRTE) - Identify S&T solutions for classroom and sustainment training and develop rapid terrain modeling and sketchpad software products to enable small unit leaders and instructors to create effective decision making environments and scenarios.\n- Initiate Simulation Tailored Training and Assessment (ST2A) - Identify S&T solutions for situated tutor techniques and unobtrusive monitoring techniques and develop software and hardware prototypes to execute a decision making program of instruction and scenarios in simulation.\n\nEC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\n- Initiate Environment Designed to Undertake Counter A2AD Tactics Training & Experimentation (EDUCAT2E) - Investigate and develop an approach to an objective, metrics-driven training and experimentation capability for Fast Attack Craft and Mine Warfare threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.298"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.298"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: CMP-FY12-01 LIVE, VIRTUAL, & CONSTRUCTIVE TRAINING FIDELITY\n- Complete Cognitive Fidelity Synthetic Environment - Develop optimal characteristics for virtual simulations to elicit the appropriate perceptual-cognitive responses for Naval aviation training.\n- Complete Tactics & Speech Capable Semi-Automated Forces - Conduct applied research to develop learner-aware semi-autonomous forces.\n- Complete Virtual-Constructive Representations on Live Avionics Displays - Develop design guidelines for effective and safe representation of virtual and constructive assets on live displays.\n\nEC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Manpower Planning and Optimization Toolset - Optimize manpower variables (task allocation, job and occupation codes, billets, and training) to better estimate the manpower components of ship total ownership cost.\n- Continue Platform Design and Acquisition Toolset - Develop assessment reporting tools that identify the dependencies, drivers, and risks associated with different platform designs and manning configurations.\n\nEC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Continue Dynamic, Adaptive & Modular Training for UAS - Expand the activity learning capability to allow automatic matching between UAS operator training objectives, specific training contexts, and computer generated force behaviors.\n- Continue Selection for UAS Personnel (SUPer) - Develop mission scenarios to enable testing for the knowledge, skills and abilities required to operate Navy unmanned aircraft systems and integrate them into an appropriate UAS simulator.\n- Continue UAS Control Station Human Machine Interface - Develop metrics that assess UAS Operator performance in terms of the likelihood of leading to successful unmanned aircraft system operation.\n\nEC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Continue Decision Making-Learning Management System (DM-LMS) - Develop new technology solutions for decision making, instructional method guidelines, and software products to plan, assess, and track decision making skill development.\n- Continue Digital Integrated Representation of Tactical Environment (DIRTE) - Develop new technology solutions for classroom and sustainment training and develop rapid terrain modeling and sketchpad software products to enable small unit leaders and instructors the ability to create effective decision making environments and scenarios.\n- Continue Simulation Tailored Training and Assessment (ST2A) - Develop new technology solutions for situated tutor techniques and unobtrusive monitoring techniques, and develop software and hardware prototypes to execute a decision making program of instruction and scenarios in simulation.\n\nEC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\n- Continue Environment Designed to Undertake Counter A2AD Tactics Training & Experimentation (EDUCAT2E) - Investigate and develop an approach to an objective, metrics-driven training and experimentation capability for Fast Attack Craft and Mine Warfare threats.\n\nEC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Initiate Operational Planning Tool - Develop decision support analytic tools that enhance collaborative planning for generating and executing safe and effective navigation & operational plans."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENTERPRISE AND PLATFORM ENABLERS (EPE)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Enterprise and Platform Enablers (EPE) FNC pillar.  The EPE Pillar develops cross-cutting, deliverable technologies that provide new capabilities for naval service platforms that lower acquisition, operations and maintenance costs, improve system safety and availability, and improve platform survivability.   \n\nThe FY 2014 to FY 2015 decrease was due primarily to the completion of EPE-FY10-01, EPE-FY10-02 and EPE-FY11-01, and the planned ramp-down of EPE-FY10-03, EPE-FY12-01 and EPE-FY13-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.020"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  EPE-FY09-07 AFFORDABLE SUBMARINE PROPULSION AND CONTROL ACTUATION\n- Continue Advanced Material Propeller - Conduct applied research to understand the failure mechanisms, cavitation erosion, shock, and fluid-structure interaction on composite marine propellers and develop predictive capability of these phenomena.\n\nEC:  EPE-FY10-01 ADVANCED SHIPBOARD WATER DESALINATION\n- Complete Advanced Navy Reverse Osmosis System (formerly known as both Desalination System and Pretreatment System) - Conduct Applied Research to understand fouling and maintenance issues for shipboard Reverse Osmosis desalination\/pretreatment systems and operational approaches to mitigate these problems.\n\nEC:  EPE-FY10-02 AFFORDABLE MODULAR PANORAMIC PHOTONICS MAST\n- Complete Compact Hyper-spectral Scanning Imager - Develop and integrate camera electronics, optics, scanner, imaging chips, and algorithms for a hyper-spectral imager providing low noise and high spectral fidelity in a small form factor.\n- Complete Compact Low Light Level Short, Wavelength Infrared (SWIR) Video Camera - Develop and integrate a Low Light Level Short, Wavelength Infrared (SWIR) Video Camera for an Affordable Modular Panoramic Photonics Mast.\n- Complete Modular Photonics Mast Housing - Develop, fabricate, and integrate panoramic headwindows into a prototype for an Affordable Modular Panoramic Photonics Mast.\n\nEC:  EPE-FY10-03 CORROSION AND CORROSION RELATED SIGNATURE TECHNOLOGIES FOR INCREASED OPERATIONAL AVAILABILITY\n- Complete Advanced Active Shaft Grounding System (ASGS)\/Shaft Current Sensor - Evaluate system interaction with Impressed Current Cathodic Protection (ICCP) control.\n- Complete Dual-Use Corrosion\/Signature Sensor for Ballast Tanks - Complete development of analysis and control methods to negate current flow and maintain corrosion control.\n- Continue Advanced-Robust Impressed Current Cathodic Protection (ICCP) Anodes and Reference Cells - Conduct scale modeling to define optimum routing of cables to minimize corrosion related magnetic signature.\n\nEC:  EPE-FY11-01 FLIGHT DECK THERMAL MANAGEMENT \n- Continue Integrated Thermal Management System Design - Test panels for heat transfer capabilities.\n\nEC:  EPE-FY12-01 CORROSION MITIGATION TECHNOLOGIES \n- Continue Corrosion Resistant Surface Treatment - Develop a single step treatment to eliminate the need for pre- and post-processes. \n- Continue Sprayable Acoustic Damping Systems - Verify damping characteristics and complete evaluation of corrosion properties and application methodologies.\n\nEC:  EPE-FY12-02 INTEGRATED HYBRID STRUCTURAL MANAGEMENT SYSTEM (IHSMS)\n- Continue Distributed Structural Micro-Sensor Nodes - Conduct research in wireless energy harvesting sensors and other advanced sensors, architectures, and diagnostics technologies for rotorcraft structural health management.\n- Continue Rotor - Hot Spot Sensors and Integration - Evaluate and optimize rotor-hot spot sensors and integration technologies that allow improved health assessment of rotating frame and selected structural hot spots.\n\nEC:  EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Continue Tools for Predicting Array Operational Loading & Distribution - Move from Phase I to Phase II of the model development effort building upon the initial effort to incorporate global\/multi-scale models and coupling on the array under all operating conditions\n\n EC:  EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Initiate Aluminum Alloy Corrosion Mitigation Technologies - Formulate coatings and investigate coating properties on corrosion inhibition, degree of thermal load reduction, and adhesion over Al 5XXX alloys.\n- Initiate Aluminum Alloy Corrosion Prediction Tool - Develop algorithm for Al 5XXX alloy evaluation and for prediction of time-to-failure.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Initiate Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Conduct Navy gas turbine hot corrosion analysis and experimentation under shipboard environmental conditions and power scales.\n\nEC: EPE -FY15-03 SPECIAL HULL TREATMENT\n- Initiate New Materials Development and Laboratory Characterization- Begin applied research."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.357"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EPE-FY09-07 AFFORDABLE SUBMARINE PROPULSION AND CONTROL ACTUATION\n- Complete Advanced Material Propeller - Assess blade\/hub joint strength, perform blade fatigue and deflection testing, and static and dynamic testing of the complex hub unit.\n\nEC: EPE-FY10-03 CORROSION AND CORROSION RELATED SIGNATURE TECHNOLOGIES FOR INCREASED OPERATIONAL AVAILABILITY\n- Complete Advanced-Robust ICCP Anodes and Reference Cells - Complete reference cell laboratory performance testing and down select.\n\nEC:  EPE-FY11-01 FLIGHT DECK THERMAL MANAGEMENT \n- Complete Integrated Thermal Management System Design - Test panels for heat transfer capabilities.\n\nEC: EPE-FY12-01 CORROSION MITIGATION TECHNOLOGIES\n- Continue Corrosion Resistant Surface Treatment - Complete development of single-step treatment.\n- Continue Sprayable Acoustic Damping Systems - Complete corrosion testing of prototype Sprayable Acoustic Damping system.\n\nEC: EPE-FY12-02 INTEGRATED HYBRID STRUCTURAL MANAGEMENT SYSTEM (IHSMS)\n- Continue IHSMS Fleet Structural Health Management Decision Tool (formerly known as Distributed Structural Micro-Sensor Nodes and Rotor Hot Spot Sensors and Integration) - Conduct research in wireless energy harvesting sensors for rotorcraft structural health management, and evaluate and optimize rotor-hot spot sensors and integration technologies that allow improved health assessment of rotating frame and selected structural hot spots.\n\nEC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Continue Tools for Predicting Array Operational Loading & Distribution - Develop individual predictive models for hydrodynamic effects on a towed array that include the forces imparted on a towed array by the handling system and the effects of the combined forces on array internal components.\n\nEC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Continue coating formulation and evaluate properties.\n- Continue Aluminum Alloy Corrosion Prediction Tool - Develop algorithm for 5000 series aluminum alloy degree of sensitization and for prediction of Mean Time to Repair.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Conduct Navy gas turbine hot corrosion analysis and experimentation under shipboard environmental conditions and power scales.\n\nEC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Develop new materials mitigation technology for submarines."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.652"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.652"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EPE-FY12-01 CORROSION MITIGATION TECHNOLOGIES\n- Complete Corrosion Resistant Surface Treatment - Determine best Corrosion Resistant Surface Treatment among carbon, nitrogen, and carbonitration approaches.\n- Complete Sprayable Acoustic Damping Systems - Investigate and develop spray applied damping systems for improved structural vibration control.\n\nEC: EPE-FY12-02 INTEGRATED HYBRID STRUCTURAL MANAGEMENT SYSTEM (IHSMS)\n- Complete IHSMS Fleet Structural Health Management Decision Tool - Optimize physics and statistical based structural health models, rotor hot-spot sensors and integration technologies, and finalize risk reduction experiments.\n\nEC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Complete Tools for Predicting Array Operational Loading & Distribution - Develop a predictive model of the magnitude and distribution of hydrodynamic forces on a towed array and the effect of the forces on array internal components.\n\nEC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Investigate and develop advanced corrosion control and thermal load reduction coatings and surface treatment\/repair technologies for improved corrosion and cracking resistance on aluminum substrates.\n- Continue Aluminum Alloy Corrosion Prediction Tool - Develop a sensitization detection tool hardware and refine the prediction algorithm for determining the rate of sensitization.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Develop and evaluate a set of alloys and coatings to support higher temperature capable gas turbine operation.\n\nEC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Develop new hull treatment materials for submarines."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EXPEDITIONARY MANEUVER WARFARE (EMW)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Navy funded Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Expeditionary Maneuver Warfare (EMW) FNC Pillar.  The EMW Pillar develops deliverable technologies that provide new capabilities in expeditionary maneuver warfare, including naval ground forces, with special emphasis on regular and irregular warfare in urban environments and combating terrorism.  \n\nThe FY 2014 to FY 2015 decrease was due primarily to the planned ramp-down of EMW-FY12-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.904"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IMPROVISED EXPLOSIVE DEVICE ELECTRONIC WARFARE (JCREW)\n- Continue Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Develop techniques for real-time networking and cross-platform synchronization of distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (JCREW) platforms for improved efficiency and coordinated tasking.\n- Continue Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Develop techniques for improving compatibility between Radio Frequency (RF) systems, particularly jammers and communications, in order to allow continuous operations of each in a shared battlespace.\n\nEC:  EMW-FY13-01 AZIMUTH AND INERTIAL MICRO-ELECTRO-MECHANICA SYSTEM (MEMS) NAVIGATION SYSTEM\n- Continue Micro-Electro-Mechanical System (MEMS) Inertial Navigation System - Characterize the operational limitations and shortcomings of the digital magnetic compass and optimize sensor performance of MEMS to reduce target location error in the Navigation System of hand-held targeting systems.\n\nEC:  EMW-FY14-01 SPECTRAL AND RECONNAISSANCE IMAGERY FOR TACTICAL EXPLOITATION (SPRITE)\n- Initiate Automated Processing for Spectral Exploitation and Dissemination (APSED) - Conduct a feasibility effort to develop an Electro-Optical (EO) and Hyper-Spectral Imagery (HSI) image processing architecture that includes EO-to-HSI cross-correlation and fusion, image archiving and retrieval, and exploitation product generation.\n- Initiate Compact Wide Area Reconnaissance and Spectral Sensor (CWARSS) - Initiate efforts to develop a wide-area intelligence, surveillance and reconnaissance capability with simultaneous high spatial and spectral resolution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.741"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IED ELECTRONIC WARFARE (JCREW)\n- Continue Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Develop distributed resource allocation and RF situational awareness techniques to provide automated tactical-level distributed jamming on multiple ground-based EW systems.\n- Continue Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Develop components and techniques to enable simultaneous transmission and reception of EW and blue-force communication waveforms.\n\nEC:  EMW-FY13-01 AZIMUTH AND INERTIAL MICRO-ELECTRO-MECHANICA SYSTEM (MEMS) NAVIGATION SYSTEM\n- Complete Micro-Electro-Mechanical System (MEMS) Inertial Navigation System - Optimize sensor performance of MEMS to reduce target location error in the Navigation System of hand-held targeting systems.\n\nEC: EMW-FY14-01 SPECTRAL AND RECONNAISSANCE IMAGERY FOR TACTICAL EXPLOITATION (SPRITE)\n- Continue Automated Processing for Spectral Exploitation and Dissemination (APSED) - Conduct a feasibility effort to develop an Electro-Optical (EO) and Hyper-Spectral Imagery (HSI) image processing architecture that includes EO-to-HSI cross-correlation and fusion, image archiving and retrieval, and exploitation product generation.\n- Continue Compact Wide Area Reconnaissance and Spectral Sensor (CWARSS) - Complete preliminary hardware design for a wide-area intelligence, surveillance and reconnaissance capability with simultaneous high spatial and spectral resolution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IED ELECTRONIC WARFARE (JCREW)\n- Continue Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Refine radio frequency situational awareness techniques and distributed resource allocation on multiple ground-based Electronic Warfare systems by providing automated tactical-level distributed jamming.\n- Continue Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Enable the simultaneous transmission and reception of blue-force and  Electronic Warfare communication waveforms by finalizing the components and techniques.\n\nEC: EMW-FY14-01 SPECTRAL AND RECONNAISSANCE IMAGERY FOR TACTICAL EXPLOITATION (SPRITE)\n- Complete Automated Processing for Spectral Exploitation and Dissemination (APSED)  - Develop an Electro-Optical (EO) and Hyper-Spectral Imagery (HSI) Image Processing architecture that includes EO to HSI cross-correlation and fusion, image archiving and retrieval, and exploitation product generation.\n- Complete Compact Wide Area Reconnaissance and Spectral Sensor (CWARSS) - Develop preliminary hardware design for a wide-area intelligence, surveillance and reconnaissance capability with simultaneous high spatial and spectral resolution.\n\nEC: EMW-FY16-01 DENSIFIED PROPELLANT FIRE FROM ENCLOSURE - CONFINED SPACE (FFE\/CS) PROPULSION TECHNOLOGIES\n- Initiate Densified Propellant Fire From Enclosure - Confined Space (FFE\/CS) Propulsion Technologies - Refine tungsten-propellant mix, grain dimensions and configuration, and the fabrication process to reach suitable rocket nozzle exit velocities and sound pressure levels."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FNC MANAGEMENT"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity includes the Science and Technology (S&T) analyses and studies required to take new Future Naval Capabilities (FNC) Program Enabling Capabilities (ECs) approved by the Technology Oversight Group and produce the detailed technology specifications and performance metrics needed to procure the component level technologies that must be developed and tested in order to deliver technology products to the acquisition community.  This activity includes development and implementation of innovative and dynamically changing technology management business processes required to manage FNC investments supporting the naval capability pillars.  \n\nThe FY 2014 FY 2015 increase was due to a Technology Oversight Group decision to delay the start of some ECs which required ONR to align additional FY15 new start preparation funds to accommodate an increased number of ECs expected to receive initial technical funds.\n\nThe FY 2015 to FY 2016 decrease was due to the FY15 increase new start preparation funds noted above and a subsequent return in FY16 to normal funding levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.666"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  FNC MGMT-NEW START PREPARATIONS\n- Continue FNC Management - New Start Preparations - Conduct technology analysis and studies to support the development and validation of technology performance specifications to ensure new enabling capabilities are able to commence execution in a timely manner.\n\nEC:  FNC MGMT-SUPPORT\/OPS ANALYSIS\nContinue FNC Management - Support\/OPS Analysis - Conduct warfighter sustainment Applied Research and analysis, including technology management of FNC investments supporting the naval capability pillars."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.782"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC MGMT-NEW START PREPARATIONS\n- Continue FNC Management - New Start Preparations - Conduct technology analysis and studies to support the development and validation of technology performance specifications to ensure new enabling capabilities are able to commence execution in a timely manner.\n\nFNC MGMT-SUPPORT\/OPS ANALYSIS\n- Continue FNC Management - Support\/OPS Analysis - Conduct warfighter sustainment Applied Research and analysis, including technology management of FNC investments supporting the naval capability pillars."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.940"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.940"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC MANAGEMENT\n- Continue FNC Management - New Start Preparations - Conduct technology analysis and studies to support the development and validation of technology performance specifications to ensure new enabling capabilities are able to commence execution in a timely manner.\n- Continue FNC Management - Support\/OPS Analysis - Conduct warfighter sustainment Applied Research and analysis, including technology management of FNC investments supporting the naval capability pillars."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE HEALTH PROTECTION (FHP)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Force Health Protection (FHP) FNC pillar.  The FHP Pillar develops deliverable technologies that provide new capabilities that provide Sailors and Marines with the best possible protection from operational threats by reducing morbidity and mortality when casualties occur."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.678"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  FHP-FY10-01 HUMAN INJURY & TREATMENT MODEL\n- Complete Human Injury & Treatment Model - Complete the model for predicting outcomes of personnel exposure to shipboard damage.\n\nEC:  FHP-FY11-01 MULTIFUNCTIONAL BLOOD SUBSTITUTE (MFBS)\n- Continue Multifunctional Blood Substitute (MFBS) - Determine the optimal blood component mixture for a complete and shelf stable resuscitation fluid.\n\nEC:  FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM (ACCS) \n- Continue Automated Critical Care System (ACCS) - Formulate autonomous hardware and software system to monitor and maintain combat causalities with minimal human intervention during a 2-6 hour Casualty Evacuation (CASEVAC) scenario.\n \nEC:  FHP-FY12-02 SAVING LIVES WITH EMERGENCY MEDICAL PERFLUOROCARBONS IN THE FIELD (SEMPER FI) FOR SEA, AIR & LAND DYSOXIA\n- Continue Saving Lives with Emergency Medical Perfluorocarbons in the Field (SEMPer Fi) for Air Dysoxia - Perform down-select of candidate drugs based on small and large animal testing for treatment of pulmonary hypoxia\/hypoxemia.\n- Continue Saving Lives with Emergency Medical Perfluorocarbons in the Field (SEMPer Fi) for Land Blast Kit - Determine window of therapeutic intervention and dosing for immediate treatment of blast overpressure in small and large animals, including injury to the brain and\/or internal organs.\n\nEC:  FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH \n- Continue Hypoxia Alert and Mitigation System - Evaluate and adapt methods of detecting individual-specific detriments in performance in hypoxic conditions.\n\nEC:  FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Initiate Acute Care Cover for Severely Injured Limbs (ACCSIL) - Establish efficacy test parameters for innovative pharmaceutical solutions and novel materials for feasibility of use.\n\nEC:  FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Initiate Algorithm - Determine, establish and design test parameters of algorithm.\n- Initiate Neuro-Functional Assessment Tool - Establish and design a repeatable sensory modality.\n- Initiate Sensor - Determine and establish sensor metrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM \n- Continue Automated Critical Care System (ACCS) - Formulate autonomous hardware and software system to monitor and maintain combat causalities with minimal human intervention during a 2-6 hour Casualty Evacuation (CASEVAC) scenario.\n\nEC: FHP-FY12-02 SAVING LIVES WITH EMERGENCY MEDICAL PERFLUOROCARBONS IN THE FIELD (SEMPER FI) FOR SEA, AIR & LAND DYSOXIA\n- Complete SEMPer Fi for Air Dysoxia - Perform down-select of candidate drugs based on small and large animal testing for treatment of pulmonary hypertension.\n- Continue SEMPer Fi for Land Blast Kit - Determine window of therapeutic intervention and dosing with hypothermia for immediate treatment of blast overpressure in small and large animals, including injury to the brain and\/or internal organs.\n\nEC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH \n- Continue Hypoxia Alert and Mitigation System - Test algorithms to detect\/predict onset of hypoxia or hypoxia-like symptoms for mountain operators, casualties, and aviators.\n\nEC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Continue Acute Care Cover for Severely Injured Limbs (ACCSIL) - Establish efficacy test parameters for a fieldable wound cover to include novel outer cover materials and internal pharmaceutical coating that improve the clinical outcome of severe wounds.\n\nEC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Continue Algorithm - Determine, establish and design test parameters for an algorithm that integrates blast intensity data with cognitive impairment data to predict likelihood of brain injury after a given blast event.\n- Neuro-Functional Assessment Tool - Establish testing paradigm and sensory modality for a non-psychometric device that detects and estimates severity of traumatic brain injury.\n- Continue Sensor - Develop metrics for a self powered blast sensor that detects and quantifies acceleration, pressure, and impulse from a given blast event and outputs the data electronically."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.670"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.670"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FHP-FY11-01 MULTIFUNCTIONAL BLOOD SUBSTITUTE (MFBS)\n- Complete Multifunctional Blood Substitute (MFBS) - Determine if a highly concentrated or standard volume resuscitation fluid is physiologically and logistically superior.\n\nEC: FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM\n- Continue Automated Critical Care System (ACCS) - Formulate autonomous hardware and software system to monitor and maintain combat casualties with minimal human intervention during a 2-6 hour Casualty Evacuation scenario. \n\nEC: FHP-FY12-02 SAVING LIVES WITH EMERGENCY MEDICAL PERFLUOROCARBONS IN THE FIELD (SEMPER FI) FOR SEA, AIR & LAND DYSOXIA\n- Complete SEMPer Fi for Land Blast Kit - Determine window of therapeutic intervention and dosing with hypothermia for immediate treatment of blast overpressure in small and large animals, including injury to the brain or internal organs.\n\nEC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH \n- Continue Hypoxia Alert and Mitigation System - Conduct assembly of the sensor suite to detect and predict the onset of hypoxia and integrate mitigation strategies for individuals operating in high altitudes or Casualty Evacuation missions in unpressurized aircraft.\n\nEC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Continue Acute Care Cover for Severely Injured Limbs (ACCSIL) - Develop a fieldable wound cover comprising outer cover materials and an internal pharmaceutical coating that improves the clinical outcome of severe wounds.\n\nEC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Continue Algorithm - Collect experimental data for use in algorithm development that relates integrated blast intensity with cognitive impairment to predict the likelihood of brain injury after single or multiple blast exposures.\n- Continue Neuro-Functional Assessment Tool - Conduct experimental development of a non-psychometric device that detects and estimates the severity of traumatic brain injury.\n- Continue Sensor - Demonstrate a self-powered blast sensor in bench and laboratory testing for sensitivity to acceleration, pressure and impulse."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCENET (FNT)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Forcenet (FNT) FNC Pillar.  The FNT pillar develops deliverable technologies that provide new capabilities in Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR), networking, navigation, sensors, decision support, cyber-space, intelligence, and space technologies that will provide the architectural framework for naval warfare in the information age.  \n\nThe FY 2014 to FY 2015 decrease was due to the completion of FNT-FY10-01, FNT-FY10-02 and FNT-FY10-03, and the planned ramp-down of FNT-FY11-01, FNT-FY11-02 and FNT-FY12-01.\n\nThe FY 2015 to FY 2016 increase was due primarily to the planned ramp-up of FNT-FY15-01, FNT-FY15-02 and FNT-FY15-04, and the initiation of FHT-FY16-01 and FNT-FY16-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "34.531"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  FNT-FY10-02 ACTIONABLE INTELLIGENCE ENABLED BY PERSISTENT SURVEILLANCE\n- Complete Autonomous Unmanned Aerial Vehicle (UAV) Collision Avoidance System - Develop and integrate a prototype with lab-test hardware, software, and subsystems for collision avoidance of Unmanned Air Systems in the National Airspace System (NAS).\n- Complete Operational Adaptation Enterprise Services - Develop an information enterprise for the organization of contextual Resource Description Framework statements for rapid association of data into meaningful graphs and application services that could be orchestrated in near real-time for hybrid complex operations.\n- Complete Ultra Wide Field of View (FOV) Area Surveillance System - Develop and integrate lab-test algorithms and individual components of the sensor system.\n\nEC:  FNT-FY10-03 SATELLITE COMMUNICATIONS (SATCOM) VULNERABILITY MITIGATION\n- Complete Multi-Link Common Data Link (CDL) System - Complete supporting architecture, Radio Frequency (RF) distribution, and networking technology developments needed for a Multi-Link Common Data Link (CDL) System.\n\nEC:  FNT-FY11-01 PRO-ACTIVE COMPUTER NETWORK DEFENSE AND INFORMATION ASSURANCE\n- Continue Common Operational Security Decision System -Develop techniques for assessing the impact of network security policy on network operations.\n- Continue Next Generation Security and Security Management Protocols - Develop techniques for evaluating the security and performance of network communication paths to support fault-aware overlay routing.\n- Continue Next Generation Sensors and Gateways - Develop techniques for modeling network behavior, identifying abnormal events, and deriving corrective transformations.\n\nEC:  FNT-FY11-02 FAST MAGIC\n- Continue Fast Magic Product 1 - Conduct Applied Research (details classified).\n- Continue Fast Magic Product 2 - Conduct Applied Research (details classified).\n\nEC:  FNT-FY11-05 NRL SPACE\n- Continue Multi-INT Tracking - Develop vessel tracking algorithms and characterization techniques.\n- Continue Tagging - Perform data tagging research based on key parametric values used in the Maritime environment.\n\nEC:  FNT-FY12-01 ADVANCED TACTICAL DATA LINK (ATDL)\n- Continue Mission-Based Waveform Controls & Networking - Emulate preliminary design to validate performance against operational scenarios.\n\nEC:  FNT-FY12-02 AUTONOMOUS PERSISTENT TACTICAL SURVEILLANCE\n- Continue Autonomous Information-Based Surveillance Control - Analyze and continue development of improved algorithms and processing for information based collection and planning.\n- Continue Contextual Enterprise Information - Develop the analytical services framework, including enterprise exploitation services for situation context between relevant theater sensor collections and exploitation products. \n- Continue Mobile Autonomous Intelligence, Surveillance and Reconnaissance (ISR) to Command and Control (C2) Synchronization - Conduct applied research to develop enterprise distributed software that will manage complex event processing and temporal modeling of the Intelligence, Surveillance and Reconnaissance (ISR) to Command and Control (C2) time link budget.\n\nEC:  FNT-FY13-01 ELECTRONIC WARFARE BATTLE MANAGEMENT (EWBM) FOR SURFACE DEFENSE \n- Continue Electronic Warfare Battle Management (EWBM) - Develop coordinated Electronic Attack and deception (decoy) techniques to include novel use of existing hardware capabilities in real time necessary to manage the Electronic Warfare (EW) battle space.\n\nEC:  FNT-FY13-03 SILK THREAD\n- Initiate Product 1 - Conduct applied research (details classified).\n- Initiate Product 2 - Conduct applied research (details classified).\n\nEC:  FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Continue Adaptive Multi-Int Correlation & Identification (AMICA)  - Research and analyze algorithms to enable cross-domain information fusion and optimize use of remote sensing assets.\n- Continue Detection & Classification Algorithms (DCA) - Research and analyze algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC:  FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Initiate Adaptive Tasking, Collection, Processing, Exploitation and Dissemination (TCPED) for Anti-Submarine Warfare (ASW) Services - Develop advanced techniques for automated, high accuracy, low error rate, adaptive processing.\n- Initiate Data Exfiltration and Networked Platform Interaction - Details classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.133"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FNT-FY11-01 PRO-ACTIVE COMPUTER NETWORK DEFENSE AND INFORMATION ASSURANCE\n- Complete Common Operational Security Decision System - Develop interactive controls for map-based visualization of Computer Network Defense policy deployments.\n- Complete Next Generation Security and Security Management Protocols - Develop path-aware trusted routing algorithm for maximizing Information Assurance of security management communications.\n- Complete Next Generation Sensors and Gateways - Develop adaptive learning and decision algorithms for pro-active defense mechanisms and for creating Computer Network Defense policy.\n\nEC: FNT-FY11-02 FAST MAGIC\n- Complete Fast Magic Product 1 - Conduct applied research.\n- Complete Fast Magic Product 2 - Conduct applied research.\n\nEC: FNT-FY11-05 NRL SPACE\n- Complete Multi-INT Tracking - Develop vessel tracking algorithms and characterization techniques.\n- Complete Tagging - Perform data tagging research based on key parametric values used in the Maritime environment.\n\nEC: FNT-FY12-01 ADVANCED TACTICAL DATA LINK (ATDL)\n- Continue Mission-Based Waveform Controls & Networking - Develop baseline waveforms and validate performance against operational scenarios.\n\nEC: FNT-FY12-02 AUTONOMOUS PERSISTENT TACTICAL SURVEILLANCE\n- Continue Autonomous Information-Based Surveillance Control - Develop algorithms for information based UAV routing and patching.\n- Continue Contextual Enterprise Information - Develop the analytical services framework, including enterprise exploitation services for situation context between relevant theater sensor collections and exploitation products. \n- Continue Mobile Autonomous ISR to C2 Synchronization - Develop enterprise distributed software solution that will model mission tracks, translate these tracks to information tracks, and produce relevant information fulfillment and deficit objects.\n\nEC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE \n- Continue EW Battle Management (EWBM) - Develop data exchange message techniques and new algorithms for control and coordination of distributed EW assets.\n\nEC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Continue Adaptive Multi-Int Correlation & Identification (AMICA) - Research and analyze algorithms to enable cross-domain information fusion and optimize use of remote sensing assets.\n- Continue Detection & Classification Algorithms (DCA) - Research and analyze algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Continue Adaptive TCPED for ASW Services - Develop and evaluate the performance of methods that are context aware and determine the value of information for a mission.\n- Continue Data Exfiltration and Networked Platform Interaction - Develop components and design methods leading to a low cost radio that meets size, weight, and power constraints.\n\nEC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Initiate Advanced AEW Electronic Protection - Develop techniques to improve E2-D electronic protection.\n\nEC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Initiate Naval Tactical Cloud Analytics (formerly known as ASW Naval Tactical Cloud, EXW Naval Tactical Cloud, and IAMD Naval Tactical Cloud) - Perform the data science activities to ingest all relevant data (acoustic, IR, EO, magnetic, radar, SIGINT, METOC) into the Naval Tactical Cloud to enable efficient decision support analytics in support of effective ASW, EXW and IAMD mission execution based on Commander's Intent.\n\nEC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Initiate Compact, Scalable Integrated RF (Compact-SIRF) - Develop techniques for high speed data conversion and processing between Radio Frequency (RF) collection and digital processing systems using low size, weight and power RF analog and digital designs.\n- Initiate Electronic Warfare Tactical Decision Aid (EW-TACAID) - Develop performance measures and expert models that provide meaningful feedback to the EW operator and develop an intuitive EW display.\n- Initiate Scalable Integrated RF for Submarines (SIRF-Sub) - Develop techniques for high speed data conversion and processing between RF collection and digital processing systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.351"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.351"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FNT-FY12-01 ADVANCED TACTICAL DATA LINK (ATDL)\n- Complete Mission-Based Waveform Controls & Networking - Develop Anti-Access\/Area Denial enhancements to waveforms, along with advanced networking techniques, and validate performance through emulation.\n\nEC: FNT-FY12-02 AUTONOMOUS PERSISTENT TACTICAL SURVEILLANCE\n- Complete Autonomous Information-Based Surveillance Control - Complete algorithm development for information based Unmanned Aerial Vehicle (UAV) routing and pathing.\n- Complete Contextual Enterprise Information - Develop and demonstrate the analytical services framework, including enterprise exploitation services, for situation context between relevant theater sensor collections and exploitation products. \n- Complete Mobile Autonomous ISR to C2 Synchronization - Transition to MARCORSYSCOM a set of services that can automate the mapping of mission relevant information requirements to information fulfillments or deficits, and provide a sensor tasking recommendation to resolve deficits.  \n\nEC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE \n- Continue EW Battle Management (EWBM) - Develop automation techniques for multiple Electronic Warfare systems across multiple ships, including network layer monitoring.\n\nEC: FNT-FY13-03 SILK THREAD\n- Continue Silk Thread Product 1 - Conduct applied research.\n- Continue Silk Thread Product 2 - Conduct applied research.\n\nEC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Continue Adaptive Multi-Int Correlation & Identification (AMICA) - Research and analyze algorithms to enable cross-domain information fusion and optimize use of remote sensing assets.\n- Continue Detection & Classification Algorithms (DCA) - Research and analyze algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Continue Adaptive TCPED for ASW Services - Develop and evaluate the performance of methods that are context aware and determine the value of the information for an ASW mission.\n- Continue Data Exfiltration and Networked Platform Interaction - Develop digital radio components and waveforms directed toward host platforms with limited size, weight, and power and with the desired communication range and performance.\n\nEC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Develop techniques to improve E-2D Advanced Hawkeye electronic protection.\n\nEC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud (formerly called Naval Tactical Cloud Analytics) - Conduct the data science activities to ingest all relevant data into the Naval Tactical Cloud to enable efficient decision support analytics for enhanced ASW, IAMD and EXW situational awareness and improved mission execution effectiveness.  \n\nEC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Develop scalable and modular, low Size, Weight and Power (SWaP) components and techniques for multi-function Radio Frequency processing on SWaP restricted platforms.\n- Continue Electronic Warfare Tactical Decision Aid (EW-TACAID) - Create an intuitive display with good user-centered design practices that has adaptive instructional content to suit an individual's aptitudes, learning preferences, and learning styles.\n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Investigate techniques that facilitate the processing and high speed data conversion between digital processing and Radio Frequency collection systems.\n\nEC: FNT-FY16-01 BUGLE\n- Initiate Bugle - Develop algorithms that enable Battle Group communications. \n\nEC: FNT-FY16-02 COMBINED EO\/IR SURVEILLANCE AND RESPONSE SYSTEM (CESARS)\n- Initiate Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Investigate multiband laser, window, and sensing technologies as well as advanced countermeasure techniques for shipboard defense.\n- Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Investigate small pixel Mid-Wave Infrared (MWIR) Focal Plane Array (FPA) technologies and innovative approaches for seamless stitching of multiple FPAs to create large format, high pixel-count imagers."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "POWER AND ENERGY (P&E)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Power and Energy (P&E) FNC pillar.  The P&E Pillar develops deliverable technologies that provide new capabilities in energy security, efficient power and energy systems, high energy and pulse power.   \n\nThe FY 2014 to FY 2015 increase was due primarily to the initiation of P&E-FY15-03.\n\nThe FY 2015 to FY 2016 decrease was due primarily to the planned ramp-down of P&E-FY12-01 and P&E-FY12-03."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.295"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  P&E-FY12-01 RENEWABLE-SUSTAINABLE EXPEDITIONARY POWER\n- Continue Renewable Thermal Engine - Continue detailed design for integration of component technologies including connections and user interfaces\/controls.\n\nEC:  P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Continue Air Independent Propulsion System - Finalize Energy System layout drawings of critical components, interfaces and subsystems integrated into the Unmanned Underwater Vehicle (UUV) hull.\n\nEC:  P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n - Initiate High Power Solid State Circuit Protection for Power Distribution and Energy Storage - \nConduct trade study to investigate suitable circuit protection methods and create analytical models of their operation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: P&E-FY12-01 RENEWABLE-SUSTAINABLE EXPEDITIONARY POWER\n- Continue Renewable Thermal Engine - Conduct test planning for integration of component technologies including test methods, procedures, facilities, and schedule.\n\nEC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Continue Air Independent Propulsion System - Develop Standard Operating Procedures, maintenance schedules, system piping and instrumentation diagrams, and system components for an Unmanned Undersea Vehicle energy section.  \n\nEC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Continue High Power Solid State Circuit Protection for Power Distribution and  Energy Storage - Assess circuit protection analytic model results, pursue circuit protection component and system design for Phase 1, and initiate Phase 2 model development for components and system circuit protection.\n\nEC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Initiate Compact High Density Tactical Energy Storage - Conduct evaluation of conceptual multifunction energy storage module technologies and overall operational modeling analysis.\n- Initiate Multi-Function High Density Shipboard Energy Storage - Conduct full-scale ship multifunctional energy storage module analysis and evaluation of conceptual multifunction energy storage module technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.758"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.758"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: P&E-FY12-01 RENEWABLE-SUSTAINABLE EXPEDITIONARY POWER\n- Complete Renewable Thermal Engine - Finish final design and fabrication of full-scale tactical power system prototype, incorporating all features to be exercised in a TRL 6 demonstration.\n\nEC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Complete Air Independent Propulsion System - Conduct final design of Phase II fuel cell energy system and coordinate test planning.\n\nEC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Continue High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Conduct modelling, simulation and cost analyses of Phase II circuit protection designs and prepare test and safety plans for Phase II circuit protection devices.\n\nEC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Continue Compact High Density Tactical Energy Storage - Develop tactical multifunction Energy Storage Module subcomponent technology and designs.\n- Continue Multi-Function High Density Shipboard Energy Storage - Develop final designs, which integrate ship energy storage module component technologies into a subscale system, and develop subscale system test plans."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA BASING (BAS)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Sea Basing (BAS) FNC pillar.  The BAS Pillar develops deliverable logistics, shipping and at-sea transfer technologies that provide new capabilities for projecting expeditionary force from the sea base and providing sea based joint operational independence through improved connector, at-sea transfer and shipboard logistical capabilities. \n\nThe FY 2014 to FY 2015 increase was due a ramp-up of BAS-FY11-01 to ensure it could finish in early FY 2016.\n\nThe FY 2015 to FY 2016 decrease was due to the planned ramp-down of BAS-FY11-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.468"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  BAS-FY11-01 CONNECTORS AND THE SEA BASE\n-  Complete Advanced Mooring System - Conduct research on vacuum mooring and motion control components.\n-  Continue Environmental Ship Motion Forecasting - Conduct research on sensing and wave and ship motion sensing and forecasting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: BAS-FY11-01 CONNECTORS AND THE SEA BASE\n- Continue Environmental Ship Motion Forecasting - Develop environmental and ship motion sensor and forecasting components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.066"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.066"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EC: BAS-FY11-01 CONNECTORS AND THE SEA BASE\n- Complete Environmental Ship Motion Forecasting - Develop environmental and ship motion sensor and forecasting components."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA SHIELD (SHD)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Sea Shield (SHD) FNC pillar.  The SHD Pillar develops deliverable technologies that provide new capabilities in theater air and missile defense, anti-submarine warfare, mine countermeasures, defensive surface warfare, global defensive assurance, anti-terrorism, and fleet\/force protection.  \n\nThe FY 2014 to FY 2015 increase was due primarily to the initiation of SHD-FY15-07.\n\nThe FY 2015 to FY 2016 increase was due primarily to the initiation of SHD-FY16-04, SHD-FY16-05, SHD-FY16-06, SHD-FY16-07 and SHD-FY16-OSD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.556"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  SHD-FY10-01 ANTI-SHIP MISSILE DEFENSE TECHNOLOGIES\n- Continue Enhanced Lethality Guidance Algorithms (ELGA) - Continue design and modeling of STANDARD Missile guidance algorithms for advanced maneuvering missile threats. \n- Continue Enhanced Maneuverability Missile Airframe (EMMA) - Continue design and modeling STANDARD Missile motor and thrust vector control for advanced maneuvering threats.\n\nEC:  SHD-FY10-02 HIGH FIDELITY ACTIVE SONAR TRAINING\n- Complete Anti-Submarine Warfare (ASW) Command Level Training - Develop algorithms for training Anti-Submarine Warfare (ASW) Commanders and their Aircraft Carrier supporting personnel by utilizing human cognitive factors and evaluating them in the laboratory for performance improvements.\n- Complete Operator Training - Develop algorithms to enhance the realism of simulated submarine targets, environmental clutter and reverberation, and evaluate their laboratory performance.\n\nEC:  SHD-FY10-03 ADVANCED SONAR TECHNOLOGY FOR HIGH CLEARANCE RATE MINE COUNTERMEASURES (MCM)\n- Continue Long Range Low Frequency Broadband (LFBB) Sonar (Autonomous Underwater Vehicle (AUV) Platform Option) -Develop detection and classification algorithms for stealthy mines. \n- Complete Integrated Forward looking Sonar - Dual Frequency Synthetic Aperture Sonar (FLS-DFSAS) - \nDevelop autonomy, automatic target recognition and real-time change detection, including conducting laboratory\/pond data collection.\n- Complete Very Shallow Water (VSW) Acoustic Color\/Imaging Sonar - Develop acoustic color\/synthetic aperture sonar imaging algorithms and performance of controlled data collection.\n\nEC:  SHD-FY10-04 NEXT GENERATION COUNTERMEASURE TECHNOLOGIES FOR SHIP MISSILE DEFENSE\n- Complete Next Generation Countermeasure Technologies for Ship Missile Defense - Develop, test and modify algorithms to allow networked, multi-platform Electronic Attack (EA) control to deliver synchronized jamming and deception effects to counter emergent anti-ship missile target prosecution modalities.\n\nEC:  SHD-FY10-05 AFFORDABLE VECTOR SENSOR TOWED ARRAY AND SIGNAL PROCESSING\n- Continue Vector Sensor Towed Array - Develop component level technology for use in a thin-line Vector Sensor Towed Array and develop a physics-based performance model.\n- Continue Vector Sensor Towed Array Signal Processing - Develop the noise reduction and passive signal processing algorithms unique to a thin-line Vector Sensor Towed Array.\n\nEC:  SHD-FY11-01 TORPEDO COMMON HYBRID FUZING SYSTEM\n- Continue Torpedo Common Hybrid Fuzing System - Conduct developmental simulations and testing.\n\nEC:  SHD-FY12-01 FORCE LEVEL RADAR RESOURCE MANAGEMENT FOR INTEGRATED AIR AND MISSILE DEFENSE (IAMD)\n- Continue Radar Resource Manager for Integrated Air and Missile Defense (IAMD) - Design and model algorithms for management and coordination of force level AEGIS radar resources.\n\nEC:  SHD-FY12-03 SONAR AUTOMATION\n- Continue Active Sonar Automation - Evaluate in lab performance of algorithms to improve active sonar operator performance in detecting submarines while reducing false contact rates.\n- Continue Passive Sonar Automation - Evaluate in laboratory performance of algorithms that improve passive sonar operator performance against quiet submarines in the presence of clutter.\n\nEC:  SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Continue Compact Modular Sensor-Processing Suite (CMSS) - Develop target recognition algorithms.\n\nEC:  SHD-FY13-01 COOPERATIVE NETWORKED RADAR \n- Continue Cooperative Networked Radar - Develop, collect, and process real-world data to integrate multiple shipboard radars.\n\nEC:  SHD-FY13-05 HIGH ALTITUDE ANTI-SUBMARINE WARFARE (HAASW) FROM THE P-8\n- Continue Next Generation Multistatic Active Capability (NGMAC) - Identify and evaluate transducer source level improvements and conduct early development work on algorithms capable of providing state estimation for use in multi-static active coherent sonobuoys.\n- Continue Unmanned Targeting Air System (UTAS) - Identify and evaluate magnetic sensors and algorithms for use on an unmanned aerial vehicle for locating a submarine.\n\nEC:  SHD-FY13-07 UNMANNED SURFACE VEHICLE (USV) PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Continue Drifting Mine Neutralization Technology - Develop low-cost sensing solutions, algorithm development, and associated autonomy.\n- Continue Mine Countermeasure (MCM) Payload Automation - Develop command and control, planning and recognition algorithms and models.\n- Continue Single Sortie Mine Countermeasure (MCM) Detect-to-Engage Payload - Develop architecture, command and control, planning algorithms and design options for hardware.\n\nEC:  SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE \n- Initiate ATT Timeline Compression (ATTTC) - Begin algorithm development.\n- Continue Concept C Countermeasure - Finalize requirements definition and performance prediction.\n- Continue HVU Mounted Sonar - Conduct requirements studies and ship scope checks.\n\nEC:  SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Initiate Autonomous Threat Detection and Localization - Develop sensor architecture, algorithms and fusion methodology for autonomously detecting and tracking targets in real-time. \n- Initiate Remote Command & Control - Develop communications protocols and algorithms to assure the exchange of messages between sensor nodes and with the weapon node, on demand.\n- Initiate Tactical Positioning & Fire Control - Develop Advanced Undersea Weapon System (AUWS) algorithms for positioning the sensor, weapon and gateway nodes, efficiently combining intra-node information, and autonomously generating an effective weapon fire solution.\n\nEC:  SHD-FY14-08 TERMINATOR (T3) (FORMERLY KNOWN AS TIER 3 HIGH VALUE UNIT (HVU) SELF-DEFENSE)\n- Initiate Terminator S (formerly know as Adaptive Hypothesis-based Fire Control) - Design and model fire control solutions using modern electronic support data.\n- Initiate Terminator E (formerly known as Advanced ESSM Guidance) - Design and model guidance algorithms to increase lethality over the maximum outer self-defense kinematic envelope.\n- Initiate Terminator R (formerly know as Advanced RAM Block 2 Guidance) - Design and model guidance modifications to the Rotating Airframe Missile.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Initiate Hyper Velocity Projectile - Demonstrate the component technology required to support hypervelocity launch and common interfaces for powder gun and railgun launch conditions.\n- Initiate Advanced Rolling Airframe Missile (RAM) Block 2 Guidance - Design and model guidance algorithms to increase lethality over the maximum inner self-defense kinematic envelope."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "46.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: SHD-FY10-01 ANTI-SHIP MISSILE DEFENSE TECHNOLOGIES\n- Continue Enhanced Lethality Guidance Algorithms (ELGA) - Develop STANDARD missile guidance algorithm to support the dual-pulse rocket motor.\n- Continue Enhanced Maneuverability Missile Airframe (EMMA) - Develop a dual-pulse rocket motor for STANDARD missile.\n\nEC: SHD-FY10-03 ADVANCED SONAR TECHNOLOGY FOR HIGH CLEARANCE RATE MCM\n- Continue Long Range LFBB Sonar (AUV Platform Option) - Demonstrate and refine detection & classification algorithms for stealthy mines.\n\nEC: SHD-FY10-05 AFFORDABLE VECTOR SENSOR TOWED ARRAY AND SIGNAL PROCESSING\n- Complete Vector Sensor Towed Array - Evaluate and deliver component technology for thin-line Vector Sensor Towed Array (VSTA), common array acoustic modules, and a validated physics-based VSTA performance model.\n- Complete Vector Sensor Towed Array Signal Processing - Evaluate and report sonar signal processing detection performance from at-sea and laboratory test events and assess hardware implications for the processing strategy.\n\nEC: SHD-FY11-01 TORPEDO COMMON HYBRID FUZING SYSTEM\n- Complete Torpedo Common Hybrid Fuzing System - Conduct developmental simulation and testing.\n\nEC: SHD-FY12-01 FORCE LEVEL RADAR RESOURCE MANAGEMENT FOR INTEGRATED AIR AND MISSILE DEFENSE (IAMD)\n- Continue Radar Resource Manager for IAMD - Develop algorithms to provide dynamic force-level management and coordination of radar tracks.\n\nEC: SHD-FY12-03 SONAR AUTOMATION\n- Continue Active Sonar Automation - Identify and evaluate in lab performance of algorithms to improve active sonar operator performance in detecting submarines while reducing false contact rates.\n- Continue Passive Sonar Automation - Identify and evaluate the in-laboratory performance of algorithms that improve passive sonar operator against quiet submarines in the presence of clutter.\n\nEC: SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Continue Compact Modular Sensor-Processing Suite (CMSS) - Develop processing & data fusion for onboard classification.\n\nEC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR \n- Continue Cooperative Networked Radar - Develop techniques for cross platform radar operation.\n\nEC: SHD-FY13-05 HIGH ALTITUDE ASW (HAASW) FROM THE P-8\n- Continue Next Generation Multistatic Active Capability (NGMAC) - Develop algorithms for use in the Multistatic Active Capability system that improve performance, reduce operator workload, and allow for use in all ocean environments. \n- Continue Unmanned Targeting Air System (UTAS) - Update vehicle noise models  and coordinate with Magnetic Anomaly Detection algorithms. \n\nEC: SHD-FY13-07 USV PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Continue USV-based Mine Neutralization (formerly called Drifting Mine Neutralization Technology) - Develop low-cost sensing, navigation, and battle damage assessment solutions, algorithm development, and associated autonomy.\n- Continue MCM Payload Automation - Develop planning and automatic target recognition algorithms for risk-based MCM.\n- Continue Single Sortie MCM Detect-to-Engage Payload - Develop architecture, command and control, planning algorithms and design options for hardware.\n\nEC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE \n- Continue ATT Timeline Compression (ATTTC) - Perform technology requirements definition, algorithm development, and performance prediction for acoustic illumination and engagement controller.\n- Continue Concept C Countermeasure - Perform technology requirements definition.\n- Continue HVU Mounted Sonar - Conduct requirements studies and ship scope checks.\n\nEC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Autonomous Threat Detection and Localization - Model the AUWS sensor architecture, target detection and tracking algorithms and fusion methodology, and conduct simulation testing. \n- Continue Remote Command & Control - Model the AUWS sensor, weapon and gateway communications protocols and algorithms, and conduct simulation testing.\n- Continue Tactical Positioning & Fire Control - Model the AUWS node positioning and management algorithms for effective fire control, and conduct simulation testing.\n\nEC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S - Develop a hypothesis-based algorithm to provide a fire control solution against a missile defense threat.\n- Continue Terminator E - Develop guidance modifications to the Evolved Sea Sparrow Missile.\n- Continue Terminator R - Develop guidance modifications to the Rotating Airframe Missile.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Continue Hyper Velocity Projectile - Demonstrate the component technology required to support hypervelocity launch and common interfaces for powder gun and railgun launch conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "52.829"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "52.829"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: SHD-FY10-01 ANTI-SHIP MISSILE DEFENSE TECHNOLOGIES\n- Complete Enhanced Lethality Guidance Algorithms (ELGA) - Optimize the guidance algorithm to increase the probability of kill against an expanded threat set.\n- Complete Enhanced Maneuverability Missile Airframe (EMMA) - Mature the technologies associated with the dual pulse rocket motor and integrated thrust vector control, incorporating risk reduction schemes.\n\nEC: SHD-FY10-03 ADVANCED SONAR TECHNOLOGY FOR HIGH CLEARANCE RATE MCM\n- Complete Long Range LFBB Sonar (AUV Platform Option) - Finalize software configuration and perform final data collection.\n\nEC: SHD-FY12-01 FORCE LEVEL RADAR RESOURCE MANAGEMENT FOR INTEGRATED AIR AND MISSILE DEFENSE (IAMD)\n- Complete Radar Resource Manager for IAMD - Refine, mature, and test advanced algorithms for ballistic missile defense track coordination.\n\nEC: SHD-FY12-03 SONAR AUTOMATION\n- Complete Active Sonar Automation - Evaluate and deliver algorithms to improve active sonar operator performance in detecting submarines while reducing false contact rates.\n- Complete Passive Sonar Automation - Evaluate and deliver algorithms that improve Passive Sonar operator performance against quiet submarines in the presence of clutter.\n\nEC: SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Complete Compact Modular Sensor-Processing Suite (CMSS) - Achieve low False Alarm Rate with advanced data fusion techniques.\n\nEC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR \n- Continue Cooperative Networked Radar - Develop techniques for cross platform radar operation.\n\nEC: SHD-FY13-05 HIGH ALTITUDE ASW (HAASW) FROM THE P-8\n- Continue Next Generation Multistatic Active Capability (NGMAC) - Develop algorithms for use in the Multistatic Active Capability system that improve performance, reduce operator workload, and allow for use in all ocean environments.\n- Continue Unmanned Targeting Air System (UTAS) - Update vehicle noise models and coordinate with Magnetic Anomaly Detection algorithms.\n\nEC: SHD-FY13-07 USV PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Continue MCM Payload Automation for Data Analysis - Develop probabilistic Enemy Course of Action models and update algorithms supporting Net-centric Sensor Analysis for MIW (NSAM).\n- Continue MCM Payload Automation for Planning - Develop probabilistic Enemy Course of Action models and update algorithms supporting Mine-warfare Environmental Decision-Aid Library (MEDAL).\n- Continue Single Sortie MCM Detect-to-Engage Payload - Develop the architecture, command and control algorithms, planning algorithms, and hardware design options.\n- Continue USV-based Mine Neutralization - Develop low-cost sensing, navigation, and battle damage assessment solutions, algorithms, and associated autonomy technology.\n\nEC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE \n- Complete Concept C Countermeasure - Complete the array design and conduct a ship check for haul-down unit installation.\n- Continue ATT Timeline Compression (ATTTC) - Develop algorithms and real time code for guidance enhancements.\n- Continue HVU Mounted Sonar - Develop an array hull-mount and baffling mechanism, and model the resultant acoustic performance.\n\nEC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Autonomous Threat Detection and Localization - Model system node positioning algorithms and mission planning improvements, and conduct simulation testing.\n- Continue Remote Command & Control - Model and assess improved integrated system communications configuration protocols and algorithms.\n- Continue Tactical Positioning & Fire Control - Develop an improved sensor node architecture and conduct evaluation modeling of detection, classification, localization and targeting capabilities.\n\nEC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S - Develop fire control algorithms for implementation in the Ship Self-Defense System (SSDS).\n- Continue Terminator E - Develop and test Evolved Sea sparrow Missile (ESSM) advanced guidance algorithms for lethal intercept at optimum ranges.\n- Continue Terminator R - Develop and test Rolling Airframe Missile (RAM) advanced guidance algorithms for lethal intercept at optimum ranges.\n\nEC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Initiate MCM Task Force Planning - Develop algorithmic approaches for optimal tailoring of heterogeneous MCM assets.\n- Initiate Expeditionary MCM Automated Data Analysis - Investigate the applicability of physics-based approaches to performance estimation.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Continue Hyper Velocity Projectile - Demonstrate the component technology required to support a hypervelocity launch and common interfaces for powder gun and railgun launch conditions.\n\nEC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Initiate Ship-launched EW Extended Endurance Decoy (SEWEED) - Develop preliminary vehicle, payload, rocket, and launcher conceptual designs and sizing.\n\nEC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Initiate Surface Ship Periscope Detection and Discrimination (SSPDD) - Develop specialized interface hardware for technology components.\n\nEC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Initiate Next Generation Airborne Passive System (NGAPS) - Develop an 'A-size' deep, long-duration, passive sonobuoy for area surveillance that takes advantage of Reliable Acoustic Path detection against modern quiet submarines and is tethered to a surface float containing a radio. \n\nEC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Initiate Softkill Performance and Real-Time Assessment (SPARTA) - Develop and establish design criteria, system requirements and software requirements.\n\nEC: SHD-FY16-OSD Advanced Sea Mines\n-  Initate Advanced Sea Mines - Develop acoustic propagation modeling, algorithms for tracking and tracking, and algorithms to exploit the acoustic communications environment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA STRIKE (STK)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE.  The Sea Strike (STK) FNC pillar develops deliverable technologies that provide new capabilities in power projection and deterrence, precise and persistent offensive power, weapons, aircraft, and expeditionary warfare.  \n\nThe FY 2014 to FY 2015 increase was due to the initiation of STK-FY15-01, STK-FY15-02 and STK-FY15-03.\n\nThe FY 2015 to FY 2016 increase  was due primarily to the planned ramp-up of STK-FY15-01, STK-FY15-02 and STK-FY15-03, and the initiation of STK-FY16-01 and STK-FY16-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  STK-FY09-03 ENHANCED WEAPONS TECHNOLOGIES\n- Complete Counter Air Defense Improvements - Finish materials and design concepts, and develop high temperature resin-fiber and high temperature oxidative-exhaust resistant materials with associated design implementations.\n\nEC:  STK-FY10-02 MULTI-TARGET TRACK AND TERMINATE (MTTT)\n- Complete Multi-Target Laser Designation (MTLD) - Design system components to fit the Fire Scout form factor and conduct laboratory testing.\n\nEC:  STK-FY11-01 STRIKE ACCELERATOR\n- Continue Strike Accelerator - Develop and understand advanced airborne capability to accurately identify targets using Advanced Target Recognition.\n\nEC:  STK-FY11-02 RADAR ELECTRONIC ATTACK PROTECTION (REAP)\n- Continue Identification and Defeat of Electronic Attack Systems (IDEAS) - Develop Electronic Support and Electronic Protection algorithms and techniques to counter hostile modern jammers.\n- Continue Network \"Sentric\" Electronic Protection (EP) - Develop improved software and algorithms for electronic protection solutions.\n\nEC:  STK-FY12-01 SUBMARINE SURVIVABILITY - ELECTRONIC WARFARE. \n- Continue Coherent Electronic Attack for Submarines (CEAS) - Update the Spiral 1 System Requirements, Architecture, Implementation and Fabrication from the assessments developed with 6.2 Applied Research, with the intention of Capability Demonstration and System Acceptance Testing in FY15.\n\nEC:  STK-FY12-02 HIGH ENERGY SPECTRAL BEAM COMBINED (SBC) FIBER LASER SYSTEM\n- Complete High Energy Fiber Laser System - Investigate and understand high energy laser, beam control and other technologies to enable a high energy laser weapons system.\n\nEC:  STK-FY13-01 LONG RANGE RADIO FREQUENCY (RF) FIND, FIX AND ID\n- Initiate Long Range Find, Fix and ID - Develop software and algorithms to enable long range Radio Frequency (RF) localization and identification from airborne radars.\n\nEC:  STK-FY13-02 HOSTILE FIRE (HF) SUPPRESSION\n- Continue Hostile Fire Suppression System - Develop tracking techniques to point closed loop eye-safe laser.\n\nEC:  STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Initiate Anti-Surface Warfare (ASuW) Weapon Upgrade - Begin subsystem design and development.\n\nEC:  STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Design and model an advanced rocket motor, warhead, and safe-arm device for the AIM-9X Sidewinder missile.\n\nEC:  STK-FY14-01 BANK SHOT\n- Initiate Bank Shot - Study and understand passive sensor phenomenology to enable its use for surveillance.\n\nEC:  STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Initiate Collaborative Electronic Attack (CEA) - Define Mission Objectives and System Architecture.\n- Initiate Collaborative Anti-Surface Warfare Engagement (CASE) - Initiate design, development, and improvement of weapon-to-weapon communications, coupled with algorithms for limited weapon autonomy, to address the surface warfare mission area.\n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Initiate Synthetic Aperture Radar Electronic Protection - Design and model algorithms and techniques to improve synthetic aperture radar electronic protection.\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Initiate Extended-Range Targeting (E-RAT) - Design processes that address extended range targeting and fire control."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.425"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: STK-FY11-01 STRIKE ACCELERATOR\n- Complete Strike Accelerator - Develop and understand advanced airborne capability to accurately identify targets using Advanced Target Recognition.\n\nEC: STK-FY11-02 RADAR ELECTRONIC ATTACK PROTECTION (REAP)\n- Complete Identification and Defeat of EA Systems (IDEAS) - Develop innovative EW countermeasures that employ flexible and robust techniques against advanced Electronic Attack systems.\n- Complete Network \"Sentric\" Electronic Protection (EP) - Develop techniques for APG-79 electronic protection.\n\nEC: STK-FY12-01 SUBMARINE SURVIVABILITY - ELECTRONIC WARFARE. \n- Continue Coherent Electronic Attack for Submarines (CEAS) - Develop advanced Electronic Support and Electronic Attack techniques for detecting and countering advanced coastal surveillance RF threats.\n\nEC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Continue Long Range Find, Fix and ID - Develop algorithms for moving maritime RF identification.\n\nEC: STK-FY13-02 HOSTILE FIRE (HF) SUPPRESSION\n- Continue Hostile Fire Suppression System - Develop a robust muzzle flash tracking algorithm and begin the laser source design process.\n\nEC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Continue Anti-Surface Warfare (ASuW) Weapon Upgrade - Evaluate hardware and software.\n\nEC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Design and model an advanced rocket motor and subsystems device for the AIM-9X Sidewinder missile.\n\nEC: STK-FY14-01 BANK SHOT\n- Continue Bank Shot - Study and understand passive sensor phenomenology to enable its use for surveillance.\n\nEC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Continue Collaborative Anti-Surface Warfare Engagement (CASE) - Design, develop, and improve weapon-to-weapon communications, coupled with algorithms for limited weapon autonomy, to address the surface warfare mission area.\n- Continue Collaborative Electronic Attack (CEA) - Develop concepts and techniques that improve U.S. Naval forces ability to conduct Anti Surface Warfare.\n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Develop algorithms and techniques to improve synthetic aperture radar electronic protection.\n\nEC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Initiate Helicopter Active RPG Protection (HARP) - Design and develop prototype concepts and new processes for a Rocket Propelled Grenade (RPG) hard kill defense for rotorcraft.\n- Initiate Multi-Spectral EO\/IR Seeker Defeat - Develop and enhance existing test capability to include EO\/IR  hybrid hardware-in-the-loop for obscurant and jammer evaluation.\n\nEC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Initiate MUHV Autonomy Suite - Define the autonomy framework.\n- Initiate MUHV Sensors, Navigation and Guidance - Evaluate and downselect hardware.\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Continue Extended-Range Targeting (E-RAT) - Design and develop prototypes and processes that address extended range targeting and fire control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.862"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.862"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: STK-FY12-01 SUBMARINE SURVIVABILITY - ELECTRONIC WARFARE\n- Complete Coherent Electronic Attack for Submarines (CEAS) - Conduct experiments of the waveform interactions and spectrum processing that occurs between advanced Electronic Warfare and radar systems in order to assess the effectiveness of new electronic support detection and electronic attack countermeasure techniques.    \n\nEC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Continue Long Range Find, Fix and ID - Develop algorithms for moving maritime Radio Frequency identification.\n\nEC: STK-FY13-02 HOSTILE FIRE (HF) SUPPRESSION\n- Complete Hostile Fire Suppression System - Demonstrate real-time muzzle flash detection and tracking.\n\nEC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Continue Anti-Surface Warfare (ASuW) Weapon Upgrade - Develop relevant algorithms.\n\nEC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Evaluate and model advanced kinematic technology improvements for a future Air-to-Air missile.\n\nEC: STK-FY14-01 BANK SHOT\n- Bank Shot - Study and understand passive sensor phenomenology.\n\nEC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Continue Collaborative Anti-Surface Warfare Engagement (CASE) - Design, develop, and improve weapon-to-weapon communications, coupled with algorithms for limited weapon autonomy, that address the surface warfare mission area.\n- Continue Collaborative Electronic Attack (CEA) - Develop adaptable Electronic Warfare mission prioritization and collaborative classification algorithms to enable U.S. Naval forces the ability to conduct Anti-Surface Warfare. \n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Develop algorithms and techniques to improve synthetic aperture radar electronic protection.\n\nEC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Design and develop prototype concepts and new processes for a Rocket Propelled Grenade (RPG) hard-kill defense for rotorcraft.\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Conduct modeling and simulation to define countermeasure sources and expendables requirements for rotary wing aircraft defense against advanced multi-spectral Electro-Optical\/Infrared (EO\/IR) Man Portable Air Defense Systems (MANPADS).\n\nEC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Downselect an autonomy suite prototype.\n- Continue MUHV Sensors, Navigation and Guidance - Conduct fiber optic development.\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Continue Extended-Range Targeting (E-RAT) - Design, develop, and improve prototypes and processes that address extended range targeting and fire control.\n\nEC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Initiate Reactive Electronic Attack Measures (REAM) - Develop signal detection and classification techniques that can recognize new and agile radar threats."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of FNC technology products within this PE.  In all cases, these technology products support the Department of the Navy FNC Program and are managed at the Office of Naval Research.  All FNC investments in this PE are subjected to management oversight by 2-star chaired Integrated Product Teams (IPTs) that control the naval pillars of Sea Shield, Sea Strike, Sea Basing, Forcenet, Naval Expeditionary Maneuver Warfare, Enterprise and Platform Enablers, Power and Energy, Capable Manpower, and Force Health Protection.  Each EC is aligned to a pillar and each technology product is aligned to an EC.  At the lowest level, each technology product is measured against both technical and financial milestones on a monthly basis.  Annually, each technology product is reviewed in depth for technical performance and development status by the Chief of Naval Research against goals that have been approved by the Navy's 3-star Technology Oversight Group (TOG).  Also annually, each technology product is reviewed by its 2-star chaired pillar IPT for transition planning adequacy and transition commitment level.   Products must meet TOG required transition commitment levels for S&T development to continue.  Transition issues and required adjustments are reported annually by the Chief of Naval Research to the TOG, which establishes investment priorities for the FNC Program."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3346"
                    },
                    "ProjectTitle": {
                        "val": "Future Naval Capabilities Adv Tech Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.300"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.300"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The efforts described in this Project address the Applied Research associated with the Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the Navy's Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are identified by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders. The Enabling Capabilities (ECs) and associated technology product investments of the FNC Program are competitively selected by a 3-star Technology Oversight Group (TOG), chartered by the S&T Corporate Board and representing the requirements, acquisition, research and fleet\/forces communities of the Navy and the Marine Corps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Accomplishment\/Planned Program Entry"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Accelerate develop of the Automated Critical Care System (ACCS) for care of injured personnel during transport to a medical facility.\nInitiate development of autonomous control of cyber secure long distance medical data transfer and patient sedation.  Complete development of autonomous control of patient ventilation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In all cases, FNC technology products support the Department of the Navy's FNC Program and are managed at the Office of Naval Research.  All FNC investments in this PE are subjected to management oversight by 2-star chaired Integrated Product Teams (IPTs).  Each EC is aligned to a pillar and each technology product is aligned to an EC.  At the lowest level, each technology product is measured against both technical and financial milestones on a monthly basis.  Annually, each technology product is reviewed in depth for technical performance and development status by the Chief of Naval Research against goals that have been approved by the Navy's 3-star Technology Oversight Group (TOG).  Also annually, each technology product is reviewed by its 2-star chaired pillar IPT for transition planning and adequacy and transition commitment level.   Products must meet TOG required transition commitment levels for S&T development to continue.  Transition issues and required adjustments are reported annually by the Chief of Naval Research to the TOG, which establishes investment priorities for the FNC Program."
                        }
                    }
                }
            ]
        }
    }
}