{
    "id": "1ad4ec760f1b5d546f60bada817689b799467d00",
    "meta": {
        "filename": "dod-2013_PROCUREMENT_2013_ARMY_OTHER_2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "B01301"
        },
        "LineItemTitle": {
            "val": "Biometrics Enterprise"
        },
        "P1LineItemNumber": {
            "val": "55"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "64"
        },
        "BudgetSubActivityTitle": {
            "val": "Information Security"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "PriorYear": {
                    "val": "46.606"
                },
                "CurrentYear": {
                    "val": "57.057"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "103.663"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "46.606"
                },
                "CurrentYear": {
                    "val": "57.057"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "103.663"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "46.606"
                },
                "CurrentYear": {
                    "val": "57.057"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "103.663"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "ComponentSplit": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "PriorYear": {
                                "TotalCost": {
                                    "val": "46.606"
                                }
                            },
                            "CurrentYear": {
                                "TotalCost": {
                                    "val": "57.057"
                                }
                            }
                        }
                    }
                ]
            }
        },
        "Description": {
            "val": "Biometrics Enabling Capability (BEC) will be the Department of Defense (DoD) authoritative biometric enterprise database repository.  Capabilities shall include multimodal storage and matching, state-of-the-art Service Oriented Architecture, management portal, Biometrically Enabled Watch-List, increased system capacity and processing ability, and system interoperability and data sharing with government agencies and stakeholders including the Federal Bureau of Investigation, Department of Homeland Security, National Ground Intelligence Center, Department of State, United States Central Command (CENTCOM), United States Special Operations Command and other DoD and Federal agencies, as required. \n \nThe current prototype capability, Next Generation Automated Biometric Identification System (NG-ABIS), was developed as a Quick Reaction Capability (QRC) based on a CENTCOM Joint Urgent Operational Needs Statement (JUONS).  NG-ABIS provides a robust capability for distinguishing friend from foe in hot spots around the globe.  NG-ABIS enables near-instantaneous device-to-database communication and lays the foundation for enhanced device-to-device communication, reducing cycle and response times.  NG-ABIS receives submissions from existing QRC-based collection devices.  NG-ABIS also receives requests by authorized users to perform storage retrieval and searches of biometric data collection and matching results.  NG-ABIS provides a reliable and effective tool for overseas operations by allowing the Warfighter to make near real-time retention, capture, or release decision.\n \nThe NG-ABIS QRC will be the initial baseline capability for the BEC POR. NG-ABIS becomes BEC Increment 0 at the Full Deployment Decision (FDD) in FY12 when a Program of Record will be established.  This was delayed from 3QFY11 due to a delay in the enhanced NG-ABIS software deployment.\n \nThe BEC program has an associated Analysis of Alternatives that has been conducted in support of BEC Increment 1, a follow-on acquisition program that is conducting pre-Milestone B activities.  Milestone B is projected for FY13."
        },
        "Justification": {
            "val": "This program has no FY 2013 Base or OCO procurement request."
        }
    }
}