{
    "id": "52ff831445a7d22408033236e641dadfd3990bdb",
    "meta": {
        "filename": "dod-2013_PROCUREMENT_2013_ARMY_AMMO_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "EA0575"
        },
        "LineItemTitle": {
            "val": "Ammunition Peculiar Equipment"
        },
        "P1LineItemNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition"
        },
        "BudgetSubActivityNumber": {
            "val": "50"
        },
        "BudgetSubActivityTitle": {
            "val": "Miscellaneous"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "227.003"
                },
                "PriorYear": {
                    "val": "12.649"
                },
                "CurrentYear": {
                    "val": "24.2"
                },
                "BudgetYearOneBase": {
                    "val": "15.692"
                },
                "BudgetYearOne": {
                    "val": "15.692"
                },
                "BudgetYearTwo": {
                    "val": "16.604"
                },
                "BudgetYearThree": {
                    "val": "16.436"
                },
                "BudgetYearFour": {
                    "val": "17.811"
                },
                "BudgetYearFive": {
                    "val": "18.087"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "348.482"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "227.003"
                },
                "PriorYear": {
                    "val": "12.649"
                },
                "CurrentYear": {
                    "val": "24.2"
                },
                "BudgetYearOneBase": {
                    "val": "15.692"
                },
                "BudgetYearOne": {
                    "val": "15.692"
                },
                "BudgetYearTwo": {
                    "val": "16.604"
                },
                "BudgetYearThree": {
                    "val": "16.436"
                },
                "BudgetYearFour": {
                    "val": "17.811"
                },
                "BudgetYearFive": {
                    "val": "18.087"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "348.482"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "227.003"
                },
                "PriorYear": {
                    "val": "12.649"
                },
                "CurrentYear": {
                    "val": "24.2"
                },
                "BudgetYearOneBase": {
                    "val": "15.692"
                },
                "BudgetYearOne": {
                    "val": "15.692"
                },
                "BudgetYearTwo": {
                    "val": "16.604"
                },
                "BudgetYearThree": {
                    "val": "16.436"
                },
                "BudgetYearFour": {
                    "val": "17.811"
                },
                "BudgetYearFive": {
                    "val": "18.087"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "348.482"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Description": {
            "val": "Ammunition Peculiar Equipment (APE) provides unique, low-density equipment items specifically designed, fabricated, tested, procured, and adopted for use in ammunition depot operations on conventional ammunition.  APE maintains a central source of standard, modern, safe, efficient, reliable and environmentally acceptable equipment for ammunition operations.  These operations involve maintenance, demilitarization, preservation, packaging, and surveillance functions on the ammunition item.  As the National Inventory Control Point, the US Army Joint Munitions Command designs, fabricates, maintains and stores APE to support US military worldwide ammunition operations.  This equipment is different from production line plant equipment as it disassembles ammunition items into components, removes hazardous materials to reduce human interaction and improve personnel safety.  Maintenance APE is also designed to perform cleaning and renovation functions on ammunition subjected to deterioration effects (rust, corrosion, weathering, etc) during its storage life.  APE supporting surveillance is keyed to stockpile sampling and function tests of the items to assure readiness for combat or training.  Demilitarization APE is similar to maintenance APE but must go further in disassembly to destroy hazardous components and reclaim salvageable parts or metals."
        },
        "Justification": {
            "val": "FY 2013 Base Procurement dollars in the amount of $15.692 million will support the Ammunition Peculiar Equipment (APE) and replacement parts that must be on-hand to perform ammunition depot operations for conventional ammunition.  The ammunition depot operations cannot be accomplished if the required APE is not supplied in a timely manner.  The equipment is loaned to worldwide locations for the accomplishment of depot-type operations based on the ammunition requirements.  APE is required to support the Ammunition Stockpile Reliability Program, Surveillance Program, equipment for worldwide maintenance and demilitarization, prepositioned ships, and Government-Owned, Contractor-Operated plants as Government Furnished Equipment for ammunition depot operations at those locations.  The APE assets maintain and verify the quality of the ammunition stockpile, thereby saving the cost of purchasing new replacement ammunition. Should ammunition need to be demilitarized, APE efficiently performs this mission with an emphasis on recycling, re-utilization and preserving the environment. \n\nAPE at the Demilitarization Facility (DEFAC) in Korea will minimize retrograde transportation costs and provide TNT for donor material or new production.  The Mutual Logistics Support Agreement - Implementing Arrangement was signed 27 June 2007, which permitted the installation and prove-out of equipment.  The APE at the DEFAC was required by provisions of an initial international memorandum of agreement signed 4 September 2003.  The final Memorandum of Agreement was signed on 4 November 2011 by US Forces, Korea and Republic of Korea (ROK) officials. This allows for the testing, training of ROK contractors as well as scheduling US titled munitions at the Korea facility for demilitarization.  The new US\/ROK DEFAC will contain several standard APE items, along with new technology systems with the potential to become future standard APE equipment."
        }
    }
}