{
    "id": "87cb1b47ad7a62dc61d27a06abb9d21f83bb7bb1",
    "meta": {
        "filename": "dod-2013_PROCUREMENT_2013_NAVY_OTHER_BA1_JustificationBook_Navy_PB_2013.zzz_unzipped_JustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "1445"
        },
        "LineItemTitle": {
            "val": "Operating Forces IPE"
        },
        "P1LineItemNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ships Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "14"
        },
        "BudgetSubActivityTitle": {
            "val": "Production Facilities Equipment"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "220.113"
                },
                "PriorYear": {
                    "val": "90.109"
                },
                "CurrentYear": {
                    "val": "54.642"
                },
                "BudgetYearOneBase": {
                    "val": "64.346"
                },
                "BudgetYearOne": {
                    "val": "64.346"
                },
                "BudgetYearTwo": {
                    "val": "69.133"
                },
                "BudgetYearThree": {
                    "val": "63.576"
                },
                "BudgetYearFour": {
                    "val": "64.209"
                },
                "BudgetYearFive": {
                    "val": "63.912"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "220.113"
                },
                "PriorYear": {
                    "val": "90.109"
                },
                "CurrentYear": {
                    "val": "54.642"
                },
                "BudgetYearOneBase": {
                    "val": "64.346"
                },
                "BudgetYearOne": {
                    "val": "64.346"
                },
                "BudgetYearTwo": {
                    "val": "69.133"
                },
                "BudgetYearThree": {
                    "val": "63.576"
                },
                "BudgetYearFour": {
                    "val": "64.209"
                },
                "BudgetYearFive": {
                    "val": "63.912"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "220.113"
                },
                "PriorYear": {
                    "val": "90.109"
                },
                "CurrentYear": {
                    "val": "54.642"
                },
                "BudgetYearOneBase": {
                    "val": "64.346"
                },
                "BudgetYearOne": {
                    "val": "64.346"
                },
                "BudgetYearTwo": {
                    "val": "69.133"
                },
                "BudgetYearThree": {
                    "val": "63.576"
                },
                "BudgetYearFour": {
                    "val": "64.209"
                },
                "BudgetYearFive": {
                    "val": "63.912"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "[P40A \/ KN100:  INDUSTRIAL PLANT EQUIPMENT (IPE) REPLACEMENT\/AFLOAT SUPPORT]: These funds are used to procure industrial plant equipment for afloat (surface combatant) activities which provide maintenance capabilities for Sailors to maintain Ship's mission essential, operational readiness while deployed.  The upgraded IPE increases deployed maintenance capability and enhances strike group's ability to remain on station through Casualty Report (CASREP) avoidance.  The program provides new industrial plant equipment to replace equipment beyond economical repair and to upgrade capabilities for ship maintenance and repair.\n\n[P40A \/ KN200:  ELECTRONIC TECHNICAL WORK DOCUMENT (ETWD)]: This funding will support the Electronic Technical Work Document (ETWD) initiative.  This innovative project will ultimately provide the capacity for real-time electronic access to work documents at the deckplate while ship maintenance is performed.  ETWD will provide the ability to immediately and efficiently validate data, check problem resolution, job progress and work certification.  This program will benefit the planning, execution, tracking and certification process when a ship requires maintenance and repair.\n\n[P40A \/ KN300:  SHIPYARD CAPITAL INVESTMENT PROGRAM (CIP)]: This line item provides funding for the Shipyard Capital Investment Program in support of the consolidated Naval Shipyard and Intermediate Maintenance Facilities (IMF) at the four mission funded Naval Shipyards.  Funds will be used for the procurement and execution of Class 3 & 4 plant and personal property projects to maintain, modernize and improve the infrastructure and industrial base at the mission funded Naval Shipyard\/IMF activities.  Funding will allow for the acquisition of equipment and OP,N related Automated Data Processing (ADP) Hardware\/Software necessary to perform the mission of repairing, conversion, and modernization of fleet ships and submarines in the most economical, efficient, environmentally sound and safe manner possible.\n\n[P40A \/ KN400:  SHIP MAINTENANCE INVESTMENT PROGRAM]: This line item provides funding to support capital investments for the Naval Shipyards, Regional Maintenance Centers (RMC's) and Trident Refit Facility (TRF) Kings Bay.  Funds will be used for the procurement and execution of industrial plant equipment (IPE) and personal property projects to maintain and  modernize the ship maintenance industrial base.  Funding will allow for the acquisition of industrial plant equipment necessary to perform the mission of repairing, conversion, and modernization of fleet ships and submarines.\n\n[P40A \/ KN600:  REGIONAL MAINTENANCE AUTOMATED INFORMATION SYSTEMS (RMAIS)]: Funding provides support for the RMAIS initiative.  RMAIS is the sole provider of automated electronic brokering of ship maintenance actions among maintenance activities and provides visibility of maintenance\/repair workload and status necessary to support sound maintenance management decisions locally, on a regional basis, and at the national level.  RMAIS provides the Regional Maintenance Center with the capability to efficiently manage all maintenance and repair resources.  Funds will be used to procure computer hardware and software needed to refresh aging systems and keep security requirements current.\n\n[P40A \/ KN700:  DISTANCE SUPPORT]: These funds support the Anchor Desk (Integrated Call Center), Customer Relations Management (CRM) solutions, implementation and standardization of various tele-assistance\/telemaintenance tools, collaborative infrastructure support and metrics\/data mining.\n\n[P40A \/ KN800:  INTEGRATED CONDITION ASSESSMENT SYSTEM (ICAS) NEW INSTALL]: Funding procures all new installations of the Integrated Condition Assessment System (ICAS) hardware and software aboard Surface Fleet hulls.  New Installation include: ICAS workstation hardware (including Palm Pilot Portable Data Terminal (PDTs)), latest version of ICAS system software, Configuration Data Set (CDS) (including the implementation of developed enhancements), firewall (if applicable), remote monitoring utility (RMU), ILS and ship's force training.  Manage contractor efforts, prepare installation plans, perform ship checks, procure material, oversee shipboard installation and Quality Assurance (QA), develop\/implement CDS, install\/test all software and CDSs, provide ship's force training.\n\n[P40A \/ KN900:  INTEGRATED CONDITION AWSSESSMENT SYSTEM (ICAS) TECH REFRESH]: Funding procures all technical refresh upgrades of the Integrated Condition Assessment System (ICAS) hardware and \tsoftware aboard Surface Fleet hulls.  Upgrades will include: ICAS workstation hardware (including Palm Pilot Portable Data Terminal (PDTs)), latest version of ICAS system software, Configuration Data Set (CDS) groom (including the implementation of developed enhancements) and ship's force refresher training.  Manage contractor efforts, prepare installation plans, perform ship checks, procure material, oversee shipboard installation and Quality Assurance (QA), develop\/implement CDS updates, install\/test all software and CDSs, provide ship's force training."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Operating Forces IPE"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) KN100:  INDUSTRIAL PLANT EQUIPMENT (IPE) REPLACEMENT\/AFLOAT SUPPORT"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) AFLOAT IPE SUPPORT (BFIMA UPGRADE) - SURFACE SUPPORT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.294"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.277"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.286"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.286"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) KN200:  ELECTRONIC TECHNICAL WORK DOCUMENT (ETWD)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) ELECTRONIC TECHNICAL WORK DOCUMENT (ETWD) SUPPORT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "CurrentYear": {
                                                        "val": "0.392"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.686"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.686"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) KN300:  SHIPYARD CAPITAL INVESTMENT PROGRAM (CIP)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) SHIPYARD CAPITAL INVESTMENT PROGRAM (CIP)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "68"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "14"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "19"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "19"
                                                    }
                                                },
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "210.832"
                                                    },
                                                    "PriorYear": {
                                                        "val": "88.237"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "49.676"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "48.469"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "48.469"
                                                    }
                                                },
                                                "GrossWeaponSystemUnitCost": {
                                                    "PriorYear": {
                                                        "val": "1297602.94"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3548290"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2551000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2551000"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "VARIOUS"
                                                        },
                                                        "Location": {
                                                            "val": "VARIOUS"
                                                        },
                                                        "MinimumSustainingRate": {
                                                            "val": "0"
                                                        },
                                                        "MaximumProductionRate": {
                                                            "val": "0"
                                                        },
                                                        "Rate185": {
                                                            "val": "0"
                                                        },
                                                        "InitialQuantity": {
                                                            "AdminLeadTimeBeforeOct1InMonths": {
                                                                "val": "0"
                                                            },
                                                            "AdminLeadTimeAfterOct1InMonths": {
                                                                "val": "0"
                                                            },
                                                            "ProductionLeadTimeAfterOct1InMonths": {
                                                                "val": "0"
                                                            },
                                                            "TotalLeadTimeAfterOct1InMonths": {
                                                                "val": "0"
                                                            }
                                                        },
                                                        "ReorderQuantity": {
                                                            "AdminLeadTimeBeforeOct1InMonths": {
                                                                "val": "0"
                                                            },
                                                            "AdminLeadTimeAfterOct1InMonths": {
                                                                "val": "0"
                                                            },
                                                            "ProductionLeadTimeAfterOct1InMonths": {
                                                                "val": "0"
                                                            },
                                                            "TotalLeadTimeAfterOct1InMonths": {
                                                                "val": "0"
                                                            }
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2011"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "VARIOUS"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2010-12"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2011-03"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "68"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "1297602.94"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2010-10"
                                                                    },
                                                                    "FundingVehicle": {
                                                                        "val": "Various"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2012"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "VARIOUS"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2012-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2012-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "14"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "3548290.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2011-10"
                                                                    },
                                                                    "FundingVehicle": {
                                                                        "val": "Various"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2013"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "VARIOUS"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2013-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2013-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "19"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "2551000.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "false"
                                                                    },
                                                                    "RevisionsAvailableDate": {
                                                                        "val": "2012-10"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2012-10"
                                                                    },
                                                                    "FundingVehicle": {
                                                                        "val": "Various"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) KN400:  SHIP MAINTENANCE INVESTMENT PROGRAM"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) SHIP MAINTENANCE INVESTMENT PROGRAM"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "5.589"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.589"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) KN600:  REGIONAL MAINTENANCE AUTOMATED INFORMATION SYSTEMS (RMAIS)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.1) REGIONAL MAINTENANCE AIS"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.823"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.32"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.325"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.334"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.334"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "6) KN700:  DISTANCE SUPPORT"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "6.1) DISTANCE SUPPORT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.696"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.093"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.909"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.937"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.937"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "7) KN800:  INTEGRATED CONDITION ASSESSMENT SYSTEM (ICAS) NEW INSTALL"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "7.1) INTEGRATED CONDITION ASSESSMENT SYSTEM (ICAS)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "3.392"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.392"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "8) KN900:  INTEGRATED CONDITION AWSSESSMENT SYSTEM (ICAS) TECH REFRESH"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "8.1) INTEGRATED CONDITION ASSESSMENT SYSTEM (ICAS)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.468"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.459"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.063"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.653"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.653"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}