{
    "id": "b089325f63931a1ca5afabffe06707b8a90503fd",
    "meta": {
        "filename": "dod-2013_PROCUREMENT_2013_ARMY_AIRCRAFT_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2031A",
        "appropriation_name": "Aircraft Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "AZ3300"
        },
        "LineItemTitle": {
            "val": "Industrial Facilities"
        },
        "P1LineItemNumber": {
            "val": "41"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2031A"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Support Equipment and Facilities"
        },
        "BudgetSubActivityNumber": {
            "val": "30"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "2856.404"
                },
                "PriorYear": {
                    "val": "1.557"
                },
                "CurrentYear": {
                    "val": "1.593"
                },
                "BudgetYearOneBase": {
                    "val": "1.643"
                },
                "BudgetYearOne": {
                    "val": "1.643"
                },
                "BudgetYearTwo": {
                    "val": "1.615"
                },
                "BudgetYearThree": {
                    "val": "1.619"
                },
                "BudgetYearFour": {
                    "val": "1.634"
                },
                "BudgetYearFive": {
                    "val": "1.662"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "2867.727"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "2856.404"
                },
                "PriorYear": {
                    "val": "1.557"
                },
                "CurrentYear": {
                    "val": "1.593"
                },
                "BudgetYearOneBase": {
                    "val": "1.643"
                },
                "BudgetYearOne": {
                    "val": "1.643"
                },
                "BudgetYearTwo": {
                    "val": "1.615"
                },
                "BudgetYearThree": {
                    "val": "1.619"
                },
                "BudgetYearFour": {
                    "val": "1.634"
                },
                "BudgetYearFive": {
                    "val": "1.662"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "2867.727"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "2856.404"
                },
                "PriorYear": {
                    "val": "1.557"
                },
                "CurrentYear": {
                    "val": "1.593"
                },
                "BudgetYearOneBase": {
                    "val": "1.643"
                },
                "BudgetYearOne": {
                    "val": "1.643"
                },
                "BudgetYearTwo": {
                    "val": "1.615"
                },
                "BudgetYearThree": {
                    "val": "1.619"
                },
                "BudgetYearFour": {
                    "val": "1.634"
                },
                "BudgetYearFive": {
                    "val": "1.662"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "2867.727"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Description": {
            "val": "This program provides funding to the Army Test and Evaluation Command (ATEC), Developmental Test Command (DTC) to establish, modernize, expand or replace test facilities used in production testing of Aircraft and Aircraft components.  It sustains Army production test capabilities through upgrade and replacement of instrumentation and equipment that is technologically and\/or economically obsolete.  Modernization of test instrumentation and equipment provides increased automation and efficiencies, improved data quality and quantity and cost avoidances to Army Program Managers.  Programmed funding will be used to upgrade or replace production test instrumentation and equipment at the Redstone Test Center (RTC), Huntsville, AL and Yuma Proving Ground (YPG), Yuma, AZ.  Note:  Previous years funding supported sustainment of production test capabilities at the Aviation Technical Test Center (ATTC), Fort Rucker, AL.  Base Realignment and Closure (BRAC) decisions move the ATTC from Fort Rucker, to RTC in Huntsville, AL.  All of the instrumentation and equipment procured for ATTC will be moved with the Test Center to Huntsville and will be used for Aircraft Testing in the relocation of this mission."
        },
        "Justification": {
            "val": "ATEC:  At RTC, FY 2013 procures upgraded telemetry equipment used to capture and process real-time data transmitted at high data rates and frequencies during open air developmental flight tests.  At YPG, FY 2013 procures replacement aircraft instrumentation for the time-stamping and on-board recording and telemetering of data from standard 1553 multiples bus, analog video from sensors, intercom (voice), and analog sensors; and on-board recorders and telemetry equipment that can meet the environment and data speeds needed for production base aviation programs.   Funding will also provide YPG enhancements and upgrades to the data acquisition software and flight models in the weapons System Test and Integration Lab; procure new  NSA approved telemetry encryption and decryption devices to support classified test missions; procure an acoustic\/seismic sensor system that will allow the YPG test team to accurately determine impact locations for high rate aerial fired weapon systems during aircraft weapons performance tests and procure on-board instrumentation for real-time collection of aircraft performance data.  The majority of the instrumentation being upgraded or replaced is obsolete and has met or exceeded its economic life.  This instrumentation is required to ensure complete and accurate test data is collected and safety and environmental hazards are minimized.  \n\nAll COMPO 1 Active"
        }
    }
}