{
    "id": "b1cada333b44764c90bff3b4a18c9464dc8636af",
    "meta": {
        "filename": "dod-2013_PROCUREMENT_2013_ARMY_OTHER_3-4_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "R05600"
        },
        "LineItemTitle": {
            "val": "Water Purification Systems"
        },
        "P1LineItemNumber": {
            "val": "149"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "35"
        },
        "BudgetSubActivityTitle": {
            "val": "Water Equipment"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "330.49"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "330.49"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "330.49"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "330.49"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "330.49"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "330.49"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Family of Water Purification Systems consists of the 1500 Gallons Per Hour (GPH) Tactical Water Purification System (TWPS), and the Lightweight Water Purifier (LWP).  The water purification rates for these two systems range from 125 GPH to 1,500 GPH.  Both the 1500 TWPS and the LWP are a part of the Stryker Brigade Combat Team (SBCT). Features of each system follows:     \n\nThe 1,500 GPH Tactical Water Purification System (TWPS) is a modern water purification system that replaces the aged 600 GPH Reverse Osmosis Water Purification Unit (ROWPU).  The 1500 TWPS is a force multiplier because each 1500 TWPS eliminates one 600 ROWPU crew.  The 1500 TWPS is mounted on an International Standards Organization (ISO) frame flat rack and transported by the Heavy Expanded Mobility Tactical Truck-Load Handling System (HEMTT-LHS) or Palletized Loading System (PLS).  This modular configuration gives the 1500 TWPS the capability of rapid deployment and recovery.  The Army Acquisition Objective AAO) is 318 systems.\n\nThe Lightweight Water Purification System (LWP) is a new water purification capability for the Army.  It is a portable water purifier developed for use during early entry, rapid tactical movement and during independent operations such as Special Operations Forces (SOF), temporary medical facilities, emergency operations, disaster relief, and\/or similar forward area operations.  It is capable of purifying 75 GPH from saltwater sources and 125 GPH from freshwater sources.  With Nuclear, Biological and Chemical (NBC) treatment components, it can also produce potable water from NBC contaminated water.  This High Mobility Multipurpose Wheeled Vehicle (HMMWV) transportable system consists of 8 modules, a triple container (TRICON) for storage and transportation, and cold weather kit.  Once employed, one Soldier can maintain and operate the system. The AAO of 586 systems is complete."
        },
        "Justification": {
            "val": "FY13 funding is not required."
        }
    }
}