{
    "id": "d32d6989a8e2aa071e400f2d4494d39e4297c917",
    "meta": {
        "filename": "dod-2013_PROCUREMENT_2013_ARMY_OTHER_2_JustificationBook_Army_PB_2013.zzz_unzipped_JustificationBook_Army_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "BZ8889"
        },
        "LineItemTitle": {
            "val": "Automatic Identification Technology"
        },
        "P1LineItemNumber": {
            "val": "108"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "89"
        },
        "BudgetSubActivityTitle": {
            "val": "Elect Equip - Tactical C2 Systems"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "506.639"
                },
                "PriorYear": {
                    "val": "15.205"
                },
                "CurrentYear": {
                    "val": "27.324"
                },
                "BudgetYearOneBase": {
                    "val": "14.377"
                },
                "BudgetYearOne": {
                    "val": "14.377"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "563.545"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "506.639"
                },
                "PriorYear": {
                    "val": "15.205"
                },
                "CurrentYear": {
                    "val": "27.324"
                },
                "BudgetYearOneBase": {
                    "val": "14.377"
                },
                "BudgetYearOne": {
                    "val": "14.377"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "563.545"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "506.639"
                },
                "PriorYear": {
                    "val": "15.205"
                },
                "CurrentYear": {
                    "val": "27.324"
                },
                "BudgetYearOneBase": {
                    "val": "14.377"
                },
                "BudgetYearOne": {
                    "val": "14.377"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "563.545"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "ComponentSplit": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "PriorYear": {
                                "TotalCost": {
                                    "val": "15.205"
                                }
                            },
                            "CurrentYear": {
                                "TotalCost": {
                                    "val": "27.324"
                                }
                            },
                            "BudgetYearOneBase": {
                                "TotalCost": {
                                    "val": "14.377"
                                }
                            },
                            "BudgetYearOne": {
                                "TotalCost": {
                                    "val": "14.377"
                                }
                            }
                        }
                    }
                ]
            }
        },
        "Description": {
            "val": "Radio Frequency-Intransit Visibility (RF-ITV) utilizes cutting edge RF technologies in concert with automatic identification technology to provide near real-time logistics visibility to on-site commanders, Combatant Commanders (COCOMs), NATO allies and Coalition partners. This is accomplished through the use of various applications of Radio Frequency Identification (RFID) tags. Shipments are tracked and monitored by land, air and sea as cargo transits throughout the global Defense Transportation System through a collection of tag read sites strategically located world-wide transmitting to satellite uplinks, downloaded to a collection tactically located servers and accessed by PC using a CAC card or user ID\/Password. This program provides state-of-the-art technologies used with automated logistics systems to facilitate and expedite supply and property receiving, distribution, storage, inventory management and accountability. This facilitates rapid and accurate data capture, retrieval and transmission. The technology includes various radio frequency identification and barcode scanning devices, barcode label and page printers, and various data carrier devices with associated readers and writers. The data carrier devices include RFID tags, optical memory buttons, and wireless Local Area Network (LAN) technology. Automatic Identification Technology (AIT) is used throughout the Army at the wholesale and retail supply levels and in automated maintenance, personnel and transportation systems, where rapid and accurate source data collection is required. The AIT contract establishes a baseline of AIT devices for use throughout the Department of Defense (DoD) and ensures standardization and interoperability of this equipment among the Services, while providing extensive warranty and maintenance. This program has the mission to provide centralized procurement of AIT Technologies and engineering and fielding of state-of-the-art Radio Frequency Identification (RFID) technologies as the joint service system for RFID-enabled visibility of the Defense Transportation System. AIT\/RF-ITV (Radio Frequency-Intransit Visibility), as a Total Asset Visibility enabler to connect logisticians and integrate DoD supply chains, is the mission essential capability for Joint\/Coalition warfighters throughout the Army and Combatant Commands. By using Radio Frequency Identification (RFID) tags, the RF-ITV infrastructure traces the identity, status and location of cargo from origin (depot to vendor) to destination."
        },
        "Justification": {
            "val": "FY 2013 Base procurement dollars in the amount of $14.377 million funds fielding and upgrade support to the DOD RFID Network\/Infrastructure, Standard Army Management Information Systems (STAMIS) and other Information Technology (IT) systems within the DOD Global Supply Chain. RF-ITV is the Product Manager's primary mission that provides Combatant Commanders (COCOMs), warfighters, NATO allies and Coalition Partners timely and accurate logistical data. Funding will also procure hardware and training (including first time users) required to meet continual fielding expansion, constant network and infrastructure upgrades and Life Cycle Replacement (LCR) to meet the warfighters' need for additional RF-ITV read\/write sites world-wide.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        }
    }
}