{
    "id": "dbafbf53dcaf308cfe7bb5ad0fa6feaf391575dd",
    "meta": {
        "filename": "dod-2013_PROCUREMENT_2013_NAVY_OTHER_BA5_8_JustificationBook_Navy_PB_2013.zzz_unzipped_JustificationBook_Navy_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "6060"
        },
        "LineItemTitle": {
            "val": "Items under $5 million"
        },
        "P1LineItemNumber": {
            "val": "134"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "Civil Engineering Support Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Civil Engineering Support Equipment"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "PriorYear": {
                    "val": "51.187"
                },
                "CurrentYear": {
                    "val": "11.729"
                },
                "BudgetYearOneBase": {
                    "val": "15.252"
                },
                "BudgetYearOneOCO": {
                    "val": "0.375"
                },
                "BudgetYearOne": {
                    "val": "15.627"
                },
                "BudgetYearTwo": {
                    "val": "33.993"
                },
                "BudgetYearThree": {
                    "val": "30.79"
                },
                "BudgetYearFour": {
                    "val": "36.354"
                },
                "BudgetYearFive": {
                    "val": "28.417"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "51.187"
                },
                "CurrentYear": {
                    "val": "11.729"
                },
                "BudgetYearOneBase": {
                    "val": "15.252"
                },
                "BudgetYearOneOCO": {
                    "val": "0.375"
                },
                "BudgetYearOne": {
                    "val": "15.627"
                },
                "BudgetYearTwo": {
                    "val": "33.993"
                },
                "BudgetYearThree": {
                    "val": "30.79"
                },
                "BudgetYearFour": {
                    "val": "36.354"
                },
                "BudgetYearFive": {
                    "val": "28.417"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "51.187"
                },
                "CurrentYear": {
                    "val": "11.729"
                },
                "BudgetYearOneBase": {
                    "val": "15.252"
                },
                "BudgetYearOneOCO": {
                    "val": "0.375"
                },
                "BudgetYearOne": {
                    "val": "15.627"
                },
                "BudgetYearTwo": {
                    "val": "33.993"
                },
                "BudgetYearThree": {
                    "val": "30.79"
                },
                "BudgetYearFour": {
                    "val": "36.354"
                },
                "BudgetYearFive": {
                    "val": "28.417"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.044"
                },
                "CurrentYear": {
                    "val": "0.045"
                },
                "BudgetYearOneBase": {
                    "val": "0.046"
                },
                "BudgetYearOne": {
                    "val": "0.046"
                },
                "BudgetYearTwo": {
                    "val": "0.047"
                },
                "BudgetYearThree": {
                    "val": "0.048"
                },
                "BudgetYearFour": {
                    "val": "0.049"
                },
                "BudgetYearFive": {
                    "val": "0.05"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "SPECIAL PURPOSE VEHICLES\/EQUIPMENT\nThis program includes special purpose vehicles and trailers of commercial design which support the Naval Expeditionary Combat Command (NECC), shore activities, and other special operating units. Included are tank trucks used to transport fuel to construction equipment at remote locations, waste disposal trucks used to transport waste oil\/water, overhead maintenance trucks with insulated buckets and pole and line trucks used for repair\/replacement of power systems, wreckers used in vehicle recovery\/towing, field servicing vehicles used for on-site preventive maintenance of construction equipment in the field, and ammunition handling trucks used in loading\/unloading and transporting munitions. Truck tractors and trailers required by the active operating forces in the logistics support of the fleet are also included in this program. Representative types and uses include van and stake bed semi-trailers to support loading\/unloading of ships and aircraft and movement of materials and equipment for fleet operations, lowbed semitrailers for transport of construction equipment, tank trailers for transport and dispensing of water, fuel, and hazardous liquids, and semi-trailers transport of materials.\n\nThis program includes funds for the procurement of Bearcats, used on paved or improved roads, to guard and protect the TRIDENT II (D5) missile while the missile is in storage, being handled, or in a movement convoy to and from the waterfront at the Strategic Weapons Facility, Atlantic (SWFLANT) in Kings Bay, GA and the Strategic Weapons Facility, Pacific (SWFPAC) in Bangor, WA. Equipment is used in support of SSP's mission of securing the Limited Area and provides for security vehicles to replace existing (aging) vehicles used in roving patrols of the Limited Area and to support TRIDENT II (D5) missile movement convoys.\n\nThe funds requested in FY 2013 will provide for recapitalization requirements to support fielding a fleet of equipment within useful life expectancy.\n\nThis request includes FY 2013 Overseas Contingency Operations (OCO) funding for Operation Enduring Freedom - Horn of Africa (OEF-H) in the amount of $.375M. The FY 2013 OCO funds requested will provide an Aircraft Refueling Truck to support mission growth (greater number of wide-body aircraft movements) and replacement of smaller-capacity trucks.\n\n\nCOMBAT CONSTRUCTION SUPPORT EQUIPMENT\nThe equipment included in this program is used by the Naval Expeditionary Combat Command (NECC), Naval Beach Group (NBG), and special operating units to provide responsive military construction support to the Navy, Marine Corps, and other forces during military operations, construction of base facilities, and in the conduct of limited defensive operations. These facilities and equipment are vital for maintaining the integrity and sustainability of these units during contingency and wartime operations. Equipment items include containers, required for prepacking and securing on-site storage of expensive equipment to expedite mobilization, fuel storage tanks required for on-site storage of fuel, water purification units required for camp water treatment systems, water storage tanks (collapsible fabric) required for water treatment, storage and distribution systems, power distribution panelboards required for camp electrical distribution systems, and tension fabric structures required for equipment maintenance and company shops. The funds requested in FY 2013 will provide for recapitalization requirements to support fielding a fleet of equipment within useful life expectancy. Funds being requested for DON Energy Initiative support procurement of Integrated Trailer Environmental Control Unit Generators (ITEG).\n\n\n\nOCEAN CONSTRUCTION EQUIPMENT\nOcean Construction Equipment are those specialized equipment and facilities components used primarily by the Naval Construction Force (NCF) to perform site selection, construction, inspection, maintenance, repair and removal of fleet and other Navy fixed underwater and ocean facilities, and in support of shore-based hyperbarics. Some equipment is centrally procured under this line as initial outfitting for the Underwater Construction Teams' (UCT) Tables of Allowance (TOA). Most of the equipment is for the Ocean Construction Equipment Inventory (OCEI). It is centrally procured and maintained by the Naval Facilities Engineering Command in a controlled inventory to ensure the NCF response to fleet needs is both timely and adequate. Utilization of funds from this program sustains the Naval Construction Force (NCF) capability to meet fleet requirements for ocean facility site survey, construction, inspection, repair, and removal, resulting in the ability of the fleet to retain its readiness through utilization of its underwater facilities. The funds requested in FY 2013 will be used to replace existing equipment kits and systems which are well beyond their useful and maintainable lives. In many instances, these replacements will result in slightly improved or modified capabilities.\n\nMOBILE UTILITIES SUPPORT EQUIPMENT (MUSE)\nEquipment in this program consists of electric power generation plants, electric substations, and steam boiler plants (including water treatment plants to meet ships' minimum clean steam requirements). MUSE provides short-term support for fleet and shore utility requirements resulting from equipment failures, changes in planning and programming, temporary replacement of utilities equipment which is out of service, ship support and testing, expeditionary military operations, and utilities outages resulting from natural disaster. Operations supported are submarine testing, ships' repair, retrofit and nuclear refueling, cold iron applications, serious utility system deficiencies, MILCON delay, and advanced base requirements. The funds requested in FY 2013 will procure one 800kw power plant and one 1500kw power plant in each year."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Items under $5 million"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) SPECIAL PURPOSE VEHICLES\/EQUIPMENT"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) SPECIAL PURPOSE VEHICLES-EQUIPMENT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "6"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "5"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "6"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6"
                                                    }
                                                },
                                                "GrossWeaponSystemCost": {
                                                    "PriorYear": {
                                                        "val": "1.681"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.407"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.709"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.709"
                                                    }
                                                },
                                                "GrossWeaponSystemUnitCost": {
                                                    "PriorYear": {
                                                        "val": "280166.67"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "281400"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "284833.33"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "284833.33"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) SPECIAL PURPOSE VEHICLES\/EQUIPMENT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "133"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "54"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "61"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "62"
                                                    }
                                                },
                                                "GrossWeaponSystemCost": {
                                                    "PriorYear": {
                                                        "val": "19.5"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.587"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.782"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0.375"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.157"
                                                    }
                                                },
                                                "GrossWeaponSystemUnitCost": {
                                                    "PriorYear": {
                                                        "val": "146616.54"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "66425.93"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "78390"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "375000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "83177.42"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) COMBAT CONSTRUCTION SUPPORT EQUIPMENT"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) COMBAT CONSTRUCTION SUPPORT EQUIPMENT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1164"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1593"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "498"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "498"
                                                    }
                                                },
                                                "GrossWeaponSystemCost": {
                                                    "PriorYear": {
                                                        "val": "28.785"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.448"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.623"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.623"
                                                    }
                                                },
                                                "GrossWeaponSystemUnitCost": {
                                                    "PriorYear": {
                                                        "val": "24729.38"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2792.22"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9283.13"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9283.13"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) MOBILE UTILITIES SUPPORT EQUIPMENT"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) MOBILE UTILITIES SUPPORT EQUIPMENT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "2"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "GrossWeaponSystemCost": {
                                                    "PriorYear": {
                                                        "val": "0.843"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.859"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.877"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.877"
                                                    }
                                                },
                                                "GrossWeaponSystemUnitCost": {
                                                    "PriorYear": {
                                                        "val": "421500"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "429500"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "438500"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "438500"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) OCEAN CONSTRUCTION EQUIPMENT"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) OCEAN CONSTRUCTION EQUIPMENT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "4"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3"
                                                    }
                                                },
                                                "GrossWeaponSystemCost": {
                                                    "PriorYear": {
                                                        "val": "0.378"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.287"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.261"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.261"
                                                    }
                                                },
                                                "GrossWeaponSystemUnitCost": {
                                                    "PriorYear": {
                                                        "val": "94500"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "95670"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "87000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "87000"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) DON ENERGY INITIATIVE"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.1) DON ENERGY INITIATIVE"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "CurrentYear": {
                                                        "val": "1.141"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}