{
    "id": "f6ef85933ee3ec1eb5c83862930313226bfd40e5",
    "meta": {
        "filename": "dod-2013_PROCUREMENT_2013_AIRFORCE_AIRCRAFT_VOL1_JustificationBook_Air_Force_PB_2013.zzz_unzipped_JustificationBook_Air_Force_PB_2013.xml",
        "budget_year": "2013",
        "budget_cycle": "PB",
        "submission_date": "2012-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3010F",
        "appropriation_name": "Aircraft Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "27"
        },
        "LineItemTitle": {
            "val": "RQ-4  Advance Procurement"
        },
        "P1LineItemNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3010F"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Other Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Aircraft"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "587.997"
                },
                "PriorYear": {
                    "val": "71.901"
                },
                "CurrentYear": {
                    "val": "71.5"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "587.997"
                },
                "PriorYear": {
                    "val": "71.901"
                },
                "CurrentYear": {
                    "val": "71.5"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "587.997"
                },
                "PriorYear": {
                    "val": "71.901"
                },
                "CurrentYear": {
                    "val": "71.5"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "FlyawayUnitCost": {
                "AllPriorYears": {
                    "val": "0.000"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Code": {
            "val": "A"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0305220F"
                }
            ]
        },
        "Description": {
            "val": "Totals include funding for PRCP Program Number 252, Global Hawk.\n\nThe Global Hawk Unmanned Aircraft System (UAS) provides high altitude, deep look, long endurance Intelligence, Surveillance, Reconnaissance (ISR), and Battle Management Command & Control (BMC2) enabler capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios.\n\nThis advance procurement funding is no longer required in FY13 and out. Production lines are being shut down (to include tooling disposition, contract closeout, sustaining engineering ramp down, etc). \n\nThe RQ-4A is an imagery-intelligence (IMINT) UAS designed to employ 2000 pounds of payload.  The RQ-4A has one (1) configuration - the Block 10.  The Block 10 employs an IMINT system comprised of a synthetic aperture radar (SAR) sensor and an electro-optical (EO) \/ infrared (IR) sensor.  These three (3) sensors comprise the integrated sensor suite (ISS).\n  \nThe RQ-4B UAS is designed to employ 3000 pounds of payload and enable multi-intelligence (multi-INT) collecting.  The RQ-4B has three (3) configurations:  Block 20, Block 30, and Block 40 (RQ440P). The Block 20 employs upgraded SAR and EO\/IR sensors - Enhanced ISS (EISS) - in an IMINT-only configuration.  The Block 30 employs the same EISS sensors as the Block 20, and integrates a wide spectrum signals intelligence (SIGINT) sensor, the Airborne Signals Intelligence Payload (ASIP).  EISS and ASIP are used simultaneously to create a multi-INT platform.  The Block 40 only integrates the Multi-Platform Radar Technology Insertion Program (MP-RTIP) radar.  The user will ultimately determine the optimal mix of quantities and payloads for each aircraft configuration based on operational requirements.  The ground segment includes the mission control element (MCE) and the launch and recovery element (LRE).  The support segment includes aerospace ground equipment, tech orders, spares, support equipment, and training to enable operation of the Global Hawk System.\n\nThe Global Hawk program went through a Title 10, Section 2433 review in 2006 due to a unit cost breach (informally known as Nunn-McCurdy breach).  The Department certified the program to Congress on June 5, 2006.  An FY09 schedule breach required reduced procurement to accommodate schedule. The Global Hawk program went through another Title 10, Section 2433 review in 2011 due to a unit cost breach (informally known as Nunn-McCurdy breach). The Department certified the program to Congress on June 14, 2011. \n\nThroughout the FYDP, the program will continue modernization to enhance the system to meet requirements as documented in updates to the Capability Development Document (CDD).  During this time, the user will determine the optimal payload configuration and quantity for each aircraft based on current operational requirements.  To protect future production schedules from Diminishing Manufacturing Sources and Material Shortages issues, the program will perform schedule protection buys when appropriate.\n\nThis program has associated Research Development Test and Evaluation funding in PE 0305220F, 0304260F, and 0207423F."
        },
        "Justification": {
            "val": "1. Block 10: No FY13 funds requested.\n2. Block 20: No FY13 funds requested.\n3. Block 30: No FY13 funds requested."
        }
    }
}