{
    "id": "002b1c93d43d05e0b4224bd801f02cda737193fe",
    "meta": {
        "filename": "dod-2017_RDTE_2017_MDA_U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603180C"
        },
        "ProgramElementTitle": {
            "val": "Advanced Research"
        },
        "R1LineNumber": {
            "val": "32"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "23.025"
            },
            "PriorYear": {
                "val": "18.476"
            },
            "CurrentYear": {
                "val": "17.364"
            },
            "BudgetYearOne": {
                "val": "23.433"
            },
            "BudgetYearOneBase": {
                "val": "23.433"
            },
            "BudgetYearTwo": {
                "val": "19.870"
            },
            "BudgetYearThree": {
                "val": "20.529"
            },
            "BudgetYearFour": {
                "val": "21.131"
            },
            "BudgetYearFive": {
                "val": "21.494"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The FY 2017 increase funds the highly successful effort to transition advanced material technology to the Ballistic Missile Defense System, along with initiatives in Nano-technology (propellants, batteries, electronics, multifunctional structures, thermal management, and electro-optics) and Additive Manufacturing Technology for interceptor propulsion and structural components."
        },
        "ProgramElementMissionDescription": {
            "val": "Advanced Research conducts leading edge research and development to create and enable future missile defense capability.  MDA executes this mission by capitalizing on the creativity and innovation of the brightest minds in our Nation's universities and small businesses, collaborative research partnerships between allied country academic institutions, and innovative ideas from industry.  This includes a focus on facilitating the transition of technology to the Ballistic Missile Defense System (BMDS) through a Commercialization and Transition Office and the execution of the Rapid Innovation Fund Program.  Advanced Research identifies priorities and balances the research portfolio in collaboration with the Agency's Chief Engineer and an Agency-wide executive level Research Council.\n\nMD40 Program-Wide Support (PWS) consists of essential non-headquarters management efforts providing integrated and efficient support to MDA functions and activities across the entire BMDS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.584"
                },
                "CurrentYear": {
                    "val": "17.364"
                },
                "BudgetYearOne": {
                    "val": "18.919"
                },
                "BudgetYearOneBase": {
                    "val": "18.919"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.476"
                },
                "CurrentYear": {
                    "val": "17.364"
                },
                "BudgetYearOne": {
                    "val": "23.433"
                },
                "BudgetYearOneBase": {
                    "val": "23.433"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.892"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.514"
                },
                "BudgetYearOneBase": {
                    "val": "4.514"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.171"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.279"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.514"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.514"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 adjustment reflects a realignment of Department of Defense priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD25"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "23.025"
                        },
                        "PriorYear": {
                            "val": "17.980"
                        },
                        "CurrentYear": {
                            "val": "16.549"
                        },
                        "BudgetYearOne": {
                            "val": "22.600"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.600"
                        },
                        "BudgetYearTwo": {
                            "val": "18.908"
                        },
                        "BudgetYearThree": {
                            "val": "19.487"
                        },
                        "BudgetYearFour": {
                            "val": "20.047"
                        },
                        "BudgetYearFive": {
                            "val": "20.362"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "Advanced Technology Development explores new BMDS capability by leveraging the creativity and innovation of the Nation's small businesses and universities, and through cooperative international research agreements between U.S. and foreign universities of allied nations. The program manages the selection process and administers the Missile Defense Small Business Innovation Research program element, 0605502C.  Small Business Innovation Research topics and projects are selected annually based on identified needs across the BMDS and executed in partnership with sponsoring intra-agency organizations. In FY 2017, the program will conduct Advanced Technology Innovation Broad Agency Announcement solicitation for identifying potential breakthrough research on missile defense related technology with private industry, qualified accredited educational institutions, and non-profit organizations. Projects may include directed energy, sensors, command and control, and interceptor technology.  The program will execute and administer the Missile Defense Agency Science, Technology and Research Broad Agency Announcement which invests in university research ranging from sensor data fusion to solid rocket propulsion to advanced materials for missile defense application.\n\nAdvanced Technology Development pursues a broad range of revolutionary technology targeted for application and insertion into the BMDS.  This work facilitates the commercialization and transition of promising technology into the BMDS by promoting a cooperative environment to reduce cost and increase return on investment between small business, prime contractors and MDA elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.980"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Pursued on-going scientific and engineering university research initiatives and projects:\n  --Alabama A&M University: Reconfigurable Computing for Multi-Sensor Tracking Applications\n  --Howard University: Machine Learning for Analyzing the Forensics and Reliability of Integrated Circuits\n  --Howard University: Infrared Analysis in Counterfeit Parts Detection and Supply Chain Validation\n  --Purdue University: Propulsion Improvements for MDA Applications\n  --Texas A&M University: Solid Propellant Additives for Divert Attitude Control System (DACS) Applications \n  --Texas A&M University: Hybrid Waveguide\/Micro Electro Mechanical System Optical Signal Processor\n  --Texas A&M University:  Ignition of Composite Propellants with Advanced Additives\n  --University of Alabama Huntsville: Computational studies of aero-optic effects of higher Reynolds numbers gas flows over sensor\n     structures\n  --University of Alabama Huntsville:  Green Oxidizer Development\n  --University of Connecticut: Innovative Radar Signal Processing & Algorithms\n  --University of Dayton: Common Aperture Light Weight Multi-Aperture All Electric HEL\n  --University of Illinois: Decision Theory for Optimal Engagement Planning\n  --University of Maryland: Development of Thrusters for Fast Response Time DAC Propulsion Systems\n  --University of New Hampshire: Gas Circulator for Diode Pumped Alkali Laser\n  --University of Southern California: Algorithms for detection, track, and classification of objects in a high debris environment \n  --University of Tennessee: Target Handoff and Resource Management for Multi-Sensor Multi-Target Tracking System\n  --University of Texas at Austin:  Nanomaterial Based Ink Jet Printing Science and Technology for X-Band Phased Array Antenna\n  --University of Texas, El Paso: HAN Based Advanced Hybrid Rocket Motor Technologies\n  --Washington State University: Reliability of Through Silicon Vias and Solder Microbumps in 3D Electronics for High Performance Defense\n     Applications\n\n-Sponsored breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement (ATI BAA), to include research in: \n  --Radar and Communication Systems\n  --Electro-Optical \/ Infrared Sensor Systems\n  --Directed Energy Systems\n  --Computer Science, Signal and Data Processing\n  --Mathematics, Probability and Decision Theory\n  --Physics, Chemistry, and Materials\n  --Mechanical and Aerospace Engineering\n  --Modeling and Simulation\n  --International BMDS Cooperation\n  --Advanced Non-Liquid Kill Vehicle Propulsion Systems or Architectures\n  --Advanced Kill Vehicle Technology and Architectures\n\n-Partnered with industry, the High Energy Laser Joint Technology Office, Universities and National Laboratories through advanced technology initiatives to improve sensor technology, high energy laser acquisition, tracking, and pointing technology, and lightweight fiber laser amplifiers\n\n-Conducted research and material solution analysis to identify initiatives and technology to include missiles, sensors, and command and control components in the defense against current and future threats:  \n  --Fabricated SM-3 IIA  unitary nosecone assembly prototype (composite structure, thermal protection system, and deployment hardware)\n  --Fabricated Small Business Innovative Research developed composite Arrow-3 replacement nosecone meeting all critical  requirements with high fidelity testing\n  --Successfully demonstrated a tungsten based non-eroding throat in a full scale static hot-fire test\n  --Partnered with industry, Lawrence Livermore National Labs (LLNL), and the Defense Threat Reduction Agency to perform radiation\n     source characterization tests to improve radiation hardness of optical components for Kill Vehicle seeker development\n  --Partnered with industry and Vanderbilt University, Institute of Space and Defense Electronics to develop a new capability for modeling \n     space radiation environments for the BMDS\n\n-Leveraged University-to-University (UUR) International Research opportunities with allied nations to enhance Ballistic Missile Defense System (BMDS) Advanced Technology initiatives and build stronger relationships with Missile Defense Agency (MDA) North Atlantic Treaty Organization (NATO) Allied nations and our partner countries\n  --University of Nebraska Lincoln \/ University of Bordeaux France: Diamond Coating Adaptive to Substrate Materials Using a Diamond\n     Composite Buffer Layer\n  --North Carolina State University \/ Czech Technical University;  Space Debris Exploration: Modeling and Fusion Algorithms\n  --Auburn University \/ Middle East Technical University, Turkey: Integrated Framework for Engineering Replicability into High Assurance\n     BMDS Simulations\n\n-Managed the selection process of the Small Business Innovation Research and Small Business Technology Transfer  programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications\n---Awarded 92 Phase I contracts and 68 Phase II contracts in the following research areas:\n  --Advanced Technology\n  --Aegis BMD\n  --Anti-Tamper\n  --Battle Management and Communications\n  --Directed Energy\n  --Future Capability\n  --Ground-Based Midcourse Defense\n  --Modeling and Simulation\n  --Quality, Safety & Mission Assurance\n  --Sensors\n  --Targets and Countermeasures\n  --Test Instrumentation\n  --Terminal High Altitude Area Defense\n\n-Conducted system engineering and integration to identify and mature initiatives and technology to defend against current and future threats\n\n-MDA Science Technology Engineering and Mathematics (STEM) Outreach expanded volunteer activities for other MDA facilities to increase overall MDA K-12 STEM awareness and engagement nationwide\n---Increased internal and external awareness through:\n  --Administering Best Robotics Grants\n  --MDA Engineering In Art program\n  --Partner in Education (MDA\/Ft. Belvoir)\n  --Colorado STEM Network (MDA\/Colorado Springs)\n  --Garrison Team Redstone - Huntsville Police Department's Community Awareness for Youth and Adventures in Engineering\n  --University of Alabama Huntsville Innovative System Project for the Increased Recruitment of Emerging STEM Students\n  --FIRST Robotics events\n  --Future City Competition\n  --Society for Science Broadcom Math, Applied Science, Technology Engineering for Rising Stars (MASTERS) science fairs\n  --University engagement awareness by providing Teacher Professional Development at an Alabama state-wide conference\n\n-Initiated innovative Advanced Sensor scene generation and modeling capability"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.549"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Pursue on-going scientific and engineering university research initiatives and projects:\n  --Texas A&M University: Solid Propellant Additives for Divert Attitude Control System (DACS) Applications \n  --Texas A&M University: Hybrid Waveguide Micro Electro Mechanical System Optical Signal Processor\n  --Alabama A&M University: Reconfigurable Computing for Multi-Sensor Tracking Applications \n  --University of Texas at Austin: Nanomaterial-based Ink-Jet Printing Science and Technology for Conformable X-\n     Band Phased Array Antenna\n  --University of New Hampshire: Gas Circulator for Diode Pumped Alkali Laser (DPAL)\n  --University of Connecticut: Development of innovative solutions for hardware security, and detection and\n     prevention\n  -- University of New Hampshire: Numerical Simulations of DPAL with Co-Flowing Planar Jet Geometries\n  -- Auburn University \/ Middle East Technical University, Turkey: Integrated Framework for Engineering\n     Replicability into High Assurance Ballistic Missile Defense System (BMDS) Simulations\n\n-Sponsor breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement (ATI BAA), to include research in: \n  -- Radar Systems\n  -- Directed Energy Systems\n  -- Electro-Optical Infrared Sensor Systems\n  -- Computer Science, Signal and Data Processing\n  -- Mechanical and Aerospace engineering\n  -- Decision Theory\n  -- Modeling & Simulation\n  -- Interceptor Technology\n  -- Sensor Technology\n\n-Partner with industry, the High Energy Laser Joint Technology Office, universities and national laboratories through advanced technology initiatives to improve sensor technology, high energy laser acquisition, tracking, and pointing technology, and lightweight fiber laser amplifiers\n\n-Conduct systems engineering, integration, research and material solution analysis to identify initiatives and technology to include missiles, sensors, and command and control components in the defense against current and future threats\n\n-Leverage University-to-University (UUR) International Research opportunities with allied nations to enhance BMDS Advanced Technology initiatives and build stronger relationships with Missile Defense Agency (MDA) North Atlantic Treaty Organization (NATO) allied nations and our partner countries\n\n-Manage the selection process of the Small Business Innovation Research and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The increase in funding from FY 2016 to FY 2017 is to provide additional funding to the highly successful effort to transition advanced material technology to the BMDS, along with initiatives in Nano-technology (propellants, batteries, electronics, multifunctional structures, thermal management, and electro-optics) and Additive Manufacturing Technology for interceptor propulsion and structural components.\n\n-Partner with industry, universities and national laboratories through advanced technology initiatives to improve:\n       --Nano-technology initiatives\n          ---Propellants\n          ---Batteries\n          ---Electronics\n          ---Multifunctional structures\n          ---Thermal management\n          ---Electro-optics\n      --Additive manufacturing technology initiatives for interceptor propulsion and structural components\n\n-Pursue on-going scientific and engineering university research initiatives and projects:\n  --Alabama A&M University: Reconfigurable Computing for Multi-Sensor Tracking Applications\n  --Auburn University \/ Middle East Technical University, Turkey: Integrated Framework for Engineering\n     Replicability into High Assurance BMDS Simulations\n  --Howard University: Machine learning for Analyzing the Forensics and Reliability of Integrated Circuits\n  --Johns Hopkins University: Improvements in Thermal Battery Capabilities\n  --Purdue University: Development and Characterization of Hypergolic Propellants\n  --Purdue University: Investigation of Root Causes of Combustion Instability \n  --Texas A&M University: Propellant Formulations for Suppressing Combustion Instability in Solid Rocket Motors\n  --Texas A&M University: Hysteresis Engineering of Adaptive Materials for Electronic and Optoelectric Devices\n  --University of Connecticut: Radar and Electro Optical Systems Track Detection Algorithms \n  --University of Dayton: Common Aperture Light Weight Multi-Aperture All Electric High Energy Laser\n  --University of Michigan: Narrow-Band Infrared Spectral Filtering via Silicon Sub-Wavelength Dielectric Gratings\n  --University of Nebraska \/ University of Bordeaux, France: Diamond Coating Adaptive to Substrate Materials\n  --University of Texas El Paso: Hydroxyl ammonium Nitrate Based Advanced Hybrid Rocket Motor Technologies\n  --Washington State University: Reliability of Through Silicon Vias and Solder Microbumps in 3D Electronics for High Performance Defense\n     Applications\n\n-Sponsor breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement, to include research in: \n  -- Radar Systems\n  -- Directed Energy Systems\n  -- Electro-Optical Infrared Sensor Systems\n  -- Computer Science, Signal and Data Processing\n  -- Mechanical and Aerospace engineering\n  -- Decision Theory\n  -- Modeling & Simulation\n  -- Interceptor Technology\n  -- Sensor Technology\n\n-Partner with industry, universities and national laboratories through advanced technology initiatives to improve:\n  --Space and Sensor Technology\n      --Nanosat Technology Demonstrations\n      --Radiation Hardened Mirror Technology\n      --Multi-Static Radar Technology to Include Interferometric Processing\n      --Radiation Hardened Strained-Layer Superlattice Focal Plane Arrays\n      --Improvements in Spacecraft Manufacturing Efficiency\n      --Deep Learning Algorithms for Missile Discrimination\n  --Directed Energy Technology\n      --High Power Optical Fibers\n      --Quick Recovery High Energy Diodes\n      --Ultra Low Size Weight and Power Diode Pump Modules\n      --Large Stroke, High Spatial Bandwidth, Deformable Mirrors\n      --Light Weight, Dampened Optical Benches\n      -- Optics and Coatings for Alkali Environments\n  --Interceptor Technology\n      --Aerospace-Grade Rayon Technology Development\n      --Liquid Bipropellant Combustion Models\n      --Liquid Propellant Neutralization\n      --Navigation Algorithm Technology Development\n  --Future Ballistic Missile Defense System Concept Development\n      --Advanced Sensor Algorithm Initiative\n      --Aerospace Vehicle Target Tracking and Discrimination\n      --Radar Interferometric Processing for Electro Magnetic Rail Gun \n\n-Conduct systems engineering, integration, research and material solution analysis to identify initiatives and technology to include missiles, sensors, and command and control components in the defense against current and future threats\n\n-Leverage University-to-University International Research opportunities with allied nations to enhance BMDS Advanced Technology initiatives and build stronger relationships with  MDA North Atlantic Treaty Organization allied nations and  partner countries\n\n-Continue an International Cooperative Agreement between the DoD  and the Ministry of Defense of the Kingdom of Denmark concerning ballistic missile defense technology (Frequency Modulated Continuous Wave radar project) to determine the utility of high-resolution range\/range-rate radar technology for ballistic missile defense applications\n\n-Manage the selection process of the Small Business Innovation Research and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603176C"
                                    },
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.999"
                                        },
                                        "CurrentYear": {
                                            "val": "12.139"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.880"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.880"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.599"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.897"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.004"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.221"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603177C"
                                    },
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.223"
                                        },
                                        "CurrentYear": {
                                            "val": "28.200"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603178C"
                                    },
                                    "Title": {
                                        "val": "Weapons Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "61.396"
                                        },
                                        "CurrentYear": {
                                            "val": "51.153"
                                        },
                                        "BudgetYearOne": {
                                            "val": "71.843"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "71.843"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "69.004"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.745"
                                        },
                                        "BudgetYearFour": {
                                            "val": "66.400"
                                        },
                                        "BudgetYearFive": {
                                            "val": "67.487"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603294C"
                                    },
                                    "Title": {
                                        "val": "Common Kill Vehicle Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.836"
                                        },
                                        "CurrentYear": {
                                            "val": "61.753"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603904C"
                                    },
                                    "Title": {
                                        "val": "Missile Defense Integration and Operations Center (MDIOC)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "53.972"
                                        },
                                        "CurrentYear": {
                                            "val": "47.939"
                                        },
                                        "BudgetYearOne": {
                                            "val": "54.750"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "54.750"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "53.894"
                                        },
                                        "BudgetYearThree": {
                                            "val": "55.524"
                                        },
                                        "BudgetYearFour": {
                                            "val": "58.100"
                                        },
                                        "BudgetYearFive": {
                                            "val": "59.029"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy to conduct these technology development agreements consists of partnering with accredited domestic universities, small businesses, and nonprofit organizations. MDA awards competitive procurements via the MDA Science and Technology Advanced Research Broad Agency Announcement; the Advanced Technology Innovation Broad Agency Announcement; the Small Business Innovative Research program; and the Small Business Technology Transfer program."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.496"
                        },
                        "CurrentYear": {
                            "val": "0.815"
                        },
                        "BudgetYearOne": {
                            "val": "0.833"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.833"
                        },
                        "BudgetYearTwo": {
                            "val": "0.962"
                        },
                        "BudgetYearThree": {
                            "val": "1.042"
                        },
                        "BudgetYearFour": {
                            "val": "1.084"
                        },
                        "BudgetYearFive": {
                            "val": "1.132"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "PWS contains non-headquarters management costs in support of MDA functions and activities across the entire BMDS.  It Includes Government Civilians, and Contract Support Services.  This provides integrity and oversight of the BMDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes Global Deployment personnel and support performing deployment site preparation and activation and, provides facility capabilities for MDA Executing Agent locations.  Other MDA wide costs includes:  physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office, equipment, vehicle, and warehouse leases; utilities and base operations; data and unified communications support; supplies and maintenance; materiel and readiness and central property management of equipment; and similar operating expenses. PWS is allocated on a pro-rata basis and therefore, fluctuates by year based on the adjusted RDT&E profile (which excludes: 0305103C Cyber Security Initiative, 0603274C Special Programs, 0603913C Israeli Cooperative Program and 0901598C Management Headquarters)."
                        }
                    }
                }
            ]
        }
    }
}