{
    "id": "004ed925bd8920206253c39883169237c4dd8eb8",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602782N"
        },
        "ProgramElementTitle": {
            "val": "Mine & Exp Warfare Applied Res"
        },
        "R1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "34.339"
            },
            "CurrentYear": {
                "val": "37.418"
            },
            "BudgetYearOne": {
                "val": "33.916"
            },
            "BudgetYearOneBase": {
                "val": "33.916"
            },
            "BudgetYearTwo": {
                "val": "34.482"
            },
            "BudgetYearThree": {
                "val": "38.636"
            },
            "BudgetYearFour": {
                "val": "37.708"
            },
            "BudgetYearFive": {
                "val": "31.876"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (20 Jan 2015).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE provides technologies for Naval Mine Countermeasures (MCM), Expeditionary Warfare, U.S. Naval sea mining, Naval Special Warfare (NSW), and Joint Tri-Service Explosive Ordnance Disposal (EOD). This program is strongly aligned with the Joint Chiefs of Staff Joint Warfighting Capability Objectives through the development of technologies to achieve military objectives with minimal casualties and collateral damage. Within the Naval Transformation Roadmap, this investment will achieve one of three \"key transformational capabilities\" required by \"Sea Shield\" as well as technically enable the Ship to Objective Maneuver (STOM) key transformational capability within \"Sea Strike\" by focusing on technologies that will provide the Naval Force with the capability to dominate the battlespace, project power from the sea, and support forces ashore with particular emphasis on rapid MCM operations. These efforts concentrate on the development and transition of technologies for the MCM-related and Urban Asymmetric\/Expeditionary Warfare Operations (UAEO)-related Future Naval Capabilities (FNC) Enabling Capabilities (ECs). The Mine and Obstacle Detection\/Neutralization efforts include technologies for clandestine and overt minefield reconnaissance, organic ship self-protection, organic minehunting and neutralization\/breaching. The Urban Asymmetric Operation effort includes critical warfighting functions such as Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR), fires, maneuver, sustainment, etc. The Naval Special Warfare and Explosive Ordnance Disposal technology efforts concentrate on the development of technologies for safe near-shore mine detection, diver mobility and survivability, and ordnance disposal operations.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.526"
                },
                "CurrentYear": {
                    "val": "37.418"
                },
                "BudgetYearOne": {
                    "val": "33.203"
                },
                "BudgetYearOneBase": {
                    "val": "33.203"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "34.339"
                },
                "CurrentYear": {
                    "val": "37.418"
                },
                "BudgetYearOne": {
                    "val": "33.916"
                },
                "BudgetYearOneBase": {
                    "val": "33.916"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.813"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.713"
                },
                "BudgetYearOneBase": {
                    "val": "0.713"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.567"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.754"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.368"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.368"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.655"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.655"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Mine & Exp Warfare Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "34.339"
                        },
                        "CurrentYear": {
                            "val": "37.418"
                        },
                        "BudgetYearOne": {
                            "val": "33.916"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.916"
                        },
                        "BudgetYearTwo": {
                            "val": "34.482"
                        },
                        "BudgetYearThree": {
                            "val": "38.636"
                        },
                        "BudgetYearFour": {
                            "val": "37.708"
                        },
                        "BudgetYearFive": {
                            "val": "31.876"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on reducing the time involved in conducting MCM operations and increasing safe standoff from minefields. It develops and transitions technologies for MCM-related and UAEO-related FNC ECs. The MCM effort includes technologies for clandestine and overt minefield reconnaissance, organic ship self-protection, organic minehunting, neutralization\/breaching and clearance. The Littoral Warfare effort includes critical warfighting functions such as C4ISR, fires, maneuver, sustainment, etc. The sea mining effort emphasizes technologies for future sea mines. The Naval Special Warfare and Explosive Ordnance technology efforts concentrate on the development of technologies to enhance diver capabilities including: safe near-shore mine sensing, mobility and survivability, and ordnance disposal operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MINE TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "This activity assesses advanced sea mine technologies to maintain expertise in this Naval Warfare area.  An acoustic sensing capability for the naval mine Target Detection Device (TDD) is being addressed.  Future mine and minefield concepts are being addressed.\n\nThe funding increase from FY 2016 to 2017 reflects the realignment of the Advanced Sea Mines FNC effort SHD-FY16-OSD Modular UnderSea Effectors (MUSE) program from PE 0602750N Future Naval Capabilities Applied Research."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.955"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue analysis of intermediate and deep water minefield concepts. \n- Continued assessment of sea mine technologies in order to maintain a level of expertise in naval mines. \n- Continued development of concepts for semi-autonomous and remote controlled mines and minefields. \n- Continued development of target discrimination technology for Target Detection Device (TDD)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.878"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015 less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.835"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.835"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above.\n- Continue the  Modular UnderSea Effectors (MUSE) that transferred from PE 0602750N- Develop of acoustic propagation modeling, algorithms for tracking, and algorithms to exploit the acoustic communications environment. \n\n- Initiate investigation into advanced mine sensing concepts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MINE\/OBSTACLE DETECTION"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on applied research to enable longer detection ranges and precise mine location with fewer false alarms in a variety of challenging environments. It supports Discovery and Invention (D&I) and MCM-related FNC ECs. Efforts in Synthetic Aperture Sonar (SAS) technologies for longer range detection and classification of mine-like targets and magnetic gradiometer sensing and electro-optic (EO) technology for buried mine identification, and sensor integration onto Autonomous Underwater Vehicles (AUVs) are being addressed. EO sensor research develops algorithms to enable image processing for rapid overt reconnaissance from an Unmanned Aerial Vehicle (UAV). Other processing, classification and data fusion techniques to reduce operator workload, and a mine burial prediction \"expert system\" are also being developed. Efforts also support development of MCM Mission Modules for Littoral Combat Ships (LCS).\n\nFunding increase from FY 2015 to FY 2016 will support improvements for the Airborne Laser Mine Detection System (ALMDS).\n\nFunding decrease from FY 2016 to FY 2017 is due to the completion of the Airborne Laser Mine Detection Systems Improvement effort that was part of the Speed to Fleet Initiatives that was a 2 year effort that started in FY 2015."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.252"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiated effort to double underwater optical imaging range via the use of time-reversed LIDAR pulse propagation. \n- Continue applied research in environmentally adaptive Automatic Target Recognition (ATR). \n- Continue development of in situ sensors to groundtruth overhead tactical sensors. \n- Continue effort to develop a three-dimensional underwater metamaterial cloaking technology. \n- Continue effort to provide Navy magnetic silencing ranges with an advanced diagnostic capability to optimize signature reduction techniques. \n- Continued development of automatic mine detection and classification algorithms for integrated forward-looking iPUMA sonar and sidelooking sonars. \n- Continued development of UUV-based, extended range, electro-optic identification sensors and supporting meteorology and oceanography and planning systems. \n- Continued integration of iPUMA and SAS systems in a single vehicle to obtain 100% area coverage. \n- Continued to investigate and develop signal processing algorithms in areas of research such as environmentally adaptive channel estimation\/equalization, multi-carrier modulation techniques, and spatial diversity exploitation to enable reliable, high-rate communication between fixed and\/or mobile nodes in an ad hoc underwater acoustic communication network. \n- Continued development of a Mine\/Obstacle Detection and Avoidance capability for Autonomous Underwater Vehicles (AUVs) equipped with the iPUMA sonar system. \n- Continued development of a small ultrasound acoustic underwater camera for UUV-based classification and identification of underwater mines. \n- Continued development of drifting mine detection concepts. \n- Continued development of heat engine for unmanned underwater vehicles powered by thermal gradients in the water column. \n- Continued modeling of data fusion and mine contact handling. \n- Continued research to demonstrate new structural-acoustic-based mine identification algorithms that do not require extensive training data to work in new underwater environments. \n- Continued research to extend electro-optical imaging resolution in underwater environments by using short exposure techniques. \n-Continued development of iPUMA\/Synthetic Aperture Sonar system to provide the first non marine mammal based mine detection and classification capability for confined or highly obstructed areas. \n- Continued development of Small Acoustic Color\/Imaging Sonar system to provide the first non marine mammal detection, classification and identification capability for very shallow water (VSW) and reduce the false-alarm rate by x20 for all VSW mine threats. \n- Continued development of Long Range Low Frequency Broadband (LRLFBB) Sonar to significantly increase the minehunting area coverage rate. \n- Continued development of a high source level, single crystal based projector that can extend the maximum detection range of the Low Frequency Broadband (LFBB) Mine Identification System. \n- Continued Phase 2 of Advanced Mission Module Technology Development. \n- Continued performance evaluation of physical layer signal processing algorithms and signaling schemes developed for underwater acoustic communication networks. \n- Continued development of technologies for detection of mines and obstacles in riverine environments. \n- Continued development of mine burial prediction models which include migrating sandwaves. \n- Continued development of prediction models for surf zone optical properties. \n- Continued effort to quantify and validate improvements in probability of detection and the reduction of false alarms that can be achieved through multi-static acoustic sensing and processing for cooperating, unmanned vehicles. \n- Continued development of system concepts for wide area detection of surface and submerged drifting mines. \n- Continued investigation into associated phenomenology and development of sensing technologies for mine and obstacle detection, classification and localization. \n- Continued development of new artificial intelligence technology\/techniques required for long duration AUV's. \n- Complete effort to design and build advanced navigational capabilities for a fin propelled UUV in near-shore, turbid, obstacle cluttered environment. \n- Initiate applied research in interactive sensing for MCM.\n- Initiate speed-to-fleet (S2F) technology development and demonstration for ALMDS P3I."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015 less those noted as completed above. \n- Continue effort to double underwater optical imaging range via the use of time-reversed LIDAR pulse propagation. \n- Complete development of new artificial intelligence technology\/techniques required for long duration AUV's.  \n- Complete effort to develop a three-dimensional underwater metamaterial cloaking technology. \n- Complete effort to provide Navy magnetic silencing ranges with an advanced diagnostic capability to optimize signature reduction techniques. \n- Initiate applied research into sensor-generic architectures for multi-session minefield mapping with multiple UUVs\n- Initiate investigation into acoustic radiation forces, or vibro-acoustography to generate new target discrimination feature sets\n- Initiate applied research in continuous sensing modalities to differentiate between targets and background\n- Initiate investigation into audition based object formation and attention models for MCM\n- Initiate applied research in model-based MCM sonar performance estimation\n- Initiate studies of coastal and riverine environmental characterization to enhance signature reduction for NSW platforms.\n- Initiate applied research in underwater communications for multiple cooperating minehunting unmanned vehicles.\n- Complete S2F technology development and demonstration for ALMDS P3I"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.858"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.858"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above. \n- Continue effort to double underwater optical imaging range via the use of time-reversed LIDAR pulse propagation. \n- Complete development of UUV-based, extended range, electro-optic identification sensors and supporting meteorology\nand oceanography and planning systems.\n- Complete integration of iPUMA and SAS systems in a single vehicle to obtain 100% area coverage.\n- Complete development of a small ultrasound acoustic underwater camera for UUV-based classification and identification\nof underwater mines.\n- Complete development of heat engine for unmanned underwater vehicles powered by thermal gradients in the water\ncolumn.\n- Complete development of iPUMA\/Synthetic Aperture Sonar system to provide the first non marine mammal based mine\ndetection and classification capability for confined or highly obstructed areas.\n- Complete development of Small Acoustic Color\/Imaging Sonar system to provide the first non marine mammal detection,\nclassification and identification capability for very shallow water (VSW) and reduce the false-alarm rate by x20 for all\nVSW mine threats.\n- Initiate applied research that links observable impacts on acoustic scattering and\/or propagation with the underlying phenomenology and\/or processes that affect the environment. \n- Initiate applied research to investigate use of topological spaces for target\/clutter features in sonar data."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MINE\/OBSTACLE NEUTRALIZATION"
                                    },
                                    "Description": {
                                        "val": "Activity includes applied research to support selected MCM related FNC ECs for rapid mine and obstacle neutralization and sea mine jamming techniques to increase surface ship safe standoff from threat mines. It includes various lethality, vulnerability and dispensing computational tools, models and assessments to support the various far-term Surf Zone (SZ) and Beach Zone (BZ) mine and obstacle breaching concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of system concepts for autonomous neutralization of surface and submerged drifting mines\n- Initiate investigation of techniques for neutralization of buried mines.\n- Initiate investigation of techniques for emulation sweep."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.412"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015 less those noted as completed above. \n- Initiate investigation of technigues for neutralization of moored and drifting ocean mines."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above. \n- Continue investigation of techniques for emulation sweep. \n- Initiate investigation into coupling of reacquire & identify capabilities with precision neutralization for buried mines."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPECIAL WARFARE\/EOD"
                                    },
                                    "Description": {
                                        "val": "The goal of this effort is to develop technologies to extend stand-off of special operations and EOD forces in clandestine hydrography, mine clearance and port security missions while increasing the range and effectiveness of divers. Advanced technologies are needed to gain access to areas contaminated by area-denial sensors and\/or booby traps. Developed technologies will transition to the Joint Service EOD Program, the Naval EOD Program, or the DOD Technical Response Group. This activity includes applied research in sensor technology for NSW and EOD autonomous and handheld sonar systems to increase detection range and accuracy in harsh environments. Other efforts include mission support technology improvements for AUVs and human divers - such as communications, navigation and life support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.697"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of technologies to neatralize energetic materials from a safe standoff using small EOD robots. \n- Continue development of technologies to excavate buried IEDs from a small EOD robot. \n- Continue development of technologies to demonstrate an autonomous dual manipulator robot for complex underwater EOD missions. \n- Continue development of technologies to enhance diver situational awareness. \n- Continue development of technologies to reduce platform vulnerability. \n- Continue investigation of multi-modal signature reduction technologies for wet\/dry-submersibles and semi-submersibles. \n- Continue development of AUV technologies for autonomous inspection of ship hulls. \n- Continue development of technologies for contaminated water diving. \n- Continue development of technologies for enhanced navigation and Intelligence, Surveillance and Reconnaissance (ISR) in riverine environments. \n- Continue development of technologies to detect and locate IEDs. \n- Continue development of technologies to access IEDs. \n- Continue development of technologies to diagnose and identify underwater munitions. \n- Continue development of technologies to identify and diagnose components and characteristics of Improvised Explosive Devices. \n- Continued development of technologies to detect and locate buried munitions. \n- Continued effort to support Joint Service Explosive Ordnance Disposal (JSEOD) applied research. \n- Complete development of an air-delivery method of small\/tactical UUVs to extend sensor operational range and expedite ingress.\n- Complete development of technologies to detect trace and bulk explosive materials from a safe position manually.\n- Complete development of technologies for prospective tele-autonomy features in EOD robotic platforms command and  control.\n- Initiate development of technologies to dispose of ordnance with insensitive munitions from a safe standoff position manually or using smal lEOD robots. \n- Initiate development of technologies to diagnose buried ordnance in situ from a safe standoff position manually or using small EOD robots."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.078"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015 less those noted as completed above. \n- Complete development of technologies to dispose of ordnance with insensitive munitions from a safe standoff position manually or using small EOD robots.\n- Initiate development of technologies for ultra light weight, low cost, highly capable autonomous robotic systems for complex dismounted operations.\n- Initiate applied research into for autonomous ISR and mapping in canopied coastal and riverine environments\n- Initiate 'through the sensor' in-stride mapping of coastal and riverine land and seascapes using operational EO\/IR, radar and acoustic sensors\n- Initiate investigation of techniques to detect deeply buried explosive threats and ordnance from a safe standoff distance  \n- Initiate investigation of techniques to neutralize or render safe explosive threats that result in low collateral damage to surrounding infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.793"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.793"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above. \n- Initiate development of technologies to diagnose buried explosive threats using an EOD robotic platform or a hand-held device.\n- Initiate development of technologies to detect\/locate biological WMD using an EOD robotic platform or a hand-held device."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall metrics of this applied research program are the development of technologies which focus on the Expeditionary Warfare challenge of speeding the tactical timeline and increasing safe standoff from minefields. Individual project metrics include the transition of 6.2 technology solutions into 6.3 advanced technology programs."
                        }
                    }
                }
            ]
        }
    }
}