{
    "id": "0294258acfabf5eb2242b0bae7a449424058b76a",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603734A"
        },
        "ProgramElementTitle": {
            "val": "Military Engineering Advanced Technology"
        },
        "R1LineNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "17.124"
            },
            "CurrentYear": {
                "val": "26.845"
            },
            "BudgetYearOne": {
                "val": "20.684"
            },
            "BudgetYearOneBase": {
                "val": "20.684"
            },
            "BudgetYearTwo": {
                "val": "22.416"
            },
            "BudgetYearThree": {
                "val": "22.817"
            },
            "BudgetYearFour": {
                "val": "23.184"
            },
            "BudgetYearFive": {
                "val": "23.648"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) demonstrates data and information architectures and software applications, as well as sensing systems, that can be used to provide Warfighters with timely, accurate, easily interpretable data and information for the operational and tactical mission environments, focusing on physical and human terrain and weather; methodologies, software applications and hardware for improving ground vehicle mobility and countermobility to support ground force operations, including force projection; subsystems and systems to increase the survivability of personnel, critical assets, and facilities through structures, shields, and barriers to combat highly adaptive and increasingly severe threats; and systems and interoperable systems of systems for detecting threats, assessing situations, defending against threats, and communicating information and warnings for deployable force protection.   \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThis work is fully coordinated with and complementary to PE 0602784A (Military Engineering Technology). \nWork in this PE is led, managed or performed by the Army Engineer Research and Development Center, Vicksburg, MS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.606"
                },
                "CurrentYear": {
                    "val": "20.145"
                },
                "BudgetYearOne": {
                    "val": "20.684"
                },
                "BudgetYearOneBase": {
                    "val": "20.684"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.124"
                },
                "CurrentYear": {
                    "val": "26.845"
                },
                "BudgetYearOne": {
                    "val": "20.684"
                },
                "BudgetYearOneBase": {
                    "val": "20.684"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.482"
                },
                "CurrentYear": {
                    "val": "6.700"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "6.700"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.482"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "T08"
                    },
                    "ProjectTitle": {
                        "val": "Combat Eng Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.124"
                        },
                        "CurrentYear": {
                            "val": "20.145"
                        },
                        "BudgetYearOne": {
                            "val": "20.684"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.684"
                        },
                        "BudgetYearTwo": {
                            "val": "22.416"
                        },
                        "BudgetYearThree": {
                            "val": "22.817"
                        },
                        "BudgetYearFour": {
                            "val": "23.184"
                        },
                        "BudgetYearFive": {
                            "val": "23.648"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates software and architectures for geospatial mapping applications and decision aids for the Warfighter; components, systems, system of systems and decision aids to enable ground vehicle mobility (freedom of movement), including force projection, countermobility to impede movement of threat forces; survivability and force protection to protect personnel, facilities and assets through design and reinforcement of structures, and deployable force protection to detect, assess, and defend against threats for troops deployed at smaller bases (such as bases being compromised or overrun). Work is in support of current and future ground force operations. Software and architectures for geospatial projects mature and validate geospatial decision tools in support of operations planning and decision making to advance utility for geospatial capability and techniques across the Army, services and coalition and to advance and mature the information architecture that supports the total Army's discovery and access to data, geospatial information and analytical tool suites. Deployable Force Protection (DFP) activities are focused on filling critical gaps in protecting forces operating at smaller, remote bases and include maturation, integration, and demonstration of components, systems and systems of systems for rapidly deployable threat detection in direct line-of-site and non-line-of-site environments; situation assessment to help reduce false alarms and decrease manpower required to monitor the environment; passive protection to mitigate blasts, direct, and indirect fire effects; and active defense to suppress or eliminate threats and threat systems. Work in survivability and force protection also includes maturing and demonstrating software to characterize blast effects generated from explosive events, such as improvised explosive device detonation in soils, and support design and decision aids. Work in mobility and force projection includes maturing and demonstrating software and hardware to assess and improve freedom of movement for ground forces. Engineered Resilient Systems (ERS) activities focus on developing capabilities for \"upfront engineering\" that will result in more operationally efficient and resilient systems that are more affordable in a more rapid fashion. This effort develops and demonstrates an end-to-end thread involving analysis to inform requirements, reduce risk, and assess lifecycle cost pre-milestone A through tradespace analytics for selected systems of interest. \n\nWork in this Project supports the Army Science and Technology Ground Maneuver, Innovation Enablers and Command, Control, Communications and Intelligence (C3I) Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  This work is being fully coordinated and is complementary to the ERS work described in the Office of the Secretary of Defense (OSD) Program Element (PE) 0603832D8Z.\n\nThis work is fully coordinated with and complementary to PE 0602784A (Military Engineering Technology).  Geospatial activities are coordinated with the National Geospatial Intelligence Agency (NGA).\n\nWork in this Project is led, managed or performed by the Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geo-Enabled Mission Command Enterprise"
                                    },
                                    "Description": {
                                        "val": "This effort matures methods and demonstrates data, information, and software tools and architectures to bring physical and human terrain and effects data into decision frameworks for consistent and accurate implementation in the Army Geospatial Enterprise (AGE). This provides ready-access of low-overhead, light-weight, analytic tools to other Services and Department of Defense (DoD) and increases situational awareness of the operational environment in support of mission planning and operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.051"
                                            },
                                            "Text": {
                                                "val": "Evaluated and matured methods and techniques to facilitate efficient sharing of common geospatial information within Common Operating Environment and Army Programs of Record through delivery and exchange of geospatial data, information, and analytics between and among computing environments (e.g., Mobile\/Handheld, Mounted, Data Center, Sensor, Command Post) within the Common Operating Environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.505"
                                            },
                                            "Text": {
                                                "val": "Enhance digital plans and orders capability to drive course of action (COA) simulation and modeling; evaluate initial plan development and COA development capabilities within Map-based planning testbed environment; evaluate and demonstrate mature geospatial research on the representative computing environment systems within the common operating environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Map-Based Planning Services (MBPS)"
                                    },
                                    "Description": {
                                        "val": "This effort matures geospatially enabled, collaborative mission planning capabilities providing services, data, and information to Army planners, staffs, and leaders. These mission planning capabilities will allow collecting, processing, storing, displaying, and sharing of authoritative data and information in a geo-temporal context. Work will leverage a Standard Shareable Geospatial Foundation (SSGF) provided by the Army Geospatial Enterprise (AGE) and incorporate Geo-Enabled Mission Command tools and analytical capabilities. This effort continues work that was part of Geo-Enabled Mission Command Enterprise and matures work in PE 0602784 Project 855."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.807"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.807"
                                            },
                                            "Text": {
                                                "val": "Will conduct MBPS demonstrations of geospatially enabled, collaborative mission planning capabilities (strategic and operational force deployment and employment) within the AGE Node, a node with streamlined geospatial standards that provides services, data, information, and other outputs to Army organizations and activities (e.g. Army Geospatial Center, Army Mission Command Centers of Excellence, programs of record, and others)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GeoIntelligence - Enabling Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort provides demonstration of analytic tools and algorithms that use multi-source (e.g. optical, lidar), multiplatform (e.g. satellite, light Unmanned Aerial Vehicle (UAV)), multi-temporal image sources to build urban tactical decision aids suitable for use on mobile devices to provide geospatial analysis to the Army, other Services, and DoD, in support of mission planning and operations (such as small units in an urban setting). This effort continues work that was part of Geo-Enabled Mission Command Enterprise."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate tailored geospatial tools used to develop analytical products and capabilities that enhance Warfighter movement and situational awareness at the tactical level, to include rapid processing and searching of high volume multi-modal spatiotemporal datasets, a class of datasets critical for the development of analytic tools associated with geospatial intelligence, climate change, natural hazards, and critical infrastructures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Occupant-Centric Survivability"
                                    },
                                    "Description": {
                                        "val": "This effort develops a comprehensive model of improvised explosive device (IED) detonations in soils that accurately predicts the blast pressure and fragmentation of IEDs on ground vehicle systems in a wide range of operational environments. This work supports PEs 0603005\/221 and 0602601\/C05 in collaboration with the Tank and Automotive Research, Development and Engineering Center (TARDEC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Demonstrate live fire full-scale model benchmark tests for evaluation, and model validation under a range of soil and operational threat conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Austere Entry and Maneuver Support Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort develops improved means for achieving Force Projection in coastal, estuary and riverine environments and an integrated sensing and simulation system for predicting physical conditions in these operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.629"
                                            },
                                            "Text": {
                                                "val": "Demonstrated simulation capability to enable rapid remote assessment of real-time structural capacity of infrastructure (airfields, ports, and roads), river, estuary, and near shore; demonstrated initial assessment of littoral environments for entry operations; demonstrated initial austere airfield point of debarkation (APOD) assessment geospatial overlay capability to the Instrument Set, Reconnaissance, and Surveying (ENFIRE) program; and demonstrated reduced-order hydrodynamic models for an operational littoral environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.886"
                                            },
                                            "Text": {
                                                "val": "Demonstrate technologies for planning and conducting anti-access\/area denial entry operations with non-existent, damaged, or destroyed infrastructure. Demonstrate rapidly deployed low-logistics kits for expedient bomb damage repair of airfield runways and terrain surface enhancement for landing of helicopters and unmanned aircraft systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.319"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.319"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate operationally-optimized terrain surfacing kits for application at seaports of debarkation. Will demonstrate decision support tools that allow exploitation of multimodal (e.g. infrared, hyperspectral, radar, Light Detection and Ranging (LiDAR)) sensor data for remote\/standoff assessment of airfields and seaports. Will demonstrate optimized terrain surfacing kits for upgrade of air- and sea ports of debarkation (A\/SPOD) as well as rapid- and scalable repair kits for airfield craters. Will mature and demonstrate decision support tools for remote assessment of infrastructure. Will mature data processing and engineering assessment algorithms using data from existing aerial and marine surveillance systems to provide refined tactical-level assessments of potential A\/SPOD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Protection Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates protection solutions for critical assets, including fixed and semi-fixed facilities. A focus will be on technologies to defeat new advanced weapons threats. Technologies include: low-logistics protective construction and facility protection, use of indigenous materials, innovative structural hardening and retrofit, and the synergistic use of camouflage, concealment, and deception to increase the effectiveness of protection to critical assets. This effort also demonstrates integrated protective technologies for force protection basing to include planning and expedient protective construction for combat outposts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.944"
                                            },
                                            "Text": {
                                                "val": "Demonstrated the use of indigenous materials from areas of interest in protective construction for critical assets against effects of new advanced weapons threats; demonstrated initial force protection basing planning and protective construction for combat outposts to increase survivability of personnel and equipment against rocket and mortar attack; demonstrated baseline effectiveness in the use of camouflage, concealment, and deception techniques to increase survivability of fixed and semi-fixed facilities against new threat weapons by decreasing the probability of direct hit on critical assets; and demonstrated capability to construct expedient protection solutions for combat outposts and evaluate manpower requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.754"
                                            },
                                            "Text": {
                                                "val": "Demonstrate force protection technologies to reduce manpower and logistics for combat outpost and personnel base construction and operation and demonstrate life cycle planning tools. Demonstrate advanced material composed of indigenous constituents and conduct structural hardening experiments for mitigation against a wide range of advanced weapon threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.808"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.808"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate improved standardized protective construction methods and preconfigured kits when compared to current systems. Will demonstrate developed overhead cover, revetments, and shelters for force protection basing. Will demonstrate improved methods for structural hardening with logistics and cost savings compared to current cast-in-place capability. Will demonstrate linear sensor systems for perimeter security against enemy threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineered Resilient Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates capabilities (tools and methodologies) to rapidly create high-fidelity environmental data to support the simulation of system performance for different Army missions in various geographic settings worldwide; provide input to and obtain output from combat simulations for different echelons pertaining to system performance; and conduct system trades that consider system performance in different operational environments and mission contexts. Engineered Resilient Systems (ERS) initiative has been identified as an S&T emphasis area by the Assistant Secretary of Defense for Research and Engineering, ASD(R&E). This effort focuses on Army systems of interest and on high-fidelity environmental data for the associated battlespace, linkages to force-on-force combat simulations representing the systems of interest, and on tools to explore trades in order to help inform requirements, reduce risk, and assess lifecycle cost pre-milestone A. This work is fully coordinated and is complementary to the ERS work described in Office of Secretary of Defense (OSD) PE 0602251D8Z project P227 and PE 0603832D8Z project PTBD."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate environmental scenario generation \"tool-set one\" based on a select set of missions within a geographical area and Army systems of interest; identify and craft initial operational scenarios and conduct functional decomposition to generate a subset of key missions for system(s) of interest in concert with Army collaborators and processes and use this to prioritize phased development; evolve and mature mission context and implementation tools and methodologies that link to combat simulations based on scenario(s) and mission(s) associated with selected Army system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a computational model builder with a simulation workflow manager to enable complex environmental simulations to assist with tradespace studies. Will demonstrate an initial tradespace analysis capability for sensors in a dense vegetation operational scenario.  Will demonstrate an initial tradespace analysis capability for Army systems of interest, ground vehicles or watercraft."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T13"
                    },
                    "ProjectTitle": {
                        "val": "Stationary Power & Energy Tech Demonstrations (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional special interest projects to mature and demonstrate advanced military engineering and geospatial research and engineering technologies."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Natural Gas Research"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.500"
                                        },
                                        "Text": {
                                            "val": "Program Increase for Natural Gas Research"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T15"
                    },
                    "ProjectTitle": {
                        "val": "MILITARY ENGINEERING TECHNOLOGY DEMONSTRATION (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.200"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "These are Congressional Interest Items for Military Engineering Technology Demonstrations."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.200"
                                        },
                                        "Text": {
                                            "val": "Program Increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}