{
    "id": "033dc386602d9f897fe3b83f3f61fe7fa4c26d43",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305205F"
        },
        "ProgramElementTitle": {
            "val": "Endurance Unmanned Aerial Vehicles"
        },
        "R1LineNumber": {
            "val": "204"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.000"
            },
            "CurrentYear": {
                "val": "5.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "25.000"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This PE focuses USAF efforts on long endurance platform projects and their associated sensors and communications suites.  Efforts include, but are not limited to, optionally piloted airships, Remotely Piloted Aircraft (RPAs), or more standard aircraft platforms flown as manned or unmanned. \n\nThe Integrated Sensor Is Structure (ISIS) project intended to develop a radar that is fully integrated into a station-keeping, stratospheric airship.  The ISIS project effort was completed in FY 2015. \n\nThe Medium Altitude Global ISR and Communications (MAGIC) project was developing a multiple-day, medium altitude ISR unmanned aircraft system (UAS) to provide long endurance surveillance with a multiple sensor payload.  This concept was initiated by the Office of the Secretary of Defense (OSD) as a Joint Capabilities Technology Demonstration (JCTD) in FY 2010.  Aurora Flight Sciences (AFS)'s Orion Remotely Piloted Aircraft (RPA) concept was chosen as the JCTD candidate by OSD\/Director of Defense, Research and Engineering (DDR&E) per the recommendation of the Combatant Commands.  The MAGIC\/Orion RPA initiative was subsequently released from the JCTD process and transitioned to the Air Force as the sponsor and 645th Aeronautical Systems Group (AESG, a.k.a. BIG SAFARI Systems Program Office) as the manager of this developmental initiative in FY 2011.  AFS and the 645th AESG performed flight test series demonstration August 2013 to March 2015 at Naval Air Weapons Station China Lake, CA.  The flight test demonstration completed in FY 2015.  The Block 0 (a.k.a. prototype) air vehicle and associated ground test articles have been re-located to Aurora Flight Sciences in Manassas, VA.  Follow-on development of the Orion RPA Block 1 air vehicle and system continues with the remainder of the FY 2015 $20M Congressional Add and the addition of the FY 2016 $5M Congressional Add.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.000"
                },
                "CurrentYear": {
                    "val": "5.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "5.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "67A026"
                    },
                    "ProjectTitle": {
                        "val": "MAGIC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.000"
                        },
                        "CurrentYear": {
                            "val": "5.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Medium Altitude Global ISR and Communications (MAGIC) project was an Air Force led technology and concept development to demonstrate the ability for a Remotely Piloted Aircraft (RPA) to stay airborne in the medium altitude structure for a multiple day duration mission with a minimum of 1,000 pounds payload capacity of intelligence, surveillance and reconnaissance sensor systems.  The MAGIC concept was initiated by OSD\/DDR&E in FY 2010 in response to the Combatant Commanders ranking this type of initiative as the highest priority for a Joint Concept and Technology Demonstration (JCTD).   In FY 2011, the Air Force accepted this initiative as the sponsor and MAGIC was subsequently removed from consideration as a JCTD and transitioned into the Air Force as a developmental project.  \n\nThe MAGIC project was intended to provide the USAF with data regarding sensor and aircraft performance parameters at a multiple day duration at medium altitude flight.  The objectives laid out in the JCTD competition and selection of Aurora Flight Sciences (AFS)'s Orion RPA for the long endurance demonstration was managed by the 645th Aeronautical Systems Group (AESG).\n\nIn FY 2010, OSD\/DDR&E (now ASD\/R&E) provided $5M of initial funding to AFRL to initiate the MAGIC project.  In FY 2011, ASD\/R&E provided an additional $5M to keep the MAGIC project development moving forward.  The Air Force provided $10M of FY 2011.  Congressional Adds of $19M in FY 2012, $50M in FY 2013, and $20M in FY 2015 provided the Endurance UAV program manager with the funding for the continuation of the Orion RPA development and initiation of the three phase flight testing series.     \n\nOrion RPA flight test series and demonstrations were accomplished at Naval Air Weapons Station (NAWS) China Lake, CA between August 2013 and March 2015.  The objectives to test\/demonstrate basic air vehicle performance, expansion of the flight characteristic envelope, a multiple day sortie and integration of a nominal sensor payload were successfully accomplished on the prototype (Block 0) Orion RPA in a controlled environment non-representative of an operational setting.  Subsequent development efforts concentrated on the validation of the Orion RPA system requirements and concept design\/specifications for a follow-on air vehicle (Block 1) capable of operational deployment in the event that the Air Force chooses the Orion RPA as a quick reaction capable system for a theater of operation or a program of record."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "MAGIC"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20.000"
                                        },
                                        "Text": {
                                            "val": "Flight Test Series completed at NAWS China Lake, CA in March 2015. Orion RPA demonstrated an 80-hour endurance flight, integration of a beyond line of sight SATCOM capability, and a full motion video capable payload.  Subsequent efforts concentrated on lessons learned from flight test and applied those concepts to the continued development of a deployable long endurance capability."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Follow-on development efforts concentrating on lessons learned from the Orion RPA Block 0 flight test and applying those concepts to continue development of a Block 1 deployable Orion RPA long endurance capability."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy for the Air Force to develop a long endurance, persistent ISR capability for the Combatant Commanders was an outgrowth of a Joint Capabilities Technology Demonstration (JCTD) started in FY 2010.  Development efforts contracted with Aurora Flight Sciences and their Orion RPA include:  completion of studies analysis, development of a prototype air vehicle (Block 0), bench testing of engines and other aircraft components, ground continuity testing of select avionics, flight controls, and engine components, slow and high speed ground taxiing and a full flight series testing of the Orion RPA capabilities to include a multiple day, long duration flight demonstration.  Efforts continue between the Aurora Flight Sciences production and management teams and the 645 AESG Systems Program Office to continue hardware and software engineering and development to meet operational airworthiness standards and mission requirements for a deployable air vehicle (Block 1)."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Design and Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aurora"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Manassas, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "14.800"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aurora"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Manassas, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.600"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "645 AESG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Retrofit Schedule B -- Block 0 Component Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Flight Test Series 3.1, Long Endurance Demonstration (November-December 2014)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Sensor Payload Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Flight Test Series 3.2, Payload Integration (March 2015)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 1 Engineering Development, System Requirements and Concept Design Reviews"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 1 Mature Design Beyond Concept Stage and Interim Design Reviews"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}