{
    "id": "06c9f5e893b2ac8d2e7d85586de86497c27b035e",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602114N"
        },
        "ProgramElementTitle": {
            "val": "Power Proj Applied Research"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "94.944"
            },
            "CurrentYear": {
                "val": "87.223"
            },
            "BudgetYearOne": {
                "val": "41.371"
            },
            "BudgetYearOneBase": {
                "val": "41.371"
            },
            "BudgetYearTwo": {
                "val": "39.925"
            },
            "BudgetYearThree": {
                "val": "45.953"
            },
            "BudgetYearFour": {
                "val": "50.344"
            },
            "BudgetYearFive": {
                "val": "52.517"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (20 Jan 2015).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE supports both advanced technology research and near to mid-term transition opportunities.  The advanced research focus is primarily on high energy lasers, Electromagnetic Railgun (EMRG) development, Hyper Velocity Projectiles (HVP), high speed weapon propulsion, and electro-optic\/infrared (EO\/IR) sensor technologies. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "95.753"
                },
                "CurrentYear": {
                    "val": "68.723"
                },
                "BudgetYearOne": {
                    "val": "30.624"
                },
                "BudgetYearOneBase": {
                    "val": "30.624"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "94.944"
                },
                "CurrentYear": {
                    "val": "87.223"
                },
                "BudgetYearOne": {
                    "val": "41.371"
                },
                "BudgetYearOneBase": {
                    "val": "41.371"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.809"
                },
                "CurrentYear": {
                    "val": "18.500"
                },
                "BudgetYearOne": {
                    "val": "10.747"
                },
                "BudgetYearOneBase": {
                    "val": "10.747"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "18.500"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.784"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.593"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "10.907"
                                },
                                "BudgetYearOneBase": {
                                    "val": "10.907"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.160"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.160"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Power Proj Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "94.944"
                        },
                        "CurrentYear": {
                            "val": "68.723"
                        },
                        "BudgetYearOne": {
                            "val": "41.371"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.371"
                        },
                        "BudgetYearTwo": {
                            "val": "39.925"
                        },
                        "BudgetYearThree": {
                            "val": "45.953"
                        },
                        "BudgetYearFour": {
                            "val": "50.344"
                        },
                        "BudgetYearFive": {
                            "val": "52.517"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses the technology issues involving the Navy's capability to project naval power on the broad seas and in the littoral regions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DIRECTED ENERGY"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop Directed Energy (DE) technology for Navy applications. The DE program addresses the requirements of future Navy combatants to provide ship defense against the emerging threats that are proliferating throughout the Navies of the world. The Directed Energy portion of this activity consists of two elements. The first element involves applied research and development of technologies supporting advanced accelerators with applications to directed energy weapons. \n\n\nFY 2015 to FY 2016 decrease in funding is due to completion of the Solid State Laser - QRC program as well as a continued realignment of Free Electron Laser (FEL) activities. \n\nFY 2016 to FY 2017 decrease in funding is due to Solid State Technology Maturation Program (SSL-TM) program entering its fabrication and testing phase."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.128"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy and Accelerator Research:\n\n-Continued to develop the most promising component technologies such as normal conducting and super conducting RF electron beam injectors, advanced high power cathode technologies, high power compact amplifiers, and advanced mirrors, coatings and optical components capable of handling the significantly higher energies for potential alignment in a Free Electron Laser. \n\nSolid State Laser - Technology Maturation (SSL-TM): \n\n-Continued the development of technologies suitable for a solid state laser weapon system, including technologies for maritime beam director, targeting and laser subsystems, which are capable of supporting future Navy missions to defeat small boat swarms, UAV swarms, and provide potential ISR disruption and\/or defeat. This work supports future prototype developments and will include laser subsystem (potentially both slab and fiber solid state systems) and required beam director scientific studies. The focus of the effort will be to support the development and advancement of future Navy Solid State Laser prototypes, including the development of lethality studies and atmospheric characterization. These scientific studies are critical to understand and support missions identified for a layered defensive capability, in the maritime environment, which shall include robust modeling and simulation of atmospheric absorption and turbulence. \n-Conducted lethality testing for notional solid state laser designs. This will include scientific studies of laser erosion, pitting, and ablation of various target materials for improved modeling and simulation that will support development of the governing technical requirements for a beam director and targeting system capable of performing Navy surface ship self-defense missions. \n-Continued studies of atmospheric absorption and turbulence, suitable to evaluate notional maritime beam director subsystems, and including studies in adaptive optics for improved lethality performance in low altitude, maritime surface conditions. These scientific studies are critical to understanding the impact of boundary layer and sea-water-air turbulent mechanics on future laser weapons systems and interfaces. \n-Continued trade studies on innovative solid state laser subsystems designs, based off industry available technologies or those technologies identified by the High Energy Laser Joint Technology Office (HEL JTO). These investments will be considered \"break through\" type of investments, which require additional scientific study to determine their potential for near term capability improvements in a future naval prototype system. \n-Continued scientific studies on laser subcomponents, including laser pump diodes and laser gain media, which have the potential to support future acquisition programs, but are based on solid state laser technologies. Efforts in this area will focus on emerging commercial technologies and government sponsored research, which are suitable for use in a maritime domain. Research and technology developments will include advancements suitable for use by either solid state slab or solid state fiber optic laser subsystems - and which if matured, would enable rapid scientific advancements and improve specific systems performance against key performance parameters. \n-Continued scientific trade studies of notional predictive avoidance systems, which examine the control interfaces between sensors and future prototypical naval laser weapons, which would provide an inherent \"safe-arm\" function for the projecting of laser power at long range (potentially beyond typical visible, line of sight distances.) Of particular concern is the designs for safety in future laser weapons to halt laser energy propagation, while performing Navy surface ship self- defense missions, and avoid inadvertent illumination of non-threat forces (e.g. friendly sensors or platforms.)\n- Conducted component and subcomponent laboratory tests.\n\nApplied Electromagnetics for High Power Weapons\n-Completed the development of Gallium Nitride as an advanced nonlinear optic material."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.885"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy and Accelerator Research:\n-Continue all efforts of FY 2015 unless noted as completed above.\n\nSolid State Laser - Technology Maturation (SSL-TM):\n-Continue all efforts of FY 2015 unless noted as completed above.\n-Preliminary Design Review (PDR) for Tactical Laser Core Module (TLCM) planned during 2016"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.956"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.956"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy Research:\n\n- Continue all efforts of FY 2016 unless noted as completed above\n\nSolid State Laser - Technology Maturation (SSL-TM):\n- Continue all efforts of FY 2016 unless noted as completed above.\n- Conduct Critical Design Review (CDR) for Tactical Laser Core Module (TLCM) planned during FY 2017"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HIGH SPEED PROPULSION AND ADVANCED WEAPON TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The high speed weapons work in this activity is focused on demonstrating propulsion and vehicle technologies for Mach3+ to Mach8 capable weapons.  This work includes technologies associated with high acceleration capable projectile structures, high temperature and high strength materials to enable projectiles to survive high speed launch environment, improved thermal prediction methodologies and test techniques, wide dynamic pressure adaptable projectile controls and non-explosively launched lethal mechanisms. The high speed projectile technologies are intended to support long range Naval Surface Fire Support weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.886"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued technology maturation of advanced airframes and controls, high G-force components and miniaturization of electronics. \n-Continued effort to develop advanced guidance and control technologies for high speed weapons. \n-Continued high temperature capable thermal management, insulator and ablative technology investigations. \n-Continued high speed propulsion and integrated airframe technology development to enhance system range, responsiveness and reliability. \n-Continued investigations into advanced material solutions to high speed airframes and air systems operating in maritime environments. \n-Transition the Hyper Velocity Projectile (HVP) program to an FNC.\n-Initiated high speed hypersonic weapons technology program to provide exploratory development of enabling very long range hypersonic boost-glide missiles and hypersonic ship-launched projectiles. \n-Initiated development of advanced computational and experimental techniques for hypersonic boundary layer transition.\n-Initiated High Temperature thermal management research.\n-Initiate Ultra-high temperature materials research for hypersonic leading edges and nose tips."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.776"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2015 unless noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.813"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.813"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2016 unless noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVIGATION, ELECTRO OPTIC\/INFRARED (EO\/IR), AND SENSOR TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This activity describes Navy Science and Technology (S&T) investments in the areas of EO\/IR devices and advanced sensors and includes investment\/performance in the technology areas of EO\/IR, Electronic Warfare, and Communications.\n\nFY 2016 to FY 2017 increase is due ramp-up of EW Sensor Technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronic Warfare: \n-Initiated development of novel photovoltaic and autonomous soaring technology to enable long range EW sensor delivery systems\n-Continued development of advanced fuel cell technology for UAS to increase on-station time of EW sensors. \n-Continued efforts for Unmanned Aerial System (UAS) Based EW: The objective is to develop a System of Systems (SoS) able to artificially create the appearance of a realistic naval force to many adversary surveillance and targeting sensors simultaneously. It will benefit the warfighter by providing battle space confusion to adversary surveillance and targeting systems both above and below water, creating seamless cross-domain countermeasure coordination, and enabling rapid advanced technology\/capability insertion to counter emerging threats. Technology developments will include reconfigurable and modular EW payloads, Distributed Decoy and Jammer Swarms (DDJS), effective acoustic countermeasures (CM), and Multiple Input\/Multiple Output Sensor\/CM (MIMO S\/CM) for false force generation to both above and below water sensors. \n- Continued development of ultra-low noise uncooled nanotechnology infrared sensors. \n- Continued development of nanoatomic sensor nonvolatile memories. \n- Continued development of electronic field of view and zoom imagers. \n- Continued the development of an active optics system that can survey a wide area and instantly, non-mechanically zoom-in on an area of interest for target tracking\/identification. \n- Continued development of new processes\/methodologies to enable construction of composite countermeasures that fit the engagement timeline while maintaining effectiveness against existing and emerging IR guided threats. \n- Continued effort to develop mid & long wave IR focal plane arrays using graded-band gap W-type-II. Superlattices with much higher detectivity than that of state-of-the-art HgCdTe (MCT).\n- Initiated development and prove a method of more efficiently transporting EW sensors using a low Reynolds Number regime boundary layer control system.\n-Initiated development of a water assisted take-off process for electronic warfare sensors.\n-Initiated development of advanced fuel cell technology for UAS to increase on-station time of EW sensors.\n \n\nElectro Optic\/Infrared\n- Continued development of next generation IR focal plane sensor and countermeasures to defeat it. \n- Continue research to apply manifold modeling and optimal control techniques to airborne EO\/IR sensor systems. \n\nElectronic Warfare:\n- Initiated development of methodology to concatenate nanoparticle structures for spectral control of obscurant material\n- Continued development of next generation IR focal plane sensor and countermeasures to defeat it. \n- Continued research to apply manifold modeling and optimal control techniques to airborne EO\/IR sensor systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.505"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2015 unless noted as completed above.\n\nElectronic Warfare\n - Continue development of novel photovoltaic and autonomous soaring technology to enable long range EW sensor delivery systems \n\nElectro Optic\/Infrared\n- Complete development of structured dielectric elastomers for electromechanical devices and deformable optics. \n- Complete development of magneto-optic materials and ultra-high sensitivity, room-temperature magnetic field sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.755"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.755"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronic Warfare\n - Continue ramp-up development of novel photovoltaic and autonomous soaring technology to enable long range EW sensor delivery systems\n-Complete development of advanced fuel cell technology for UAS to increase on-station time of EW sensors.\n-Continue development of methodology to concatenate nanoparticle structures for spectral control of obscurant material\nElectro Optic\/Infrared\n-Complete development of next generation IR focal plane sensor and countermeasures to defeat it. \n-Complete research to apply manifold modeling and optimal control techniques to airborne EO\/IR sensor systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STRIKE AND LITTORAL COMBAT TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The focus of this activity is on those technologies that will support Naval Precision Strike Operations and provide the Navy of the future the ability to quickly locate, target, and strike critical targets ashore."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.757"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increased Capability Against Moving and Stationary Targets:\n-Continued the development and demonstration of new Electronic Protection (EP) techniques that can discriminate advanced jamming false targets from true targets and also suppress false targets so that true targets can be readily detected. \n-Complete development of multi-static electronic protection techniques against advanced jamming systems.\n\nEnhanced Weapon Technologies: \n-Continue three new products to expand current Counter Air \/ Counter Air Defense capabilities by providing improved range and end-game maneuverability while decreasing Time-of-Flight. Specific tasks to begin design and development phase are: Counter Air Advanced Medium-Range Air-to-Air Missile (AMRAAM) Improvements \/ Counter Air Defense \/ Improvement \/ High Speed Components. \n-Continue development and apply emerging technologies that support delivery of Technology Oversight Group approved FNC enabling capabilities structured to close operational capability gaps in power projection; package emerging power projection technologies into deliverable FNC products and ECs that can be integrated into acquisition programs within a five year period; and mature power projection technologies that support naval requirements identified within the Sea Strike and FORCEnet naval capability pillars. \n\nStrike Accelerator: \n-Continue Strike Accelerator program. This effort will provide an advanced airborne capability to accurately identify targets using Advanced Target Recognition (ATR). These capabilities are utilizing the F\/A-18 E\/F, AESA (Active Electronically Scanned Array) Radar and ATFLIR (Advanced Targeting Forward Looking Infrared) sensors. \n\nMulti-Target Laser Designator: \n- Continue research for advanced optical techniques to defeat SWARM attacks. \n\nSelectable Output Weapon: \n-Continue Selectable Output Weapon Sea Strike Project \n\nHigh Energy Fiber Laser System: \n-Continue development an advanced laser beam control, pointing mechanism and power subsystem to support an airborne laser weapon system. This system will provide the detection and defeat of current and future threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.737"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2015 unless noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.909"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.909"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2015 unless noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ELECTROMAGNETIC GUNS"
                                    },
                                    "Description": {
                                        "val": "This activity is the Electro Magnetic (EM) railgun program that is focused on developing the technology to launch a long range projectile from Navy ships. EM railgun is being considered for multi-mission applications including USMC Naval Surface Fire Support, anti-surface warfare (ASUW) and ship self defense from missiles and small boat threats.\n\nFY 2015 to FY2016 decrease is due to the completion of pulsed power development and fabrication required to support repetitive rate testing.\n\nFY 2016 to FY 2017 decrease is due to the completion of majority of long lead barrel buys with continued barrel testing required."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "46.324"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued additional next generation pulsed power fabrication as part of a multi-module, multi-year build to increase full scale rep rate capability from 20MJ to 32MJ muzzle energy capability. \n-Continued effort to understand the technology required to launch hypervelocity projectiles in only a 4 meter long barrel at 10 rounds per minute.  \n-Continued launcher development. \n-Continued material, physics and thermal property research for single shot launchers, pulsed power and projectiles for 32MJ muzzle energy launch; and initiated assessments from next generation, rep rate, and operational environments. \n-Continued IPT and Bore Life Consortium collaborations for 32 MJ launchers. \n-Continued material applications and component design assessments for next generation repetitive fires. \n-Continued development of modeling and simulation capability to support bore life development and testing for rep rate bore life development assessments.\n-Continue pulsed power development and fabrication required to support repetitive rate testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.820"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2015 unless noted as completed above.\n-Complete pulsed power development and fabrication required to support repetitive rate testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.938"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.938"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2016 unless noted as completed above.\n-Complete majority of long lead barrel buys with continued barrel testing required.\n-Complete effort to understand the technology required to launch hypervelocity projectiles in only a 4 meter long barrel at 10 rounds per minute.\n-Complete additional next generation pulsed power fabrication as part of a multi-module, multi-year build to increase full scale rep rate capability from 20MJ to 32MJ muzzle energy capability."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This PE develops early components technologies that can be integrated into weapon systems that meet warfighter requirements.  Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).  The metrics used to evaluate 6.2 programs are necessarily less precise than those used in 6.3 programs. \n\nThe metrics for this PE can be divided into two categories:  technological and organizational\/functional.  Technological metrics address the success of the work performed.  The primary technological metrics used in this PE involve laboratory experiments\/tests demonstrating proof of the concept for the technology.  This demonstration is frequently a hand-assembled functioning breadboard of the concept.  The organizational\/functional metrics applied to this PE include:  transition of the technology to advanced development in a 6.3 PE and applicability of the technology to documented warfighter problems or requirements.  Successful implementation of these categories would result in the application of a pass\/fail metric and further evaluation for possible transition to a 6.3 development\/demonstration program."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "18.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "18.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "13.500"
                                        },
                                        "Text": {
                                            "val": "Additional funds will be utilized towards researching efforts to develop high energy weapons.  These could potentially include Electromagnetic Railgun (EMRG) development and directed energy initiatives. Increased investments in the Electro Magnetic (EM) railgun would go towards the further development of a weapon which could be considered for multi-mission applications including USMC Naval Surface Fire Support, anti-surface warfare (ASUW) and ship self-defense from missiles and small boat threats.  Funds used towards the development of Directed Energy (DE) technologies for Navy applications will go towards addressing requirements of future Navy combatants to provide ship defense against emerging threats that are proliferating throughout the Navies of the world."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Protection Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Investments in the Electro Magnetic (EM) railgun would go towards the further development of a weapon which could be considered for multi-mission applications including USMC Naval Surface Fire Support, anti-surface warfare (ASUW) and ship self-defense from missiles and small boat threats.  Funds used towards the development of Directed Energy (DE) technologies for Navy applications will go towards addressing requirements of future Navy combatants to provide ship defense against emerging threats that are proliferating throughout the Navies of the world."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}