{
    "id": "0d762f8bda5d3fa9215310b3433c0eff6343018d",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA2_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602623A"
        },
        "ProgramElementTitle": {
            "val": "Joint Service Small Arms Program"
        },
        "R1LineNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.633"
            },
            "CurrentYear": {
                "val": "5.487"
            },
            "BudgetYearOne": {
                "val": "5.545"
            },
            "BudgetYearOneBase": {
                "val": "5.545"
            },
            "BudgetYearTwo": {
                "val": "5.608"
            },
            "BudgetYearThree": {
                "val": "5.565"
            },
            "BudgetYearFour": {
                "val": "5.675"
            },
            "BudgetYearFive": {
                "val": "5.789"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates individual and crew-served weapon designs and technologies that enhance the fighting capabilities and survivability of the dismounted Warfighter in support of all of the Services. All work is led by the Joint Service Small Arms Program (JSSAP) and is based upon the Joint Service Small Arms Master Plan (JSSAMP) and the Joint Capabilities Integration Development System's Small Arms Analyses.\n \nWork in this PE is related to, and fully coordinated with, efforts in PE 0601102A (Defense Research Sciences), PE 0602624A (Weapons and Munitions Technology), PE 0603607A (Joint Service Small Arms Program), and PE 0602618A (Ballistic Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.   \n \nThis program is managed by the Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ, in collaboration with the Army Research Laboratory (ARL) at Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.850"
                },
                "CurrentYear": {
                    "val": "5.487"
                },
                "BudgetYearOne": {
                    "val": "5.545"
                },
                "BudgetYearOneBase": {
                    "val": "5.545"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.633"
                },
                "CurrentYear": {
                    "val": "5.487"
                },
                "BudgetYearOne": {
                    "val": "5.545"
                },
                "BudgetYearOneBase": {
                    "val": "5.545"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.217"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.217"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H21"
                    },
                    "ProjectTitle": {
                        "val": "Jt Svc Sa Prog (JSSAP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.633"
                        },
                        "CurrentYear": {
                            "val": "5.487"
                        },
                        "BudgetYearOne": {
                            "val": "5.545"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.545"
                        },
                        "BudgetYearTwo": {
                            "val": "5.608"
                        },
                        "BudgetYearThree": {
                            "val": "5.565"
                        },
                        "BudgetYearFour": {
                            "val": "5.675"
                        },
                        "BudgetYearFive": {
                            "val": "5.789"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates individual and crew-served weapon component design and technologies that enable increased lethality for survivability of the dismounted Warfighter in all the Services. All efforts are based upon the Joint Service Small Arms Master Plan (JSSAMP) and the Joint Capabilities Integration Development System's Small Arms Analyses.\n\nEfforts in this Program Element (PE) support the Lethality portfolio.\n\nWork in this project is related to, and fully coordinated with, efforts in PE 0602624A (Weapons and Munitions Technology) and PE 0603607A (Joint Service Small Arms Program) and PE 0602786A (Warfighter Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Small Unit (Squad) Small Arms Technology Concepts"
                                    },
                                    "Description": {
                                        "val": "This effort was originally titled Joint Service Small Arms Program (JSSAP) Mini Grand Challenge. It addresses future small arms technology investments including new materials, high power energy sources, miniaturization techniques, and reduction of weapon moving components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Experimented with selected phosphors properties that provide one-way luminescence capability for 5.56mm and 7.62mm caliber ammunition; investigated and evaluated suppressor designs to decrease flash and acoustic detection; validated adaptive solid lubricants to decrease required weapon maintenance and transitioned results to PE 0603607A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Material and Process Technology"
                                    },
                                    "Description": {
                                        "val": "This effort addresses state of the art material substrates and surface coatings to improve reliability, reduce maintenance and improve weapon diagnostics through embedded technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.429"
                                            },
                                            "Text": {
                                                "val": "Experimented with selected phosphors properties that provide one-way luminescence capability for 5.56mm and 7.62mm caliber ammunition; investigated and evaluated suppressor designs to decrease flash and acoustic detection; validated adaptive solid lubricants to decrease required weapon maintenance and transitioned results to PE 0603607A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Future Small Arms Concept Exploration"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the investigation and design of enabling technologies transitioned from Basic Research (6.1) efforts in the areas of ballistics, energetics, future weapon and fire control sensors in order to extend individual soldier engagement ranges and maintain squad lethality overmatch; and optimize caliber performance to match mission sets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.704"
                                            },
                                            "Text": {
                                                "val": "Investigated and evaluated advanced small arms kinetic ammunition designs; designed new small caliber weapons component technologies to obtain increased range and accuracy, decreased weight, improved target acquisition and engagement while reducing weapons recoil and suppressing weapon signature; investigated futuristic small arms weapon systems proposed by the West Point Futures Studies and generated technology development plans, trade-off analysis, and concept designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapon System and Enablers"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates small arm weapon systems and enabling technologies to include: weapon size, weight and power consumption, barrel properties, recoil force, balance, and suitability. This effort also investigates scalable effects weapons in order to increase warfighter capability by providing one cartridge\/weapon system delivering variable effects from non-lethal to lethal at greater ranges than currently available."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.742"
                                            },
                                            "Text": {
                                                "val": "Investigate and evaluate advanced materials, coatings and weapon system designs in order to reduce weight, mitigate recoil, and decrease weapon signature; mature suppressor designs to reduce gun flash and acoustic signatures; investigate futuristic small arms weapon systems proposed by the West Point Futures Study and generate technology plans, trade-off analyses, and concept gun designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.860"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.860"
                                            },
                                            "Text": {
                                                "val": "Will investigate and assess technologies to improve the accuracy and controllability of the weapon with the Soldier-in-the loop, and facilitate the operation of the weapon system with novel or advanced ammunition concepts required to meet lethality requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Ammunition Research"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the design and evaluation of ammunition with reduced weight, signature, fouling and contaminants as well as improved terminal performance and improved performance against soft and hard targets."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.278"
                                            },
                                            "Text": {
                                                "val": "Investigate and evaluate ammunition designs in order to increase probability of hit and probability of incapacitation\/hit; optimize caliber and configuration to defeat personnel targets at extended ranges, with or without protection; conduct trade studies to support energetic materials for propulsion, breaching ammo and tagging and marking; design, fabricate or evaluate advanced armor piercing 5.56mm and advanced kinetic energy ammunition in collaboration with ARL."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.046"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.046"
                                            },
                                            "Text": {
                                                "val": "Will investigate and assess ammunition propulsion technologies to increase muzzle velocity that meet safety constraints (noise and muzzle pressure) yet increase velocity\/muzzle energies: launch mechanisms (sabot, taper bore, etc); improve propellant higher energy densities; introduce compact cartridges; and lighten cartridge weight; improve ammunition projectiles to reduce energies required to perforate toughest targets and implement highly efficient aerodynamics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optics and Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates optics and fire control technologies in order to provide a single ballistic solution to the Warfighter. Fire control devices include a laser range finder to determine the range of a target, a ballistic sensor to detect the position of the weapon system, and sensors that can measure local and downrange conditions that would affect the trajectory of a round."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.841"
                                            },
                                            "Text": {
                                                "val": "Investigate and evaluate hardware and software component technologies for an enhanced ballistic computer that enables fire on the move trajectory correction and increased precision at longer ranges, wind and improved environmental sensing, and improved target identification"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Technology Applied Research"
                                    },
                                    "Description": {
                                        "val": "This effort supports the requirements analysis and the long-term investigation and maturation of technologies to fulfill the Department of Defense small arms capability requirements. The Joint Service Small Arms Program continuously utilizes studies and evaluations to determine the feasibility of novel material concepts; investigate all potential interfaces between the Soldier, training, weapon, optics, and the ammunition; and explore and evaluate interior and exterior ballistic component technologies to enhance weapon performance."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.626"
                                            },
                                            "Text": {
                                                "val": "Evaluate state-of-art small arms technologies components to determine maturity for system integration; investigate small arms technologies capabilities to defeat current and future threats to the dismounted warfighter; conduct extensive analysis of available worldwide small arms systems and component technologies; leverage small arms knowledge to better focus applied research efforts in support of Army small arms capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.639"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.639"
                                            },
                                            "Text": {
                                                "val": "Will evaluate state-of-art small arms technologies components to determine maturity for system integration; investigate small arms technologies capabilities to defeat current and future threats to the dismounted warfighter; conduct extensive analysis of available worldwide small arms systems and component technologies; leverage small arms knowledge to better focus applied research efforts in support of Army small arms capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}