{
    "id": "0e49e0c951f192f73bf0276bc5ca7407037a04a0",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602201F"
        },
        "ProgramElementTitle": {
            "val": "Aerospace Vehicle Technologies"
        },
        "R1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "101.053"
            },
            "CurrentYear": {
                "val": "122.969"
            },
            "BudgetYearOne": {
                "val": "122.831"
            },
            "BudgetYearOneBase": {
                "val": "122.831"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "125.042"
            },
            "BudgetYearThree": {
                "val": "129.566"
            },
            "BudgetYearFour": {
                "val": "135.530"
            },
            "BudgetYearFive": {
                "val": "135.135"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program investigates, develops, and analyzes aerospace vehicle technologies in the three primary areas of structures, controls, and aerodynamics for legacy and future aerospace vehicles. Advanced structures concepts are explored and developed to exploit new materials, fabrication processes, and design techniques. Vehicle, inter-vehicle, and intra-vehicle control technologies are developed and simulated for aerospace vehicles. Advanced aerodynamic vehicle configurations are developed and analyzed through simulations, experiments, and multi-disciplinary analyses. Resulting technologies improve performance of existing and future manned and remotely piloted air vehicles, sustained high speed, and space access vehicles. Improvements include, but are not limited to, reduced energy use by efficient air platform designs, use of lightweight composite structures, and improved sustainment methods based on the condition of the platform and sub-systems. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nThis program is in Budget Activity 2, Applied Research, because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "105.673"
                },
                "CurrentYear": {
                    "val": "123.438"
                },
                "BudgetYearOne": {
                    "val": "122.766"
                },
                "BudgetYearOneBase": {
                    "val": "122.766"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "101.053"
                },
                "CurrentYear": {
                    "val": "122.969"
                },
                "BudgetYearOne": {
                    "val": "122.831"
                },
                "BudgetYearOneBase": {
                    "val": "122.831"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.620"
                },
                "CurrentYear": {
                    "val": "-0.469"
                },
                "BudgetYearOne": {
                    "val": "0.065"
                },
                "BudgetYearOneBase": {
                    "val": "0.065"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.469"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.750"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.870"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.065"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.065"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2015 reflects reprogramming to support Research and Development Projects, 10 U.S.C. Section 2358."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "622401"
                    },
                    "ProjectTitle": {
                        "val": "Structures"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.230"
                        },
                        "CurrentYear": {
                            "val": "52.112"
                        },
                        "BudgetYearOne": {
                            "val": "41.103"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.103"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "44.739"
                        },
                        "BudgetYearThree": {
                            "val": "45.579"
                        },
                        "BudgetYearFour": {
                            "val": "46.444"
                        },
                        "BudgetYearFive": {
                            "val": "47.259"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops advanced structures concepts to exploit new materials and fabrication processes and investigates new concepts and design techniques.  New structural concepts include incorporating subsystem hardware items and adaptive mechanisms into the aerospace structures and\/or skin of the platform."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircraft Service Life Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop an economic service life analysis capability comprised of analysis tools, methodologies, and structural health monitoring technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.772"
                                            },
                                            "Text": {
                                                "val": "Completed technology development concepts for risk informed decision-making. Completed technology efforts for condition-\nbased maintenance of structural integrity. Initiated development of engineered residual stress methods for airframe life extension. Continued the technology development of failure criteria methods and tools for advanced aircraft composite and metallic components. Continued efforts in certification of advanced composite for aircraft structures. Continued efforts in Airframe Digital Twin to develop an integrated system of data, models, and analysis tools that enable better decisions regarding fleet lifecycle management and sustainment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.652"
                                            },
                                            "Text": {
                                                "val": "Continue development of engineered residual stress methods for airframe life extension. Continue the technology development of failure criteria methods and tools for advanced aircraft composite and metallic components. Continue efforts in certification of advanced composite for aircraft structures. Continue efforts in Airframe Digital Twin to develop an integrated system of data, models, and analysis tools that enable better decisions regarding fleet lifecycle management and sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.431"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.431"
                                            },
                                            "Text": {
                                                "val": "Continue development of engineered residual stress methods for airframe life extension.  Continue efforts in certification of advanced composite for aircraft structures. Complete the technology development of failure criteria methods and tools for advanced aircraft composite and metallic components.  Continue efforts in Airframe Digital Twin to develop an integrated system of data, models, and analysis tools that enable better decisions regarding fleet lifecycle management and sustainment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Design Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop methodologies to reduce the cost and time involved from design to full-scale testing of structural concepts and aircraft systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.486"
                                            },
                                            "Text": {
                                                "val": "Completed high fidelity multidisciplinary design methods to enable efficient supersonic air vehicle technologies. Completed development of multi-disciplinary methodologies that will allow for lower cost advanced structures. Continued the development of advanced high fidelity aircraft design analysis tools. Initiated design methods for innovative control of supersonic tailless aircraft. Initiated parametric modeling methods for integrated multidiscipline collaborative design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.665"
                                            },
                                            "Text": {
                                                "val": "Continue the development of advanced high fidelity aircraft design analysis tools. Continue design methods for innovative control of supersonic tailless aircraft. Continue parametric modeling methods for integrated multidiscipline collaborative design. Continue high-fidelity technology assessment and design of next generation mobility concepts. Initiate the development of design methods for low cost attritable aircraft concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.047"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.047"
                                            },
                                            "Text": {
                                                "val": "Continue the development of advanced high fidelity aircraft design analysis tools.  Complete design methods for innovative control of supersonic tailless aircraft.  Continue parametric modeling methods for integrated multidiscipline collaborative design.  Complete high-fidelity technology assessment and design of next generation mobility concepts.  Continue the development of design methods for low cost attritable aircraft concepts.  Initiate evaluation of control effector concepts for supersonic tailless aircraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Structural Concepts"
                                    },
                                    "Description": {
                                        "val": "Develop design methods, processes, and lightweight, adaptive, and multifunctional structural concepts to capitalize on new materials, multi-role considerations, and technology integration into aircraft systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.972"
                                            },
                                            "Text": {
                                                "val": "Continued innovative energy efficient conformal load bearing antenna structural concepts. Initiated development of lightweight, adaptive, and efficient structural concepts for mobility and special operations. Initiated low cost airframe design and manufacturing methods."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.795"
                                            },
                                            "Text": {
                                                "val": "Continue innovative energy efficient conformal load bearing antenna structural concepts. Continue development of lightweight, adaptive, and efficient structural concepts for mobility and special operations. Continue low cost airframe design and manufacturing methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.625"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.625"
                                            },
                                            "Text": {
                                                "val": "Continue innovative energy efficient conformal load bearing antenna structural concepts. Continue development of lightweight, adaptive, and efficient structural concepts for mobility and special operations. Complete low cost airframe design and manufacturing methods. Initiate verification of low cost attritable airframe manufacturing methods.  Initiate development of lightweight aircraft structural concepts to support Air Superiority 2030 requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622403"
                    },
                    "ProjectTitle": {
                        "val": "Flight Controls and Pilot-Vehicle Interface"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.305"
                        },
                        "CurrentYear": {
                            "val": "27.447"
                        },
                        "BudgetYearOne": {
                            "val": "28.516"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.516"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "29.827"
                        },
                        "BudgetYearThree": {
                            "val": "30.418"
                        },
                        "BudgetYearFour": {
                            "val": "30.922"
                        },
                        "BudgetYearFive": {
                            "val": "31.412"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies that enable maximum affordable capability from manned, remotely piloted and autonomous aerospace vehicles.  Advanced flight control technologies are developed for maximum vehicle performance throughout the flight envelope and simulated in virtual environments.  Resulting technologies contribute significantly towards the development of reliable autonomous remotely piloted air vehicles, hypersonic aircraft, and extended-life legacy aircraft."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Flight Controls Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for advanced control-enabled capabilities, including flight controls, components, integrated vehicle management systems and software, and system certification techniques for both manned and remotely piloted aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.414"
                                            },
                                            "Text": {
                                                "val": "Continued the development, demonstration, and assessment of advanced flight control mechanization technologies for trusted and certifiable operations under adverse and contested environments. Continued the development of survivable and health-adaptive control system architecture; developing new methods and expanding to include more aircraft systems.  Completed assessment of single pilot operations for mobility aircraft.  Continue the development of adaptive guidance and control technologies for small-scale hypersonic air vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.438"
                                            },
                                            "Text": {
                                                "val": "Continue the development, demonstration, and assessment of advanced flight control mechanization technologies for trusted and certifiable operations under adverse and contested environments. Continue the development of survivable and health-adaptive control system architecture; developing new methods and expanding to include more aircraft systems. Initiate development of advanced automation capabilities for large aircraft. Complete the development of adaptive guidance and control technologies for small-scale hypersonic air vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.307"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.307"
                                            },
                                            "Text": {
                                                "val": "Continue the development, demonstration, and assessment of advanced flight control mechanization technologies for trusted and certifiable operations under adverse and contested environments. Continue the development of survivable and health-adaptive control system architecture; developing new methods and expanding to include more aircraft systems. Continue the development of advanced automation capabilities for large aircraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manned and Unmanned Teaming Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technology for flight control systems that will permit safe interoperability between manned and remotely piloted aircraft and effective teaming in adverse and contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.768"
                                            },
                                            "Text": {
                                                "val": "Continued the development, demonstration, and assessment of advanced control automation techniques. Continued the development of mixed initiative control techniques for teams of remotely piloted aircraft and\/or manned-unmanned teams in contested, dynamic mission environments, as well as for the integration of unmanned systems into controlled airspace and airbase operations.  Completed demonstration and assessment of on-aircraft technology options for autonomous operations in a terminal airspace environment.  Continue development of airborne control of UAS in preparation for flight test activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.581"
                                            },
                                            "Text": {
                                                "val": "Continue development, demonstration, and assessment of advanced control automation techniques. Continue the development of mixed initiative control techniques for teams of remotely piloted aircraft and\/or manned-unmanned teams in contested, dynamic mission environments, as well as for the integration of unmanned systems into controlled airspace and airbase operations.  Initiate development of robust, affordable Unmanned Air Systems (UAS) operations in a terminal airspace environment.  Complete development of airborne control of UAS in preparation for flight test activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.506"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.506"
                                            },
                                            "Text": {
                                                "val": "Continue development, demonstration, and assessment of advanced control automation techniques. Continue the development of mixed initiative control techniques for teams of remotely piloted aircraft and\/or manned-unmanned teams in contested, dynamic mission environments, as well as for the integration of unmanned systems into controlled airspace and airbase operations.  Continue the development of robust, affordable UAS operations in a terminal airspace environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Controls Technologies Modeling and Simulation"
                                    },
                                    "Description": {
                                        "val": "Develop tools and methods for capitalizing on simulation-based research and development of future aerospace vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.123"
                                            },
                                            "Text": {
                                                "val": "Continued modeling and simulation efforts to evaluate emerging autonomous and robust flight control technologies and concepts, as well as assess mission-level performance of integrated aerospace systems. Continued analyses of automated unmanned air systems and manned-unmanned teams in controlled airspace and airbase operations, as well as in adversarial mission environments, initiating development of testbed for emerging technologies. Continued trade studies of vehicle concepts for strike, mobility and reconnaissance. Completed autonomy in mobility testbed and began mobility evaluations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.428"
                                            },
                                            "Text": {
                                                "val": "Continue modeling and simulation efforts to evaluate emerging autonomous and robust flight control technologies and concepts, as well as assess mission-level performance of integrated aerospace systems. Continue analyses of automated unmanned air systems and manned-unmanned teams in controlled airspace and airbase operations, as well as in adversarial mission environments. Continue trade studies of vehicle concepts for strike, mobility and reconnaissance. Complete manned-unmanned teaming testbed.  Complete mobility evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.703"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.703"
                                            },
                                            "Text": {
                                                "val": "Continue modeling and simulation efforts to evaluate emerging autonomous and robust flight control technologies and concepts, as well as assess mission-level performance of integrated aerospace systems. Continue analyses of automated unmanned air systems and manned-unmanned teams in controlled airspace and airbase operations, as well as in adversarial mission environments. Continue trade studies of vehicle concepts for strike, mobility and reconnaissance.  Continue manned-unmanned teaming evaluations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622404"
                    },
                    "ProjectTitle": {
                        "val": "Aeromechanics and Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.080"
                        },
                        "CurrentYear": {
                            "val": "28.553"
                        },
                        "BudgetYearOne": {
                            "val": "34.470"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.470"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "28.281"
                        },
                        "BudgetYearThree": {
                            "val": "28.875"
                        },
                        "BudgetYearFour": {
                            "val": "29.476"
                        },
                        "BudgetYearFive": {
                            "val": "29.981"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops aerodynamic configurations of a broad range of revolutionary, affordable aerospace vehicles.  It matures and applies modeling and numerical simulation methods for fast and affordable aerodynamics prediction and integrates and demonstrates multi-disciplinary advances in airframe, propulsion, weapon and air vehicle control integration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aerodynamic Systems Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop aerodynamic assessment prediction methods centered on expanding the design capabilities of future air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.792"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and assess aerodynamic technologies that enable future revolutionary manned and unmanned air vehicles. Continued to develop and assess advanced aircraft configurations for future mobility and air superiority requirements. Completed technology assessments on air superiority vehicle concepts. Initiated technology assessments on next generation tanker systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.652"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and assess aerodynamic technologies that enable future revolutionary manned and unmanned air vehicles. Complete development and assessment of advanced aircraft configurations for mobility. Continue to develop and assess advanced aircraft configurations for future air superiority. Continue technology assessments on next generation tanker systems. Initiate development and assessment of low cost attritable unmanned air systems concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.117"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.117"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and assess aerodynamic technologies that enable future revolutionary manned and unmanned air vehicles.  Complete development and assessment of advanced aircraft configurations for future Air Superiority 2030 requirements.  Complete technology assessments on next generation tanker systems.  Continue development and assessment of low cost attritable UAV concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Aerodynamic Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and assess technologies for the next generation of multi-role large aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.490"
                                            },
                                            "Text": {
                                                "val": "Continued development of high fidelity aerodynamic analysis and method development for Mobility and future Air Superiority requirements.  Continued development of practical laminar flow technologies for highly swept wings. Initiated aerodynamics technologies to enable control of supersonic tailless aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.367"
                                            },
                                            "Text": {
                                                "val": "Continue development of high fidelity aerodynamic analysis and method development for Mobility and future Air Superiority 2030. Continue development of practical laminar flow technologies for highly swept wings. Continue development of aerodynamics technologies to enable control of supersonic tailless aircraft. Initiate development of flow control techniques to increase the efficiency of practical laminar flow technologies for highly swept wings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.988"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.988"
                                            },
                                            "Text": {
                                                "val": "Continue development of high fidelity aerodynamic analysis and method development for future Air Superiority 2030.  Continue development of practical laminar flow technologies for highly swept wings.  Complete development of aerodynamics technologies to enable control of supersonic tailless aircraft. Initiate aerodynamic technology maturation for next generation tanker.  Continue development of flow control techniques to increase the efficiency of practical laminar flow technologies for highly swept wings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Integration Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop enabling technologies to allow efficient and effective integration of propulsion, weapons, and subsystems into current and future air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.798"
                                            },
                                            "Text": {
                                                "val": "Developed aerodynamic and propulsion integration technologies that enable future mobility and fighter aircraft. Developed analyses and experiments to investigate propulsion integration flow control to enhance mobility and future air superiority vehicle performance. Developed innovative aerodynamic design methods for integrating high bypass propulsion for future mobility aircraft. Developed advanced kinetic and directed energy weapons integration technologies for future air superiority requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.534"
                                            },
                                            "Text": {
                                                "val": "Continue to develop aerodynamic and propulsion integration technologies that enable future mobility and fighter aircraft. Complete analyses and experiments to investigate propulsion integration flow control to enhance mobility and  future air superiority vehicle performance. Initiate advanced inlet and exhaust systems subscale tests for air superiority.  Continue development of advanced kinetic and directed energy weapons integration technologies for future air superiority requirements.  Complete innovative aerodynamic design methods for integrating high bypass propulsion for future mobility aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.365"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.365"
                                            },
                                            "Text": {
                                                "val": "Continue to develop aerodynamic and propulsion integration technologies that enable future mobility and fighter aircraft. Continue advanced inlet and exhaust systems subscale tests for future air superiority.  Continue development of advanced kinetic and directed energy weapons integration technologies for future air superiority.  Initiate analysis of innovative propulsion integration technologies that enable low cost attritable aircraft."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622405"
                    },
                    "ProjectTitle": {
                        "val": "High Speed Systems Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.438"
                        },
                        "CurrentYear": {
                            "val": "14.857"
                        },
                        "BudgetYearOne": {
                            "val": "18.742"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.742"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "22.195"
                        },
                        "BudgetYearThree": {
                            "val": "24.694"
                        },
                        "BudgetYearFour": {
                            "val": "28.688"
                        },
                        "BudgetYearFive": {
                            "val": "26.483"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program investigates, analyzes, and develops high speed\/hypersonic aerospace vehicle technologies. Advanced high temperature structures concepts are explored and developed to exploit new materials, fabrication processes, and design techniques. Advanced aerodynamic vehicle configurations are developed and analyzed through simulations, experiments, and multi-disciplinary analyses. Advanced flight control technologies are developed and simulated for hypersonic vehicles. These technologies will enable future high speed; weapons, intelligence, surveillance, and reconnaissance systems; and space access vehicles"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Speed\/Hypersonics Structures"
                                    },
                                    "Description": {
                                        "val": "Develop high speed, high temperature structural analysis methods and technologies for extreme operating conditions in current and future air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.115"
                                            },
                                            "Text": {
                                                "val": "Initiated development of innovative structural concepts for high speed\/hypersonic air vehicles. Initiated development of analytical methods for predicting structural response needed for design and evaluation of hot primary structure for hypersonic vehicles. Initiate the impact of path dependent structural behavior on the service life prediction for hot structures encountering extreme environments. Initiated the development and integrate model uncertainty methods into multi-disciplinary simulations and quantify its impact on the structural margin. Initiated development of structural analysis methods and technology for hot structure concepts under extreme environment loading conditions. Initiated the assessment of the aerospace community to quantify the structural margins for extreme environment hot structure through experimental validation of ground test articles. Completed fabrication and initiated testing of representative vehicle structures for combined aero, thermal, and acoustic loads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.315"
                                            },
                                            "Text": {
                                                "val": "Continue development of innovative structural concepts for high speed\/hypersonic air vehicles. Continue development of analytical methods for predicting structural response needed for design and evaluation of hot primary structure for hypersonic vehicles. Continue to assess the impact of path dependent structural behavior on the service life prediction for hot structures encountering extreme environments. Continue to develop and integrate model uncertainty methods into multi-disciplinary simulations and quantify its impact on the structural margin. Continue development of structural analysis methods and technology for hot structure concepts under extreme environment loading conditions. Continue the assessment of the aerospace community to quantify the structural margins for extreme environment hot structure through experimental validation of ground test articles. Complete testing of representative vehicle structures for combined aero, thermal, and acoustic loads. Validate combined loads methodology to predict structural response."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.896"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.896"
                                            },
                                            "Text": {
                                                "val": "Continue development of innovative structural concepts for high speed\/hypersonic air vehicles. Continue development of analytical methods for predicting structural response needed for design and evaluation of hot primary structure for hypersonic vehicles. Continue to assess the impact of path dependent structural behavior on the service life prediction for hot structures encountering extreme environments. Continue to develop and integrate model uncertainty methods into multi-disciplinary simulations and quantify its impact on the structural margin. Continue development of structural analysis methods and technology for hot structure concepts under extreme environment loading conditions. Continue the assessment of the aerospace community to quantify the structural margins for extreme environment hot structure through experimental validation of ground test articles. Initiate development of structural life prediction methodology for extreme environment structures and thermal protection systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed Vehicle Aeromechanics and Integration"
                                    },
                                    "Description": {
                                        "val": "Develop new and improved components, concepts, and designs for sustained flight of high-speed\/hypersonic expendable and re-useable vehicles. Conduct analyses of high speed\/hypersonic vehicles to enable revolutionary capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.323"
                                            },
                                            "Text": {
                                                "val": "Matured critical technologies for high speed\/hypersonic flight. Initiated development of design\/analysis techniques\/tools and experimental approaches to enable enhanced high-speed air induction system starting, operability, and performance for propulsion integration concepts over a wide range of flight conditions. Continued performance and operability ground testing of advanced high contraction ratio inlets.  Initiated development of high speed system concepts that provide revolutionary capabilities. Investigated aeromechanic technologies to reduce drag and enable robust stability & control at low dynamic pressure flight conditions. Initiated efforts to characterize high-speed phenomena and develop and validate fundamental high-speed technologies through experimental testing. As part of international collaborative effort, conducted flight tests boundary layer transition experiment. Developed design of multi-functional terminal sensor integrated flight experiment. Assessed mission-level effectiveness and refined definition of preferred high speed weapon alternatives. Developed campaign-level modeling and simulation of high speed weapon alternatives. Assessed campaign-level benefits of preferred high speed weapon alternatives"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.542"
                                            },
                                            "Text": {
                                                "val": "Continue maturation of critical technologies for high speed\/hypersonic flight. Continue development of design\/analysis techniques\/tools and experimental approaches to enable enhanced high-speed air induction system starting, operability, and performance for propulsion integration concepts over a wide range of flight conditions. Complete performance and operability ground testing of advanced high contraction ratio inlets. Continue development of high speed system concepts that provide revolutionary capabilities. Investigate aeromechanic technologies to reduced drag and enable robust stability and control at low dynamic pressure flight conditions. Continue efforts to characterize high-speed phenomena and develop and validate fundamental high- speed technologies through experimental testing. As part of an international collaborative effort, continue flight tests of Mach 6 adaptive guidance and control flight experiment. Continue assessment of mission-level effectiveness and refinement of definition of preferred high speed weapon alternatives and limited life hypersonic intelligence, surveillance, and reconnaissance vehicles. Continue assessment of campaign-level benefits of preferred high speed weapon alternatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.846"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.846"
                                            },
                                            "Text": {
                                                "val": "Continue to mature critical technologies for high speed\/hypersonic flight. Continue development of design\/analysis techniques\/tools and experimental approaches to enable enhanced high-speed air induction system starting, operability, and performance for propulsion integration concepts over a wide range of flight conditions. Continue development of high speed system concepts that provide revolutionary capabilities. Continue investigation of aeromechanic technologies to reduced drag and enable robust stability and control at low dynamic pressure flight conditions. Continue efforts to characterize high-speed phenomena and develop and validate fundamental high- speed technologies through experimental testing. As part of international collaborative effort, complete flight testing of Mach 6 adaptive guidance and control flight experiment and initiate boundary layer transition flight experiment program. Continue assessment of mission-level effectiveness and refinement of definition of preferred high speed weapon alternatives and limited life hypersonic intelligence, surveillance, and reconnaissance vehicles. Continue assessment of campaign-level benefits of preferred high speed weapon alternatives."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}