{
    "id": "1672a3f40bb811ee623b8fdcf4c0a6dcbfcd9c46",
    "meta": {
        "filename": "dod-2017_RDTE_2017_SOCOM_U_RDTE_MasterJustificationBook_United_States_Special_Operations_Command_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_United_States_Special_Operations_Command_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "1160401BB"
        },
        "ProgramElementTitle": {
            "val": "SOF Technology Development"
        },
        "R1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "401.679"
            },
            "PriorYear": {
                "val": "35.559"
            },
            "CurrentYear": {
                "val": "37.517"
            },
            "BudgetYearOne": {
                "val": "37.820"
            },
            "BudgetYearOneBase": {
                "val": "37.820"
            },
            "BudgetYearTwo": {
                "val": "34.493"
            },
            "BudgetYearThree": {
                "val": "37.036"
            },
            "BudgetYearFour": {
                "val": "44.662"
            },
            "BudgetYearFive": {
                "val": "57.618"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element enables USSOCOM to conduct studies and develop laboratory prototypes for applied research and advanced technology development, as well as leverage other organizations' technology projects that may not otherwise be affordable within MFP-11.  Applying small incremental amounts of investments to Department of Defense (DOD), other government agencies, and commercial organizations allows USSOCOM to influence the direction of technology development or the schedule against which it is being pursued, and to acquire emerging technologies for Special Operations Forces.  This project provides an investment strategy for USSOCOM to link technology opportunities with capability deficiencies, capability objectives, technology thrust areas, human endurance and sensory performance, and technology development objectives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.750"
                },
                "CurrentYear": {
                    "val": "37.517"
                },
                "BudgetYearOne": {
                    "val": "38.104"
                },
                "BudgetYearOneBase": {
                    "val": "38.104"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "35.559"
                },
                "CurrentYear": {
                    "val": "37.517"
                },
                "BudgetYearOne": {
                    "val": "37.820"
                },
                "BudgetYearOneBase": {
                    "val": "37.820"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.191"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.284"
                },
                "BudgetYearOneBase": {
                    "val": "-0.284"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.191"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.284"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.284"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:  \n\nFY 2015:  Decrease of -$1.191 million is due to a transfer of funds to Small Business Innovative Research\/Small Business Technology Transfer programs.\n\nFY 2016:  None.\n\nFY 2017: Decrease of -$0.284 million is due to a Departmental economic assumption decrease.\n\nSchedule:  None.  \n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S100"
                    },
                    "ProjectTitle": {
                        "val": "SOF Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "401.679"
                        },
                        "PriorYear": {
                            "val": "35.559"
                        },
                        "CurrentYear": {
                            "val": "37.517"
                        },
                        "BudgetYearOne": {
                            "val": "37.820"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.820"
                        },
                        "BudgetYearTwo": {
                            "val": "34.493"
                        },
                        "BudgetYearThree": {
                            "val": "37.036"
                        },
                        "BudgetYearFour": {
                            "val": "44.662"
                        },
                        "BudgetYearFive": {
                            "val": "57.618"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts studies and develops laboratory prototypes for applied research and advanced technology developments, and leverages other organizations' technology projects that may not otherwise be affordable within MFP-11.  Small incremental co-investments with DOD, other government agencies, and commercial organizations allow USSOCOM to influence the schedule and direction of technology developments, emerging technologies, and capabilities for Special Operations Forces (SOF), with significant economies of investment.  This USSOCOM investment strategy is used to link technology opportunities with USSOCOM capability deficiencies, capability objectives; technology thrust areas, and technology objectives.  Technology development needs in these areas may be advertised to industry and government research and development agencies via agency announcements and calls for white papers.  Sub-projects within the SOF Technology Demonstration effort include:\n\n•  SOF Technology Development Sub-Project:  This project conducts studies and develops laboratory prototypes for applied research and advanced technology developments, and leverages other organizations' technology projects that may not otherwise be affordable within MFP-11.\n\n•  Tagging, Tracking, and Locating (TTL) Sub-Project:  TTL funds Applied Research projects identified in the USSOCOM Quick Look Capabilities Based Assessments (QL-CBA).  TTL applies leading edge nanotechnology, biometric and biotechnology, and chemistry which is directed towards the development of revolutionary tags, taggants, sensors, communications, and data processing.\n\n•  Classified Sub-Project (provided under separate cover)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOF Technology Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.988"
                                            },
                                            "Text": {
                                                "val": "Continued ongoing technology development sub-projects in areas such as, but not limited to:  reduced signature technologies; advanced lightweight armor and materials; advanced long duration small form factor power supplies; and alternative fuel power systems.  Advanced technologies for combat medical equipment and tactics; sensor and processing improvements; improved interfaces and displays; and secure communications.  Continued pursuit of methods to reduce operator load and provide advanced protection.  Developed technologies for improved and widened window of target engagement (escalation of force), pursued enhancements to technologies that can aid in detection of enemy intentions and movement, and continued development and exploration across the electromagnetic spectrum.  Based upon agreed technology maturity metrics, transferred successful projects into programs of record.  Continued the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes.  Focus was on delivering prototype system for soldier protection and augmentation and continued development of situational awareness and command\/control systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.780"
                                            },
                                            "Text": {
                                                "val": "Continue ongoing technology development sub-projects in areas such as, but not limited to: long duration small form factor power supplies, alternative fuel power systems, reduce signature technologies, advance lightweight armor and materials, and begin studying high data-rate throughput.  Continue advance technologies for combat medical equipment and tactics, sensor and processing improvements, improve interfaces and displays, and secure communications.  Continue pursuit of methods to reduce operator load and provide advanced protection.  Develop technologies for improved and widened window of target engagement (escalation of force), pursue enhancements to technologies that can aid in detection of enemy intentions and movement, and continue development and exploration across the electromagnetic spectrum.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record.  Continue the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes.  Focus is on delivering prototype system for soldier protection and augmentation and continue development of situational awareness and command\/control systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.858"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.858"
                                            },
                                            "Text": {
                                                "val": "Continues ongoing technology development sub-projects in areas such as, but not limited to: long duration small form factor power supplies, alternative fuel power systems, reduces signature technologies, high data-rate throughput, and advances lightweight armor and materials.  Advances technologies for combat medical equipment and tactics, sensor and processing improvements, improves interfaces and displays, and secure communications.  Continues pursuit of methods to reduce operator load and provides advanced protection.  Develops technologies for improved and widened window of target engagement (escalation of force), pursues enhancements to technologies that can aid in detection of enemy intentions and movement, and continues development and exploration across the electromagnetic spectrum.  Based upon agreed technology maturity metrics, transfers successful projects into programs of record.  Continues the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes.  Focus is on delivering prototype system for soldier protection and augmentation and continues development of situational awareness and command\/control systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging, Tracking, and Locating Technologies (TTL)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.414"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Continued projects to exploit nanotechnology, biotechnology and chemistry for application to TTL and TTL-enabling systems.  Initiated projects linked to the USSOCOM\/DOD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL QL-CBA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.950"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Continue projects to exploit nanotechnology, biotechnology and chemistry for application to TTL and TTL-enabling systems.  Initiate projects linked to the USSOCOM\/DOD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL QL-CBA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.137"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.137"
                                            },
                                            "Text": {
                                                "val": "Specific objectives, priorities, technical approaches, and potential operational applications are classified.  Continues projects to exploit nanotechnology, biotechnology and chemistry for application to TTL and TTL-enabling systems.  Initiates projects linked to the USSOCOM\/DOD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL QL-CBA."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Classified Sub-Project"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.157"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.787"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.825"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.825"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}