{
    "id": "1e7fb3e56fc47133ff63e677f72052f11d5004ab",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603456F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Advanced Technology Development"
        },
        "R1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.142"
            },
            "CurrentYear": {
                "val": "25.448"
            },
            "BudgetYearOne": {
                "val": "26.492"
            },
            "BudgetYearOneBase": {
                "val": "26.492"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "22.811"
            },
            "BudgetYearThree": {
                "val": "23.470"
            },
            "BudgetYearFour": {
                "val": "25.114"
            },
            "BudgetYearFive": {
                "val": "25.615"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates technologies to enhance airman performance and effectiveness in the aerospace force.  State-of-the-science advances are made in warfighter training, warfighter system interfaces, directed energy bioeffects, deployment and sustainment of warfighters in extreme environments, and understanding and shaping adversarial behavior.  The Directed Energy Bioeffects Parameters project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems.  The Human Dynamics and Terrain Demonstration project develops, demonstrates, and transitions human-centric technologies to address processing, exploitation, and dissemination of intelligence, surveillance, and reconnaissance (ISR) capability needs.  The Mission Effective Performance project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness.  The Warfighter Interfaces project develops, demonstrates, and transitions technologies to revolutionize the way airmen synergistically use Air Force systems, including autonomous machines and adaptive teams of airmen and machines.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  \n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.788"
                },
                "CurrentYear": {
                    "val": "25.448"
                },
                "BudgetYearOne": {
                    "val": "26.314"
                },
                "BudgetYearOneBase": {
                    "val": "26.314"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.142"
                },
                "CurrentYear": {
                    "val": "25.448"
                },
                "BudgetYearOne": {
                    "val": "26.492"
                },
                "BudgetYearOneBase": {
                    "val": "26.492"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.646"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.178"
                },
                "BudgetYearOneBase": {
                    "val": "0.178"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.062"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.584"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.178"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.178"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635323"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Bioeffects Parameters"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.012"
                        },
                        "CurrentYear": {
                            "val": "2.439"
                        },
                        "BudgetYearOne": {
                            "val": "4.909"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.909"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.888"
                        },
                        "BudgetYearThree": {
                            "val": "5.115"
                        },
                        "BudgetYearFour": {
                            "val": "6.393"
                        },
                        "BudgetYearFive": {
                            "val": "6.520"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems.  This project also develops the human components of the guidelines for testing, deployment, and protection from high power microwave and high energy laser systems and uses this information to enhance the effectiveness of these weapon systems in air, space, and cyber operations.  The optical radiation bioeffects thrust develops and demonstrates technologies that counter optical threats, while exploiting optical systems for non-lethal applications.  The radio frequency (RF) radiation bioeffects thrust develops and demonstrates technologies to assess RF bioeffects and collateral hazards from high power RF directed energy systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate optical protective technologies for aircrew and ground personnel to provide protection against directed energy threats.  Develop modeling capabilities to assess collateral hazards from high power directed energy laser systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.460"
                                            },
                                            "Text": {
                                                "val": "Began integration of physiological\/behavioral response models into engagement-level simulation capabilities for directed energy weapon threats and concepts.  Demonstrated modeling and simulation tools which transition engagement-level simulations to mission and campaign models to evaluate the utility and impact of directed energy systems.  Applied these models in the battlespace simulation at tactical levels with contribution of bioeffect human vulnerability models in a DoD standardized format.  Continued flight evaluation comparisons of predictive human system integration models to performance and acceptance of military users of these technologies in next-generation aircraft, identifying data gaps and optimizing future acquisitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.622"
                                            },
                                            "Text": {
                                                "val": "Complete initial demonstration of physiological\/behavioral response model in engagement-level simulation within distributed simulation and Air Force modeling and simulation architecture for overall weapons evaluations.  Complete initial demonstration of human vulnerability model built within a DoD standardized format and continue additional component development, integrating vision effects along with probability of eye and skin injury.  Complete effort to design probabilistic risk assessment tools for lasers. Extend laser eye protection (LEP) evaluations to perform night visor aircrew acceptance testing, including laboratory testing, and ground and flight assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.550"
                                            },
                                            "Text": {
                                                "val": "Further integration of physiological\/behavioral response models into engagement-level simulation capabilities for directed energy weapon threats and concepts.  Validate and demonstrate modeling and simulation tools which transition engagement-level simulations to mission and campaign models to evaluate the utility and impact of directed energy systems.  Develop human systems integration modeling tools for laser eye protection devices.  Evaluate new technologies for laser eye protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to assess RF bioeffects and collateral hazards from high power RF directed energy systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.552"
                                            },
                                            "Text": {
                                                "val": "Validated predictive capability of models against high average power scenarios and began integration of high peak power models and high average power models into one software suite.  Continued integration of RF bioeffects real-time model and control algorithms into RF weapons to optimize non-lethal human effects while minimizing collateral damage from RF weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.817"
                                            },
                                            "Text": {
                                                "val": "Develop fast (near real-time) anatomy and physiology-based computational tool for RF-induced thermal response.  Complete prototype high peak power effects model integration into software suite and begin verification and validation studies.  Increase efficiency of human posing and morphing for electromagnetic analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.359"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.359"
                                            },
                                            "Text": {
                                                "val": "Continue verification and validation studies for high peak power effects model in support of next-generation counter-electronics weapons. Develop and validate a model of effects of low gigahertz radiation. Inform development of fire control technology for millimeter wave and high power microwave technologies based on safety and effectiveness."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635324"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics and Terrain Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.592"
                        },
                        "CurrentYear": {
                            "val": "7.149"
                        },
                        "BudgetYearOne": {
                            "val": "6.759"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.759"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.935"
                        },
                        "BudgetYearThree": {
                            "val": "7.068"
                        },
                        "BudgetYearFour": {
                            "val": "7.209"
                        },
                        "BudgetYearFive": {
                            "val": "7.353"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to identify human threats within the air, space, and cyber domains.  These technologies will enhance Air Force capabilities in ISR, layered sensing, autonomous and adaptive decision-making systems, decision aids for computer network attack\/defense\/support, ISR force development and training, cross-cultural communication, human-centric exploitation of measurement and signatures intelligence, and advanced molecular diagnostic methodologies to assess airman performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate human-centered design processes and operational tools that optimize ISR information exploitation and analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.319"
                                            },
                                            "Text": {
                                                "val": "Developed analytical work environments and toolsets to create advanced situational performance for ISR work roles that span the processing, exploitation, and dissemination process from time-dominated tactical work situations to content-dominated operational and strategic reach back operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.194"
                                            },
                                            "Text": {
                                                "val": "Demonstrate initial analytical work environments and toolsets to advance performance for ISR work roles in contested environments that span the processing, exploitation, and dissemination process from time-dominated tactical work situations to content-dominated operational and strategic reach back operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.215"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.215"
                                            },
                                            "Text": {
                                                "val": "Develop analytical work environment concepts to support advanced multi-intelligence analysis.  Demonstrate airmen-centered tools for future distributed ground processing concepts.  Assess efficacy of new concepts, methodologies, and tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate machine translation and speech-to-text tools to support the span of Air Force mission areas including ISR and cyber operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.103"
                                            },
                                            "Text": {
                                                "val": "Developed advanced multimedia machine translation and automatic speech recognition tools.  Developed 'soft' and 'hard' fusion methodology experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.206"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and test advanced multimedia machine translation and automatic speech recognition tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.044"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.044"
                                            },
                                            "Text": {
                                                "val": "Investigate advanced multimedia translation and automatic speech recognition tool applications in military environments for mission focus areas and domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Signatures"
                                    },
                                    "Description": {
                                        "val": "Develop automated and assisted methods to exploit human threat biosignatures to defeat terrorist activities and hidden person-borne threats.  Provide improved models of virtual humans to deliver mission-ready training for ISR analysts and create more immersive, realistic experiences in joint and coalition exercises."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.170"
                                            },
                                            "Text": {
                                                "val": "Demonstrated utility of integrated normative anthropometric-based human signatures data sets.  Demonstrated wearable wireless monitors for human performance real-time assessment for multiple operational settings."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.749"
                                            },
                                            "Text": {
                                                "val": "Investigate integration of normative anthropometric-based human signatures algorithms into sensor system processors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Integrate human detection algorithm to provide operators with real-time counts of gender and age differentiation into operationally relevant sensor applications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635325"
                    },
                    "ProjectTitle": {
                        "val": "Mission Effective Performance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.345"
                        },
                        "CurrentYear": {
                            "val": "10.724"
                        },
                        "BudgetYearOne": {
                            "val": "10.141"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.141"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.626"
                        },
                        "BudgetYearThree": {
                            "val": "6.846"
                        },
                        "BudgetYearFour": {
                            "val": "6.982"
                        },
                        "BudgetYearFive": {
                            "val": "7.122"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness.  This project also develops advanced methods and technologies to enable interactive live, virtual, and constructive (LVC) environments for performance-aiding methods and technologies.  Focus areas include integrated high-fidelity weapon systems training technologies for air, space, and cyber; tailored immersive simulation environments for airmen at the tactical and operational levels; and incorporation of performance assessment and feedback tools.  These methods and technologies facilitate the development of mission-essential competencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate secure, persistent, and standardized LVC training enterprise.  Utilize modeling capabilities for technology demonstration efforts focused on developing software-based tools for training that would replace human instructors.  This enables more efficient mission execution training in an LVC environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.345"
                                            },
                                            "Text": {
                                                "val": "Completed performance-based LVC environment fidelity assessment system.  Completed development of automated tools to analyze training utility for alternative ways to accomplish mixes of live and virtual training in and across mission sets.  Began development of common scenario, learner performance, and after action review content tagging for training.  Developed learning management technologies for undergraduate pilot training.  Developed adaptive training and performance measurement system for ISR analysts.  Developed low-cost, multiple-platform remotely piloted aircraft (RPA) training system.  Initiated adaptive training for Red Flag preparation.  Developed deployable LVC capability for manned and unmanned aircraft as well as emergency responders."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.724"
                                            },
                                            "Text": {
                                                "val": "Complete operational trials of integrated LVC operations training and assessment methods in large force exercise. Demonstrate shareable content and metrics in joint and coalition mission training contexts.  Begin development of reusable models for improving adversary realism in distributed mission operations (DMO) and LVC environments.  Demonstrate deployable LVC training in integrated manned and unmanned aircraft and ground operations exercise. Begin development of scenario and metrics specifications and standards for deployable LVC operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.141"
                                            },
                                            "Text": {
                                                "val": "Begin definition of standards for sharable scenario content, data, models, and metrics across a range of military operations.  Transition fast jet learning management system into routine operational training and to an alternate research domain.  Begin development of methods to create adaptive learning environments across multiple missions contexts.  Define studies to evaluate efficiencies to be derived from the creation and use of more sharable scenario content models and metrics in LVC testbeds."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635327"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Interfaces"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.193"
                        },
                        "CurrentYear": {
                            "val": "5.136"
                        },
                        "BudgetYearOne": {
                            "val": "4.683"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.683"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.362"
                        },
                        "BudgetYearThree": {
                            "val": "4.441"
                        },
                        "BudgetYearFour": {
                            "val": "4.530"
                        },
                        "BudgetYearFive": {
                            "val": "4.620"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to revolutionize the way airmen optimize the capabilities of Air Force systems, including autonomous machines and adaptive teams of airmen and machines.  Improvements in the presentation of operational information to the community of users, from the system operator to the commander, must be developed in step with advancements in the acquisition, storage, and retrieval of information.  This project provides the advances in understanding of human cognitive abilities, as well as the utilization of human interfaces, multisensory fusion, high-resolution image displays, and three-dimensional (3-D) audio to customize communications and enhance shared understanding across a diverse user community in air, space, and cyber for maximum situational awareness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Develop sense, assess, and augment technologies to facilitate efficient workflow in distributed operational environments.  Develop empirically validated cyber operator-centered tools for distributed cyber operations integrated into a single user interface."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.726"
                                            },
                                            "Text": {
                                                "val": "Finalized design recommendations for an integrated offensive and defensive cyber operator tool set.  Integrated neurophysiological sensors and validated biofluid sensors capable of real-time assessment of human cognition, human-machine teaming status, and calibrated trust.  Conducted cognitive task analyses and cognitive work analyses in operational cyber and other operational domains to develop technical requirements and make operational recommendations based on findings.  Integrated sensors, methodologies, and approaches to assess operator functional state relating to stress, cognition, trust, and human-machine teaming."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.437"
                                            },
                                            "Text": {
                                                "val": "Verify and validate design recommendations for an integrated offensive and defensive cyber operator tool set. Finalize design of neurophysiological-based airman performance sensor suite. Refresh sensors, methodologies, and approaches to assess operator functional state relating to stress, cognition, trust, and airman-machine teaming."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.995"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.995"
                                            },
                                            "Text": {
                                                "val": "Finalize design of an integrated offensive and defensive cyber operator tool set.  Begin development of the neurophysiological-based airman performance sensor suite.  Begin to build rapid and agile human-centered and testing capability for cyber operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Demonstrate ability to forecast acoustic profiles for any atmospheric\/terrain condition.  Demonstrate technologies to enhance the battlefield airman's situational awareness through wearable interfaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.801"
                                            },
                                            "Text": {
                                                "val": "Integrated real-time 3-D acoustic models into mission planning tools.  Validated high-fidelity 3-D acoustic models against real-world data obtained from airborne platform measurements in different weather and terrain environments.  Validated weather effects, landscape sounds, and geography used in developed acoustic models.  Applied human factors and usability engineering methodologies to prototype and test wearable interfaces for seamless integration of data for battlefield airmen."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.119"
                                            },
                                            "Text": {
                                                "val": "Validate real-time 3-D acoustic models into mission planning tools. Evaluate high-fidelity 3-D acoustic models against real-world data obtained from airborne platform measurements in different weather and terrain environments. Conduct human panel validation studies of weather effects, landscape sounds, and geography used in developed acoustic models. Initiate applications of physiological sensors, usability engineering methodologies to prototype and test innovative solutions required for battlefield airmen and pararescue jumpers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.637"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.637"
                                            },
                                            "Text": {
                                                "val": "Transition real-time 3-D acoustic models into mission planning tools.  Transition high-fidelity 3-D acoustic models against real world data obtained from airborne platform measurements in different weather and terrain environments.  Analyze human panel validation studies of weather effects, landscape sounds, and geography used in developed acoustic models.  Evaluate applications of physiological sensors and human performance assessment technologies for the battlefield airmen and pararescue jumpers.  Refresh usability engineering methodologies to prototype and test innovative solutions required for battlefield airmen and pararescue jumpers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an integrated human-centered interface to control multiple RPAs that have various levels of autonomy and that optimize net-centric information flow."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.666"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and evaluated operator interface designs to support decision-making and situation awareness while controlling multiple advanced and legacy RPAs in a dynamic mission environment.  Performed initial evaluations of multi-transit control station interface technology to enable a single pilot to simultaneously control multiple RPAs transiting through airspace by using high-fidelity simulations. Evaluated interfaces for a networked RPA collaborative environment using high-fidelity simulations and flight tests, to allow teams of pilot, sensor, and payload operators to work together during various RPA mission phases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.580"
                                            },
                                            "Text": {
                                                "val": "Foster advancements in the design, demonstration, and evaluation of novel airman interface designs that support decision-making and situation awareness while controlling multiple RPAs in a highly dynamic mission environment. Perform final evaluations of multi-transit control station interface technologies that will enable a single airman to simultaneously control multiple, heterogeneous RPAs transiting through airspace by using high-fidelity simulations and flight tests. Deliver mature prototype of RPA transit operations workstation. Enhance and evaluate initial designs of interfaces for a networked RPA collaborative environment to permit teams of pilot, sensor, and payload operators to collaborate for mission execution purposes, during various RPA mission phases in various threat environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.051"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.051"
                                            },
                                            "Text": {
                                                "val": "Enhance and evaluate refined interface designs for a networked collaborative environment to enable distributed teams of manned and unmanned systems to work synergistically to maximize mission effectiveness.  Establish design patterns for optimal human-autonomy dialog tailored to the specific computational methods utilized by the underlying autonomy.  Refine intelligent agents for decision support and plan monitoring, across a wide range of applications.  Extend transit control into the operations area, factoring in sensor management tasks and other operational drivers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}