{
    "id": "1f7e1098b5377e774666e247617c208c494125e1",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603794A"
        },
        "ProgramElementTitle": {
            "val": "C3 Advanced Technology"
        },
        "R1LineNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "37.816"
            },
            "BudgetYearOne": {
                "val": "35.775"
            },
            "BudgetYearOneBase": {
                "val": "35.775"
            },
            "BudgetYearTwo": {
                "val": "36.880"
            },
            "BudgetYearThree": {
                "val": "36.520"
            },
            "BudgetYearFour": {
                "val": "41.475"
            },
            "BudgetYearFive": {
                "val": "42.355"
            }
        },
        "ProgramElementNote": {
            "val": "Efforts in this Program Element (PE) were transferred from PE 0603008A beginning in Fiscal Year (FY) 2016 for the purposes of correctly identifying the efforts as Command, Control and Communications Advanced Technology.  Project EL4 efforts were transferred from PE 0603008A Project TR1 and Project EL5 efforts were transferred from PE 0603008A Project TR2."
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures and demonstrates technologies to address the seamless integrated tactical communications challenge with distributed, secure, mobile, wireless, and self-organizing communications networks and networked transceivers that will operate reliably in diverse and complex terrains, in all environments. Efforts demonstrate seamlessly integrated communications and information security technologies across all network tiers, ranging from unattended networks and sensors through maneuver elements using airborne and space assets. Project EL4 matures and integrates antennas, wireless networking devices, protocols, and software; network operations tools and techniques; and combines these with current fielded program of record networks and systems in a series of command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) network modernization demonstrations to measure their technology readiness levels (TRLs) up to TRL6 and assess them against currently fielded network architectures in an operationally relevant environment. Project EL5 matures information security devices, techniques, services, software and algorithms to protect tactical wired and wireless networks against modern network attacks; generates and distributes tactical cyber situational awareness; and focuses on configuration, operation, monitoring, defense and network reconstitution in bandwidth constrained tactical environments while reducing the operator workload required to conduct these functions.\n\nWork in this PE is complementary of PE 0602782A (Command, Control, Communications Technology), and fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), PE 0602783A (Computer and Software Technology), PE 0603001A (Warfighter Advanced Technology), PE0603270A (Electronic Warfare Technology) and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "37.816"
                },
                "BudgetYearOne": {
                    "val": "38.775"
                },
                "BudgetYearOneBase": {
                    "val": "38.775"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "37.816"
                },
                "BudgetYearOne": {
                    "val": "35.775"
                },
                "BudgetYearOneBase": {
                    "val": "35.775"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.000"
                },
                "BudgetYearOneBase": {
                    "val": "-3.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EL4"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Comms and Networking Technology Int"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "23.229"
                        },
                        "BudgetYearOne": {
                            "val": "19.769"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.769"
                        },
                        "BudgetYearTwo": {
                            "val": "20.822"
                        },
                        "BudgetYearThree": {
                            "val": "17.805"
                        },
                        "BudgetYearFour": {
                            "val": "22.390"
                        },
                        "BudgetYearFive": {
                            "val": "22.888"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Efforts in this Project were transferred from Program Element (PE) 0603008A Project TR1 beginning in Fiscal Year (FY) 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates key communications and mobile networking technologies, such as antennas, transceivers, transceiver components, networking software and novel techniques to provide secure, reliable, mobile network solutions that function in complex and diverse terrains. This Project concentrates on four major goals: to provide a series of technology demonstrations of new and emerging command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) technology enabled capabilities to significantly reduce risk associated with the network-of-networks concept; to lower the size, weight, power and cost of wireless networking systems deployed on Army platforms through hardware and software convergence; to provide critical improvements in the ability to communicate and move large amounts of information in radio frequency (RF) contested environments, in a seamless, integrated manner across the Army's highly mobile manned and unmanned force structure; and to assess the technology readiness level (TRL) of emerging network technologies in an operationally relevant environment. \n\nThis Project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground Maneuver, Air and Soldier\/Squad portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antenna and Hardware Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates low cost, power efficient, communications and electronic warfare (EW) antenna technologies for terrestrial and tactical satellite ground terminals. The focus is to reduce the visual signature and cost of antennas and the number of antennas required on platforms by proving the capability to transmit and receive on multiple frequency bands. This effort also matures small form factor interference mitigation hardware for compatibility between communications and EW systems.  Work accomplished under PE 0602782A\/project H92 complements this effort. This effort transferred from PE 0603008A\/project TR1 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.350"
                                            },
                                            "Text": {
                                                "val": "Perform extensive assessments and demonstrate distributed on-the-move satellite communications (SATCOM) antenna arrays, using both live vehicles traversing test tracks and a sophisticated motion table that emulates the test track motions and other worst case scenarios; finalize a Government standard architecture for distributed SATCOM arrays to enable interoperability between various transceivers and antenna arrays; develop and mature small form factor RF interference mitigation hardware for compatibility between EW and communications systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.995"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.995"
                                            },
                                            "Text": {
                                                "val": "Will develop and release for comment, to industry and other Government partners, a Government standard architecture for distributed SATCOM arrays to enable interoperability between various transceivers and antenna arrays; will fabricate a demonstrator of a digital intermediate frequency (digital IF) common hardware SATCOM terminal to facilitate flexibility and performance improvements, such as porting of SATCOM waveforms to the digital IF terminal."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RF Interoperability Through Convergence"
                                    },
                                    "Description": {
                                        "val": "This effort designs transceiver hardware and software standards and proof of concept that will reduce size, weight, power and cost of multiple communications and EW systems on tactical platforms.  The standard and proof of concept demonstration takes advantage of common components within the communications and EW systems to define the internal and external interfaces to communications and EW devices. The effort includes implementing and publishing a reference architecture and associated specifications for a modular, open systems approach for integrating military communications and EW devices. Work being accomplished under PE 0603270A\/Project K16 complements this effort. This effort transferred from PE 0603008A\/Project TR1 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Complete the maturation of the radio reference architecture, specification and application program interfaces sufficient to begin detailed design discussions about radio component design and configurations with potential commercial suppliers as well as Military platform developers for integration into their vehicles; continue to expand the reference architecture to include EW systems, and codify in the form of electronics chassis, backplane, wiring, power, mounting, RF, control and topology specification (the A-kit); provide a more realistic demonstration, moving from a lab table-top environment to a demonstrator vehicle mock-up, possibly using an actual vehicle, and with an expanded demonstration of the radio modules, antennas, filters, switches and radio components (the B-kit)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.144"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.144"
                                            },
                                            "Text": {
                                                "val": "Will leverage the radio reference architecture, specification and application program interfaces to begin software application development with commercial suppliers; begin in-house Army development of more sensitive application scenarios, such as applications that leverage coordinated control of communications and EW hardware resources to eliminate interference; mature reference architecture for RF hardware\/software convergence, addressing distribution of RF components across the vehicle; implement Vehicle Integration for C4ISR\/EW Interoperability (VICTORY) authentication and authorization component types into the RF hardware\/software convergence architecture; mature VICTORY compliant algorithms and complete development of a VICTORY compatible RF switch to direct RF signals between components, such as software defined radios, power amplifiers and antennas, based on radio provided information and other on-platform systems; provide a more realistic RF convergence demonstration, moving from a laboratory vehicle mock-up to an actual demonstrator vehicle, and with an expanded set of C4ISR applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR On-The-Move (OTM)"
                                    },
                                    "Description": {
                                        "val": "This effort provides a venue for the demonstration of new and emerging C4ISR technologies. This venue performs field based risk reduction (FBRR) and technical readiness assessments (TRAs) by evaluating the TRLs of candidate Army science and technology (S&T) and best of Industry efforts to support tactical network modernization. The yearly themes for the integrated capabilities event are determined by the maturity of the tech base programs across the Army S&T Command, Control, Communications, and Intelligence (C3I) portfolio. On an annual basis, those programs at or approaching TRL 6 will be solicited for participation based on their maturity to enter TRA in the FBRR environment located at Joint Base McGuire-Dix-Lakehurst (JB-MDL) (Fort Dix). Upon the completion of technology selection, themes will be developed that inform CERDEC Thrust Areas, Army Warfighting Challenges, TRADOC key technology imperatives, and the overall development of the Mission Command Network of 2025 and beyond. This effort transferred from PE 0603008A Project TR1 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.846"
                                            },
                                            "Text": {
                                                "val": "Assess and demonstrate early Operation-Intelligence network convergence concepts in a real field environment using a mix of S&T, Programs Of Record (PORs) and industry offerings to provide early performance feedback to S&T and PORs that rely upon robust tactical networks; apply field based risk reduction techniques to the integration of new S&T technologies as well as adapting\/adopting the best industry products to provide rigorously evaluated demonstrator systems for Soldier assessment; assess new S&T systems and provide data to determine the appropriate TRL to inform PORs preparing to transition these technologies to assure leadership has the right information to make critical acquisition decisions and provide technical risk reduction to assure that any issues are identified early enough to be corrected before formal testing; evaluate both Mission Command and Actionable Intelligence S&T products from a performance perspective and validate their TRLs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.849"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.849"
                                            },
                                            "Text": {
                                                "val": "Will assess, mature, and demonstrate early operations-intelligence network convergence concepts in a real field environment, provide early performance feedback to S&T programs that require robust tactical networks; apply FBRR techniques to the integration of new technologies developed by Army S&T as well as adapting\/adopting the best commercial products to provide rigorously evaluated systems for soldier assessment; assess and validate the performance of new S&T systems and provide data to determine the appropriate TRL to assure that leadership has the right information to make critical acquisition decisions; serve as a precursor event for S&T efforts that will later participate in Network Integration Evaluations to assure that problems are identified early enough to be corrected before further assessment.  This is in compliance with the Government Accountability Office recommendation for FBRR, citing that money can be saved by doing more \"early\" up front work to reduce risk, which is consistent with the mission of the C4ISR OTM effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communication Networking Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates components, software, algorithms and services that enable Army tactical wireless networks to operate more efficiently in both the use of RF spectrum and network resources for terrestrial and SATCOM systems. Efforts also include adapting commercial wireless technology for use in the tactical environment. Work accomplished under PE 0602782A\/project H92 and 0603794A EL5 complements this effort. This effort transferred from PE 0603008A\/project TR1 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.033"
                                            },
                                            "Text": {
                                                "val": "Investigate and mature tactical waveform protocols and architectures to support frequency hopping at timeslot boundaries using parameters chosen by the waveform software to improve radio network performance in a dynamic spectrum contested environment; continue to mature tactical multifunction waveform software, algorithms and techniques to optimize coordinated signal scheduling features that allow improved interoperability between RF functions such as communications and EW jamming; continue to mature and begin implementation of suitable routing protocols to increase performance of the network and develop and mature feasible approaches to enable networking in Global Positioning System (GPS)-denied environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.781"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.781"
                                            },
                                            "Text": {
                                                "val": "Will mature technologies, such as directional networking, narrowband voice and position\/location information capability, for robust ground communications with efficient use of spectrum in a spectrum contested environment; develop and integrate tactical multifunction waveforms for terrestrial radios enabling coordinated C4ISR\/EW functions that provide improved interoperability between RF functions, robust performance and spectrum efficiency; develop and mature software tools that simulate tactical networking conditions (i.e., latency, delay, jamming, cosite interference) to provide a high fidelity network modeling and simulation environment that enables large-scale tactical network analysis and data collection in realistic operational scenarios."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networking technologies for Wireless Personal Area Networks (WPAN)"
                                    },
                                    "Description": {
                                        "val": "This effort develops and matures WPAN technology for the Soldier in a manner approved by the National Security Agency (NSA) for up to Secret data traffic. This effort is coordinated with PE 0603001A\/Project J50. This effort transferred from PE 0603008A\/Project TR1 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Complete evaluations of WPAN system designs for performance, reliability and security; finalize specification and architecture development of WPAN hardware interfaces and software; inform WPAN standards for security and interface development; fabricate and code several candidate WPAN designs; validate WPAN designs for electromagnetic compatibility, low probability of intercept and low probability of detection in the laboratory and RF chamber; conduct field evaluations of selected design(s) on multiple Soldier Systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will mature and assess low cost small form factor Intra Soldier Wireless (ISW) personal communication system design for performance, reliability and security; implement hardware interfaces, software and standards for security for ISW communication systems; begin efforts to extend the ISW technologies to develop more efficient inter Soldier wireless capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EL5"
                    },
                    "ProjectTitle": {
                        "val": "Secure Tactical Information Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "14.587"
                        },
                        "BudgetYearOne": {
                            "val": "16.006"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.006"
                        },
                        "BudgetYearTwo": {
                            "val": "16.058"
                        },
                        "BudgetYearThree": {
                            "val": "18.715"
                        },
                        "BudgetYearFour": {
                            "val": "19.085"
                        },
                        "BudgetYearFive": {
                            "val": "19.467"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Efforts in this project were transferred from Program Element (PE) 0603008A Project TR2 beginning in Fiscal Year (FY) 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates software, algorithms and services that focus on tactical cyber situational awareness, autonomous network defense, cross domain security and encryption solutions to secure the Army's tactical network.  Efforts focus on configuration, operation, monitoring, defense and network reconstitution in bandwidth constrained tactical environments while reducing the operator workload required to conduct these functions.  This project codes, optimizes, and demonstrates software based technologies for intrusion detection, high assurance internet protocol (IP) encryption, seamless communications across security boundaries, as well as information sharing across operations and intelligence functions.  These capabilities to automate, protect, monitor, report and access cyber elements of the tactical network are intended to greatly reduce Soldier burden and protect the Army's tactical network by building upon enterprise solutions from commercial, Department of Defense, Department of the Army and other government agencies.  This project cumulatively builds science and technology capabilities in accordance with Army Cyber Material Development Strategy and the Office of the Secretary of Defense Cyber Community of Interest.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground Maneuver, Air and Soldier\/Squad portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications Electronics Research Development and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Defensive Cyber"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies that create new methods for proactively defending resource constrained tactical wireless networks against cyber attack using nontraditional methodologies. Work being performed under PE 0602782A\/Project H92, PE 0602783A\/Project Y10 and PE 0603794A\/Project EL4 complement this effort. This effort transferred from PE 0603008A\/Project TR2 in FY16."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.587"
                                            },
                                            "Text": {
                                                "val": "Integrate and mature software to provide a holistic cyber situational awareness picture offering actionable information for the Brigade network assurance team to quickly and accurately assess the cyber battle space, detect\/defend against known cyber weapons being employed against United States military assets, and enable network adaptation to ensure commander intent can be exercised in theater; design, fabricate, code and mature a reprogrammable logic single chip cryptographic engine which includes anti-tamper and security boundary technology (both information security functions and crypto engine) and complies with the National Security Agency Crypto Modernization Initiative and the Key Management Infrastructure Program of Record; assess, develop and mature novel network attack\/defense behavior models for tactical radio routing; mature and integrate novel tactical radio cyber behavior sensors to provide cyber situational awareness for military radio networks; perform analysis of current satellite communications (SATCOM) systems to determine the optimal integration path to achieve protected SATCOM architectures that will support protection methods aimed at hardening the modulation methods, software coding and component redundancy used in SATCOM systems; mature and optimize precision polarization concepts to optimize communications system security by employing multiple communications paths and bandwidth expansion techniques; perform modeling, simulation and emulation of network systems to assess performance in contested environments; design and develop security for network protocols."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.006"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.006"
                                            },
                                            "Text": {
                                                "val": "Will integrate and mature software tools tailored for the disadvantaged, intermittent and latent (DIL) tactical networking conditions that are sanctioned by NSA to increase software assurance posture while reducing time and cost of delivering secure software products to the tactical warfighter; integrate and mature robust software solutions to identify, prevent and protect role-based tactical systems from insider threats and malicious behaviors and actions; mature threat modeling to predict where and how attackers may react to a network maneuver, integrate and mature software tools and a framework to easily identify vulnerabilities during development and integration with third party software to detect potential vulnerabilities prior to the software being used on Army networks, implement and mature a software based encryption for low\/no size, weight, and power (SWaP) encryption on Army use devices, implement and mature anomaly detection modules to integrate sensors into tactical servers that currently do not support Host Based System Security to complement existing signature based protection capabilities to minimizing impact of zero day attacks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Electromagnetic Activity (CEMA) Situational Awareness (SA)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates software, architectures and frameworks in support of CEMA SA for both defensive and offensive cyber operations.  This effort is coordinated with PE 0602270A\/Project 906, PE 0602783A\/Project Y10, PE 0603008A\/Project TR1 and Project TR2 and PE 0603270A\/Project K15."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Will mature software that employs techniques for data sharing and collaboration between offensive and defensive cyber operations and across security boundaries to enable advanced warning of threats and coordinated defensive and offensive cyber response; develop and mature an integrated suite of analytic algorithms and software tools for blue\/gray\/red CEMA situation awareness; mature and optimize Defensive Cyber Operations (DCO) analytic algorithms and software tools to identify and correlate threats and attacks against Army tactical systems and networks; mature architectural specifications and interfaces for interconnection of cyber sensors, data management and visualization software capabilities, and analysis to inform ongoing DCO SA doctrinal and requirement generation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Public Key Infrastructure (PKI) and Cryptography"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates PKI and cryptographic technologies tailored for the tactical environment. Work being performed under PE  0602782A\/Project H92 and PE 0602783A\/Project Y10 complement this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Will develop software to provide Soldiers the ability to automate, monitor, manage, validate and implement public key infrastructure in tactical networks; integrate and mature software based encryption techniques sanctioned by NSA that are tailored for the DIL tactical networking conditions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}