{
    "id": "20108c194dbffa08914bb31257f4c5eebada3a72",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603003A"
        },
        "ProgramElementTitle": {
            "val": "Aviation Advanced Technology"
        },
        "R1LineNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "99.762"
            },
            "CurrentYear": {
                "val": "103.136"
            },
            "BudgetYearOne": {
                "val": "94.280"
            },
            "BudgetYearOneBase": {
                "val": "94.280"
            },
            "BudgetYearTwo": {
                "val": "100.731"
            },
            "BudgetYearThree": {
                "val": "100.699"
            },
            "BudgetYearFour": {
                "val": "102.706"
            },
            "BudgetYearFive": {
                "val": "118.032"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates manned and unmanned air vehicle technologies to enable Army aviation modernization.  Within this PE, aviation technologies are advanced and integrated into realistic and robust demonstrations.  Project 313 matures, demonstrates and integrates enabling component, subsystems and systems in the following areas: rotors, drive trains, structures and survivability.  Project 436 matures, integrates and demonstrates air launched weapons systems and mission equipment packages to enable control of unmanned systems.  Project 447 matures and demonstrates affordable and efficient engines.  Focus areas include: engines & drive trains; rotors & vehicle management systems; platform design & structures; aircraft & occupant survivability; aircraft weapons & sensors; maintainability & sustainability; and unmanned & optionally manned systems. A major effort in this PE is the Joint Multi-Role (JMR) Technology Demonstrator.  \n\nWork in this PE contributes to the Army Science and Technology (S&T) Air Systems portfolio and is related to and fully coordinated with PE 0602211A (Aviation Technology), PE 0603313A (Missile and Rocket Advanced Technology), PE 0603710A (Night Vision Advanced technology), and PE 0603270A (Electronic Warfare Technology).  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Aviation and Missile Research, Development, and Engineering Center(AMRDEC) with facilities located at Redstone Arsenal, AL; Joint Base Langley-Eustis, VA; and Moffett Field, CA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "102.950"
                },
                "CurrentYear": {
                    "val": "89.736"
                },
                "BudgetYearOne": {
                    "val": "94.280"
                },
                "BudgetYearOneBase": {
                    "val": "94.280"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "99.762"
                },
                "CurrentYear": {
                    "val": "103.136"
                },
                "BudgetYearOne": {
                    "val": "94.280"
                },
                "BudgetYearOneBase": {
                    "val": "94.280"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.188"
                },
                "CurrentYear": {
                    "val": "13.400"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "13.400"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.188"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "313"
                    },
                    "ProjectTitle": {
                        "val": "Adv Rotarywing Veh Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "70.043"
                        },
                        "CurrentYear": {
                            "val": "73.076"
                        },
                        "BudgetYearOne": {
                            "val": "80.948"
                        },
                        "BudgetYearOneBase": {
                            "val": "80.948"
                        },
                        "BudgetYearTwo": {
                            "val": "87.882"
                        },
                        "BudgetYearThree": {
                            "val": "88.707"
                        },
                        "BudgetYearFour": {
                            "val": "90.476"
                        },
                        "BudgetYearFive": {
                            "val": "105.558"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, demonstrates and integrates components, subsystems and systems for vertical lift and unmanned air systems that provide improved aircraft and occupant survivability, reduced maintenance and sustainment costs, and greater performance through improved rotors, drives, vehicle management systems and platform design and structures.  Systems demonstrated include rotors, drive trains, robust airframe structures and integrated threat protection systems.  A major effort in this project is the Joint Multi-Role (JMR) Technology Demonstrator in support of the Future Vertical Lift (FVL) family of aircraft.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy. \n \nWork in this project is performed by the Aviation Development Directorate of the Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Joint Base Langley-Eustis, VA, and the System Simulation Development Directorate, AMRDEC, Redstone Arsenal, AL.  Work in this project is coordinated with Program Executive Office Aviation (PEO Aviation) and PEO Intelligence, Electronic Warfare, and Sensors (PEO IEW&S)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircraft & Occupant Survivability Systems"
                                    },
                                    "Description": {
                                        "val": "This effort increases rotorcraft survivability by reducing platform signatures, providing the means to more efficiently counter enemy detection and tracking systems, and also increases protection to the aircraft and aircrew against ballistic munitions, crash landings, and post-crash fire events. This effort enhances air crew situational awareness, allowing manned\/unmanned aircraft to avoid enemy air threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.784"
                                            },
                                            "Text": {
                                                "val": "Integrated for flight demonstration purposes route planner software, common processing hardware, displays, and sensors onto a relevant aircraft platform; conducted system ground testing and a series of flight tests that quantified the capability of the hardware\/software to process data from threat sensors and display appropriate adjustments to the route plan; completed development and demonstration of a common software\/hardware interface to rapidly integrate survivability technologies onto aviation platforms; and demonstrated increased operational durability and total survivability through full-scale tests of combat tempered airframe, zero-vibration helicopter, durable main rotor, integrated crash protection system, and adaptive flight control laws."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.371"
                                            },
                                            "Text": {
                                                "val": "Complete full scale demonstration of Combat Tempered Platform Technology. Conduct platform system trades of vehicle hardening and aircraft\/occupant protection technologies with threat detection and route optimization for complex visual environments to optimize the total survivability of FVL concepts and mature integrated technology solution through analysis and incremental tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.073"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.073"
                                            },
                                            "Text": {
                                                "val": "Will continue platform system trades to develop an integrated platform solution optimized for improved survivability effectiveness, operational availability, weight, and cost.  Will mature integrated technology solutions that encompass susceptibility reduction, vulnerability reduction, operational durability, and reparability.  Will provide initial concepts for aircraft integration and system level demonstrations. Will continue to incorporate aircraft dynamic radar cross-section (RCS) signature information in real time route planner to fully exploit modern threat radar signal processing; will integrate open systems architecture compliant route planner software in a UH-60 Blackhawk and AH-64 Apache aircraft; will demonstrate route planner software in appropriate threat environment. Demonstration will include human-in-the-loop for assessing route planner aural detection algorithms and assessments using simulated radar threat systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotors & Vehicle Management Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the performance benefits of advanced rotors through the assessment of alternative designs aimed to satisfy future force capability needs for increased system durability, speed, range and payload.  This effort also integrates advanced flight controls with real-time aircraft state information into vehicle management systems to enable safe, low-effort maneuvering and real-time adaptation to aircraft state changes (degradation, damage, mission, etc.)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.292"
                                            },
                                            "Text": {
                                                "val": "Matured advanced Vehicle Management System (VMS) technologies. Demonstrated, via flight test, a system which more efficiently utilizes available vehicle data to improve system performance and reduce pilot workload across the range of Army rotorcraft with applicability to both the legacy fleet and the FVL fleet."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.505"
                                            },
                                            "Text": {
                                                "val": "Demonstrate integrated Rotors and Vehicle Management Technologies developed in PE 0602211A to reduce rotor loads, reduce hub and airframe drag, improve performance and validate high-fidelity computational models of complete rotorcraft for aerodynamics and structural dynamics in whirl stands and wind tunnels.  Conduct flight test demonstration of dual-lift control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.098"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.098"
                                            },
                                            "Text": {
                                                "val": "Will complete system trades and begin development of modernized Rotorcraft Aircrew Systems Concepts Airborne Laboratory (RASCAL), enabling integration and flight demonstration of cutting-edge vehicle management and flight control concepts and architectures for advanced rotorcraft configurations and operation in complex environments.  Will integrate and demonstrate efficient, low drag rotor and hub designs and technologies that mitigate the interactional aerodynamics issue affecting high speed operation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform Design & Structures Systems"
                                    },
                                    "Description": {
                                        "val": "Provide demonstration of advanced vertical lift aircraft system configurations that address FVL capability needs.  Determine optimum vehicle attributes that meet future force capability needs for increased system speed, range, payload, and reduced operating costs, facilitating preliminary detailed system design of multiple candidate systems.  Flight demonstrate operational capability of FVL technology demonstrators. Demonstrate an architecture standard and toolset that enables robust, effective, affordable and enduring mission system solutions for the FVL family of systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "46.985"
                                            },
                                            "Text": {
                                                "val": "Completed detailed design of Joint Multi-Role technology demonstrator concepts; matured final design drawings; provided cost\/weight analyses; conducted critical system design review; began component and subsystem fabrication and test; updated analytical tools; conducted the Joint Common Architecture (JCA) demonstration; refined the objective Mission Equipment Package (MEP) definition; defined an Architecture Centric Virtual Integration Process (ACVIP) for avionics architecture development; and completed version 1 of the JCA standard."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "57.810"
                                            },
                                            "Text": {
                                                "val": "Continue execution of the following for the JMR TD Program:  Air Vehicle demonstration efforts, JCA standard validation and implementation demonstrations, and Mission System Architecture Demo (MSAD) efforts.  Specific tasks for the Air Vehicle effort includes (for both flight vehicles):  complete fabrication of major air vehicle components; continue flight vehicle assembly; complete scaled wind tunnel tests and continue data reduction activities; develop and submit subsystem test plans, air vehicle ground test plan, and critical analytical results in support of the on-going airworthiness evaluation; complete fabrication of full scale subsystem test fixtures; initiate tests to reduce risks and develop airworthiness data; and develop and exercise flight control software in simulations and system integration labs (SILs).  Specific tasks for the MSAD effort include: issuance of Requests for Information (RFI) to refine the scope of the implementation demonstrations; continue development of the JCA standard including the functional decomposition of subsystem modules using both government and industry experts and government laboratory facilities; support the development of the model-based software tool with the System Architecture Virtual Integration effort; and conduct mission systems architecture implementation process demonstrations designed to mature tools, processes and technologies required for affordable and effective mission systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "55.476"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "55.476"
                                            },
                                            "Text": {
                                                "val": "Continue execution of the JMR TD air vehicle demonstration including air vehicle fabrication and assembly; subsystem, system, and full scale ground testing; and first flights.  Continue execution of MSAD including the Architecture Implementation Process Demo (AIPD) and initial efforts of the Capstone Demo to prove and develop the standards, processes, methods, and strategies required to produce an efficient, effective, and enduring open system architecture in future aircraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotorcraft Drive Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates advanced rotorcraft drive technologies with the potential to: increase the horsepower-to-weight ratio; reduce drive system noise; reduce production, operating and support costs; and provide automatic component impending failure detection. The drive system demonstrators for this effort will be applicable to current platforms and Future Vertical Lift platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.701"
                                            },
                                            "Text": {
                                                "val": "Completed final assembly of the full-scale drive system demonstrator hardware for UH-60 Blackhawk configurations; conducted full-scale testing to include endurance testing for reliability and over torque testing to validate material design parameters; and evaluated loss of lubrication capabilities through testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.013"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.013"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate design of advanced multi-speed drive train for advanced aircraft configurations under the Next Generation Rotorcraft Transmission program.  Maturation will enable greater aircraft speeds in platforms such as Future Vertical Lift."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintainability & Sustainability Systems"
                                    },
                                    "Description": {
                                        "val": "Mature and demonstrate technologies that improve the operational availability of rotorcraft while reducing operating and support (maintenance) costs.  Efforts include component sensing, diagnostics, prognostics, and control systems. Far-term objective is to enable transition to an ultra-reliable, low maintenance design approach that significantly reduces unscheduled maintenance, inspections, and operating and sustainment costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.281"
                                            },
                                            "Text": {
                                                "val": "Matured engine adaptive controls to optimize performance, component life, and maintenance schedule based on engine health; matured planetary gear failure detection technology, multifunctional aircraft sensor technology (to reduce number of sensors and system weight), and a drive system intermediate rating methodology; demonstrated technologies for assessing structural integrity of a primarily composite airframe; verified the integrity of composite repairs, and predicted the remaining useful life; and demonstrated in-flight real-time, automated methods to sense rotor system track and balance and make adjustments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.378"
                                            },
                                            "Text": {
                                                "val": "Mature wireless sensors for on-component processing of part health and usage history; demonstrate methodologies to allow for probability of failure predictions based on vehicle current state and anticipated mission; mature technologies to enable lighter weight designs through loads monitoring of critical components; mature and demonstrate technologies for component self assessment, usage tracking and embedded history; and mature embedded multifunctional sensors with built-in processing and communications.  Conduct developmental testing of system health and fault recognition algorithms, sensors and structural global health models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.785"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.785"
                                            },
                                            "Text": {
                                                "val": "Will complete demonstration of technologies and methodologies to enable more efficient designs and reduce the maintenance burden for future and current fleet vertical lift aircraft.  Demonstrations will improve system components' reliability, inevitably improving overall system reliability. Will complete demonstration of on-engine, adaptive engine controls to optimize performance, component life and maintenance schedule based on engine health. Will complete demonstration of in-flight, real-time, automated methods to adjust rotor system track and balance to reduce aircraft vibration and loads. Will complete demonstration of improved failure detection within a planetary system, a reduced size and weight impact of advanced sensor technologies, and a methodology to allow operations above maximum continuous rating for limited periods of time. Will complete demonstration of an autonomous condition assessment process for a composite airframe, and provide decision support for repair decisions with a repair integrity assessment approach. Will optimize a comprehensive integrated aircraft wide electrical system capability for diagnostics, fault isolation, and generate trendable health indicators.  Will improve the reliability criteria for design tools, methodologies, and materials to facilitate the optimization of future rotorcraft designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability for Degraded Visual Environment (DVE) Operations"
                                    },
                                    "Description": {
                                        "val": "Develop and mature advanced sensor cueing and flight controls to provide ability to maintain terrain and obstacle situational awareness during all DVEs both aircraft induced(brown-out & white-out) and environmentally induced (fog, rain, snow etc.).  Flight testing on fleet aircraft is an integral component of the demonstration. Work in this area is being done in coordination with efforts at U.S. Army Communications-Electronics Research, Development, and Engineering Center (CERDEC), Program Element (PE) 0603710A, Night Vision Advanced Technology.  The program presents an opportunity to North Atlantic Treaty Organization (NATO) nations, global industry, and academia to participate with their own assets in order to foster information exchange and collaboration."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.012"
                                            },
                                            "Text": {
                                                "val": "Conduct the first major milestone event of the DVE Mitigation (DVE-M) Demonstration Program, the DVE-M Flight Trials at Yuma Proving Ground, AZ.  The demonstration will be executed with a UH-60 aircraft that will host program developed modernized control laws (MCLAWS version 3), multi-modality sensor suites (two) and advanced cueing elements.  All modes of flight will be tested (take-off, en-route, landing) and numerous obstacle fields will be presented to the flight crew in order to assess overall DVE System performance, system capability and pilot workload."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.503"
                                            },
                                            "Text": {
                                                "val": "Will conduct second flight trial at NATO DVE Flight Trials event at Manching, GE. Test events to develop DVE knowledge in other critical environments such as rain, snow, and fog. Complex computing will leverage ongoing adjacent projects, particularly the Joint Common Architecture demonstration (JCA Demo); Will mature a government SIL that can test configurations prior to aircraft integration.  Will optimize integration of 3D aural and haptic cues with visual cues; will optimize distribution of visual cues between Panel Mounted Displays and Helmet Mounted Displays; will integrate cueing with sensors and flight controls for holistic DVE pilotage capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "436"
                    },
                    "ProjectTitle": {
                        "val": "Rotarywing MEP Integ"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.744"
                        },
                        "CurrentYear": {
                            "val": "8.444"
                        },
                        "BudgetYearOne": {
                            "val": "8.385"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.385"
                        },
                        "BudgetYearTwo": {
                            "val": "6.758"
                        },
                        "BudgetYearThree": {
                            "val": "5.847"
                        },
                        "BudgetYearFour": {
                            "val": "5.962"
                        },
                        "BudgetYearFive": {
                            "val": "6.081"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and validates man-machine integration and mission equipment software and hardware technologies for unmanned and optionally manned aircraft systems. Efforts focus on artificial intelligence, intelligent agents, cognitive decision aiding, sensors, avionics, communications, and pilot vehicle interfaces. This project improves the overall mission execution by demonstrating manned and unmanned system teaming, enhanced aircraft pilotage capability, improved crew workload distribution, and new capabilities for both manned and unmanned aircraft. This project supports Army transformation by providing mature technology to greatly expand the capabilities of unmanned aircraft, in current operating roles and future unmanned wingman roles. This project also develops, demonstrates and integrates manned and unmanned sensor and weaponization technologies such as advanced missiles, guns, fire controls, advanced target acquisition and pilotage sensors into Army aviation platforms.  Efforts are directed toward reducing the integrated weight of weapons, increasing engagement ranges, providing selectable effects on a variety of threats, and enabling cost-effective integration across multiple aviation platforms.  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aviation Development Directorate of the Army Aviation and Missile Research, Development and Engineering Center (AMRDEC), Joint Base Langley-Eustis, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned and Optionally Manned Systems"
                                    },
                                    "Description": {
                                        "val": "Mature and apply tactical behavior algorithms and safe-flight technologies to enable unmanned and optionally manned aircraft to maintain safe, responsive, flexible, and tactical formation flight with manned helicopters for unmanned wingman applications in re-supply, reconnaissance, surveillance and attack missions.  Develop, mature, apply, and integrate advanced decision aiding, autonomy, and human-machine interface technologies to enable the helicopter flight crew to make full use of the capabilities of an unmanned aerial system (UAS) without requiring continuous attention. Efforts include development of intelligent algorithms that aid decisions and actions in order to increase situation awareness, maximize use of on-board and off-board sensors, efficiently manage a team of manned and unmanned vehicles and their mission systems, and develop and execute effective and appropriate offensive and defensive responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.744"
                                            },
                                            "Text": {
                                                "val": "Completed implementation of aiding and autonomy algorithms into simulation; demonstrated task and mission effectiveness of interface devices and concepts, and aiding and autonomy algorithms; optimized approach for full integration of selected devices, concepts, and algorithms; and demonstrated a hierarchical structure of nested crew aiding and autonomy functions and evaluated the structure and functionality set for application across multiple Army aircraft, both current and future, and for suitability as the aiding\/autonomy domain of the Joint Common Architecture (JCA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.444"
                                            },
                                            "Text": {
                                                "val": "Demonstrate advanced autonomous behaviors in a virtual battle space to be integrated into a simulation facility to evaluate Manned\/Unmanned Teaming (MUM-T).   Integrate close proximity flight in a simulated environment and mature technology in preparation for a simulation demonstration.  Mature and demonstrate data fusion technologies of both on and off board sensors in a simulation environment.   Demonstrate advanced decision aiding technologies to aid an airborne mission commander to control both his or her own ship and a team of unmanned systems. Implement Future Airborne Capability Environment (FACE) conformance requirements to allow for ease of portability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.385"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.385"
                                            },
                                            "Text": {
                                                "val": "Will mature advanced autonomous behaviors for UAS, such as sensor guided flight.  Plan to transition technology to Program Management (PM) UAS.  This increased autonomy enables the UAS to perform functions that manned operators had to complete manually.  Will demonstrate the implementation of autonomous multi-UAS reconnaissance mission planning and execution.  Will continue to mature and demonstrate human machine interface and decision aiding to support MUM-T and allow the pilot to perform mission planning and control of multiple UAS aircraft, and the mission."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "447"
                    },
                    "ProjectTitle": {
                        "val": "ACFT Demo Engines"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.975"
                        },
                        "CurrentYear": {
                            "val": "8.216"
                        },
                        "BudgetYearOne": {
                            "val": "4.947"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.947"
                        },
                        "BudgetYearTwo": {
                            "val": "6.091"
                        },
                        "BudgetYearThree": {
                            "val": "6.145"
                        },
                        "BudgetYearFour": {
                            "val": "6.268"
                        },
                        "BudgetYearFive": {
                            "val": "6.393"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates power system technologies through design, fabrication, and evaluation of advanced engine components in order to improve the performance of turbine engines for vertical lift aircraft.  This project supports Army modernization by demonstrating mature technologies for lighter turbine engines that provide increased power, increased fuel efficiency, improved sustainability and reduced maintenance.  These advanced engine designs will significantly improve the overall aircraft performance characteristics and reduce the logistical footprint of vertical lift aircraft.    \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aviation Development Directorate of the Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC), at Joint Base Langley-Eustis, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future Affordable Turbine Engine (FATE)"
                                    },
                                    "Description": {
                                        "val": "Demonstrate an advanced, innovative 7000 horsepower class gas turbine engine that provides significant improvement in operational capability for current and future rotorcraft.  FATE uses sequential design and fabrication iterations to mature engine design and demonstrate significant reduction in specific fuel consumption (SFC), significant improvement in horsepower-to-weight ratio, and significant reduction in production and maintenance cost compared to year 2000 state-of-the-art engine technology.  The sequential design and fabrication process is as follows, respectively:  compressor subsystem, combustor subsystem, turbine subsystem, and mechanical systems.  Work in this project is coordinated with efforts in Program Element (PE) 0602211A, Project 47A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.975"
                                            },
                                            "Text": {
                                                "val": "Completed assembly\/instrumentation for first engine test. This initial, full engine, system level test validated the mechanical integrity of the advanced FATE architecture and provided data for an initial integrated performance assessment; initiated redesigned component tests in support of final goal engine build; and used results from first engine test to establish optimized component flow areas and variable geometry schedules."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.216"
                                            },
                                            "Text": {
                                                "val": "Complete fabrication of redesigned engine components and complete assembly, instrumentation, and testing of the final performance demonstration engine.  This full engine system level test validates the horsepower to weight ratio and specific fuel consumption goals of the advanced FATE architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Concept Engine (ACE)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates alternative, adaptive, and intelligent engine technologies to provide improved \/ mission-optimized performance, readiness, and affordability across an expanding engine envelope for increased operational capability for Army Aviation platforms.  The alternative concept engine technology demonstrations planned for this effort are applicable to current and future platforms including Unmanned Aerial Systems (UAS). Work in this project is coordinated with efforts in PE 0602211A, project 47A."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.947"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.947"
                                            },
                                            "Text": {
                                                "val": "Will provide preliminary design and perform detailed design efforts supporting planned engine level demonstration of alternative concept engine technologies.   Effort will build on knowledge gained under previous project A47A design activities and other Government agency research.  Research included investigation of innovative\/adaptive engine component technologies such as variable speed power turbine."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BA7"
                    },
                    "ProjectTitle": {
                        "val": "AVIATION ADVANCED TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.000"
                        },
                        "CurrentYear": {
                            "val": "13.400"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Aviation advanced technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Future Vertical Lift Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "14.000"
                                        },
                                        "Text": {
                                            "val": "This Congressional Add supported research for Future Vertical Lift technologies and concepts in support of the Joint Multi-Role Tech Demo Program."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "This Congressional Add supports research for Future Vertical Lift technologies and concepts in support of the Joint Multi-Role Tech Demo Program."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Helicopter Seat Improvements"
                                    },
                                    "Description": {
                                        "val": "Program increase"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Text": {
                                                "val": "This Congressional Add supports research for helicopter seat improvements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}