{
    "id": "2599cb3e1f746c42127a23bd1639d6b288809a95",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DARPA_U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602702E"
        },
        "ProgramElementTitle": {
            "val": "TACTICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "299.787"
            },
            "CurrentYear": {
                "val": "302.582"
            },
            "BudgetYearOne": {
                "val": "313.843"
            },
            "BudgetYearOneBase": {
                "val": "313.843"
            },
            "BudgetYearTwo": {
                "val": "381.964"
            },
            "BudgetYearThree": {
                "val": "370.283"
            },
            "BudgetYearFour": {
                "val": "403.688"
            },
            "BudgetYearFive": {
                "val": "407.797"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element is budgeted in the Applied Research Budget Activity because it supports the advancement of concepts and technologies to enhance the next generation of tactical systems.  The Tactical Technology program element funds a number of projects in the areas of Naval Warfare, Advanced Land Systems, Advanced Tactical Technology, Aeronautics Technology and Network Centric Enabling Technology.\n\nThe Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities such as improved situational awareness over large maritime environments, ship self-defense techniques, novel underwater propulsion modalities, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, and high bandwidth communications.\n\nThe Advanced Land Systems Technology project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  This project will also explore novel design technologies for the manufacture of ground vehicles and new tools for systems assessments of emerging DARPA technologies.\n\nThe Advanced Tactical Technology project focuses on broad technology areas including compact, efficient, frequency-agile, diode-pumped, solid-state lasers for infrared countermeasures, laser radar, holographic laser sensors, communications, and high-power laser applications.\n\nAeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion and vehicle concepts, sophisticated fabrication methods, and examination of novel materials for aeronautic system applications.\n\nThe Network Centric Enabling Technology project develops network-centric mission applications that integrate information arising from: 1) intelligence networks; 2) open and other external sources; 3) sensors and signal\/image processors; and 4) collection platforms and weapon systems.  Technical challenges include the need to process huge volumes of diverse, incomplete, and uncertain data streams in tactically-relevant timeframes.  The data processing efforts include: conditioning of unstructured data, content analysis, behavioral modeling, pattern-of-life characterization, economic activity analysis, social network analysis, anomaly detection, and visualization.  Operational benefits include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon.  Promising technologies are evaluated in the laboratory and demonstrated in the field to facilitate transition."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "299.734"
                },
                "CurrentYear": {
                    "val": "314.582"
                },
                "BudgetYearOne": {
                    "val": "386.540"
                },
                "BudgetYearOneBase": {
                    "val": "386.540"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "299.787"
                },
                "CurrentYear": {
                    "val": "302.582"
                },
                "BudgetYearOne": {
                    "val": "313.843"
                },
                "BudgetYearOneBase": {
                    "val": "313.843"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.053"
                },
                "CurrentYear": {
                    "val": "-12.000"
                },
                "BudgetYearOne": {
                    "val": "-72.697"
                },
                "BudgetYearOneBase": {
                    "val": "-72.697"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-12.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "9.182"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-9.129"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-72.697"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-72.697"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015:  Increase reflects reprogrammings offset by the SBIR\/STTR transfer.\nFY 2016:  Decrease reflects congressional reduction. \nFY 2017:  Decrease reflects completion of the Ground Experimental Vehicle program, the transition of the Endurance program to Budget Activity 3, and drawdown of the XDATA and Network Defense programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "TT-03"
                    },
                    "ProjectTitle": {
                        "val": "NAVAL WARFARE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "61.648"
                        },
                        "CurrentYear": {
                            "val": "52.128"
                        },
                        "BudgetYearOne": {
                            "val": "43.024"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.024"
                        },
                        "BudgetYearTwo": {
                            "val": "53.544"
                        },
                        "BudgetYearThree": {
                            "val": "64.765"
                        },
                        "BudgetYearFour": {
                            "val": "43.451"
                        },
                        "BudgetYearFive": {
                            "val": "53.451"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities such as improved situational awareness over large maritime environments, ship self-defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, and high bandwidth communications."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Arctic Operations Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.250"
                                        },
                                        "Text": {
                                            "val": "- Conduct additional study work on technologies to assure U.S. capability to achieve situational awareness in the Arctic."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-Submarine Warfare (ASW) Continuous Trail Unmanned Vessel (ACTUV)"
                                    },
                                    "Description": {
                                        "val": "The Anti-Submarine Warfare  (ASW) Continuous Trail Unmanned Vessel (ACTUV) program has three primary goals: (1) to build and demonstrate an experimental unmanned vessel with beyond state-of-the-art platform performance based on clean sheet design for unmanned operation; (2) demonstrate the technical viability of operating autonomous unmanned craft at theater or global ranges, from forward operating bases, under a sparse remote supervisory control model; and (3) leverage unique ACTUV characteristics to transition a game changing ASW capability to the Navy.  By establishing the premise that a human is never intended to step on board at any point in the operational cycle, ACTUV concepts can take advantage of an unexplored design space that eliminates or modifies conventional manned ship design constraints in order to achieve disproportionate speed, endurance, and payload fraction.  The resulting unmanned naval vessels must possess sufficient situational awareness and autonomous behavior capability to operate in full compliance with the rules of the road and maritime law to support safe navigation for operational deployments spanning thousands of miles and months of time.  When coupled with innovative sensor technologies, the ACTUV system provides a low cost unmanned system with a fundamentally different operational risk calculus that enables game changing capability to detect and track even the quietest diesel electric submarine threats.  Key technical areas include unmanned naval vessel design methodologies, ship system reliability, high fidelity sensor fusion to provide an accurate world model for autonomous operation, novel application of sensors for ASW tracking, and holistic system integration due to unique optimization opportunities of the ACTUV system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.100"
                                            },
                                            "Text": {
                                                "val": "-  Integrated software and hardware into the ACTUV platform.\n-  Initiated development of alternative payloads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete construction of prototype vessel.\n-  Initiate at-sea testing to validate baseline performance of vessel, sensor systems, and autonomy.\n-  Move the vessel from the contractor facility to a Navy facility in San Diego for long term testing - with the Office of Naval Research (ONR).\n-  Demonstrate improved situational awareness and autonomy capabilities, incorporating advanced above water sensors.\n-  Demonstrate the ability to successfully integrate new mission payloads, including a Mine Counter Measures (MCM) payload."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue vessel at-sea testing, including tactical exercises with fleet units.\n-  Continue testing of new payloads for MCM, ASW, and other missions.\n-  Transition custody of prototype vessel to the Navy (ONR)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Upward Falling Payloads (UFP)"
                                    },
                                    "Description": {
                                        "val": "The Upward Falling Payloads (UFP) program will develop forward-deployed unmanned distributed systems that can provide non-lethal effects or situational awareness over large maritime environments.  Building upon and complimenting concepts for maritime situational awareness and ISR developed under the DASH program, budgeted in PE 0603766E, Project NET-02, the UFP approach centers on pre-deploying deep-ocean nodes years in advance in forward operating areas which can be commanded from standoff to launch to the surface.\n\nAdvances in miniaturized sensors and processors, growth in the variety of unmanned systems, and advances in autonomy and networking all point toward highly capable, yet affordable, distributed systems.  However, power and logistics to deliver these systems in a timely manner in forward operating areas limit their utility.  The UFP program will remove this barrier to accelerate large-scale unmanned distributed missions.  The presumption is that a wider range of technology options and system solutions will emerge when the barriers to deployment are removed."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.955"
                                            },
                                            "Text": {
                                                "val": "-  Developed UFP nodes scalable in size, to enable extended survival at full depth.\n-  Demonstrated launch of a UFP surrogate payload from land and method for aerodynamically stable deployment of an unmanned aerial vehicle (UAV) from a UFP node.\n-  Initiated design of payload subsystems for sensing, communicating, and locating.\n-  Developed signaling scheme and performed sea test for long range underwater acoustic communications for triggering.\n-  Demonstrated integration of triggered release from surrogate underwater cabled system.\n-  Studied alternative communication modalities.\n-  Demonstrated surfacing of UFP balloon-node riser and deployment of small UAV."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.901"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate deep-ocean surfacing of scalable riser prototype to the surface and launch of payload surrogate from UFP node at surface.\n-  Demonstrate launch of a UFP surrogate payload after being submerged for several months.\n-  Demonstrate long-range acoustic communications sufficient to wake up a UFP node.\n-  Demonstrate launch of UAV from UFP node at surface."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop communications and ISR payloads for UFP nodes.\n-  Demonstrate complete launch of UAV from ocean depth.\n-  Integrate parafoil kite with submerged tow body.\n-  Integrate and demonstrate remote triggering of dormant UFP node.\n-  Conduct major integrated sea test at full depth."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Mobility"
                                    },
                                    "Description": {
                                        "val": "The goal of the Strategic Mobility program is to analyze and perform risk reduction on technology solutions which can enable rapid deployment of brigade- or even division- sized forces globally in a matter of just days.  Initially, the activity will focus on identifying high payoff logistics and deployment technologies, and understanding the deployment and sustainment architectures required to support these technologies.  The program will examine increased automation in logistics and distribution operations, new platform technologies for sea-based transportation and prepositioning, and technologies which could enable aerial delivery of forces to the vicinity of an objective area.  The Strategic Mobility program will then shift to a focused technology risk reduction activity designed to systematically address the principal risks for the highest payoff technology set.  The technologies developed by the program could enable a rapid strategic response capability, with rapid deployment and sustainment of substantial ground combat forces, even to very remote or austere locations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.727"
                                            },
                                            "Text": {
                                                "val": "-  Create time and cost model of brigade level deployment technologies and processes.\n-  Perform refined technology trade studies to identify critical component technology to aid in extremely rapid loading, unloading, and unpacking of transports and filling of requisitions to include building boxes\/pallets and loading of materials into containers.\n-  Initiate studies into foundation and structure required to enable reliable operation of robotic logistics systems in expeditionary environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete technology trade studies to identify critical component technologies to aid in extremely rapid loading and unloading of transports, unpacking of supplies from transports, and filling requisitions.\n-  Complete studies in foundation and structure required to enable reliable operation of robotic logistics systems in expeditionary environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Azimuth Defense Fast Intercept Round Engagement System (MAD-FIRES)"
                                    },
                                    "Description": {
                                        "val": "The Multi-Azimuth Defense Fast Intercept Round Engagement (MAD-FIRES) program seeks to develop a point defense system against today's most stressing threats by developing a highly maneuverable, medium caliber, guided projectile, fire sequencing and control system capable of neutralizing large threat raids of high speed, highly maneuverable targets.  Leveraging recent advancements in gun hardening, miniaturization of guided munition components, and long range sensors, MAD-FIRES will advance fire control technologies, medium caliber gun technologies, and guided projectile technologies enabling the multiple, simultaneous target kinetic engagement mission at greatly reduced costs.  MAD-FIRES seeks to achieve lethality overmatch through accuracy rather than size, thus expanding the role of smaller combat platforms into missions where they have been traditionally outgunned.  MAD-FIRES, sized as a medium caliber system, enhances flexibility for installment as a new system and as an upgrade to existing gun systems with applications to various domain platforms across a multitude of missions to include: ship self-defense, precision air to ground combat, precision ground to ground combat, counter unmanned air vehicles (C-UAV), and counter rocket and artillery and mortar (C-RAM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.343"
                                            },
                                            "Text": {
                                                "val": "-  Initiated technology development efforts focusing on guidance, packaging and delivery method.\n-  Began detailed subsystem design and plans for later stage risk reduction tests and prototyping.\n-  Began end-to-end modeling and simulation of all candidate designs to determine Point of Departure (POD) designs.\n-  Began examining candidate platforms for out-year live-fire tests.\n-  Completed government in-house feasibility and trade study.\n-  Conducted projectile wind tunnel testing to verify performance predictions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.500"
                                            },
                                            "Text": {
                                                "val": "-  Determine Point of Departure (POD) designs.  \n-  Complete end-to-end modeling and simulation of POD designs.\n-  Begin risk reduction tests and prototyping. \n-  Update models and simulations as designs are modified.\n-  Conduct risk reduction subsystem tests to verify gun hardening and performance.\n-  Perform unguided projectile flight tests to validate aerodynamic models and gun-launch survivability.\n-  Coordinate with Navy for integrated tests to include approved representative targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.024"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.024"
                                            },
                                            "Text": {
                                                "val": "-  Update models and simulations of select designs.\n-  Complete preliminary prototype design.\n-  Perform initial controlled projectile flight tests to assess projectile performance.\n-  Conduct fire control tests for target acquisition and tracking and interceptor projectile tracking."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "ACTUV"
                                    },
                                    "Title": {
                                        "val": "Office of Naval Research MOA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.000"
                                        },
                                        "CurrentYear": {
                                            "val": "7.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-04"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED LAND SYSTEMS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "57.521"
                        },
                        "CurrentYear": {
                            "val": "63.118"
                        },
                        "BudgetYearOne": {
                            "val": "52.847"
                        },
                        "BudgetYearOneBase": {
                            "val": "52.847"
                        },
                        "BudgetYearTwo": {
                            "val": "62.527"
                        },
                        "BudgetYearThree": {
                            "val": "68.518"
                        },
                        "BudgetYearFour": {
                            "val": "96.298"
                        },
                        "BudgetYearFive": {
                            "val": "101.298"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  This project will also explore novel design technologies for the manufacture of ground vehicles and new tools for systems assessments of emerging DARPA technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Experimental Vehicle (GXV)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Ground Experimental Vehicle (GXV) program is to investigate ground vehicle technologies that enable crew\/vehicle survivability through means other than traditional heavy passive armor solutions.  This will be accomplished through research and development of novel ground combat and tactical vehicle technology solutions that demonstrate significantly advanced platform mobility, agility, and survivability.  The focus of the GXV program will be on technology development across multiple areas to simultaneously improve military ground vehicle survivability and mobility.  Traditionally, survivability and mobility have to be traded against each other due to the reliance on heavy armor.  The GXV program seeks to break this trend.  Coupled with the development of technologies, the GXV program will define concept vehicles which showcase these developmental technologies.  A modeling and simulation effort will also be undertaken to understand the vehicle design trade space for the concept vehicles using the developmental technologies and to illustrate how these vehicles might be used operationally in combat scenarios.  Technology development areas are likely to include increasing vehicle tactical mobility, survivability through agility, and crew augmentation, though other relevant technologies may also be pursued."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.601"
                                            },
                                            "Text": {
                                                "val": "-  Initiated GXV technology development efforts.\n-  Began developing parametric models for evaluating military utility of technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue GXV technology development efforts focused on increasing mobility, survivability through agility and crew augmentation.\n-  Mature parametric models for evaluating military utility of technologies.\n-  Complete studies focusing on system trades relating to system power requirements, size\/caliber of weapon systems, and crew size. \n-  Complete studies focusing on the impact of crew augmentation capabilities on the size and cognitive workload of combat vehicle crews. \n-  Conduct survivability analysis of individual concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Squad X"
                                    },
                                    "Description": {
                                        "val": "The U.S. military achieves overmatch against its adversaries in certain regimes; however, this level of overmatch is not enjoyed at the squad to individual dismounted warfighter level.  The goal of the Squad X program is to leverage advances in real-time situational awareness and mission command; organic three-dimensional dismount mobility; extended range tracking, targeting, and response; and unmanned mobility and perception in order to create a squad with substantial combat overmatch.  The concept of overmatch at the squad level includes increased human stand-off, a smaller force density, and adaptive sensing to allow for responses at multiple scales.  Squad X will explore advanced wearable force protection, advanced organic squad level direct and indirect trajectory precision weaponry, and non-kinetic precision capabilities.  The end result of the Squad X program is an individual dismount unit outfitted with sensors, weaponry, and supporting technology to achieve unit level overmatch as well as the overall integration of unmanned assets alongside the dismounts to create a new Hybrid Squad unit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.500"
                                            },
                                            "Text": {
                                                "val": "-  Initiated technology development efforts, focusing on squad precision effects, non-kinetic engagement, enhanced sensor fusion and exploitation, and squad collaborative autonomy.\n-  Completed initial integration and architecture trade studies.\n-  Initiated squad architecture, technology evaluation, and experimentation studies.\n-  Initiated development of virtual, constructive, and live experimentation plan; defined modeling and simulation strategy.\n-  Initiated development of virtual test bed.\n-  Conducted Tactical Edge Standards Boards (TESBs) and service-level operational workshops."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "31.118"
                                            },
                                            "Text": {
                                                "val": "-  Complete systems architecture, technology evaluation, and experimentation trade studies.\n-  Conduct Squad X Baseline experimentation, through virtual and live experiments to obtain a system performance baseline.\n-  Refine technology development efforts focusing on squad precision effects, non-kinetic engagement, enhanced sensor fusion and exploitation, and squad collaborative autonomy.\n-  Implement modeling and simulation environment to allow for an overarching iterative design process and obtain system performance estimation.\n-  Leverage Squad X testbed and simulation environments to iteratively assess developed technology and architecture schemes.\n-  Demonstrate initial individual technology capabilities in technology assessments.\n-  Conduct Tactical Edge Standards Boards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.847"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.847"
                                            },
                                            "Text": {
                                                "val": "-  Leverage Squad X testbed and simulation environments to iteratively assess developed technology and architecture schemes.\n-  Leverage virtual testbed to provide predictions of system performance in multiple operational conditions.\n-  Complete Squad X Baseline experimentation.\n-  Initiate planning for system-level experimentation and evaluation in relevant conditions with operational units.\n-  Demonstrate individual technology capabilities for squad precision effects, non-kinetic engagement, enhanced sensor fusion and exploitation, and squad collaborative autonomy in operational environment.\n-  Initiate technology development efforts focusing on human machine interfaces and the squad common operating picture.\n-  Initiate squad-system development efforts focusing on the development of automatic systems to increase squad performance and the integration of previously developed technologies and enhancing for dismounted operations.\n-  Conduct Tactical Edge Standards Boards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Unmanned Air Systems (C-UAS) and Force Protection (CFP)"
                                    },
                                    "Description": {
                                        "val": "The Counter Unmanned Air Systems (C-UAS) and Force Protection (CFP) program will examine advanced detection, tracking, and system defeat capabilities to counter emerging threats posed against U.S. military forces.  Key research will include an analysis of system threat phenomenologies where non-state and state actors seek to leverage asymmetries by employing small unmanned systems and other threats to include rocket propelled grenades, anti-tank munitions, and indirect fires.  The program will consider technologies supporting U.S. ground, air, and maritime operations.  Central research and development will factor in analysis of advanced sensor integration, detection, and weapons engagement capabilities within operationally relevant environments (urban, tactical, and strategic domains)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform trade studies for a systems approach.\n-  Conduct operational analysis and technology maturity assessments to determine the minimum set of critical system attributes and technology advances required for C-UAS and CFP."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Infantry"
                                    },
                                    "Description": {
                                        "val": "The Mobile Infantry (MI) program will explore the development of a system-based, mixed team of mounted\/dismounted warfighters, and semi-autonomous variants of platforms.  The MI system concept will allow for a combined set of mounted and dismounted operations and for a larger area of operations over more aggressive timelines than standard infantry units.  To improve operational effectiveness of the warfighter teams when dismounted, the semi-autonomous platforms, when unmanned, act as multipliers to the squad, such as extended and mobile fire support platforms and allow the MI mixed teams to perform higher risk exposure and access missions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete trades of mission\/vignette-driven collaborative command and control of a MI unit composed of a warfighter team and semi-autonomous systems.\n-  Complete trade studies and initial estimates of perception and autonomous algorithms required to match vignettes.\n-  Complete trade studies of candidate platforms and options for conversion, system integration, interfaces (electrical, mechanical, software, etc.), and define preliminary warfighter architectures to leverage."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate technology development efforts for critical perception and autonomous algorithms to enable semi-autonomous systems to act as force multipliers for warfighter team.\n-  Initiate technology development efforts for critical collaborative behavior algorithms to enable semi-autonomous systems to cooperatively execute missions without human interaction.\n-  Initiate technology development efforts for critical technologies to enable effective command and control of manned and unmanned warfighter team."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics Fast Track"
                                    },
                                    "Description": {
                                        "val": "To be dominant in robotics of the future, the DoD will need to embrace programs designed to create disruptive advances in robotics capabilities that are measured in months rather than years, and whose individual costs may largely be measured in thousands of dollars rather than millions.  The Robotics Fast Track program seeks to revolutionize robotics technologies by promoting non-traditional technical opportunities.  The program will create low-cost, high-utility robotic component solutions that result in prototype systems and proofs of concept in months.  The Robotics Fast Track program will engage numerous robotics related efforts across the spectrum of robotics professionals and enthusiasts, extending the existing performer base.  The program will demonstrate the ability for robotics projects to be performed at an asymmetric advantage in time, cost, and contribution of the efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Began execution of multiple performance developments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue execution of multiple performance developments.\n-  Release initial robotics fast track catalog.\n-  Host transition workshops to facilitate follow-on developments with other U.S. government entities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics Challenge"
                                    },
                                    "Description": {
                                        "val": "The Robotics Challenge program sought to boost innovation in autonomous systems and expand platform utility through enhanced actuation, energy density, perception, locomotion, agile reconfiguration, and design efficiency.  Program thrusts were centered on a progressive regimen of physical problem solving, real-time team oriented tasks, and dynamic adaptation designed to build \"machine trust\", especially when integrated with humans in a variety of operational environments.  The Robotics Challenge program consisted of a series of obstacle course style challenge events that focused on technology solutions to demonstrate and test robot capabilities for disaster response.  The program drove advances in power systems, agility and speed, precision in perception tied to platform coordination, dexterity, and impulsive power.  Program objectives focused on technologies to expand mobility and extend endurance of unmanned platforms, advanced tactile and manipulation capabilities, and tools for cost effective design, validation, and construction of autonomous technology, and human-robot interaction.  The 6.3 portion of this program was budgeted in PE 0603766E, Project NET-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.920"
                                            },
                                            "Text": {
                                                "val": "-  Conducted the DARPA Robotics Challenge Finals.\n-  Performed analysis and reported findings to document advancements achieved as a result of the challenge."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-06"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED TACTICAL TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.861"
                        },
                        "CurrentYear": {
                            "val": "13.468"
                        },
                        "BudgetYearOne": {
                            "val": "6.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.500"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project focuses on broad technology areas including compact, efficient, frequency-agile, diode-pumped, solid-state lasers for a variety of applications including infrared countermeasures, laser radar, holographic laser sensors, chemical sensing, communications, and high-power laser applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Laser Ultraviolet Sources for Tactical Efficient Raman (LUSTER)"
                                    },
                                    "Description": {
                                        "val": "The Laser Ultraviolet Sources for Tactical Efficient Raman (LUSTER) program is developing a compact semiconductor laser that emits in the deep UV (i.e., wavelength < 250 nanometers (nm)) and is capable of an output power of 1 Watt (W) with high efficiency and spectral purity suitable for a wide array of spectroscopy applications.  Such an achievement will represent a significant advance over the state of the art, as existing lasers in this wavelength range are bulky, highly inefficient, and expensive, as there are no available semiconductor lasers that can emit in the UV range < 250 nm.  LUSTER will leverage lessons learned in growing high quality light emitting material from the Compact Mid-Ultraviolet Technology (CMUVT) program.  The compact size of semiconductor lasers along with the LUSTER performance goals will enable many applications including but not limited to standoff Raman spectroscopy which is of interest for DoD applications such as chemical agent sensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated low loss thulium doped tellurite fibers for use in amplification of blue emission.\n-  Demonstrated high quality quantum well material that exhibited optically pumped UV emission in the 220-240 nm range.\n-  Initiated the design and growth of laser epitaxial material, focusing on low-defect growth, optimal electrical and optical confinement, and methods for high efficiency and power operation.\n-  Evaluated methods for using non-linear crystals to efficiently convert longer wavelength lasers in the 500 nm range down to the 250 nm range and identified Beta Barium Borate (BBO) as best performing non-linear optical crystal."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Optimize laser epitaxial material, electron-beam source, and frequency multiplying nonlinear crystals for higher efficiency and high power operation.\n-  Develop compact low power electronics for driving and controlling photonic and mechanical components.\n-  Demonstrate working prototype of a deep UV laser system that meets the Phase 1 metrics of > 100 mW output power, 0.4% total system efficiency and line width less than 0.1 nm."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a deep UV laser system that meets the Phase 2 metrics of > 1 W output power, 10% total system efficiency, line width less than 0.01 nm and size < 2 in^3."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Endurance"
                                    },
                                    "Description": {
                                        "val": "The Endurance program will develop technology for pod- or internally-mounted lasers to protect airborne platforms from emerging and legacy electro-optical\/infrared (EO\/IR) guided surface-to-air missiles.  The Endurance system will be a completely self-contained laser weapon system brassboard in an open architecture configuration.  The focus will be on miniaturizing component technologies, developing high-precision target tracking, identification, and lightweight agile beam control to support target engagement.  The program will also focus on determining the laser irradiance and dwell time required to defeat both emerging and legacy missile threats.  The advanced technology component of this program is budgeted in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.161"
                                            },
                                            "Text": {
                                                "val": "-  Spectrally combined the output of four kW-class, near perfect beam quality fiber lasers in a packaged compact, rugged spectral beam combiner.\n-  Achieved the objective high-speed slew and settle rates for the beam director (BD) with an inertial surrogate of the preliminary BD design.\n-  Developed a concept for robust high-precision tracking of threat missiles throughout the engagement.\n-  Initiated a live-fire test plan in conjunction with all the stakeholders (Government test team, performer, target logistics, range support, range safety and environmental offices, laser clearing house, etc.)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.468"
                                            },
                                            "Text": {
                                                "val": "-  Conduct effects testing on an available surrogate of the seeker of a larger class of threat EO\/IR guided surface-to-air missile to verify estimated lethality criteria and anchor lethality models.\n-  Complete a live-fire test plan in conjunction with all the stakeholders (Government test team, performer, target logistics, range support, range safety and environmental offices, laser clearing house, etc.).\n-  Conduct key risk reduction experiments to support the design of robust, high-precision tracking.\n-  Demonstrate robust, high-precision tracking against multiple low-speed surrogate targets at representative angular line-of-sight rates and ranges.\n-  Partially-package high-power laser for pod-integration testing.\n-  Fabricate and test smallest high-power beam director and control system yet demonstrated."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "International Space Station SPHERES Integrated Research Experiments (InSPIRE)"
                                    },
                                    "Description": {
                                        "val": "The International Space Station SPHERES Integrated Research Experiments (InSPIRE) program utilized the DARPA-sponsored Synchronized Position, Hold, Engage, and Reorient Experimental Satellites (SPHERES) platform, which has flown onboard the International Space Station (ISS) since May 2006, to perform a series of multi-body formation flight experiments that necessitate a medium-duration zero-gravity environment.  InSPIRE enhanced the ability to rapidly mature and insert new technologies into national security space assets.  The InSPIRE program expanded on the capabilities matured through SPHERES by developing, building, and launching new hardware and software elements that expand the baseline capabilities.  These capabilities will enable use of SPHERES as a testbed for more complex experimentation, providing affordable opportunities to test new space technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "-  Launched the new docking ports for SPHERES to enhance rendezvous and docking test capabilities.\n-  Conducted on-orbit testing of new SPHERES docking ports.\n-  Developed and executed additional rendezvous and proximity operations experiments using SPHERES inside ISS."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-07"
                    },
                    "ProjectTitle": {
                        "val": "AERONAUTICS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "50.245"
                        },
                        "CurrentYear": {
                            "val": "31.621"
                        },
                        "BudgetYearOne": {
                            "val": "62.876"
                        },
                        "BudgetYearOneBase": {
                            "val": "62.876"
                        },
                        "BudgetYearTwo": {
                            "val": "95.361"
                        },
                        "BudgetYearThree": {
                            "val": "62.424"
                        },
                        "BudgetYearFour": {
                            "val": "51.434"
                        },
                        "BudgetYearFive": {
                            "val": "42.434"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Aeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion and vehicle concepts, sophisticated fabrication methods, and examination of novel materials for aeronautic system applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircrew Labor In-cockpit Automation System (ALIAS)"
                                    },
                                    "Description": {
                                        "val": "The Aircrew Labor In-cockpit Automation System (ALIAS) program will design, develop, and demonstrate a kit enabling affordable, rapid automation of selected aircrew functions across a broad range of aircraft.  ALIAS intends to enable reduction of aircrew workload and\/or the number of onboard aircrew to improve performance.  The program will develop hardware and software to automate select aircrew functions and will employ novel, low impact approaches to interface with existing aircraft monitoring and control systems.  The program will also develop tractable approaches to rapidly capture crew-station specific skills and aircraft unique behaviors.  To accomplish this, ALIAS will leverage recent advances in perception, manipulation, machine learning, reusable software architectures, autonomous systems architecture, and verification and validation.  ALIAS will culminate in a demonstration of the ability to rapidly adapt a single system to multiple aircraft and execute simple missions.  This reliability enhancement capability will enable new operational concepts for reuse of existing air assets and allow a reduction in the number of aircrew required."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.284"
                                            },
                                            "Text": {
                                                "val": "-  Designed and commenced prototyping of an initial ground-based ALIAS system.\n-  Initiated simulator-based demonstration of complete automation system including training and adaptation of system to multiple crew member roles.\n-  Conducted ground and airborne risk reduction testing and demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.621"
                                            },
                                            "Text": {
                                                "val": "-  Perform ground demonstration of ALIAS system mission functionality.\n-  Conduct flight demonstration of contingency management and new command interface.\n-  Demonstrate portability to new aircraft type.\n-  Continue risk reduction activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.876"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.876"
                                            },
                                            "Text": {
                                                "val": "-  Conduct flight demonstration of perception and actuation subsystems.\n-  Perform ground demonstration of portability timeline into other aircraft.\n-  Initiate airworthiness evaluation for integrated flight demonstration.\n-  Initiate the transition of select knowledge acquisition, perception, and interface technologies to operational aircraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aeronautics Technologies"
                                    },
                                    "Description": {
                                        "val": "The Advanced Aeronautics Technologies program will examine and evaluate aeronautical technologies and concepts through applied research.  These may include feasibility studies of novel or emergent materials, devices and tactics for both fixed and rotary wing air vehicle applications, as well as manufacturing and implementation approaches.  The areas of interest range from propulsion to control techniques to solutions for aeronautic mission requirements.  The result of these studies may lead to the design, development, and improvement of prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiated new studies of novel technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform modeling of concepts and architectures.\n-  Conduct trade studies of emerging concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform testing of enabling technology components.\n-  Initiate conceptual system designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gremlins"
                                    },
                                    "Description": {
                                        "val": "The goal of the Gremlins program is to develop platform technologies that enable a new class of distributed warfare.  The Gremlins concept envisions small air-launched unmanned systems that can be responsively dispatched in volley quantity from commodity platforms, fly into contested airspace, conduct a moderate duration mission, and ultimately be recovered.  Key enabling technologies for the concept include smaller developmental payloads that benefit from multiple collaborating host platforms.  The Gremlins program will conduct risk reduction and development of the host platform launch and recovery capability and develop and demonstrate a recoverable UAV platform concept.  Enabling platform technologies will include precision relative navigation, advanced computational modeling, variable geometry stores, compact propulsion systems, and high speed digital flight control.  The program will leverage these technologies, perform analytic trade studies, conduct incremental development, and ultimately demonstrate the potential for an integrated air-launched Gremlins unmanned platform."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct exploratory trade studies to establish feasibility of technical approaches.\n-  Initiate studies on integration with existing Service systems and systems architectures.\n-  Conduct system concept design tradeoff analyses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate engineering of integrated demonstration concepts.\n-  Conduct system and subsystem risk reduction test planning.\n-  Develop objective system concepts and mission capability projections.\n-  Complete Preliminary Design Review for demonstration system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Swarm Challenge"
                                    },
                                    "Description": {
                                        "val": "The goal of the Swarm Challenge is to develop autonomous swarming algorithms for Unmanned Vehicles (UxVs) to augment ground troops performing missions in a complex environment, without creating a significant cognitive burden.  The program will evaluate the effectiveness of swarming for UxVs supporting ground operations, air operations, maritime operations, undersea operations, or search and rescue operations.  Challenges include the ability for the UxV to collaborate to rapidly survey an area leveraging other UxVs to solve problems related to, for example, perception, decision making, or obstacle clearing.  The challenge emphasizes minimum operator training and supervision so that the operator can continue to perform his\/her normal duties while using UxVs as force multipliers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed trade studies for system approach.\n-  Select architecture for software, communication, computation, perception, and simulation environment.\n-  Develop autonomous algorithms and associated software."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "21st Century Propellants"
                                    },
                                    "Description": {
                                        "val": "The 21st Century Propellants program will examine new classes of solid propellants capable of affording solid fueled rockets the ability to perform in a greater range of operating scenarios.  The program will provide current and future missile systems the flexibility in speed-range combinations unachievable in current solid propellants and will reduce current volume and weight forms for smaller rocket systems.  Successful propellant systems for this program must demonstrate a controlled burn rate, restart capability, termination control, improved safety, and a dramatically improved shelf life (>15 years).  The program will also address critical issues of safer manufacturing (improved operational handling, transportability issues, and improved environmental impact).  Advanced manufacturing methods are of special interest because they can assure reproducibility and can support building custom propellant grains for different rocket systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate new studies of novel technologies.\n-  Conduct risk reduction tests of candidate technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vertical Take-Off and Landing (VTOL) Technology Demonstrator"
                                    },
                                    "Description": {
                                        "val": "The Vertical Take-Off and Landing (VTOL) Technology Demonstrator program will demonstrate revolutionary improvements in (heavier than air) VTOL air vehicle capabilities and efficiencies through the development of subsystem and component technologies, aircraft configurations, and system integration.  The program will build and flight test an unmanned 10,000 - 12,000 lb aircraft capable of sustained speeds in excess of 300 kt, demonstrate system level hover efficiency within 25% of the ideal power loading, and a lift-to-equivalent drag ratio no less than ten.  Additionally, the demonstrator will be designed to have a useful load of no less than 40% of the gross weight with a payload capacity of at least 12.5% of the gross weight.  A strong emphasis will be placed on the development of elegant, multi-functional subsystem technologies that demonstrate net improvements in aircraft efficiencies to enable new and vastly improved operational capabilities.  In FY 2016, VTOL Technology Demonstrator will be funded in PE 0603286E, Project AIR-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.961"
                                            },
                                            "Text": {
                                                "val": "-  Initiated preliminary design of configuration and all subsystems.\n-  Held system definition reviews to evaluate subsystem integration into air vehicle design and technology development paths to meet program objectives.\n-  Performed subscale wind tunnel and laboratory testing for aerodynamic data base and flight controls development.\n-  Refined power generation and distribution\/integration concepts.\n-  Performed propulsion and power system scaled model bench testing.\n-  Designed and developed subscale flight models for configuration viability and control law validation.\n-  Fabricated and began ground testing of subscale model in preparation for flight testing in FY 2016.\n-  Validated computational performance predictions against empirical data.\n-  Refined full scale engine integration design.\n-  Created detailed system integration plans.\n-  Prepared detailed airworthiness and flight test preparation requirements in support of the subscale flight test schedule."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Petrel"
                                    },
                                    "Description": {
                                        "val": "The Petrel program investigated advanced capabilities for the rapid transport of large quantities of cargo and equipment, such as during the deployment of a heavy brigade combat team, from CONUS to the battlefield, reducing the deployment timeline for mechanized land forces and critical supplies anywhere in the world to under seven days at a price point comparable or slightly in excess of conventional sealift."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigated component technologies with potential to enable specific concepts, including advanced propulsion and materials.\n-  Explored innovative approaches for significantly increasing lift to drag ratio.\n-  Evaluated approaches to rapidly deliver cargo and equipment directly from offshore to the battlefield without infrastructure."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-13"
                    },
                    "ProjectTitle": {
                        "val": "NETWORK CENTRIC ENABLING TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "115.512"
                        },
                        "CurrentYear": {
                            "val": "142.247"
                        },
                        "BudgetYearOne": {
                            "val": "148.596"
                        },
                        "BudgetYearOneBase": {
                            "val": "148.596"
                        },
                        "BudgetYearTwo": {
                            "val": "170.532"
                        },
                        "BudgetYearThree": {
                            "val": "174.576"
                        },
                        "BudgetYearFour": {
                            "val": "212.505"
                        },
                        "BudgetYearFive": {
                            "val": "210.614"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Network Centric Enabling Technology project develops applications that integrate information arising from: 1) intelligence networks; 2) open and other external sources; 3) sensors and signal\/image processors; and 4) collection platforms and weapon systems.  Technical challenges include the need to process huge volumes of diverse, incomplete, and uncertain data in tactically-relevant timeframes.  The data processing efforts include: conditioning of unstructured data, content analysis, behavioral modeling, pattern-of-life characterization, economic activity analysis, social network analysis, anomaly detection, and visualization.  Operational benefits include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon.  Promising technologies are evaluated in the laboratory and demonstrated in the field to facilitate transition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "XDATA"
                                    },
                                    "Description": {
                                        "val": "The XDATA program is developing computational techniques and software tools for analyzing large volumes of data, both semi-structured (e.g., tabular, relational, categorical, metadata, spreadsheets) and unstructured (e.g., text documents, message traffic).  Central challenges addressed include a) development of scalable algorithms for processing imperfect data in distributed data stores, and b) creation of effective human-computer interaction tools for facilitating rapidly customizable visual reasoning for diverse missions.  The program has developed open source software toolkits that enable flexible software development supporting users processing large volumes of data in timelines commensurate with mission workflows of targeted defense applications.  An XDATA framework supports minimization of design-to-deployment time of new analytic and visualization technologies on diverse distributed computing platforms, and also accommodates changing problem spaces and collaborative environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.217"
                                            },
                                            "Text": {
                                                "val": "-  Developed methods for interactive, iterative, and distributed analysis of diverse data at petabyte scale.\n-  Optimized analytic methods and software for implementation on heterogeneous platforms and operating environments.\n-  Optimized visualization technology to rapidly adapt to new missions and contexts.\n-  Demonstrated the initial implementation of a rich library of software tools for rapid use in mission and user specific contexts.\n-  Demonstrated end-to-end systems on data and problems of users from DoD, intelligence, and law enforcement communities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.917"
                                            },
                                            "Text": {
                                                "val": "-  Develop methods and software for interactive, iterative, distributed analysis of diverse data enabling transition, integration and implementation on heterogeneous platforms.\n-  Develop new analytic methods for distributed data and systems through the development of enhanced machine learning and algorithmically scalable methods.\n-  Develop a scalable, robust framework for user-defined, adaptable visualizations.\n-  Develop, test and benchmark a library of user interfaces which provide a consistent user experience independent of scale or processor heterogeneity.\n-  Demonstrate that applications deployed from a library of interfaces reduce design to testing time and increase reusability of components across multiple mission systems and user-defined requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.896"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.896"
                                            },
                                            "Text": {
                                                "val": "-  Develop integrated applications from components and interface libraries demonstrating flexible adaptation to emergent user requirements and ad-hoc tasking.\n-  Optimize software components and integrated applications to allow seamless integration into a user enterprise or mission environment.\n-  Transition end-to-end systems, components, platforms and operating environments to identified user communities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Defense"
                                    },
                                    "Description": {
                                        "val": "The Network Defense program is developing technologies to detect network attacks using network summary data. U.S. computer networks are continually under attack, and these attacks are typically handled by individual organizations as they occur.  Analyzing network summary data across a wide array of networks will make it possible to identify trends and patterns visible only when the data is viewed as a whole and to detect recurring threats, patterns of activity, and persistent vulnerabilities.  Network Defense is developing novel algorithms and analysis tools that enable a big picture approach for identifying illicit behavior in networks.  This analysis and subsequent feedback to system administrators, security engineers, and decision makers will enhance information security in both the government and commercial sectors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.500"
                                            },
                                            "Text": {
                                                "val": "-  Enhanced network analytics to detect structured attacks across multiple networks.\n-  Created general purpose algorithms for detecting novel classes of attacks across multiple networks.\n-  Developed methods for identifying persistent vulnerabilities within a network and across multiple networks.\n-  Evaluated and optimized techniques on realistic network data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "31.002"
                                            },
                                            "Text": {
                                                "val": "-  Develop algorithms that use scanning events to provide indications and warning of coordinated adversary activities.\n-  Enhance persistent vulnerability detection techniques and work with potential users to identify vulnerabilities particular to individual organizations\/networks and\/or shared by multiple organizations\/networks.\n-  Demonstrate the capability to use summary information about an attack on one network to automatically detect similar attacks on other networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.500"
                                            },
                                            "Text": {
                                                "val": "-  Optimize algorithms that detect anomalous behaviors and coordinated adversary activities through exercises using summary data and on-site evaluations.\n-  Demonstrate the capability to anticipate specific attack formats on one network based on attacks observed on other similar networks.\n-  Perform comprehensive test and evaluation of the multiple detection algorithms developed to produce quantitative understanding of probabilities of detection and false alarm and receiver operating characteristic curves for important classes of attacks.\n-  Transition capabilities to U.S. government, defense industrial base organizations\/networks, and other U.S. commercial companies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Memex"
                                    },
                                    "Description": {
                                        "val": "The Memex program is developing the next generation of search technologies to revolutionize the discovery, organization, and presentation of domain-specific content.  Current search technologies have limitations in search query format, retrieved content organization, and infrastructure support and the iterative search process they enable is time-consuming and inefficient, typically finding only a fraction of the available information.  Memex is creating a new domain-specific search paradigm to discover relevant content and organize it in ways that are more immediately useful to specific missions and tasks.  In addition, Memex domain-specific search engines will extend the reach of current search capabilities to the deep web and non-traditional content.  Memex technologies will enable the military, government, and commercial enterprises to find and organize mission-critical information on the Internet and in large intelligence repositories.  Anticipated mission areas include counter-terrorism, counter-drug, anti-money-laundering, and anti-human-trafficking, with transition partners from DoD and other U.S. government activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.338"
                                            },
                                            "Text": {
                                                "val": "-  Developed initial domain-specific search engines to automatically discover, access, retrieve\/extract, parse, process, analyze, and manage web content in specified domains.\n-  Implemented the base capabilities to index the surface, deep, and dark web and non-traditional structured and unstructured content that is dynamically-generated, unlinked, and in unconventional formats.\n-  Developed information extraction techniques to categorize and classify discovered content based on mission\/user task requirements.\n-  Developed dynamic, interactive, and collaborative user interface capabilities to support the needs of specialized users.\n-  Developed search techniques optimized for queries performed for anti-human-trafficking investigations and provided these to law enforcement to support case development and criminal prosecution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.300"
                                            },
                                            "Text": {
                                                "val": "-  Develop specialized search techniques for information discovery in networks of illicit activity.  \n-  Develop advanced content discovery, deep crawling, information extraction, and information relevance algorithms to support domain specific search.\n-  Integrate and evaluate multiple end-to-end operational prototypes with automated, user, and team guided methods for web content analysis.\n-  Conduct system evaluation with feedback from operational partners and transition mature capabilities for use in operational settings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.700"
                                            },
                                            "Text": {
                                                "val": "-  Develop advanced domain search techniques and methods across the data pipeline (domain specification, crawlers, extractors, indexing, search, analytics, and visualization) that are domain agnostic, highly adaptable, and rapidly deployed.\n-  Develop integrated applications from Memex components demonstrating reduced time and increased flexibility of standing up new domain specific search capabilities with highly effective user experience.\n-  Transition software components and integrated systems, and demonstrate enhanced support for partner missions.\n-  Establish and develop software and user communities around open source components and applications to ensure tool sustainment, software evolution, and long-term operational use."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Battle Management (DBM)"
                                    },
                                    "Description": {
                                        "val": "The Distributed Battle Management (DBM) program will develop mission-driven architectures, protocols, and algorithms for battle management (BM) in contested environments.  The military is turning to networked weapons and sensors on-board a heterogeneous mix of multi-purpose manned and unmanned systems.  In contested environments, it is a challenge for BM networks to communicate with subordinate platforms due to extensive adversarial cyber and electronic warfare operations, anti-satellite attacks, and the need for emissions control in the face of a formidable integrated air defense system.  The Distributed Battle Management program will seek to develop a distributed command architecture with decentralized control of mission-focused asset teams.  The architecture will enable rapid reaction to ephemeral engagement opportunities and maintain a reliable BM structure, despite limited communications and platform attrition in continuously evolving threat environments.  The program will incorporate highly automated decision making capability while maintaining vital human-on-the-loop operator approval."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.024"
                                            },
                                            "Text": {
                                                "val": "-  Developed detailed system architecture for the distributed battle management system.\n-  Developed workflow and Concepts of Operations (CONOPS) for the human operator to interact with the battle management system.\n-  Developed and prototyped the protocols and algorithms for distributed battle management in a denied environment.\n-  Stood-up modeling and simulation capability for test and performance evaluation and began testing of prototype architecture and algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.440"
                                            },
                                            "Text": {
                                                "val": "-  Identify and further research the most promising planning concepts, situation understanding concepts, and systems integrator.\n-  Complete design of the overall DBM system, to include architecture, software components, CONOPS, and integration strategy for expected host platforms.\n-  Implement initial version of the integrated DBM system architecture, algorithms, and software.\n-  Demonstrate initial version's capabilities in a simulated battle environment with impaired communications and loss of critical resources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Update DBM algorithms and architecture based on experimentation to support complex contested environments. \n-  Continue development of the DBM human-machine interface for battle management platforms and tactical platforms.\n-  Demonstrate integrated DBM capabilities in live, virtual, and constructive simulations.\n-  Conduct software flexibility tests to demonstrate the ability to insert software upgrades without disrupting the BM structure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantitative Crisis Response (QCR)*"
                                    },
                                    "Description": {
                                        "val": "*Previously Quantitative Methods for Rapid Response (QMRR)\n\nThe Quantitative Crisis Response (QCR) program develops and applies big data analysis and visualization methodologies to better understand the true nature of non-traditional threats, track the effectiveness of remedial measures, and develop\/optimize alternative strategies.  Recently we have seen the rise of extremely challenging non-traditional threats including illicit networks of (human) traffickers and infectious diseases like Ebola. To counter illicit networks it is important to detect their activities, which often take place on the dark web, and derive their command and control structure.  Infectious disease contagion presents a somewhat different challenge, specifically, finding patterns in the spread of the disease and factors that favor\/mitigate its propagation.  There is also interest in quantitative methods for countering the proliferation of weapons of mass terrorism.  QCR will be coordinated with and transitioned to multiple national security agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.600"
                                            },
                                            "Text": {
                                                "val": "-  Developed quantitative models to track the impact of Ebola on a population, with emphasis on social and economic factors.\n-  Developed advanced content discovery, deep crawling, information extraction, and information relevance algorithms to support search, analysis and visualization of collected information.\n-  Coordinated with stakeholders in national security agencies and developed mechanisms for transitioning technology to operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.588"
                                            },
                                            "Text": {
                                                "val": "-  Refine quantitative models, content discovery, deep crawling, information extraction, and information relevance algorithms to support search, analysis and visualization of collected information.\n-  Generalize mechanisms and harden collection and processing architectures to respond to rapid re-direction of system resources and apply developed models, processes and methods to other areas of national security interest.\n-  Develop dynamic, interactive, and collaborative user interface capabilities to support the needs of users.\n-  Develop quantitative models to discover indicators of possible proliferation of weapons of mass terrorism."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.500"
                                            },
                                            "Text": {
                                                "val": "-  Integrate collection architectures, analytic models, processes and methods into operational prototypes. \n-  Evaluate multiple end-to-end operational prototypes with automated, user, and team guided methods for web content analysis and visualization.\n-  Conduct system evaluation with feedback from operational partners and transition mature capabilities for use in operational settings.\n-  Develop algorithms for extracting trace signals from large data sets to enable tracking potential proliferation of weapons of mass terrorism."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Media Forensics (MediFor)"
                                    },
                                    "Description": {
                                        "val": "The Media Forensics (MediFor) program will create technologies for analyzing diverse types of content and media to determine their trustworthiness for military and intelligence purposes.  Current approaches to media forensics are manpower intensive and require analysts and investigators to undertake painstaking analyses to establish context and provenance.  MediFor will develop, integrate, and extend image and video analytics to provide forensic information that can be used by analysts and automated systems to quickly determine the trustworthiness of open source and captured images and video. Technologies will transition to operational commands and the intelligence community.  This program was previously funded in PE 0603767E, Project SEN-03."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.729"
                                            },
                                            "Text": {
                                                "val": "-  Formulated approaches for automatically detecting when image and video files have been altered or manipulated.\n-  Collected images and videos and manually manipulated a subset for training and evaluation of the technology.\n-  Initiated development of techniques for detecting inconsistent observations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop advanced techniques for media fingerprinting and the ability to search large repositories for content produced by the same device.\n-  Define processes and practices for the scientific grounding of integrity of visual media, including detection of pixel level manipulations and inconsistencies in shadows\/illumination and motion\/trajectories.\n-  Develop cross media representations of semantic content in image and video sources and techniques to indicate where the sources reinforce or contradict each other.\n-  Collect and manipulate additional images and videos for evaluation and training of algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop approaches for countering evolving media editing technologies.\n-  Develop approaches to detect manipulation in noisy, degraded and highly compressed media.\n-  Develop means to fuse knowledge from the various technology components and inference engines to determine the relation between manipulation and the intended application.\n-  Develop an integrated platform with Graphical User Interfaces (GUIs) for operator communication."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Science of Human and Computer Teaming"
                                    },
                                    "Description": {
                                        "val": "The Science of Human and Computer Teaming program will develop and demonstrate data-driven approaches for the formation and training of teams comprised of humans and computers.  Conventional approaches to military personnel selection, role assignment, and training are optimized for individual performance, but military operations are typically performed by teams, and future teams are likely to also include autonomous systems that use artificial intelligence (AI) to sense, reason, learn, and interact.  Behavioral scientists are studying the performance of groups across diverse sets of tasks and developing performance assessment techniques for group work.  Interesting early results suggest that groups exhibit a form of intelligence beyond that of the individual members, and that group intelligence has social correlates.  Computer scientists are looking at ways in which humans may team with computers to achieve superior levels of performance.  Such human-computer teams have shown great promise in highly structured competitive domains such as chess.  Realizing this promise in free-form (battlefield) environments will require intuitive, low-latency, high-bandwidth, human-computer interfaces that enable computers to be better teammates. The program will identify individual characteristics predictive of performance of mixed human-computer teams; develop techniques for measuring these characteristics in military personnel; demonstrate the capability to select, assign roles, and train human-computer teams with performance superior to that of human-only teams formed and trained using current methods; and develop an understanding of how to structure human-computer teams for superior performance on military missions such as cyber defense and intelligence analysis."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop group psychometrics concepts applicable to human-computer teams.\n-  Identify individual characteristics that are readily measured and are predictive of individual performance in human-computer teams assigned specific military task types.\n-  Develop quantitative approaches for creating high-performing human-computer teams through the inclusion of individuals and computers\/autonomous systems with complementary characteristics.\n-  Develop human-computer-interface design principles that optimize the contribution made by computer-based teammates to human-computer team performance. \n-  Formulate human-machine teaming strategies for military missions such as cyber defense and intelligence analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Predicting Complex Operational Environments"
                                    },
                                    "Description": {
                                        "val": "The Predicting Complex Operational Environments program expands on prior work in the XDATA program and will develop advanced modeling, analysis, simulation, and visualization tools to enable command staffs to rapidly and effectively plan and manage missions in complex operational environments.  The U.S. military increasingly operates in remote and unstable parts of the world where mission success depends heavily on cooperation with and among a wide variety of stakeholder groups.  These groups typically include host nation government organizations, local civilian groups, and non-governmental organizations each of which has priorities, sensitivities and concerns that may differ significantly.  Economic disruptions can add great urgency to these considerations, as shortages of water and food directly impact theater security and may even lead to war.  Current mission planning and plan assessment\/adaptation technologies do not adequately model the inherent uncertainties.  Addressing this challenge will require the creation of new semantic techniques that automatically generate, update, and prune alternative hypotheses as they become more or less likely given incoming data streams.  The program will create computational models that represent the most significant dynamics and uncertainties of the operational environment including political, military, economic, and social factors.  These will enable command staffs to develop and assess potential courses of action at multiple levels of granularity and time scales, and to quickly adapt to changing situations in complex operational environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Formulate computational models for political, military, economic, and social factors in complex operational environments to support military planning and plan assessment\/adaptation at multiple levels of granularity and time scales.  \n-  Create semantic techniques that automatically generate, update, and prune alternative hypotheses as they become more or less likely given incoming data streams."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop dynamical systems models for projecting and predicting the interactions between diverse stakeholder groups that may have differing priorities, sensitivities and concerns. \n-  Develop displays for rapidly visualizing and evaluating likely outcomes of alternative U.S. courses of action. \n-  Implement models for operational environments and run initial simulations that would be required to support military planning and plan assessment\/adaptation. \n-  Introduce models that capture the impact of natural and human-mediated perturbations, such as water shortages, crop failures, and hoarding of critical resources, on theater security. \n-  Develop machine-reading and automated model assembly techniques to enable prediction of the theater security ramifications of natural resource shortages and economic disruptions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visual Media Reasoning (VMR)"
                                    },
                                    "Description": {
                                        "val": "The Visual Media Reasoning (VMR) program created technologies to automate the analysis of enemy-recorded photos and videos and to identify, within minutes, key information related to the content.  This included identification of individuals within the image (who), enumeration of the objects within the image and their attributes (what), and determining the image's geospatial location and time frame (where and when).  Large data stores of enemy photos and video are available but cannot be easily leveraged by a warfighter or analyst attempting to understand a specific new image in a timely fashion.  The VMR program developed technology to enable users to gain insights rapidly through application of highly parallelized image analysis techniques that can process the imagery in massive distributed image stores.  VMR technology serves as a force-multiplier by rapidly and automatically extracting tactically relevant information and alerting the analyst to scenes that warrant the analyst's expert attention."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.104"
                                            },
                                            "Text": {
                                                "val": "-  Included mechanisms for technical users to add new computer vision algorithms to the system.\n-  Provided a quantified level of performance to show the advantage of multi-algorithm reasoning versus a single-algorithm approach.\n-  Delivered robust full-featured Version 1.0 to National Media Exploitation Center (NMEC), FBI, AFRL, and other Government agencies as transition products."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}