{
    "id": "2d0f37f68be104f48a07ea7669482773359f8f9e",
    "meta": {
        "filename": "dod-2017_RDTE_2017_TJS_U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0204571J"
        },
        "ProgramElementTitle": {
            "val": "Joint Staff Analytical Support (JSAS)"
        },
        "R1LineNumber": {
            "val": "167"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "8.601"
            },
            "PriorYear": {
                "val": "4.915"
            },
            "CurrentYear": {
                "val": "5.983"
            },
            "BudgetYearOne": {
                "val": "7.464"
            },
            "BudgetYearOneBase": {
                "val": "7.464"
            },
            "BudgetYearTwo": {
                "val": "6.363"
            },
            "BudgetYearThree": {
                "val": "5.751"
            },
            "BudgetYearFour": {
                "val": "5.751"
            },
            "BudgetYearFive": {
                "val": "5.751"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Staff Analytical Support (JSAS) family of programs provides defense analytical support capabilities for the Joint Staff (TJS) and Combatant Commands (CCMDs).  JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulates the results to best assist the Chairman in fulfilling his statutory responsibilities.  Key deliverables provided by JSAS include wide-ranging force structure assessments, course of action development for the Joint Force environment, analyses and studies to aid in decision-making, and other analysis efforts to implement timely, low-cost initiatives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.321"
                },
                "CurrentYear": {
                    "val": "7.673"
                },
                "BudgetYearOne": {
                    "val": "5.812"
                },
                "BudgetYearOneBase": {
                    "val": "5.812"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.915"
                },
                "CurrentYear": {
                    "val": "5.983"
                },
                "BudgetYearOne": {
                    "val": "7.464"
                },
                "BudgetYearOneBase": {
                    "val": "7.464"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.406"
                },
                "CurrentYear": {
                    "val": "-1.690"
                },
                "BudgetYearOne": {
                    "val": "1.652"
                },
                "BudgetYearOneBase": {
                    "val": "1.652"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.017"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-1.673"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.652"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.652"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY2015 Carryover"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.406"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Addition of the Global Force Management (GFM) Data Initiative Enterprise Force Structure (EFS) Integration project to provide critical upgrades to GFM mission applications to meet CCMD and warfighter requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Future Joint Force Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.018"
                        },
                        "PriorYear": {
                            "val": "4.392"
                        },
                        "CurrentYear": {
                            "val": "5.983"
                        },
                        "BudgetYearOne": {
                            "val": "5.564"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.564"
                        },
                        "BudgetYearTwo": {
                            "val": "5.763"
                        },
                        "BudgetYearThree": {
                            "val": "5.751"
                        },
                        "BudgetYearFour": {
                            "val": "5.751"
                        },
                        "BudgetYearFive": {
                            "val": "5.751"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Staff Analytical Support (JSAS) program supports the Chairman of the Joint Chiefs of Staff US US Code Title 10, Subtitle A, Part I, Chapter 5, Section 153 statutory responsibilities that directs the analytical support, management, development, evaluation, and implementation of joint concepts.  The Joint Concepts Program provides management capabilities and analytical support for the Joint Staff, Combatant Commands, and Services to execute the Joint Concepts Program.    Key deliverables include:  CJCSI 3010 Guidance for Development and Implementation of Joint Concepts; a comprehensive view of the future operating environment; identification of joint concepts necessary to address future operating environment challenges and achieve objectives of the National Military Strategy; evaluation and testing of joint concepts; and implementation of joint concepts into DOTMLPF in order to advance the operational effectiveness of the future Joint Force and enable the introduction of new capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future Joint Force Development"
                                    },
                                    "Description": {
                                        "val": "FY 2015 efforts focused on supporting the President’s “Sustaining U.S. Global Leadership Priorities for the 21st Century Defense” with emphasis on concept assessment of the Chairman’s Capstone Concept for Joint Operations, implementing the Joint Operational Access Concept, and developing new operational concepts to support achievement of the NMS. Specific work focused on joint concept development, implementation, and assessment through the Iron Crucible Wargaming series resulting in joint capability gap analysis and recommendations for non-materiel solutions that will improve current and future joint force capability including operating in anti-access and area denial environments, joint command & control, counterterrorism, and defeating threats in all domains, including cyber."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.392"
                                            },
                                            "Text": {
                                                "val": "Specific work focused on developing, implementing, and evaluating joint concepts.  The CJCS approved four new joint concepts that were completed and began implementation planning in FY 2015:  Joint Concept for Rapid Aggregation, Joint Concept for Electromagnetic Spectrum Operations, Joint Concept for Logistics version 2.0, and Joint Concept for Health Services.  Seven Joint Concepts were initiated and will be completed in FY16:  Joint Concept for Cyberspace, Joint Concept for Preventing the Use or Transfer of WMD, Joint Concept for Human Aspects in Military Operations, Joint Concept for Access and Maneuver in the Global Commons, Joint Concept for Robotic and Autonomous Systems, Joint Concept for Operating in the Information Environment, and Joint Concept for Integrated Campaigning.  The FY15 update of the Joint Operational Access Implementation Plan was completed and approved by the CJCS in August 2015 and work has begun on the FY16 update.  An update of two key joint force development documents were initiated:  the CJCS’s Capstone Concept for Joint Operations that describes the vision for how joint forces will operate in the future and guides all joint force development; and the DJ-7’s Joint Operating Environment that describes military joint force challenges based on the anticipated future security environment of 2035.  An update of the CJCSI 3010 began with expected completion in FY 2016.  Twelve joint concepts were archived after extensive staffing and approval by the DJS during Phase I of a legacy concept review.  Fourteen joint concepts are under review for archiving in FY 2016 as part of Phase II of a legacy concept review.\n\nThe draft Joint Concept for Robotics and Autonomous Systems was evaluated in an analytic workshop as part of the concept development process, and produced refined ideas to shape the Department’s approach to the impact of robotics and autonomous systems to Joint Warfighting over the next 20 years.\nAs a result of concept assessment of the Chairman’s Capstone Concept for Joint Operations, feedback was provided to inform DoD decision making on Goldwater-Nichols Act reviews including that Senior leaders require integrated processes to develop and implement global crisis-response options, anticipate cross-CCMD challenges, assess risk, make timely resource allocation decisions, integrate special capabilities, and communicate strategic priorities.      \n\nSpecific results:\n\n- recommended re-examining above CCMD C2 measures to support global decision-making during high-demand multi-AOR crises.  This TTX also developed ways to accelerate logistics planning and improve feasibility of CCDR estimates prior to the CJCS\/SECDEF review.  \n- suggest global synchronization is impacted at two levels: (1) above CCMD through strategic guidance, authorities, resource allocation, and risk assessment; and (2) across-CCMD through access, force sharing, information sharing, and the harmonizing of actions.  This SLS deliberated the challenges in force management, pre-conflict cross-CCMD coordination, shared battle rhythms, and supported\/supporting command relationships.  \n- identified ways to integrate Defense and National Intelligence systems for more effective collection management and more agile ISR and PED resource management.  Initiatives seek improved asset awareness across the globe, better management tools, and expanded force management authorities.  IB 15-3 results provide timely information to DoD leadership as they consider changes to the Unified Command Plan (UCP) and other ways to overcome global ISR challenges.\n\nIMPACTS:  The IRON CRUCIBLE Series influences senior leaders’ perspectives on global synchronization and continues to expand DoD understanding of critical requirements for global agility and global synchronization.  Event reports and writings on global agility have impacted senior Department leaders and contribute to the narrative on innovation and efficiencies in the 2015 NMS.  The Series has produced 30 recommendations for force development in the areas of policy, doctrine, and training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.983"
                                            },
                                            "Text": {
                                                "val": "Concept Development work will focus on completing the update of the Capstone Concept for Joint Operations and the Joint Operating Environment.  Seven joint concepts started in FY 2015 will be completed and submitted for CJCS approval.  Implementation planning for the seven joint concepts will be initiated.  The CJCSI 3010 will be updated and approved with improved terminology and process descriptions to guide joint concept development and implementation standards and practices across the Department of Defense.  Additional legacy joint concepts will be archived in FY 2016 based on extensive collaboration with the joint concept community and approval by the Director, Joint Staff (DJS).\n\nConcept Assessment efforts will assess multiple joint concepts against future challenges, and support ongoing actions for joint concept transition.  This work will be shaped by the learning needs from joint concept sponsors.  The proposed campaign includes three lines of effort, an initial workshop to refine learning needs, and a final workshop to review findings and develop recommendations for joint force development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.564"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.564"
                                            },
                                            "Text": {
                                                "val": "Assess the Family of Joint Concepts based on the Capstone Concept for Joint Operations and identify new concepts that are needed to address the challenges of the future operating environment.  Continue implementing approved joint concepts in order to advance the operational effectiveness of the future Joint Force and enable the introduction of new capabilities.  Conduct IRON CRUCIBLE Series events to assess the body of ideas in joint concepts aligned to senior leader priorities including focus on Russia, China, North Korea, Iran and ISIS, hybrid or gray zone conflict, cyberspace and robotics and autonomous systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Concept development performance metrics are derived from the Chairman’s Title 10 responsibilities and CJCSI 3010.02D Guidance for Development and implementation of Joint Concepts and, as such, support the purpose of informing the Department’s senior leadership by examining military problems and providing an azimuth for future force development. As a component of the overall Joint Force Development system, concept development and implementation products or processes are highly qualitative in nature; there are few strong quantitative performance measures in proposing new operational approaches, whether a concept is achievable, or if they inform decisions on joint capabilities. The follow metrics apply to the role of Joint Concepts in the Joint Strategic Planning System:\n\nPerformance measure 1 - Identify concepts that must be developed to support defense needs and priorities. Metrics: Process is complete. Product is on time. Analysis is thorough. \n\nPerformance measure 2 – Develop Joint Concepts assigned by CJCS and General Officer Steering Committee. Metric: Central idea and principles inform leadership and capability assessments.\n\nPerformance measure 3 – Conduct assessments that support implementation of approved Joint Concepts. Metrics: assessments and wargames inform or guide materiel and non-materiel capability development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P002"
                    },
                    "ProjectTitle": {
                        "val": "Global Force Management Data Initiative (GFM DI)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.583"
                        },
                        "PriorYear": {
                            "val": "0.523"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Staff Analytical Support (JSAS) family of programs provides defense analytical support capabilities for the Joint Staff (TJS) and Combatant Commands (CCMDs).   JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulates the results to best assist the Chairman in fulfilling his statutory responsibilities.   Under the umbrella of analytical support tools are the Automated Global Force Management Tool (AGT) and the Collaborative Issue Resolution Tool (CIRT), both which will meet requirements set forth in Title 10 U.S.C. and the Unified Command Plan (UCP) for automating the Global Force Management Implementation Guidance Forces For (Assignment and Apportionment) tables.  Additionally, the Joint Organizational Server (JOS) will be the enabler system for Joint Staff personnel to be entered, near-real-time, into the automated Forces For Process.\n\nRDT&E efforts for GFM DI ends in FY2015."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Global Force Management Data Initiative (GFM DI)"
                                    },
                                    "Description": {
                                        "val": "RDT&E funds for the Global Force Management (GFM) program will enable the Assignment, Allocation, and Apportionment functions for forces to meet the requirements set forth in Title 10 U.S.C. and the Unified Command Plan (UCP).  The development of the Secretary of Defense's \"Forces for Unified Commands\" Memorandum Assignment Tables has historically been a labor intensive staffing process conducted annually.  The automated GFM Toolset is the first downstream consumer of force structure data resident in the seven organization (org) servers that are made available by the GFM Data Initiative (DI) effort.  CIRT has streamlined force management, increased common understanding of force assignment, and supported timely force management decisions.  The objective is to automate the generation of the Global Force Management Implementation Guidance (GFMIG) and Forces For Unified Commands (Forces For) Assignment, Apportionment, and Allocation tables.  These efforts will flatten, streamline, and automate the current process while providing high fidelity data and transparency, and enhance Combatant Commander risk assessment to operational plans.  The Joint Organizational Server (JOS) will be the enabler system for Joint Staff personnel to be entered, near-real-time, into the automated Forces For Process.  Failure to fund for this effort negatively impacts the ability of the Services, CCMDs, Joint Staff (JS) and Office of the Secretary of Defense (OSD) to efficiently manage force structure resources."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.523"
                                            },
                                            "Text": {
                                                "val": "Finalize the AGT for Assignment and Apportionment functions to meet GO\/FO Staffing cycle event for AGT verification testing.  Enable full Joint Operations Capability for two-way interface with individual service management systems and OSD servers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Specific performance metrics are being developed."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "GFM DI Enterprise Force Structure (EFS) Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.900"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.900"
                        },
                        "BudgetYearTwo": {
                            "val": "0.600"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "GFM DI Enterprise Force Structure (EFS) Integration effort provides the next steps for GFM Mission Application enhancements intrinsic to balancing Global Force Demand against the Total Military Force. This is complex, multi-variant and requires modernized technologies that must provide integrated information by linking authoritative force structure data (derived from the GFM DI Organizational Servers) to C2 data (resident in GFM Mission Applications).  The Joint Staff Operations Directorate (J3) is the functional leader for GFM Allocation and GFM Mission Applications.  Accordingly, TJS will employ a joint strategy for efficiently fulfilling Enterprise Force Structure (EFS) data utility.\n\nThe DoD must quickly transition from legacy systems that promulgate data disparity across the Defense enterprise in order to meet the National Military Objectives that have evolved from large force scenarios to operations that include small-to-full scale activities. As stated in both the NSS and NMS, our adversaries demonstrate the ability to adapt to kinetic or non-kinetic terrain. Consequently, Information Technology (IT) superiority, capabilities, and recognition of associated vulnerabilities are an operational imperative. Yet, warfighters, strategic planners and GFM decision makers are unable to seamlessly exchange information in a manner that keeps pace with globally changing threats to rapidly and accurately accomplish force sourcing activities to support SecDef allocation decisions. TJS is mandated to utilize the Service Org Server (OS) Enterprise Force Structure (EFS) data to enhance managing, assessing, and displaying the worldwide disposition of U.S. forces. Key deliverables include incrementally developed, operationally realistic capability enhancements focused on Resource-Informed Planning and GFM sourcing functionality required by JROCM 111-14, the Capability Development Document (CDD) for Global Force Management Data Initiative (GFM DI); JROCM 073-13, Joint Command and Control (JC2) Capability Definition Package (CDP); Joint Operation Planning Process (JOPP) and Assessment CDP; and Force Planning & Deployment Planning\/Execution CDP."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Critical upgrades to GFM Mission Applications directly supporting Enterprise Force Structure (EFS) Integration."
                                    },
                                    "Description": {
                                        "val": "The GFM Mission DI EFS Integration effort requires RDT&E funds to upgrade GFM Mission Applications in order to ensure GFM DI Next Steps Allocation Implementation is achieved. This addresses the final phases for the GFM DI effort that was formerly started within the Joint Staff Analytical Support (JSAS) family of programs; specifically the Assignment and Apportionment functions and development of the Automated GFM Tool (AGT) that streamlined the SECDEFs \"Forces for Unified Commands\" Memorandum Assignment Tables. RDT&E efforts for Assignment and Apportionment functions within the purview of Joint Staff J8 are scheduled to end in FY2015 with the declaration of AGT Full Operation Capability (FOC). In order to complete the GFM DI tasks, efforts must begin as early as possible to ensure all GFM DI planned milestones, reflected in Section E, are realized and thereby enable a Global Visibility Capability. GFM applications managed by the Joint Staff are used by the JSAS family of programs and this effort to fund critical upgrades is a precondition to GFM DI EFS Integration."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.900"
                                            },
                                            "Text": {
                                                "val": "Specific RDT&E work will focus on a decentralized data strategy resulting from the DoD CIO \"DoD Cloud Way Forward\" service-oriented architecture that flattens the legacy \"Silos of Databases\" paradigm by providing infrastructure services.  This will satisfy the Joint Allocation IPlan guidance for mapping Enterprise Force Structure capabilities to Force-Management modeled workflows uniting both user and technical functionality. The result is incremental development of enabling technologies designed to operationalize force structure data resident in each Service Organizational Server (Service OS) and meet Interim Operational Capability (IOC). This will be accomplished by first aggregating the Service OS into a Global Laydown Service that aggregates the Service OS data, then by linking the unique organization identifier (OUID) in the aggregate service to establish the C2 relationships habitual to the Allocation process (OPCON and TACON Links). The minimum capability to establish the OUID\/UIC linkages in JOPES TPFDDs, mapped to GFM allocation information (FTN, RFF and DEPORD\/LNR), and Transportation data (TTAN\/TTN) comprises the baseline IT functionality available to the DoD Enterprise.This is foundational for the success of GFM DI Next Steps implementation writ large and includes cyber security improvements required to meet the latest Information Assurance compliance standards."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Joint migration or transition to a JIE compliant JC2 Architecture and ultimate Life-Cycle Logistics within an Acquisition Portfolio."
                        },
                        "PerformanceMetrics": {
                            "val": "The GFM DI Enterprise Force Structure (EFS) integration efforts will result in a Global Laydown Service and Joint Force Capability Catalog that supports a Global Visibility Capability (GVC) allowing for GFM Allocation and Joint Future Force integration or transition\/implementation of concepts and capabilities to the APEX Enterprise. This yields value-added non-materiel solutions, lessons learned, and best practices across the Doctrine, Organization,Training, Materiel, Leadership and Education, Personnel, Facilities - Policy (DOTMLPF-P).  This is a cost-effective yet full spectrum approach to support and assist the Chairman in fulfilling his statutory responsibilities while improving current and future joint force capabilities, and are measured by the following:\n\n(1) Meet Initial Operating Capability (IOC) performance elements.\n\n(2) Enterprise Force Structure Data services and Web Service Interfaces supporting a Joint Force Capabilities Catalog (JFCC) described in the Enterprise Force\nStructure (EFS) Capability Package (CP) that is essential to operationalizing the force structure data and achieve GFM DI Next Steps Allocation.\n\n(3) Services, CCMDs, Joint Staff and OSD will be able to efficiently manage force generation supporting GFM Allocation in less than the current time it takes with a\ncommon view of the sourcing-to-employment tracking of forces. This is realized by the automated linking of the Organization Unique Identifier (OUID) attributes from the GFM DI Org Servers (OS) to the Unit Identification Code (UIC) resident in JOPES TPFDDs, GFM allocation information (FTN, RFF, and DEPORD\/LNR), and\nTransportation data.\n\n(4) GFM applications that allow a Joint Planner to inculcate the association of standard and consistent force structure instance data and consistently applied data\n\"types\" with force structure data referenced over time in the GFM Allocation sourcing solutions and deployment planning,execution, and distribution processes."
                        }
                    }
                }
            ]
        }
    }
}