{
    "id": "2d797e55290aeac58b6d6541f9b803e5d349d5ea",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA2_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602709A"
        },
        "ProgramElementTitle": {
            "val": "Night Vision Technology"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "44.694"
            },
            "CurrentYear": {
                "val": "38.807"
            },
            "BudgetYearOne": {
                "val": "36.079"
            },
            "BudgetYearOneBase": {
                "val": "36.079"
            },
            "BudgetYearTwo": {
                "val": "37.081"
            },
            "BudgetYearThree": {
                "val": "36.800"
            },
            "BudgetYearFour": {
                "val": "37.531"
            },
            "BudgetYearFive": {
                "val": "38.292"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) conducts applied research and investigates core night vision and electronic sensor components and software to improve the Army's capability to operate in all battlefield conditions. Technologies pursued in this PE have the potential to provide the Army with new, or enhanced, capabilities to detect and identify targets farther on the battlefield, operate in obscured conditions, and maintain a higher degree of situational awareness (SA). Project H95 advances infrared (IR) Focal Plane Array (FPA) technologies, assesses and evaluates sensor materials, designs advanced multi-function lasers for designation and range finding, and develops models and simulations for validating advanced sensor technologies.  \n\nWork in this PE is fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602705A (Electronics and Electronic Devices), PE 0602712A (Countermine Technology) and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "44.935"
                },
                "CurrentYear": {
                    "val": "33.807"
                },
                "BudgetYearOne": {
                    "val": "35.556"
                },
                "BudgetYearOneBase": {
                    "val": "35.556"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "44.694"
                },
                "CurrentYear": {
                    "val": "38.807"
                },
                "BudgetYearOne": {
                    "val": "36.079"
                },
                "BudgetYearOneBase": {
                    "val": "36.079"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.241"
                },
                "CurrentYear": {
                    "val": "5.000"
                },
                "BudgetYearOne": {
                    "val": "0.523"
                },
                "BudgetYearOneBase": {
                    "val": "0.523"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.470"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.711"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.523"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.523"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H95"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision And Electro-Optic Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "38.194"
                        },
                        "CurrentYear": {
                            "val": "33.807"
                        },
                        "BudgetYearOne": {
                            "val": "36.079"
                        },
                        "BudgetYearOneBase": {
                            "val": "36.079"
                        },
                        "BudgetYearTwo": {
                            "val": "37.081"
                        },
                        "BudgetYearThree": {
                            "val": "36.800"
                        },
                        "BudgetYearFour": {
                            "val": "37.531"
                        },
                        "BudgetYearFive": {
                            "val": "38.292"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research and develops component technologies that enable improved Reconnaissance, Surveillance, Target Acquisition (RSTA) and situational awareness (SA) at an affordable price. Technologies include novel focal plane arrays (FPAs), processing, and electronics.   It also includes modeling and simulation to predict performance and to determine operational effectiveness of these technologies. Research focuses on dual band infrared (IR) FPAs necessary to search, identify and track mobile targets in all day\/night visibility and battlefield conditions and to improve standoff detection in ground-to-ground and air-to-ground operations. This project designs, fabricates and validates large format IR FPAs for sensors to simultaneously provide wide area viewing and the high resolution imagery for situational awareness, persistent surveillance and plume\/gun flash detection. This project also investigates and improves III-V materials, semiconductor materials formed by a combination of elements from Groups III and V of the periodic table. In addition, this project develops algorithms for multispectral and hyperspectral functionality, which provide the ability to perform detection and identification at extended ranges, as well as the ability to detect deeply buried targets.  The reduction of size, weight and power (SWaP) is a key research objective for all efforts. In Fiscal Year (FY) 2015 and 2016 the Army investment in advanced IR FPA technologies is augmented to ensure a world-wide technological advantage in IR sensors for the United States. \n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Soldier, Ground and Air portfolios.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n\nWork in this Program Element (PE) is performed by the Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Aided Target Recognition (AiTR) Evaluation Center of Excellence"
                                    },
                                    "Description": {
                                        "val": "This effort investigates a virtual, distributed capability to interactively process both real and simulated three-dimension (3D) multispectral scenes for Defense-wide applications. Automatic target recognition (ATR) and AiTR algorithms are evaluated against realistic operational scenarios, to include roadside threats\/explosively formed projectiles, in aided or fully autonomous RSTA missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.768"
                                            },
                                            "Text": {
                                                "val": "Investigated algorithmic correlation approaches to further reduce false alarms in image based detection and confirmation processing for vehicle systems; designed and developed improved technology for multifunction display capability; continued to investigate signal processing and algorithms for threat detection and tracking that minimizes power consumption, enabling the use of reduced power processors in SWaP constrained environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.794"
                                            },
                                            "Text": {
                                                "val": "Investigate inclusion of airborne countermine data in algorithmic correlation approaches to improve image based detection and confirmation; explore new algorithms to improve slew-to-cue and robotic move to a way-point for multifunction display capability; apply low power techniques and look-up libraries to improve signal processing and algorithms for threat detection and tracking to minimize power consumption; augment current evaluation infrastructure and data repository used for RSTA and countermine applications to include human activity recognition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.486"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.486"
                                            },
                                            "Text": {
                                                "val": "Will investigate holistic algorithms that address multiple targets, validate signatures and improve Probability of Detection\/False Alarm Rate (Pd\/FAR) rates; develop a baseline algorithms to provide a framework for cognitive image processing techniques that collect multiple types of  data from networks and apply continuous learning techniques to adapt to evolving threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Modeling and Simulation Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, verifies and validates engineering models, measurement techniques and realistic simulations. The goal is to improve the fidelity and adaptability of modeling and simulation capabilities for Warfighter training, sensor system analysis, identification and assessment of phenomenology associated with imaging technologies, and calibration of imaging technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.125"
                                            },
                                            "Text": {
                                                "val": "Researched and incorporated sensor performance model and measurement techniques to validate the optimal implementation of target and background signatures in simulation; compared laboratory and field measurements to determine if any errors are introduced by methodology; validated and measured imagery post processing algorithms and subsequent effects on human performance; researched phenomenology and application of imaging sensor modalities across the waveband spectrum, to include three-dimensional (3D) imaging and displays."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.222"
                                            },
                                            "Text": {
                                                "val": "Implement and begin verification and validation of a two dimensional version of sensor performance model and measurement techniques; extend model and measurement methodologies to incorporate non-linear processing to include image quality based metric and advanced image processing algorithms; research modeling and simulation techniques for multi-function or multi-mission sensor systems; research new techniques and implementation methods such as virtual prototyping to support evolution of the modeling and simulation tools development"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.246"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.246"
                                            },
                                            "Text": {
                                                "val": "Will research and develop improved imaging sensor performance metrics, using computational modeling and imaging system design and evaluation. The objectives are to extend model and measurement methodologies to assess non-linear image processing algorithms and metrics; investigate the most effective combination of computational modeling techniques, lab assessments, and field evaluations; extend confidence level calculations to non-linear systems; define verification and validation methodology for sensor data collections and human performance sensors; and research methods to advance full spectral image generation and processing into augmented reality and virtual representation of new sensor modalities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Multifunction Laser Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technology for a new class of multi-wavelength laser modules, which will have the ability to replace multiple laser targeting systems and reduce the SWaP of current devices, such as laser designators, laser rangefinders (LRFs), pointers, markers, warning systems and illuminators.  The goal is to achieve a single housing, electronics board, power supply and telescope for all applications to provide a reduction in the SWaP of multi-function laser systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.178"
                                            },
                                            "Text": {
                                                "val": "Designed a multifunction Short Wave Infrared (SWIR) laser breadboard that performs range finding, day-night pointing, and 3D Light Detection and Ranging (LIDAR); extended the laser operating wavelength to Long Wave Infrared (LWIR) by examining alternative laser technology including quantum cascade lasers; researched methods for electronically tuning waveband throughout LWIR band; researched and improved laser diode drivers and associated electronics to improve efficiency and power consumption."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.276"
                                            },
                                            "Text": {
                                                "val": "Validate and mature multifunction SWIR fiber-based laser breadboard, and components for performing functions such as: LRF, laser illumination, laser pointing, and LIDAR; investigate novel laser pulsing technologies to allow for compact and lightweight, solid state lasers at reduced cost; design a fiber-based laser operating in an extended-SWIR spectral band for active imaging for covert conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.746"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.746"
                                            },
                                            "Text": {
                                                "val": "Will investigate novel techniques for improving efficiency, pulse energy and size of Mid Wave Infrared (MWIR) and LWIR solid state lasers; investigate methods to convert laser operating frequencies from operations in shorter spectral wavebands into the MWIR and LWIR spectral wavebands for use in applications such as locating and neutralizing threat sensors, 3-dimensional imaging, and landing in degraded visual environments; determine methods for optimizing laser frequency; investigate novel approaches to optimize peak output powers and reduce size, weight and power consumption."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Structures for Cooled Infrared (IR) Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort researches detector materials and substrates for IR sensors. This effort investigates and improves III-V materials (materials formed by a combination of elements from Groups III and V of the periodic table) and II-VI material (materials formed by a combination of elements from Groups II and VI of the periodic table), to provide low cost, large format, high quality imaging sensors.  The emphasis is on reducing material defects and increasing the reliability by means of new ways to prepare and treat the substrates, new designs, and new methods of growing the structures. The goal is to develop cost effective components for high definition Army IR sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.655"
                                            },
                                            "Text": {
                                                "val": "Investigated new growth methods for improving the uniformity and reducing the cost of very LWIR (wavelength greater than 11 microns) III-V and II-VI materials; investigated new techniques for passivating LWIR III-V small pixel structures; mitigated effects of initial substrate condition and processing on resulting performance; designed and validated read-out circuits appropriate for these FPAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.763"
                                            },
                                            "Text": {
                                                "val": "Investigate new growth methods, detector structures and pixel level wavelets for capturing photons and meta-materials into FPAs for improving the responsivity (signal to noise ratio) of SWIR through LWIR wavebands using III-V and II-VI materials; continue investigation of new techniques for etching and passivating LWIR III-V and II-VI small pixel structures; investigate small FPA pixel pitch interconnect technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.892"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.892"
                                            },
                                            "Text": {
                                                "val": "Investigate in-house growth of new LWIR III-V semiconductor compound materials and device structures focusing on optimizing quantum efficiency and material lifetime; research methodologies to improve the signal-to -noise ratio and increase the sensitivity of small pixel III-V structures. Continue to investigate small-pitch pixel processing including mitigation of etch damage and novel interconnect techniques to enable larger-format focal planes with better resolution and increased range."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced IR Detector (\"nBn\") Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops a new detector structure for the development of sensors with increased sensitivity.  In \"nBn\" technology an electron-barrier (“B”) layer is placed between two negatively charged (n-type or “n”) conductive layers, to reduce flow of charge through the material.  The reduction in charge flow reduces the noise intrinsic to the material, thus, increasing the material’s sensitivity.  The objective of the effort is to make MWIR FPAs easier and more affordable to manufacture and to enable operation at higher temperatures, resulting in more affordable sensor systems with significant reductions in SWaP of system optics, housings and cryogenic coolers. In addition, the barrier detector approach allows for very small pixel pitch (8 micron) enabling FPAs of very large format, 5000x5000 pixel, for persistent surveillance applications that were not possible prior to emergence of this barrier FPA technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.720"
                                            },
                                            "Text": {
                                                "val": "Researched and developed nBn large format FPAs (up to 3000x3000, 8-micron pitch) with a cutoff wavelength at or greater than 5 microns and operating at temperatures at or exceeding 130 Kelvin with a goal to achieve repeated performance comparable to indium antimonide; developed processing and hybridization for 8 micron pixel FPAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strained Layer Superlattices (SLS) Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and improves III-V material (materials formed by a combination of elements from Groups III and V of the periodic table) thin film crystal growth of IR FPAs using a very flexible SLS structure. This will allow high performance multi band infrared FPAs to be produced at much lower costs than the existing II-VI FPAs (Mercury Cadmium Telluride) and can leverage commercial product research and production lines, including cell phone chips, to improve uniformity related to performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.141"
                                            },
                                            "Text": {
                                                "val": "Verified fabrication techniques for a 1280x720, 12 micron pitch, dual-band MWIR\/LWIR FPA on analog Readout Integrated Circuits (ROICs) with increased quantum efficiency and reduced noise equivalent differential temperature; hybridize 16 bit digital ROIC with characterized 640x480, 20 micron pitch LWIR FPA; extended cutoff wavelength device designs to 11.5 and 13.5 microns."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wide Field of View Displays and Processing for Head Mounted Display Systems"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs optical filters, objective lenses and personal display viewing optics that will enable ultra-low profile, lightweight sensors and virtual displays for both individual head mounted and vehicle based, multi-user vision systems using the latest developments in holograms for small package optics that can be readily reconfigured (i.e., ultra-small\/light optical zoom). Additional work in this effort investigates image processing as part of the optical design strategy and designs novel approaches for color filtering image processing for low light sensors in order to provide a color low-light imaging capability to the Warfighter. This effort is fully coordinated with PE 0603710A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.803"
                                            },
                                            "Text": {
                                                "val": "Integrated waveguide optical components into head wearable form factors for limited data collections and Soldier perception testing; validated ability of large area waveguide virtual displays to provide the space stabilized display in scenes with jitter; fabricated and integrated color low light solid state silicon focal plane as a test platform; determined optimum color filter array spectral requirements; improved patterned interference filter coating technology for sub-10 micron pixel spacing; conducted experiments on tactical target low light color phenomenology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Solid State Low Light Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort develops true starlight and very low light sensing FPA technology, with reduced power and production cost, for Soldier vision enhancement in degraded visibility conditions. The objective of this effort is an all solid state IR sensor for replacement of current Image Intensifier (I2) vacuum tube technology that can be integrated with new 3D Digital Read-Out Integrated Circuit (DROIC) technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.782"
                                            },
                                            "Text": {
                                                "val": "Optimized pixel size and developed back-side illuminated silicon processes for near IR resolution comparable to current I2 technology; developed through silicon via processing capability for 3D stacking of small pixel silicon FPAs; investigated back-end processing techniques for stacking FPAs with electronics and displays; conducted design studies to determine image processing techniques required for low latency night imaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.971"
                                            },
                                            "Text": {
                                                "val": "Leverage C-MOS and 3D DROIC design to achieve high resolution, low latency, stacked, lowlight silicon sensor and micro-display imaging components; validate design by conducting experiments of stacked wafer fabrication runs with C-MOS pixel densities equivalent to the full resolution designs; investigate and design low profile folded and switchable optics compatible with objective lens and eye piece lens functions suitable for the solid state stacked imager design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensing and Processing"
                                    },
                                    "Description": {
                                        "val": "This effort investigates processing and sensor fusion technology for low cost multi-modal sensors. Processing and sensor fusion technology will enable the capability to see through Degraded Visual Environments (DVE) and to improve Situational Awareness (SA) through automated recognition of personnel and obstacles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.022"
                                            },
                                            "Text": {
                                                "val": "Investigated incorporation of algorithms for improved SA and mobility in DVE; developed low power processing techniques for improved imaging through DVE."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Three-Dimensional (3D) Micro-Electronics for Night Vision Sensors"
                                    },
                                    "Description": {
                                        "val": "The goal of this effort is to investigate new reconfigurable optics and display technologies to interface with emerging 3D electronics processing. The ability to actively reconfigure optical elements will require investigation of new materials and lens designs to enable real time optical refocusing and extended fields of view. Micro-display technology will benefit from new integrated microelectronics by use of new and improved display materials which operate at lower powers and enable all weather, day\/night visualization."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.913"
                                            },
                                            "Text": {
                                                "val": "Investigate new lens designs to include radially indexed materials for enhanced beam steering, metamaterials, and improved coatings for improved transmission\/reflectivity. Microdisplay research will explore new organic light emitting diode (OLED) materials, which offer luminance and multi sensor input for sensor visualization with a 3D DROIC interface."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.836"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.836"
                                            },
                                            "Text": {
                                                "val": "Will perform downselect of new lens designs investigated in FY16 and optimize technical approaches based on size, weight, power, performance, and cost metrics; determine feasibility of the reconfigurable and adaptive optics; characterize transmission, reflectance and absorption of materials and material coatings, and begin assessment of suitability for military environments; determine efficacy of micro-displays necessary for high brightness operation and demonstrate compatibility with multiple video source inputs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Function Digital Readout Integrated Circuits (DROICs) for Cooled and Uncooled Focal Plane Arrays (FPAs)"
                                    },
                                    "Description": {
                                        "val": "The objective of this effort is the development of advanced Two-Dimensional (2D) and 3D DROICs to replace legacy 2D analog ROICs. This effort will investigate and design a digital readout architecture optimized for large format, high resolution, high IR FPAs through the use of modeling, analysis, and simulations. This enabling technology will bring substantial advancements to IR imaging capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.868"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop novel Analog to Digital (A\/D) architectures for new high definition FPAs; investigate A\/D architectures compatible with 2D or 3D integration by use of advanced lithographic techniques; develop small pitch vertical interconnect technology such as Through-Silicon Via (TSV) technology, Isolated Deep Silicon Via Technology (iDSV), and wafer thinning and bonding processes to allow for 3D stacking of sensor display functionalities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.645"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.645"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to validate multi-layer ROIC functionality; explore novel material research and newly maturing technologies to increase on-chip processing capabilities; examine and quantify the ability of multi-layer ROIC technology to store large amounts of charge in very small pixel areas, while maintaining state-of-the-art noise performance; investigate the high dynamic range imaging capabilities enabled by multi-layer ROICs; begin designs of a digital ROIC circuit for uncooled sensors to enable increased performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computational Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort develops component technology designed to reduce soldier workload, increased battlespace awareness, threat detection and target identification.  The objective is to provide enhanced situational awareness with extended range and multi-spectral imaging capability, with reductions to the size, weight, and cost (SWaC), for the individual warfighter.  This is accomplished through integrating computational imaging, novel optics and digital read out electronics. This effort will develop a methodology of computation and optics combined with display and vision processing for improved target discrimination and visualization; improve mounted and dismounted soldier mobility in urban and complex terrain under low light and visibility conditions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.228"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.228"
                                            },
                                            "Text": {
                                                "val": "Will conduct a trade study focused of optics, sensors and processing focused on day\/night helmet mounted 3D imagers; research and validate computational algorithms centered on high speed hemispherical threat detection and localization sensors and optics; explore applications of new optics concepts for multispectral weapon and handheld surveillance devices."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K90"
                    },
                    "ProjectTitle": {
                        "val": "NIGHT VISION COMPONENT TECHNOLOGY (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.500"
                        },
                        "CurrentYear": {
                            "val": "5.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Night Vision Component Technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.500"
                                        },
                                        "Text": {
                                            "val": "Program increase for night vision technology research. Developed Future Vertical Lift camera brassboard with high sensitivity, high dynamic range, and high resolution necessary to see through all degraded visual environments, with fast framerates for hostile fire indication; developed digital low light camera sensor arrays for insertion into brassboard cameras for user test and evaluation; integrated short-wave infrared sensor arrays with new read-out integrated circuit technology for insertion into a camera and subsequent integration into a crew-served weapon sight brassboard to validate an integrated day\/night pointing and handoff capability; developed conceptual models for both sector and 360˚ collection modes that when used with the detection and tracking algorithms will inform Armor and Fires combat developers of capabilities and support needs (i.e. network bandwidth) in their air-defense requirement generation process."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "This is a Congressional Interest Item."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}