{
    "id": "2dca9f2202e0a1effd826031edb3fcd87279bd1d",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603782N"
        },
        "ProgramElementTitle": {
            "val": "Mine and Expeditionary Warfare Advanced Technology"
        },
        "R1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "1.931"
            },
            "CurrentYear": {
                "val": "3.491"
            },
            "BudgetYearOne": {
                "val": "15.167"
            },
            "BudgetYearOneBase": {
                "val": "15.167"
            },
            "BudgetYearTwo": {
                "val": "15.470"
            },
            "BudgetYearThree": {
                "val": "12.971"
            },
            "BudgetYearFour": {
                "val": "13.415"
            },
            "BudgetYearFive": {
                "val": "1.959"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (20 Jan 2015) and investment directions as defined by Department of Defense (DoD) Directive 5160.62 \"Single Manager Responsibility for Military Explosive Ordnance Disposal Technology and Training (EODT&T)\" and approved by the DoD Explosive Ordnance Disposal (EOD) Program Board (Sep 2012).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance, input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). The strategy is also based on the unique needs and capabilities identified by the Joint Requirements Oversight Council (JROC) and the DoD EOD Program Board. It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval and Joint EOD forces in the 21st century.  The strategy focuses and aligns Naval S&T with Naval missions, DoD EOD S&T with Joint EOD missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE primarily develops and demonstrates prototype Mine Countermeasures (MCM), Expeditionary Warfare and Joint EOD system components that support capabilities enabling Naval and Joint EOD Forces to influence operations ashore.  Adversarial nations have the capability to procure, stockpile and rapidly deploy all types of naval mines, including new generation mines having sophisticated performance characteristics, throughout the littorals. They also have the capability to develop or modify explosive devices such as mines and unexploded ordnance to construct Improvised Explosive Devices (IEDs) for the purpose of targeting Joint Forces.  Real world operations have demonstrated the requirement to quickly counter the mine threat.  Current operations have also demonstrated the requirement to quickly counter the threat from explosive hazards and IEDs during DoD operations.  Advanced technologies must rapidly detect and neutralize all mine types, from deep water to the inland objective.  Advanced technologies must enable Joint EOD forces to detect\/locate, gain access, diagnose, render safe, neutralize, recover, exploit and dispose of a broad spectrum of explosive hazards including unexploded ordnance and IEDs.  This program supports the advanced development and integration of sensors, processing, warheads, and delivery vehicles to demonstrate improved Naval Warfare capabilities. It supports the advanced development and integration of sensors and tools for standoff capabilities such as detection and location of IEDs (particularly in dismounted operations), dismounted diagnosis of buried munitions and other explosive hazards, precision render safe and neutralization of surface munitions and other explosive hazards, and enhanced access to IEDs.  It supports the MCM-related FNC Enabling Capabilities (ECs).  Within the Naval Transformation Roadmap, this investment will achieve one of three key transformational capabilities required by Sea Shield as well as technically enable the Ship To Objective Maneuver (STOM) key transformational capability within Sea Strike.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.000"
                },
                "CurrentYear": {
                    "val": "1.991"
                },
                "BudgetYearOne": {
                    "val": "2.000"
                },
                "BudgetYearOneBase": {
                    "val": "2.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.931"
                },
                "CurrentYear": {
                    "val": "3.491"
                },
                "BudgetYearOne": {
                    "val": "15.167"
                },
                "BudgetYearOneBase": {
                    "val": "15.167"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.069"
                },
                "CurrentYear": {
                    "val": "1.500"
                },
                "BudgetYearOne": {
                    "val": "13.167"
                },
                "BudgetYearOneBase": {
                    "val": "13.167"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "1.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.069"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "13.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.333"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.333"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase in FY 2017 is due to the transfer of the Advanced Sea Mines Future Naval Capability (FNC) effort SHD-FY16-OSD Modular Undersea Effectors (MUSE) from PE 0603673N Future Naval Capabilities Advanced Technology Development.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2917"
                    },
                    "ProjectTitle": {
                        "val": "Shallow Water MCM Demos"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.931"
                        },
                        "CurrentYear": {
                            "val": "1.991"
                        },
                        "BudgetYearOne": {
                            "val": "15.167"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.167"
                        },
                        "BudgetYearTwo": {
                            "val": "15.470"
                        },
                        "BudgetYearThree": {
                            "val": "12.971"
                        },
                        "BudgetYearFour": {
                            "val": "13.415"
                        },
                        "BudgetYearFive": {
                            "val": "1.959"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE develops and demonstrates prototype technology for Mine Countermeasures (MCM), US Naval sea mining, and Expeditionary Warfare and Joint EOD system components that support capabilities enabling Naval and Joint EOD Forces to influence operations ashore. Adversarial nations have the capability to procure, stockpile and rapidly deploy all types of naval mines, including new generation mines having sophisticated performance characteristics, throughout the littorals. They also have the capability to develop or modify explosive devices such as mines and unexploded ordnance to construct Improvised Explosive Devices (IEDs) for the purpose of targeting Joint Forces. Real world operations have demonstrated the requirement to quickly counter the mine threat. Current operations have also demonstrated the requirement to quickly counter the threat from explosive hazards and IEDs during DoD operations. Advanced technologies must rapidly detect and neutralize all mine types, from deep water to the inland objective. Advanced technologies must enable Joint EOD forces to detect\/locate, gain access, diagnose, render safe, neutralize, recover, exploit and dispose of a broad spectrum of explosive hazards including unexploded ordnance and IEDs. This program supports the advanced development and integration of sensors, processing, warheads, and delivery vehicles to demonstrate improved Naval Warfare capabilities. It supports the advanced development and integration of sensors and tools for standoff capabilities such as detection and location of IEDs (particularly in dismounted operations), dismounted diagnosis of buried munitions and other explosive hazards, precision render safe and neutralization of surface munitions and other explosive hazards, and enhanced access to IEDs.  It supports advanced development for battlespace shaping weapons including advanced undersea weapons.  It supports the MCM related FNC Enabling Capabilities (ECs). Within the Naval Transformation Roadmap, this investment will achieve one of three key transformational capabilities required by Sea Shield as well as technically enable the Ship To Objective Maneuver (STOM) key transformational capability within Sea Strike."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint EOD Demos"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on developing and demonstrating technologies to support a standoff or remote capability for detection and location, diagnosis, render safe, neutralization and enhanced access.  Efforts include: electromagnetic, electro-optical, and acoustic sensors and systems for detection of explosive threat components including explosives, device housings\/containers, and triggering mechanisms, standoff identification and confirmation of trace explosives, fusion of multi-sensor input for high confidence detection and diagnosis of buried threats, highly dexterous manipulators and imitative controllers for lightweight, efficient (strength\/weight ratio) dual manipulator systems integrated onto EOD robots for enhanced access, enhanced robotic autonomy to support EOD missions, data compression and visualization techniques to support precise render safe and neutralization, and neutralization devices containing reactive materials to neutralize devices with low collateral damage. \n \nThis S&T investment supports the Joint Requirements Oversight Council (JROC) and DoD EOD Program Board validated requirements for Joint EOD missions. This S&T investment provides critical S&T transitions to acquisition programs.  This investment in Joint EOD S&T is reported annually to the DoD EOD Program Board. This S&T investment is documented in the DoD EOD Applied Research Program Plan which is reviewed and approved annually by the DoD EOD Program Board."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.931"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of a laser interferometric sensor\/system that can be integrated onto various platforms including EOD robots for detection and\/or diagnosis of buried objects.\n- Continued development of highly dexterous dual manipulator systems (manipulators, controllers) that can be integrated onto EOD robots for precision render safe and neutralization missions.\n- Continued development of a Resonance Raman (single or dual wavelength) detector for standoff detection of trace explosives that can be integrated into a handheld device or onto an EOD robot."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.991"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2015, less those noted as completed above.\n- Initiate development of sensors that can be integrated into a handheld device or onto an EOD robot to detect deeply buried objects. \n- Initiate development of excavation tools and techniques that can be integrated into a handheld device or onto an EOD robot for precision recovery and diagnosis of buried objects.  \n- Initiate development of neutralization tools and technigues that can be deployed by an EOD technician or integrated onto an EOD robot for effective target neutralization with low collateral damage to surrounding infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.957"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.957"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above. \n- Initiate development of a robotic system demonstrator for stand-off detection of trace and bulk explosive materials.\n- Initiate development of a robotic system demonstrator for autonomous grasping and manipulation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mine Technology"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on developing and demonstrating technology to support on-demand battlespace shaping through advanced undersea weapons.  Efforts include command & control (C2), remote control, advanced sensing technologies, compatibility with unmanned delivery options, detection & classification, and targeting solutions.  \n\nThe increase in FY 2017 is due to the transfer of the Advanced Sea Mines FNC effort SHD-FY16-OSD Modular UnderSea Effectors (MUSE), to Technology Maturation (TM)-ONR Advanced Sea Mines, from PE 0603673N Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.210"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.210"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiate development of advanced sensing technologies\n- Initiate development of command & control and advanced detection & classification technologies"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall metrics of this advanced technology program are the development of technologies supporting the Mine and Expeditionary Warfare challenges of reducing the MCM tactical timeline from months to days and eliminating the need for Navy divers and manned equipment to enter minefields.  Another important metric is the scheduled transition of 6.3 advanced technology projects from the FNCs program into Navy and Marine Corps acquisition programs at agreed upon Technology Readiness Levels.  Technology-specific metrics include: Mine warfare data fusion capabilities yielding a 10%-25% reduction in time and risk to mine hunting activities; Mine hunting sensors - Probability of Detection = 95%, Probability of Identification of Proud Mines = 90%, Probability of Classification of Buried Mines = 80%; Unmanned Systems for MCM sized for inclusion in the Littoral Combat Ship Mine Warfare Mission Package; MCM sensors sized, packaged and capable of 12 hour missions with a search rate greater than .05 square nautical mines per hour; Mine sweeping: Modular magnetic and acoustic influence sweeping systems packaged for deployment from Unmanned Surface Vehicles; Minesweeping single sortie coverage > 9.4 square nautical miles at 20 nautical miles per hour during a 4 hour mission up to Sea State 3; Surface-laid mine and obstacle breaching capability > 90% in the Beach Zone (BZ) using unitary warheads, and > 80% in the Surf Zone (SZ)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This congressional increase further develops and demonstrates technologies to support a standoff or remote capability for detection and location, diagnosis, render safe, neutralization and enhanced access. Efforts include: electromagnetic, electro-optical, and acoustic sensors and systems for detection of explosive threat components including explosives, device housings\/containers, and triggering mechanisms, standoff identification and confirmation of trace explosives, fusion of multiple-sensor input for high confidence detection and diagnosis of buried threats, highly dexterous manipulators and imitative controllers for lightweight, efficient (strength\/weight ratio) dual manipulator systems integrated onto EOD robots for enhanced access, enhanced robotic autonomy to support EOD missions, data compression and visualization techniques to support precise render safe and neutralization, and neutralization devices containing reactive materials to neutralize devices with low collateral damage."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "1.500"
                                        },
                                        "Text": {
                                            "val": "- Expand development  of sensors that can be integrated into a handheld device or onto an EOD robot to detect deeply buried objects\n- Expand development of excavation tools and techniques that can be integrated into a handheld device or onto an EOD robot for precision recovery and diagnosis of buried objects\n- Expand development of neutralization tools and techniques that can be deployed by an EOD technician or integrated onto an EOD robot for effective target neutralization with low collateral damage"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This activity supports the development and transition of technologies to PMS-408 for Joint Service missions. This S&T investment supports the Joint Requirements Oversight Council (JROC) and DoD EOD Program Board validated requirements for Joint EOD missions. This S&T investment provides critical S&T transitions to the acquisition programs managed by PMS-408. This investment in Joint EOD S&T is reported annually to the DoD EOD Program Board. This S&T investment is documented in the DoD EOD Applied Research Program Plan which is reviewed and approved annually by the DoD EOD Program Board."
                        }
                    }
                }
            ]
        }
    }
}