{
    "id": "2e36dbeb4f1731c3c3c410a2be9f95870b538d65",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603271N"
        },
        "ProgramElementTitle": {
            "val": "Electromagnetic Systems Advanced Technology"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "62.860"
            },
            "CurrentYear": {
                "val": "34.856"
            },
            "BudgetYearOne": {
                "val": "26.421"
            },
            "BudgetYearOneBase": {
                "val": "26.421"
            },
            "BudgetYearTwo": {
                "val": "26.199"
            },
            "BudgetYearThree": {
                "val": "24.897"
            },
            "BudgetYearFour": {
                "val": "20.789"
            },
            "BudgetYearFive": {
                "val": "8.056"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (20 January 2015).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nActivities and efforts in this Program Element (PE) address technologies critical to enabling the transformation of discrete functions to network centric warfare capabilities, which simultaneously perform Radar, Electronic Warfare (EW), and Communications and Network functions across platforms through multiple, simultaneous and continuous communications\/data links.  The Electromagnetic Systems Advanced Technology program addresses Radio Frequency (RF) technology for Surface and Aerospace Surveillance sensors and systems, EW sensors and systems, RF Communication Systems, Multi-Function sensor systems, and Position, Navigation and Timing (PNT) capabilities.  Within the Naval Transformational Roadmap, this investment offers affordable options for the transformational capabilities required by the Sea Shield (Theater Air and Missile Defense), Sea Strike (Persistent Intelligence, Surveillance, and Reconnaissance), and ForceNet (Communications and Networking) SeaPower 21 Naval Warfighting Pillars. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "64.574"
                },
                "CurrentYear": {
                    "val": "34.899"
                },
                "BudgetYearOne": {
                    "val": "26.488"
                },
                "BudgetYearOneBase": {
                    "val": "26.488"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "62.860"
                },
                "CurrentYear": {
                    "val": "34.856"
                },
                "BudgetYearOne": {
                    "val": "26.421"
                },
                "BudgetYearOneBase": {
                    "val": "26.421"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.714"
                },
                "CurrentYear": {
                    "val": "-0.043"
                },
                "BudgetYearOne": {
                    "val": "-0.067"
                },
                "BudgetYearOneBase": {
                    "val": "-0.067"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.043"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.450"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.164"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.067"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.067"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2913"
                    },
                    "ProjectTitle": {
                        "val": "Electromagnetic Systems Advanced Technology"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "62.860"
                        },
                        "CurrentYear": {
                            "val": "34.856"
                        },
                        "BudgetYearOne": {
                            "val": "26.421"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.421"
                        },
                        "BudgetYearTwo": {
                            "val": "26.199"
                        },
                        "BudgetYearThree": {
                            "val": "24.897"
                        },
                        "BudgetYearFour": {
                            "val": "20.789"
                        },
                        "BudgetYearFive": {
                            "val": "8.056"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Work in this project addresses cost-effective RF technology for Surface and Aerospace Surveillance sensors and systems, EW sensors and systems, RF Communication Systems, Multi-Function sensor systems, and Position, Navigation and Timing (PNT) capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ELECTRONIC AND ELECTROMAGNETIC SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop, test, and demonstrate communications, electronic attack (EA), electronic surveillance (ES), electronic warfare (EW), and radar functions.  This activity also includes development of affordable wideband, high performance Advanced Multifunction Radio Frequency (AMRF) apertures.  A portion of this PE is devoted to mid-term technology development in close concert with acquisition programs of record.  The products of these efforts are expected to transition at the end of their schedule into the associated acquisition program of record.\n\na) Advanced EW Enabling Technologies (Formerly Titled: Electronic Warfare (EW) Roadmap) - Develop classified advanced electronic warfare technology in support of current and predicted capability requirements. \n\nb) Electromagnetic Maneuver Warfare Command & Control (EMC2) (FY16-FY20)- Enable a battle group to work cooperatively in the EM Spectrum (EMS) to optimize Electronic Warfare (EW), Information Operations (IO), Communications (Comms) and Radar performance.  EMC2 will build upon the Resource Allocation Manager (RAM) that was previously developed for single multifunction systems under the InTop program to optimize spectrum and functional use across a platform and an entire battle group.\n\nThe increase from FY 2015 to FY 2016 is due to the initiation of a new INP Electromagnetic Maneuver Warfare Command & Control (EMC2) Project.\n\nThe increase from FY16 to FY17 reflects an increase in the level of effort for the new Electromagnetic Maneuver Warfare Command & Control (EMC2) INP Program. \n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.598"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced EW Enabling Technologies (formerly titled: Electrontic Warfare (EW) Roadmap): \n- Continued development of classified advanced electronic warfare technology in support of current and predicted capability requirement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.518"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced EW Enabling Technologies (formerly titled: Electronic Warfare (EW) Roadmap): \n- Continue all efforts of FY 2015 unless noted as completed above. \n\nElectromagnetic Maneuver Warfare Command & Control (EMC2):\n- Initiate Wideband Airborne Multifunction System design. \n- Initiate Low-Band RF Intelligent Distribution Resource (LowRIDR) SubSystem build.\n- Initiate Electromagnetic Warfare Command and Control system design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced EW Enabling Technologies:\n- Continue all efforts of FY 2016 unless noted as complete above. \n\nElectromagnetic Maneuver Warfare Command & Control (EMC2):\n- Continue all efforts of FY 2016 unless noted as complete above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GLOBAL POSITIONING SYSTEM (GPS) & NAVIGATION TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Position, Navigation and Timing (PNT) capabilities using either GPS systems, non-GPS navigation devices, or atomic clocks. This activity will increase the operational effectiveness of U.S. Naval units. The focus is on the mitigation of GPS electronic threats, the development of atomic clocks that possess unique long-term stability and precision, and the development of compact, low-cost, Inertial Navigation Systems (INS). \n\nThe major objectives of this activity are: \na) GPS Anti-Jam Antennas and Receivers - Integrate and demonstrate anti-jam antennas and antenna electronics for Navy platforms for the purpose of providing precision navigation capabilities in the presence of electronic threats; to integrate and demonstrate anti-spoofer\/anti-jam processors for the purpose of providing precision navigation capabilities in the presence of emergent threats. \n\nb) Precision Time and Time Transfer - Integrate and demonstrate tactical grade atomic clocks that possess unique long-term stability and precision for the purpose of providing GPS-independent precision time; to integrate and demonstrate the capability of transferring GPS-derived time via radio frequency links for the purpose of providing GPS-independent precision time. \n\nc) Non-GPS Navigation Technology - To integrate and demonstrate inertial navigation systems for the purpose of providing an alternative means of providing precision navigation for those Naval platforms which may not have GPS navigation capabilities and\/or loss of GPS signals; to integrate and demonstrate a correlation navigation technique using earth maps of high precision (including bathymetric, magnetic and gravimetric data) for navigation for those Naval platforms which may not have GPS navigation capabilities and\/or loss of GPS signals. \n\nThe following are non-inclusive examples for projects funded in this activity.\n\nThe increase from FY 2016 to FY 2017 is due to increased funding for the Navigation and Precision Timekeeping initiative."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.228"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers: \n- Continued GPS Antenna System for Enhanced EP, ES and Precise Navigation. \n- Continued development of Small Antenna Based Anti-spoofing project. \n- Continued Modernized Integrated Spoofer Tracking. \n- Continued development of Advanced Spoofer Tracking. \n- Continued development of Next Generation Global Positioning Satellite System - Situational Awareness (XGPSS-SA) Challenged Environment. \n- Continued Modernized Receiver for RF Challenged Environments. \n- Continued development of the Simulation of GPS Signals in a Stressed Environment. \n- Continued development of Self Calibrating GPS Anti-Jam Antennas for Electronic Support. \n- Continued Cognitive Modernized GPS User Equipment (MGUE) for GPS-Denied Environments project. \n\nPrecision Time and Time Transfer: \n- Continued DoD master clock time transfer via optical fibers. \n- Continued development of algorithms for distributed time scaling; developed architectures necessary to establish a Navy Global Coordinated Time Scale; tested the algorithms via both simulation and using actual clock data provided by the U.S. Naval Observatory (USNO). \n- Continued development and Distributing Time-frequency Device. \n- Continued development of Rb 3-cc Tactical Grade Atomic Clock (TGAC). \n- Initiate Tactical Grade Atomic Clock.\n\n Non-GPS Navigation Technology: \n- Continued Two-Axis Fiber Optic Inertial Navigation System Phase II project. \n- Continued Mechanical System (MEMS) Inertial Navigation System (INS) Phase II project. \n- Continued Angle-Only Infra Red Celestial Navigation System. \n- Continued Optically Transduced MEMS Inertial Navigation System project. \n- Continued Sub-harmonic Lateral Mode MEMS Inertial Navigation System project. \n- Continued Two-Axis Gyro-compass Fiber Optic Inertial Navigation System project. \n- Continued development of Wavewinds project. \n- Continued development of Small Unmanned Underwater Vehicle - Sonar Aided Inertial Navigation Technology (UUV-SAINT) project. \n- Continued development of Portable PCNS project. \n- Continued development of Superconducting Magnetometer On-Board Navigation (SIMON) System. \n- Continued development of Alternative Navigation Over Unstructured or Featureless Terrain. \n- Complete Precise At-Sea Ship's Indoor Outdoor Navigation (PASSION). \n- Initiate Miniature Ultra-Cold Atom Chip Inertial Sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.338"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers: \n- Continue all efforts of FY 2015 unless noted as complete above. \n- Complete Modernized Integrated Spoofer Tracking. \n\nPrecision Time and Time Transfer: \n- Continue all efforts of FY 2015.\n- Complete Tactical Grade Atomic Clock \n\nNon-GPS Navigation Technology: \n- Continue all efforts of FY 2015 less those noted as completed.\n- Complete Two-Axis Gyro-compass Fiber Optic Inertial Navigation System. \n- Complete development of Superconducting Magnetometer On-Board Navigation (SIMON) System. \n- Initiate Broadband Navigation Sonar (BBNS) Technology"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "GPS Anti-Jam Antennas and Receivers: \n- Complete development of Small Antenna Based Anti-spoofing project.\n- Complete development of Next Generation Global Positioning Satellite System - Situational Awareness (XGPSS-SA) Challenged Environment. \n- Complete Modernized Receiver for RF Challenged Environments.\n- Complete development of the Simulation of GPS Signals in a Stressed Environment.\n- Complete development of Self Calibrating GPS AJ Antennas for Electronic Support. \n- Complete Cognitive Modernized GPS User Equipment (MGUE) for GPS-Denied Environments project. \n- Complete GPS Antenna System for Enhanced EP, ES and Precise Navigation. \n- Initiate advanced receiver design implementing advanced and collective acquisition and  tracking techniques.\n\nPrecision Time and Time Transfer: \n- Continue all efforts of FY 2016 less those noted as complete.\n- Complete development of algorithms for distributed time scaling; developed architectures necessary to establish a Navy Global Coordinated Time Scale; tested the algorithms via both simulation and using actual clock data provided by the U.S. Naval Observatory (USNO). \n- Initiate the development of generalized time transfer modem for terrestrial and shipboard systems.\n- Initiate cold atom development efforts for compact, deployable next generation clock technology to surpass current Rubidium and Cesium standards, providing longer accurate time holdover in GPS denied environments.\n- Initiate RF and Optical time transfer effort for terrestrial, surface, and airborne platforms.\n\nNon-GPS Navigation Technology:\n- Continue all efforts of FY 2016 less those noted as complete. \n- Complete Optically Transduced MEMS Inertial Navigation System project. \n- Complete Sub-harmonic Lateral Mode MEMS Inertial Navigation System project. \n- Complete development of Wavewinds project. \n- Complete development of Small Unmanned Underwater Vehicle Sonar Aided Inertial Navigation Technology (UUV-SAINT) project.\n- Complete development of Portable PCNS project. \n- Complete development of Alternative Navigation Over Unstructured or Featureless Terrain. \n- Complete Two-Axis Fiber Optic Inertial Navigation System Phase II project. \n- Complete Mechanical System (MEMS) Inertial Navigation System (INS) Phase II project.\n- Initiate advanced development of geophysical, RF, and celestial navigation aids for manned and unmanned surface and subsurface platforms.\n- Initiate cold atom gravimetric measurement system for aids to inertial sensors."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INTEGRATED TOPSIDE (INTOP) INNOVATIVE NAVAL PROTOTYPE (INP)"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of the INTOP INP is to develop and demonstrate a set of prototypes that integrate RF functionality (EW, Radar, Communications, Navigation) into a common set of multi-function apertures electronics and software through an architecture that is modular, scalable across all platforms, and open at the RF as well as computer and software level.  The apertures are capable of providing multiple simultaneous, independent beams which can together perform any of the above functions.\n\nThe major objectives of this activity are:\n\na) Submarine SATCOM Array - Develop wide-band SATCOM array capable of supporting EW for submarines.\n\nb) Electronic Warfare (EW)\/Information Operations (IO)\/Line of Sight (LOS) Communications (Comms) for Surface Combatants - Develop wide-band array to support EW capability and other functions, including but not limited to IO and LOS Comms, for surface combatants with potential application to other platforms.\n\nc) Architecture, Standards and Devices - Develop architecture and standards for wide-band multi-beam, multi-band arrays and below deck systems and the technology and electronic devices needed to make integrated array systems affordable.\n\nd) Surface Combatant Communication Array - Develop wide-band surface combatant communication array capable of supporting other RF functions.\n\ne) Resource Allocation Manager - Develop enterprise common Resource Allocation Manager.\n\nf) Digital Radar - Develop an all digital radar to demonstrate advanced concepts for coherent radar networking and control, which will increase radar coverage and provide new levels of electronic protection (EP), while maximizing radar resources and reducing cost.\n\ng) Low Band Communications, IO and EW - Develop low band technology development and concept studies leading to development of an Advanced Development Model (ADM).\n\nThe decrease between FY 2015 and FY 2016 is representative of the InTop program coming to an end. The funding provided in FY 2016 is to complete all efforts under the InTop program originally scheduled to be completed in FY 2015.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.198"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Submarine SATCOM Array: \n- Complete integration and test.\n\nEW\/IO\/Comms for Surface Combatants: \n- Complete integration and test of ADM. \n\nArchitecture, Standards and Devices: \n- Complete development of deckhouse and platform integration strategies and concepts.\n\nSurface Combatants Satellite Communications Array: \n- Complete design effort.\n\nResource Allocation Manager: \n- Continued integration and test of RAM.  \n\nDigital Radar: \n- Continued system build for back-end. \n- Continued and completed design effort for front-end. \n- Initiate system build for front-end.\n\nLow Band Communications, IO and EW: \n- Continue and complete development of the initial architecture and requirements. \n- Initiate subsystem designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Resource Allocation Manager: \n- Complete integration and test of RAM.\n\nDigital Radar: \n- Complete system build for front-end.\n- Complete system build for back-end.\n\nLow Band Communications, IO and EW: \n- Complete subsystem designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NETTED EMULATION OF MULTI-ELEMENT SIGNATURES AGAINST INTEGRATED SENSORS (NEMESIS)"
                                    },
                                    "Description": {
                                        "val": "The objective is to develop a System of Systems (SoS) able to coordinate distribute EW resources against many adversary surveillance and targeting sensors simultaneously. It will benefit the warfighter by providing platform protection across the battlespace against many sensors, creating seamless cross-domain countermeasure coordination, and enabling rapid advanced technology\/capability insertion to counter emerging threats. \n\na) Develop reconfigurable and modular EW payloads, Distributed Decoy and Jammer Swarms (DDJS), effective multi-spectral countermeasures (CM), and Multiple Input\/Multiple Output Sensor\/CM (MIMO S\/CM) for platform protection across operational domains.\n\nThis R2 activity was initiated in PE 0602271N and expanded in FY 2015 to PE 0603271N.\n\nThe decrease from FY16 to FY17 reflects the transition toward the integration and demonstration of the new technologies.  The first 3 years FY14-FY16 are dedicated toward the design, development and procurement of new technologies.  Years FY17 and FY18 are dedicated toward the integration and demonstration of these new technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.836"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development and demonstration of the NEMESIS EW payloads and their integration into platforms. \n- Continued application of the research supporting distributed control, coordination and networking of NEMESIS payloads and platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.361"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.361"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Advanced Electronic Sensor Systems for Missile Defense and Long Range Detection and Tracking ECs are aligned to the Navy's Advanced Cruiser (CG(X)) plans and closely coordinated with Naval Sea Systems Command Integrated Warfare Systems (PEO IWS 2.0). Other performance metrics are discussed within the R-2a."
                        }
                    }
                }
            ]
        }
    }
}