{
    "id": "307c6acb846e917c9f77649fefe9fbe38c1dc2a2",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0606355N"
        },
        "ProgramElementTitle": {
            "val": "(U)Warfare Innovation Management"
        },
        "R1LineNumber": {
            "val": "182"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "21.123"
            },
            "BudgetYearOneBase": {
                "val": "21.123"
            },
            "BudgetYearTwo": {
                "val": "34.938"
            },
            "BudgetYearThree": {
                "val": "13.629"
            },
            "BudgetYearFour": {
                "val": "13.917"
            },
            "BudgetYearFive": {
                "val": "14.195"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) contains two projects: Fleet Experimentation (FLEX), and Trident Warrior (TW).\nFLEX Project 3319:  Advances\/augments operational and tactical warfighter capabilities through the experimentation of high payoff initiatives, technologies and concepts, Fleet Concepts of Operations (CONOPS), doctrine, and new tactics, techniques and procedures (TTP). The objective of FLEX is to produce recommended changes in doctrine, organization, training, materiel, leadership development, personnel, facilities, and policy (DOTMLPF-P) actions.  \n\nTW Project 3320: TW enables early delivery of capabilities to the warfighter via Fleet-directed Trident Warrior operational events with an emphasis on USFF\/CPF directed focus areas.\n\nFLEX was transferred from 0604707N to 0606355N from Fy2017 forward.  This is not a new start.\n\nTrident Warrior (TW) was transferred from 0604231N to 0606355N from FY17 forward.  This is not a new start.\n\nClassified Project Expeditionary Submarine Fiber Optic Cable (SFOC) Communications added for FY2017 and FY2018 execution.  Request new Project number.\n\n       The Expeditionary Submarine Fiber Optic Cable (SFOC) Communications is developing and experimenting innovative concepts designed to validate both material and non-material methodologies to provide resilient command and control within the maritime domain.  The project focus is to demonstrate capabilities that leverage existing DOD investments and infrastructure using non-traditional means to move data and information.  The key deliverable will be a demonstration using maritime assets, experimental methodologies, and current backhaul architecture to validate C2 data movement in the maritime domain.  Continue the development and refinement of advanced networking and communication capabilities in a maritime environment that promote C2 interoperability in Satellite Communications (SATCOM) - Restricted and SATCOM - Denied environments, and support the defeat Anti-Access Area Denial (A2\/AD).  Solutions will address higher bandwidth technologies across the Radio Frequency (RF) and Optical spectrum."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "21.123"
                },
                "BudgetYearOneBase": {
                    "val": "21.123"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "21.123"
                },
                "BudgetYearOneBase": {
                    "val": "21.123"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "13.694"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.694"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "7.429"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.429"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3319"
                    },
                    "ProjectTitle": {
                        "val": "Fleet Experimentation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "18.954"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.954"
                        },
                        "BudgetYearTwo": {
                            "val": "32.659"
                        },
                        "BudgetYearThree": {
                            "val": "11.308"
                        },
                        "BudgetYearFour": {
                            "val": "11.544"
                        },
                        "BudgetYearFive": {
                            "val": "11.775"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "1. The Fleet Experimentation (FLEX) program examines the doctrine, organization, training, materiel, leadership and education, personnel, facilities, and policy (DOTMLPF-P) solutions to identified warfighter capability gaps within the FYDP. The FLEX program considers warfighting gaps identified in: Integrated Prioritized Capability Lists (IPCL) generated by Warfighting Development Centers (WDC); USFF\/CPF's Integrated Priorities Letter (IPL) delivered annually to the CNO; USFF\/CPF's Commanders' FLEX Guidance; and Navy and Joint Urgent Operational Needs Statements. In addition, FLEX addresses innovative concepts, and tactics, techniques, and procedures (TTP), and Fleet Concepts of Operation (CONOPS) that collectively mitigate Fleet-identified warfighting capability gaps as defined by Commander, U.S. Fleet Forces' (CUSFF)\/Commander, Pacific Fleet's (CPF) annual FLEX guidance. Through experimentation activities such as workshops, system or seminar war games, live at-sea events, and experimentation campaigns, the FLEX program examines potential materiel and non-materiel tangible solutions that will enhance the Fleet's ability to execute assigned missions. FLEX events and campaigns are comprised of all facets of experimentation including design, planning, systems engineering and integration, execution, data collection, analysis, assessment, and the delivery of tangible products to the fleet. While Naval-centric, FLEX efforts include joint, coalition, Science and Technology (S&T), academia, and industry partners.\n\n\tExperimentation is vital to continuously improving naval warfighting capabilities. As such, the FLEX program directly supports four of the five elements outlined in the Secretary of the Navy's Innovation Vision: Build the Naval Innovation Network, Improve the Use of DON Information, Accelerate Emerging Operational Capabilities to the Fleet, and Develop Game-Changing Warfighting Concepts.\n\n2. Request a new Project Number for Expeditionary SFOC Communications (Classified Project)\n\nThe Expeditionary Submarine Fiber Optic Cable (SFOC) Communications is developing and experimenting innovative concepts designed to validate both material and non-material methodologies to provide resilient command and control within the maritime domain.  The project focus is to demonstrate capabilities that leverage existing DOD investments and infrastructure using non-traditional means to move data and information.  The key deliverable will be a demonstration using maritime assets, experimental methodologies, and current backhaul architecture to validate C2 data movement in the maritime domain.  Continue the development and refinement of advanced networking and communication capabilities in a maritime environment that promote C2 interoperability in Satellite Communications (SATCOM) - Restricted and SATCOM - Denied environments, and support the defeat Anti-Access Area Denial (A2\/AD).  Solutions will address higher bandwidth technologies across the Radio Frequency (RF) and Optical spectrum."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fleet Experimentation"
                                    },
                                    "Description": {
                                        "val": "FLEX is a USFF\/CPF collaborative effort to address fleet prioritized capability gaps, led by USFF N8\/N9, supported by Navy Warfare Development Command (NWDC), and coordinated with Naval Component Commands (NCC)\/Numbered Fleets, Type Commanders (TYCOM), Systems Commands (SYSCOM), OPNAV, Services, Coalition, and Science & Technology (S&T) community.  The Fleet Experimentation program objective is to produce recommended changes in doctrine, organization, training, materiel, leadership development, personnel, facilities, and policy (DOTMLPF-P) actions. Deliverables are focused on operational and tactical warfighting capability in the near term (within the Future Years Defense Program), and prioritized by the Commander, U.S. Fleet Forces (USFF)\/Commander, Pacific Fleet (CPF) Fleet Experimentation annual guidance. NWDC plans and executes USFF\/CPF approved multi-year Fleet experimentation campaigns and final reports.  USFF\/CPF staff manage the follow-on DOTMLPF-P actions with OPNAV, SYSCOMs, TYCOMs and Warfighter Development Center (WDC) staffs to establish or enhance warfighting capability in Integrated Air and Missile Defense (IAMD), Amphibious Warfare (AMW), Surface Warfare (SUW), Strike Warfare (STW), Anti-Submarine Warfare(ASW),Expeditionary Warfare (EXW), Information Dominance (ID), Mine Warfare (MIW) and Anti-Terrorism\/Force Protection (AT\/FP).\n \nFLEX supports Operational\/Tactical venues to experiment, demonstrate, assess warfighting CONOPS development, concepts, doctrine\/training development, techniques and procedures (TTPs), and technologies \n\tMulti-year experiment campaigns focus on warfighting capability per CPF\/CUSFFC guidance to evaluate and transition to DOTMLPF-Policy change recommendations.\n\tTrident Warrior is the component of FLEX that specifically targets C4I systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FLEX Project 3319 was previously funded under PE 0604707N\nThe FY15 Execution Plan (ExPlan) was based on five USFF\/CPF directed focus areas, to include, in very broad terms, Electromagnetic Maneuver Warfare, Joint Assured Access, Integration and Interoperability, Unmanned Systems, and New Platform Introduction. The status of the FY15 ExPlan is as follows:\n1.\tNavy Integrated Fire Control-Counter Air (NIFC-CA) War Game #2\nFLEX provided for the technical, operational, and subject matter expertise support for the application of modeling and simulation techniques to stimulate operator-in-the-loop wargaming.\nThe wargaming facilitates the investigation of command and control flow and decision-making for force positioning and integration\/interoperability of Naval Integrated Fire Control-Counter Air employment. \nA Joint Engagement Zone was used to inform the development and refinement of Concepts of Operations; Tactics, Techniques and Procedures; and Operational Taskings and Training. It also helped capture insights for future experimentation, analysis, and capability requirements for the NIFC-CA campaign.\n\t\n2.\tElectromagnetic Maneuver Warfare (EMW) Experimentation Campaign.  The overall EMW campaign include:\nNEMESIS War Game\nEMW At-Sea Experiment\nNORTHERN EDGE 2015\nEMW At Sea Experiment\n\nFLEX provided funds for technical and Subject Matter Expertise (SME) support for EMW-related doctrine, blue emitter vulnerability assessment, focused collection reports and briefing documents related to EMW.\n\nFLEX provided funds for a Center for Naval Analysis SME support for the development of the EMW experimentation plan.\n\nDeliverables:  Experimentation Plan for EMW and post event analysis report\n\n3.\tUndersea Domain Operating Concept (UDOC) Experimentation Campaign\nIndividual components of the FY15 UDOC campaign included:\nUndersea Innovation War Game\nNon-Traditional Theater ASW War Game\t\nUDOC 2015\nFLEX provided funds to SCORE (Southern California Off-Shore Range) for range tracking, data collection, operations monitoring and safety services during UDOC experimentation event.\nFunds provided for installation and operation of antenna for telemetry transmission; temporary installs for Roll-on\/Roll-off passive acoustic Anti-Submarine Warfare (ASW) capability onboard two VMX-22 Osprey aircraft; three MK-30 unmanned underwater vehicle (UUV) targets to support at-sea data collection effort.\n\n4.\tAlternative Platforms with Payloads (APPS) Seminar War Game\nFLEX provided funds for subject matter expertise to define platforms, identify payloads, and enablers to integrate platform and mission payload.\t\n\n5.\tJoint High Speed Vessel (now Expeditionary Fast Transport (T-EPF)) At Sea Experiment Campaign\nFLEX funds:   \n   - Provided for the shipment of PUMA and associated equipment, onload and set-up of equipment, and air operations for Phase 2 of T-EPF execution\n   - Certification and Accreditation\n   -\tSupported installation and operation of an air\/surface radar in order to provide persistence surveillance capability aboard a JHSV\n   - Provided funds to Naval Ordnance Safety and Security Activity for the battery safety evaluation package.\n   - Provided funds for retrieval boat support\n   - Provided funds for the engineering support, system testing and post-installation support for Littoral Surveillance System (LSS), Scan Eagle, and PUMA.\n   - Range planning and site support for JHSV Southern Partnership Station 2015 Phase 1.\n\n6.\tRail Gun Seminar War Game\n\tFLEX provided funds for the subject matter expertise to evaluate platforms and weapons systems related to Rail Gun employment. \n7.\tTRIDENT WARRIOR 2015 (TW 15)\n    FLEX funds provided:\n\t- Technical support for the installation, integration, and operation of experimental technologies onboard selected vessels and at shore sites.\n    - Shipyard diagrams for PANDARRA NET (PANNET)\n    - Certification and accreditation for both GENSER and SCI ICOP (Intelligence Carry-on Program) experiment\n    - Application Integration (AI) process and Integrated Support Engineering Agent (ISEA) support for technologies installed aboard USN afloat platforms\n    - Installation and removal of TW15 technologies, and restoration of ship ISNS and ADNS configs upon completion of experiment event.\n    - Site survey, system engineering, and planning yard diagrams\n    - Integration of Maritime Domain awareness fusion correlator\n    - Funds provided for Integrated Testing Facility (ITF) laboratory for Assured Compliance Assessment Solution (ACAS) testing in a classified environment \n\n8.\tNetted Sensors At Sea Experiment\nFLEX funds provided for Tactical Targeting Network) radios support to include:\n-\tSite support for air platforms and installation and Integration of TTNT radios\n-\tE-2 system test laboratory support\n-\tAnalysis report for E-2D as related to Netted Sensors\n-\tGround and flight testing\n-\tClassified laboratory support\n-\tCertification and Accreditation\nDeliverables:  \n-\tData collection plan used to develop aircraft orbits\n-\tNetwork diagrams and accreditation boundary diagrams\n-\tAnalysis report"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FLEX Project 3319 was previously funded under PE 0604707N\n\nThe FY16 FLEX ExPlan is based on four USFF\/CPF directed focus areas to include, Multi-mission Electromagnetic Maneuver Warfare, Naval Integrated Fires, Full Spectrum Mine Warfare, and Unmanned Systems.  Additionally, FLEX will support the introduction of new platform capabilities. FLEX ExPlan for FY 2016 includes the following events:\n\n1.\tNaval Integrated Fires (NIF) Campaign 3 Non-Kinetic War Game\n- Project 3319 will continue to provide funds for Modeling and Simulation support, and wargame execution\n\n2.\tElectromagnetic Maneuver Warfare Experiment Campaign\nProject 3319 will continue to provide funds for series of events to include:\n-\tFleet Battle Experiment\n-\tEMW Technical War Game (Spectral Tsunami 16-1)\n-\tKRYSTAL SPHINX\nFunds will be provided for technical and engineering, analysis, certification and accreditation, range and target support for efforts related to EMW.\n\n3.\tLogistics Force Assured C2 War Game\nProject 3319 will continue to provide funds for subject matter expertise in support of the Logistics Force Assured C2 wargame.\n\n4.\tTrident Warrior 2016 At-Sea Experiment\n\tProject 3319 will continue to provide funds for Certification and Accreditation, range, targets, technical and engineering support, installation and de-installation of experiment technologies onboard selected vessels and at shore sites.\n\n5.   Project 3319 will continue to provide funds for technical and subject matter expertise throughout the experiment planning, execution, and analysis process for the following FLEX events\/campaigns: \n- Unmanned System Series of Events\n- T-EPF At-Sea Experiment\n- Navy Tactical Data Network At-Sea Experiment\n- Undersea Domain Operating Concept (UDOC) Experimentation Campaign\n-\tUndersea Innovation Seminar War Game\n-\tTheater Undersea Warfare (TUSW) Command and Control (C2) Seminar War Game\n-\tUDOC At-Sea Experiment\n \n-Strike Weapon Evaluations\n-Mine Warfare (MIW) Innovation War Game\n-MIW At-Sea Experiment\n-Netted Sensor System War Game"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.410"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.410"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Although FY17 focus areas have not officially been selected, the FLEX program is designed to be campaign-based with the focus areas carrying forward year-to-year (with potentially slight modifications based on current posture, gaps, and threats). The FY16 ExPlan was based on four USFF\/CPF directed focus areas to include, Multi-mission Electromagnetic Maneuver Warfare, Naval Integrated Fires, Full Spectrum Mine Warfare, and Unmanned Systems.  In addition to the four named areas, FLEX will also be leveraged to support new platform introduction capabilities. FY17 experimentation will be executed following the prior named FY16 focus areas and as laid out in the draft FLEX ExPlan for FY 2017 as follows:\n1.\tEMW Experiment Campaign:\t\n-\tFleet Battle Experiment EMW (FBX EWM 17)\n-\tNavy Tactical Data Network At-Sea Experiment (Phase Two)\n-\tReal Time Spectrum Operations (RTSO) Speed to Fleet At-Sea Experiment\t\n\n2.\tNaval Integrated Fires (NIF) Campaign Focus:\nExecute Kinetic Wargame FY17.\n\n3.\tUndersea Warfare Vision 2025 Experimentation Campaign to include: \n-\tUndersea Innovation Seminar War Game\n-\tUSW Vision 2025 At-Sea Experiment\n-\tNon-Traditional Theater Anti-Submarine Warfare (ASW) At-Sea Experiment\n\n4.\tTrident Warrior 2017 At-Sea Experiment\n\n5.\tMine Warfare (MIW) Innovation War Game\n\tMIW At-Sea Experiment\n\n6.\tUnmanned Systems Experimentation\n7.\tLCS Manned\/Unmanned Aviation Integrated Operations At-Sea Experiment"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expeditionary SFOC Communications"
                                    },
                                    "Description": {
                                        "val": "Request a new Project Number for this Classified Project:  Expeditionary SFOC Communications\n\nThe Expeditionary Submarine Fiber Optic Cable (SFOC) Communications project is developing and experimenting innovative concepts designed to validate both material and non-material methodologies to provide resilient command and control within the maritime domain.  The project focus is to demonstrate capabilities that leverage existing DOD investments and infrastructure using non-traditional means to move data and information.  The key deliverable will be a demonstration using maritime assets, experimental methodologies, and current backhaul architecture to validate C2 data movement in the maritime domain.  Continue the development and refinement of advanced networking and communication capabilities in a maritime environment that promote C2 interoperability in Satellite Communications (SATCOM) - Restricted and SATCOM - Denied environments, and support the defeat Anti-Access Area Denial (A2\/AD).  Solutions will address higher bandwidth technologies across the Radio Frequency (RF) and Optical spectrum.\n\nD. Acquisition Strategy:\n\nExpeditionary SFOC Communications is a non-acquisition program that promotes DoD interoperability to achieve resilient C2 data flows by facilitating maritime architectures in both processes and communications systems, including emerging capabilities, to counter growing high-end asymmetric threats, and is a key enabler of the Combatant Commanders C2 functionality.\n\nE. Performance Metrics:\n Expeditionary SFOC Communications will employ laboratory testing and at-sea demonstrations to assess specific technologies, operational concepts, and integrated Doctrine, Organization, Training, Material, Leadership, Personnel and Facilities (DOTMLPF) solutions pertaining to C2 communications and other aspects of Information Dominance (ID).  These assessments will report on identified capability gaps, link capability gaps to technology\/DOTMLPF gaps, identify technologies and DOTMLPF solutions considered ready for deployment, transition to a program of record to enhance war fighting capability and enhance interoperability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Classified project. Identified previous work done within OSD channels"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identified previous work done within OSD channels, and will leverage lessons learned.  Validated contractor work key for the successful implementation of concept SFOC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.544"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.544"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-\tAcquire maritime vessel as test article IAW objectives\n-\tModify vessel as required to meet demonstration objectives\n-\tDetermine demonstration location\n-\tIdentify Government Furnished Equipment required for successful demonstration\n-\tContinue the development and refinement of advance networking and communication capabilities in a maritime environment that promote C2 interoperability in Satellite Communications (SATCOM) - Restricted and SATCOM - Denied environments, and support the defeat of Anti-Access Area Denial (A2\/AD)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "FLEX is a non-acquisition program."
                        },
                        "PerformanceMetrics": {
                            "val": "Fleet Experimentation MOP:\n\tFLEX supports approximately 100 experimental initiatives annually address fleet identified capability gaps. The majority of this funding is applied toward acquiring intellectual capital in emerging technical areas through contracts providing engineering expertise, experiment design, execution and analysis support, range support, certification and accreditation of technical capabilities, targets, and supporting air assets, and it is also used to acquire engineering and integration costs associated with conducting campaign-based experiments.\nFleet Experimentation MOE:\n-\tCNO\/CUSFF\/CPF directed experiment for emerging future capability\n-\tMitigate critical capability gaps\n-\tInform Doctrine TTP, and training\n-\tInform Fleet Platform Wholeness or Warfighter CONOPS validation\n-\tImpact to Fleet Warfighting within the FYDP"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3320"
                    },
                    "ProjectTitle": {
                        "val": "TRIDENT Warrior"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.169"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.169"
                        },
                        "BudgetYearTwo": {
                            "val": "2.279"
                        },
                        "BudgetYearThree": {
                            "val": "2.321"
                        },
                        "BudgetYearFour": {
                            "val": "2.373"
                        },
                        "BudgetYearFive": {
                            "val": "2.420"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Trident Warrior (TW) was transferred from 0604231N to 0606355N from FY17 forward."
                        },
                        "ProjectMissionDescription": {
                            "val": "TW enables early delivery of Information Dominance (ID) capabilities to the warfighter via Fleet-directed TW operational events. Integrates stand-alone systems and efforts to achieve substantially enhanced capability, demonstrates\/tests these capabilities in both laboratory and operational environments, and evaluates their effectiveness. Develops supporting concepts and Concept of Operations to improve warfighting effectiveness. Coordinates ID efforts with other Service\/Joint\/Department of Defense\/National efforts to ensure Joint\/Interagency\/Allied\/Coalition applicability and interoperability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trident Warrior"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Trident Warrior was previously funded under PE 0604231N"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Trident Warrior was previously funded under PE 0604231N"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.169"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.169"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct analysis of Trident Warrior (TW)16 executed experiments in order to determine recommended next steps for Naval Warfare Development Command (NWDC).\n- In accordance with standardized procedures derived from experimentation best practices, coordinate TW participant efforts with specific goal identification, risk identification, and experiment plans to include data requirements and collection.\n- Coordinate TW participant efforts to achieve required installation and security certifications, accreditations and approvals.\n- Provide subject matter experts (SMEs) for core ship services during the experimentation period.\n- Provide independent experts to coordinate the establishment of, and compliance with, experiment plans and to lead analysis effort and provide unbiased assessment to decision makers for initiatives designated by NWDC.\n- Provide results to government sponsors to support the program's Planning, Programming, Budgeting, and Execution Process (PPBE) and engineering recommendations.\n- Plan and execute TW 17 operational events to accelerate the transition of Information Dominance (ID) capability to the Fleet.\n- Solicit participation, both commercial and government, for TW 18 and recommend inclusion of technologies responsive to identified Naval Capability Gaps. \n- Provide subject matter expertise, analysis, and recommendations in order help select technologies for participation in numbers supportable within resources."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Confirmation of Fleet and Joint Interoperability with technology candidates, Information Assurance Certification and Accreditation, and alignment with United States Fleet Forces (USFF) Commander's Guidance, and Systems Command (SYSCOM) Chief Engineer (CHENG) as well as related Program Executive Office (PEO) objectives and projected architectures."
                        }
                    }
                }
            ]
        }
    }
}