{
    "id": "3323471f66080ff32b310e018a5be293e9159cef",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602788F"
        },
        "ProgramElementTitle": {
            "val": "Dominant Information Sciences and Methods"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "146.951"
            },
            "CurrentYear": {
                "val": "169.183"
            },
            "BudgetYearOne": {
                "val": "161.650"
            },
            "BudgetYearOneBase": {
                "val": "161.650"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "159.214"
            },
            "BudgetYearThree": {
                "val": "166.251"
            },
            "BudgetYearFour": {
                "val": "169.690"
            },
            "BudgetYearFive": {
                "val": "171.865"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops enterprise-centric information technology for the Air Force. Advances in enterprise-centric information technologies are required to increase warfighter readiness and effectiveness by providing the right information, at the right time, in the right format, anytime, anywhere in the world. The Connectivity and Protection Tech project provides the technologies for multi-level, secure, seamless networks; advanced communications processors; anti-jam and low probability of intercept techniques, as well as technologies that deter any adversary from attacking computer systems while allowing access to, presence on, manipulation of, and operational effects on adversary computer systems. This project also develops the technology base for the next generation of ultra-wide-bandwidth, multi-channeled, air- and space-based communications networks. The Information Management and Computational Tech project provides advances in information management and dissemination technologies to ensure the delivery of high-quality, timely, secure information to the warfighter, and develop technologies to produce both advanced on demand computational processing and computer architectures with greater capacity and sophistication for addressing dynamic mission objectives under constraints imposed by Air Force systems. The Information Decision Making Tech project develops the technology to support the commander and staff's ability to command all viable options to achieve desired effects across the full spectrum of operations. The Operational Awareness Tech project develops technologies that improve their capability to generate, process, manage, fuse, exploit, interpret, and disseminate timely and accurate information. The Research Site Support project provides the Rome Research Site infrastructure at Rome, NY and provides for the continued operations of all Rome Research Site properties, buildings, and services necessary for the research mission. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nStarting in FY 2017 to improve reporting to Congress, Project 625319, Cyberspace Dominance Technology was created to capture all cyber activity that was previously performed in this program. Cyberspace Dominance Technology will develop technologies that deter any adversary from attacking computer systems while allowing access to, presence on, manipulation of, and operational effects on adversary computer systems; technologies to produce both advanced on demand computational processing and computer architectures; and technologies for secure and survivable enterprise operating at multiple domains. \n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "147.749"
                },
                "CurrentYear": {
                    "val": "164.909"
                },
                "BudgetYearOne": {
                    "val": "163.132"
                },
                "BudgetYearOneBase": {
                    "val": "163.132"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "146.951"
                },
                "CurrentYear": {
                    "val": "169.183"
                },
                "BudgetYearOne": {
                    "val": "161.650"
                },
                "BudgetYearOneBase": {
                    "val": "161.650"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.798"
                },
                "CurrentYear": {
                    "val": "4.274"
                },
                "BudgetYearOne": {
                    "val": "-1.482"
                },
                "BudgetYearOneBase": {
                    "val": "-1.482"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.226"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "4.500"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.798"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.482"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.482"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2015 reflects reprogramming to support Research and Development Projects, 10 U.S.C. Section 2358.\n\nDecrease in FY 2017 is due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "625315"
                    },
                    "ProjectTitle": {
                        "val": "Connectivity and Protection Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "64.217"
                        },
                        "CurrentYear": {
                            "val": "77.129"
                        },
                        "BudgetYearOne": {
                            "val": "31.228"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.228"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "31.456"
                        },
                        "BudgetYearThree": {
                            "val": "32.266"
                        },
                        "BudgetYearFour": {
                            "val": "31.579"
                        },
                        "BudgetYearFive": {
                            "val": "31.699"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies that enable assured, worldwide communications among all elements of the force. These communication technologies will provide en-route and deployed reach-back communications for distributed collaborative military operations. This project provides the technologies for secure, self-configuring, self-healing, seamless networks; advanced communications processors; anti-jam and low probability of intercept communications techniques; agile, dynamic policy based network management capabilities; and modular, programmable, low-cost software radios. This project also develops both the technology base for ultra-wide bandwidth, multi-channeled air- and space-based communications networks on and between platforms. In addition, the Air Force requires technologies to deliver a full range of options in cyberspace on par with air and space dominance in each of the areas of cyber-attack, cyber defense, and cyber support to achieve the strategic capability of cyber dominance. This project provides the technologies required to successfully deter any adversary from attacking computer systems anytime, anywhere by ensuring the Air Force's ability to: access, maintain presence on, and deliver effects to adversary systems; detect, defend, and respond to attacks on friendly computer systems as well as provide forensic analysis concerning those attack attempts; and provide cyber situational awareness to Air Force commanders. Starting in FY 2017 cyber work previously performed within this project will be reported under Project 625319, Cyberspace Dominance Technology."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.500"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Connectivity Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop improved, survivable, higher bandwidth communications, networking, and signal processing technologies to provide secure, adaptive, covert, anti-jam, and assured global battlespace connectivity tailored to anti-access and area-denial environments and contested operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.348"
                                            },
                                            "Text": {
                                                "val": "Completed an accelerated waveform development process and associated tools.  Demonstrated the digital portion of a 32 by 32 multiple input, multiple output (MIMO) system. Continued the 81 to 86 gigahertz (GHz) Traveling Wave Tube Amplifier (TWTA) development. Completed bench-top demonstration of quantum key distribution (QKD) in concert with a multi-access lasercom system. Initiated research to investigate the use of autonomy on small unmanned aircraft system platforms to support (semi-)autonomous distributed cooperative airborne tactics using airborne networks. Initiated the development and integration of waveform components, tools, and hardware into an innovative ecosystem for affordable rapid waveform development over a continuum of commercial-off-the-shelf (COTS)\/government-off-the-shelf (GOTS) software defined radio frequency architectures. Developed a waveform starter kit for multi-mission communications and radar. Performed dual site diversity radiometric testing for mitigating weather limitations. Continued development of automated process to port communication models to real-time hardware in the loop. Continued both development of secure video distribution over tactical internets on demand and design of distributed, cross-layer protocols for cognitive radio ad hoc networks with decentralized control. Continued the development of a modular airborne network bridge for the creation of an air-air\/air-ground secure tactical intranet. Continued the development of wideband, long range, rapidly deployable aerial backbone network for command, control, intelligence, surveillance, and reconnaissance (C2ISR) dissemination."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.122"
                                            },
                                            "Text": {
                                                "val": "Perform a field demonstration of the 32 by 32 MIMO system. Demonstrate a three node QKD  multi-access  laser communications system.  Plan a electromagnetic frequency band space experiment in the V and W bands for ground site locations, defining ground site equipment and data collection capabilities and analysis. Develop a software implementation of a low-bandwidth protocol for network situational awareness and management across heterogeneous networks. Derive an Air Force specification and S&T strategy for next-generation directional capabilities. Continue development of an automated process to port communication models to a real-time hardware in the loop simulation. Continue the development and integration of waveform components, tools, and hardware into an innovative ecosystem for affordable rapid waveform development over a continuum of COTS\/GOTS software defined radio frequency (SDRF) architectures. Continue both the development of secure video distribution over tactical internets on demand and the design of distributed, cross-layer protocols for cognitive radio ad hoc networks with decentralized control. Continue the development of a modular airborne network bridge for the creation of an air-air\/air-ground secure tactical intranet. Continue the development of wideband, long range, rapidly deployable aerial backbone network for C2ISR dissemination. Continue research to advance autonomy in unmanned air vehicles to support distributed cooperative airborne tactics using advanced communications techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.228"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.228"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate Aerial Layer Network Components; low-bandwidth protocol for network situational awareness (SA) and management across heterogeneous networks (Internet Protocol (IP)\/Non IP\/Other Tactical). Initiate investigation and research into new, high frequency pathways (i.e. V and W band of the electromagnetic spectrum) to support aerial and space-based Beyond Line of Sight (BLOS) communications. Initiate dynamic map-to-mission software for operations continuity and agile info management technology for secure message exchange. Work to continue the investigation of the use of autonomy on small unmanned aircraft system platforms to support semi-autonomous distributed cooperative airborne tactics using airborne networks. Initiate development of advanced hardware with embedded cyber protection for multi-mission agile RF capability. Demonstrate TWTA at 81 to 86 GHz continuous power of approximately 45 watts. Demonstrate a multi-access optical link at 30 kilometers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Defense Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop cyber defense and supporting technologies to detect, defend, and respond to attacks on computer systems as well as provide forensic analysis concerning the attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.860"
                                            },
                                            "Text": {
                                                "val": "Initiated research in Cyber ISR technologies to support integrated Signals Intelligence (SIGINT)-Cyber operations. Initiated development of innovative embedded system security techniques that protect critical high-value resources; initial use-case focus is command and control functions of unmanned aerial systems. Continued interaction with the University Center of Excellence (UCoE) in Assured Cloud Computing and collect performance results for a framework to assess cloud trustworthiness. Initiated research for enhanced cyber situational awareness through the automated assessment of mission execution through the analysis of network traffic flows."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.906"
                                            },
                                            "Text": {
                                                "val": "Continue development of embedded and resilient technologies; develop an initial prototype with separation, monitoring service and cryptographic key management. Continue enhancement, maturation, testing, and demonstration of Cyber Agility technologies through exercises and other user-focused venues toward the objective of transition. Continue Cyber Intelligence, Surveillance, and Reconnaissance (ISR) research by demonstrating of the first components of Cyber ISR and exploring the integration of any newly developed capability with existing ISR systems such as the Distributed Common Ground Station (DCGS). Continue interaction with UCoE in Assured Cloud Computing. Continue research for an innovative approach to mission awareness by making mission model, information, and behavioral analytical assessments of mission execution status and mission phase changes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017 and beyond, work accomplished under this Effort will be reported in Project 625319, Cyberspace Dominance Technology, under the Effort Cyber Defense Technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Offense Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop offensive cyber operations technologies to access, maintain presence on, and deliver effects to adversary systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.380"
                                            },
                                            "Text": {
                                                "val": "Continued development in software-defined radio (SDR) hardware, software, frameworks and interfaces matched with dynamic waveform techniques and cyberspace capabilities to detect, identify, locate and attack adversaries in anti-access area-denial (A2AD) environments.  Continued state of the art (SOTA) multi-channel, tactical transceiver technology as well as modular and hardware-flexible SDR components to operate over the entire electromagnetic spectrum (EMS) & Cyberspace Continuum including SIGINT, Electronic Warfare (EW), Cyber and Communications in a horizontally and vertically-scalable fashion. Researched and developed concepts for how the behaviors of living organisms (i.e. flocking, herding, swarming) could be advantageously applied to the enterprise operations realm.  Researched next generational operating systems and computer-based systems of interest for advancing cyber operation based capabilities. Developed prototype, proof of concept based capabilities.  Transitioned Cyber Mission Framework Prototype (Alpha) to the 67th Cyberspace Operations Group (Air Force Space Command) in San Antonio for evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.291"
                                            },
                                            "Text": {
                                                "val": "Continue development of existing capabilities to exploit and mitigate adversary threats in the EMS. Continue closed-loop learning techniques for applying EW and Cyberspace operations in composite fashion based on near-real-time feedback loops. Continue to mature SDR hardware and software at national-level exercises and pursue technology transfer\/transition to Joint platforms and Programs of Record. Continue to research and develop emerging technology for impacts to our cyber operation mission and determine how to incorporate the most promising technology into our cyber toolset. Continue development of technologies to remain current with new waveforms and signals. Continue Service Oriented Architecture (SOA) mission component development for use in the Air Force Life Cycle Management Center Cyber Mission Platform (CMP). Transition components, including mission reporting, for use in CMP. Continue red-teaming new components to improve security."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017 and beyond, work accomplished under this Effort will be reported in Project 625319, Cyberspace Dominance Technology, under the Effort Cyber Offense Technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop methods and technologies for controlled operation of information systems during attacks and fault conditions, minimizing vulnerabilities of cyber attacks, and guaranteeing the accuracy and correctness of data and codes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.235"
                                            },
                                            "Text": {
                                                "val": "Initiated research to orchestrate the dynamic employment of multiple survive and recover defense components, configurations, and services at the system level to assure and empower the mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.803"
                                            },
                                            "Text": {
                                                "val": "Continue research to orchestrate the dynamic employment of multiple survive and recover defense components, configurations, and services at the system level to assure and empower the mission. Focus effort on hiding mission essential functions (MEFs) in the cloud and rapidly recovering MEFs using the vast computing cloud resources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017 and beyond, work accomplished under this Effort will be reported in Project 625319, Cyberspace Dominance Technology, under the Effort Survivability Technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Technologies for Spectrum Warfare"
                                    },
                                    "Description": {
                                        "val": "Develop technologies combining electronic warfare, signals intelligence (SIGINT), communications, and cyber technologies that provide synergistic access, exploitation, and effects across air and cyber domains in congested and contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.394"
                                            },
                                            "Text": {
                                                "val": "Initiated development of methods to improve the identification, collection and geo-location, analysis and correlation of parametric data and information. These methods will maximize the information that can be extracted to include: source of the communication, location of the transmitter, function of the transmitter, Radio Frequency (RF) and other technical characteristics of the transmission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.507"
                                            },
                                            "Text": {
                                                "val": "Continue development of methods to improve the identification, collection and geo-location, analysis and correlation of parametric data and information. These methods will maximize the information that can be extracted to include: source of the communication, location of the transmitter, function of the transmitter, RF and other technical characteristics of the transmission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017 and beyond, work accomplished under this Effort will be reported in Project 625319, Cyberspace Dominance Technology, under the Effort Cyber Technologies for Spectrum Warfare."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625316"
                    },
                    "ProjectTitle": {
                        "val": "Info Mgt and Computational Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.814"
                        },
                        "CurrentYear": {
                            "val": "31.138"
                        },
                        "BudgetYearOne": {
                            "val": "12.966"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.966"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "12.528"
                        },
                        "BudgetYearThree": {
                            "val": "14.150"
                        },
                        "BudgetYearFour": {
                            "val": "13.982"
                        },
                        "BudgetYearFive": {
                            "val": "13.274"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires the capability to maximize the value, sharing, management, and use of its information and information assets in achieving its mission objectives as the importance of information grows in the current net-centric environment.  Technology development in this project must be capable of taking advantage of future net-centric environments including new structured and ad hoc processes in response to rapidly changing warfare challenges.  Advances in robust information management focus on quality of service and flow of information within the enterprise, information transformation and brokering, secure information sharing across and among domains, and collaboration of workflow within the enterprise.  Technologies addressed in this project include the ability to globally share, discover, and access information across organizational, functional, and coalition boundaries and between and among domains, the timely delivery of information to tactical assets, the tailoring and prioritization of  information based on mission needs and importance, and the scaling, robustness, and collaboration features required of the Air Force net-centric information management environment.  In addition, the Air Force requires the development of superior, intelligent, on-demand computing to enable information superiority.  Technology development in this project focuses on producing: computer architectures with greater capacity and sophistication for addressing constrained, dynamic mission objectives; \"game-changing\" computing power to the warfighter; disruptive computing power at the tactical edge and for federated grid services; and interactive and real-time computing improving the usability of high-performance computing to the Air Force.  It includes technologies in computational sciences and engineering, computer architectures, and software intensive systems. Starting in FY 2017 cyber work previously performed within this project will be reported under project 625319, Cyberspace Dominance Technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dissemination Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop technologies for decision quality information dissemination services via publish, subscribe, and query across the Global Information Grid (GIG) to enterprise and tactical assets and coalition partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.152"
                                            },
                                            "Text": {
                                                "val": "Completed development of information management services embedded with the sensor that will boost the effective communication bandwidth available to tactical users and link pilots, remotely piloted aircraft (RPA), and ground assets in the field. Continued development and design of cloud-based information management services for provisioning sufficient computational power for high demand semantic processing of large data sets within mission timeline constraints. Continued development of responsive autonomous control for tactical sensor control.  Initiated the development of highly scalable mission oriented middleware that semantically characterizes and contextualizes information to automatically identify and deliver mission relevant information to consumers in federated environments.  Initiated the development of information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared situational awareness (SA) across the theater of war for targeting and force protection operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.406"
                                            },
                                            "Text": {
                                                "val": "Continue research into scalable mission responsive data systems by mapping mission requirements to information flows. Continue development and design of cloud-based information management services for provisioning sufficient computational power for high demand semantic processing of large data sets within mission timeline constraints. Continue development of responsive autonomous control for tactical sensor control. Continue the development of highly scalable mission oriented middleware that semantically characterizes and contextualizes information to automatically identify and deliver mission relevant information to consumers in federated environments.  Continue the development of information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared SA across the theater of war for targeting and force protection operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.966"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.966"
                                            },
                                            "Text": {
                                                "val": "Continue to research scalable mission responsive data systems by mapping mission requirements to information flows and develop mission event trigger response components and complex event processing algorithms to monitor environment state across federations. Continue to develop highly scalable mission oriented middleware that semantically characterizes and contextualizes information to automatically identify and deliver mission relevant information to consumers in federated environments. Demonstrate multi-platform opportunistic sensor resource management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Processing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop automatic and dynamically reconfigurable, affordable, scalable, distributed petaflop processing technologies for real-time global information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.156"
                                            },
                                            "Text": {
                                                "val": "Continued development of advanced computing techniques, enabling superior information processing for Air Force warfighters through in-house research. Improved on-board processing to include real-time dissemination of three dimensional (3D) situational awareness of the battlespace.  Investigated the information management techniques necessary for an operator to publish, query and subscribe to services that enable the information to be provided to only those operators that require it without overloading existing communication links. Investigated the use of neuromorphic neural network techniques for real-time learning about unanticipated events (hypothesis discovery and testing). Initiated research to develop and demonstrate embedded high performance computing systems and integrate bio-inspired embedded computing hardware that delivers a set of autonomous sensing capabilities for Air Force Intelligence, Surveillance, and Reconnaissance (ISR) missions in the contested and A2AD environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.720"
                                            },
                                            "Text": {
                                                "val": "Continue research to develop and demonstrate embedded high performance computing systems and integrate bio-inspired embedded computing hardware that delivers a set of autonomous sensing capabilities for Air Force ISR missions in the contested and A2AD environments. Develop autonomous methods of discovering salient events by exploiting disparate sensor data via bio-logically inspired neuromorphic learning algorithms.  Develop algorithms that automatically make associations of disparately sensed signatures for a given event(s). Develop the algorithms so that they exploit low level information (raw data) from ISR sensors. Fabricate the enhanced Air Force Research Laboratory Secure Processor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017 and beyond, work accomplished under this Effort will be reported in Project 625319, Cyberspace Dominance Technology, under the Effort Processing Technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross Domain Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop secure cross domain discovery services for access to services outside of existing domain. Develop the tools to allow collaboration of workflows required by the Air Force net-centric information management environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.724"
                                            },
                                            "Text": {
                                                "val": "Developed an innovative approach to malicious code detection by running suspect files within a virtual environment and comparing the execution with normal application behaviors. Developed a secure foundation for mobile devices that will act as a foundation for a multiple levels of security (MLS) mobile device. Developed a cross-domain video teleconference (VTC) capability that allows VTC participants to be on networks of differing classification. Developed automated techniques to correlate network events to cross-domain systems (CDS) policy configurations allowing for automated remediation of attacks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.772"
                                            },
                                            "Text": {
                                                "val": "Develop techniques to allow rapid cross security domain enablement of IT systems. Continue development of a secure MLS mobile foundation. Continue development of malicious code detection techniques based upon runtime performance of applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017 and beyond, work accomplished under this Effort will be reported in Project 625319, Cyberspace Dominance Technology, under the Effort Cross Domain Technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Architectural Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop the architectural mechanisms that form the basis for predictable software and high assurance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.782"
                                            },
                                            "Text": {
                                                "val": "Completed creation of a trade space analysis tool used to determine feasibility and scale of autonomy on mobile systems. Completed demonstration of 3D stacking of logic chips on other logic chips while using standard processor fabrication lines. Initiated development of theory and techniques to continuously validate\/reestablish trust utilizing mission objectives & warfighter perspectives (environment). Developed a continuous calculus of trust (verification & validation) as the system executes the mission. Initiated research of trusted and resilient systems using evolutionary and formal approaches. Developed automated repairs that are trusted, understandable and maintainable by humans. Initiated research for embedded processor to address the middle range computing requirements and having significant cyber hardening features. Initiated research to develop new, unconventional processing technologies with greater than ten-times conventional processing energy efficiencies to allow efficient co-processing on-board."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.240"
                                            },
                                            "Text": {
                                                "val": "Integrate the hardened secure processor with its stacked dynamic random-access memory (DRAM) memory. Package the stacked chipset and test it on a printed circuit board. Continue research on a calculus of trust for measurement and understanding. Develop theory and techniques to continuously validate and\/or reestablish trust in resilient systems as they fight through attacks and failures (utilizing mission objectives and warfighter perspectives). Develop automated repairs that are trusted, understandable and maintainable by humans."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017 and beyond, work accomplished under this Effort will be reported in Project 625319, Cyberspace Dominance Technology, under the Effort Advanced Architectural Technologies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625317"
                    },
                    "ProjectTitle": {
                        "val": "Information Decision Making Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.035"
                        },
                        "CurrentYear": {
                            "val": "20.462"
                        },
                        "BudgetYearOne": {
                            "val": "14.770"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.770"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.585"
                        },
                        "BudgetYearThree": {
                            "val": "15.865"
                        },
                        "BudgetYearFour": {
                            "val": "15.695"
                        },
                        "BudgetYearFive": {
                            "val": "16.860"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires advances in technologies enabling the effective execution of military objectives that will vastly improve the ability to support the commander and staff's ability to command all viable options to achieve desired effects across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict.  Technology development in this project includes anticipatory decision support and course of action development, planning, scheduling and assessment, and the real-time effective portrayal of complex data sets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Campaign Planning Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced monitoring, planning, and assessment technologies  enabling aerospace commanders to develop effects-based campaigns."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.361"
                                            },
                                            "Text": {
                                                "val": "Continued development of robust autonomous control algorithms for heterogeneous and distributed assets capable of learning in dynamic environments. Completed research in cooperative agency and group transfer learning. Initiated research to develop a validation and verification methodology such that an agent acting autonomously will never act outside of a prescribed policy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.918"
                                            },
                                            "Text": {
                                                "val": "Initiate development of capabilities for combat planning and tactical assessment software services supporting distributed command and control (C2) capabilities at Tactical Air Control Systems (TACS) entities. Continue development of robust autonomous control algorithms for heterogeneous and distributed assets capable of learning in dynamic environments. Initiate research for robust autonomous system capable of self-adjustment and active learning under unforeseen circumstances. Demonstrate multi-agent autonomous ISR capabilities, given limited communications in Autonomous Test and Evaluation Environment simulations. Continue the development of a capability to allow operators to specify their own assessments and incorporate real world feedback to update and refine confidence metrics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.242"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.242"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and deliver combat planning and tactical assessment software services supporting distributed C2 capabilities at TACS entities. Continue to develop and demonstrate multi-agent autonomous ISR capabilities, given simulated hostile environments and limited communications at the Stockbridge testing site."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control System Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate, analyze, and develop technologies for planning, execution, and automatic rapid reconfiguration of distributed intelligent and integrated C2 information systems to achieve the commander's intent throughout varying crisis levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.674"
                                            },
                                            "Text": {
                                                "val": "Characterized Moving Target Defenses attributes and de-conflicted network and system resources across competing defenses. Completed development of fundamental visualization components that addressed existing and forth coming visualization problems for the Air Force, such as: live video over 3D terrain, radial mission map plots, semantic dataset overview, semantic dataset merging and filtering, thin-client point cloud visualization, server based point cloud distribution and analysis, and structured graph navigation. Initiated research on new concepts for space operations, such as the applicability of crowdsourcing methods in the space C2 domain; designed and implemented an Electromagnetic Spectrum Common Operational Picture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.544"
                                            },
                                            "Text": {
                                                "val": "Continue development of concepts for space operations. Continue electromagnetic spectrum course of action generation\/optimization, discrete optimization from a large input set, electromagnetic spectrum visualization, resource-oriented hybridized architecture and group-sourcing for command and control. Work to complete development of capability for the orchestration of the dynamic employment of multiple moving target defense components, configurations and services across the information enterprise to ensure the mission. Provide final delivery of Attack Surface Reasoning and Characterization of Proactive Defenses integration with local and remote testbeds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.528"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.528"
                                            },
                                            "Text": {
                                                "val": "Initiate horizontal and vertical integration of kinetic and non-kinetic effects assessment across domains. Initiate validity estimation and correlation. Initiate optimization and dynamic constraint monitoring. Initiate advanced visualizations of heterogeneous sources for understanding complex interaction. Continue electromagnetic spectrum course of action generation\/optimization, discrete optimization from a large input set, electromagnetic spectrum visualization, resource-oriented hybridized architecture and group-sourcing for C2."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625318"
                    },
                    "ProjectTitle": {
                        "val": "Operational Awareness Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.407"
                        },
                        "CurrentYear": {
                            "val": "19.198"
                        },
                        "BudgetYearOne": {
                            "val": "21.246"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.246"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "22.731"
                        },
                        "BudgetYearThree": {
                            "val": "23.753"
                        },
                        "BudgetYearFour": {
                            "val": "24.246"
                        },
                        "BudgetYearFive": {
                            "val": "24.900"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies that improve and automate the capability to generate, process, manage, fuse, exploit, interpret, and disseminate timely and accurate information.  This project provides not only a network-centric, collaborative intelligence analysis capability that enables the fusion of multi-intelligence and sensor sources to provide timely situational awareness, understanding, and anticipation of the threats in the battlespace, but also the advanced, novel exploitation technologies needed to intercept, collect, locate, and process both covert and overt raw data from intelligence and sensor sources.  It leads the research, discovery, and development of technology that enables the fusion of multi-intelligence sources to provide accurate object tracking and identification (ID), situational awareness, understanding, and anticipation of the threats in the battlespace (air, ground, space, and cyber).  It also leads in the development of advanced exploitation technologies to maximize the intelligence gained from our adversaries in the areas of spectral detection and geolocation, signal recognition and analysis, and the data tagging, tracking, and tracing via the insertion of secure, imperceptible signal embedding for future fusion and understanding of the information."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Source Fusion Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop higher-level fusion and the enabling text information\/knowledge base technologies to achieve situational awareness and understanding at all command levels for dynamic planning, assessment, and execution processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.795"
                                            },
                                            "Text": {
                                                "val": "Continued in-house and university research dealing with the information fusion using intelligence (INT) from multiple sources and sensor feeds to advance the Air Force capability to anticipate the variety of threats from the ground, air, and cyber domains. Applied advanced reasoning techniques to multi-INT data including SIGINT and space surveillance network (SSN) data to assess space objects and determine significance of activity. Continued the development of on-board technologies that integrate and fuse data from disparate sensors and sources. Integrated on-board passive 3D processing to enhance algorithm performance and provide operators with greatly improved situational awareness. Continued to develop multi-INT fusion for contested environments to aid National Air and Space Intelligence Center (NASIC) & DCGS analysts. Developed automatic optimization of tracking algorithms across sensors, modes, and regions. Migrated tools and data to distributed (cloud) computing to extract additional performance gains. Provided baseline Activity-Based Intelligence (ABI) capabilities and metrics. Developed distributed cross-document co-reference for automated consolidation of information across documents; a flexible and adaptive platform for layered Network analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.699"
                                            },
                                            "Text": {
                                                "val": "Complete in-house and university research dealing with the information fusion using INT from multiple sources and sensor feeds to advance the Air Force capability to anticipate the variety of threats from the ground, air, and cyber domains. Analyze emerging activities across multiple domains in both tactical and strategic timelines. Continue applying advanced reasoning techniques to multi-INT data including SIGINT and SSN data to assess space objects and determine significance of activity. Address the contested operations ISR analysis needs for multi-INT breadth spanning standoff-perishable-hard\/soft collection & processing via development of spatial-temporal mining and correlation capabilities across the INT spectrum using both batch and streaming cloud analytics. Provide advanced ABI tools with built-in optimization tailored against operator objectives. Develop techniques to provide a deeper understanding of the meaning of information extracted from open source text, messages, reports, social media and other associated data sources and large scale, time dependent, network based analytics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.283"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.283"
                                            },
                                            "Text": {
                                                "val": "Continue to develop Space Situational Awareness & Space Protection Domain Specific Applications. Continue to analyze and correlate observations from sensors, to produce tracks, to extract kinematic and non-kinematic features, and to learn target object behavior. This information will be used to assess capabilities, purpose, and intent and produce indications and warnings of anomalies associated with the object behavior. Continue to develop multi-INT techniques using context-based, pattern of life analysis for permissive and contested environments. Continue development of techniques (a) for information extraction from network analysis; (b) for complex event extraction to understand how individual events fit together conceptually, into some higher-level logical structure (e.g., based on causality, temporal ordering, etc.); and (c) for social media analytics focused on entity and account resolution, spatial and content analysis, temporal analysis, noise reduction, and community structures. Continue to develop a distributed multi-INT processing, exploitation, and dissemination (PED) software framework. Incorporate automated or operator-assist ABI product generation to expedite analyst workflow, and provide ABI analytics with PED (both streaming and forensic) driven by the analyst."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Exploitation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop digital information exploitation technologies for electronic communications and special signals intelligence, imagery, and measurement signatures to increase accuracy, correlation, and timeliness of the information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.720"
                                            },
                                            "Text": {
                                                "val": "Investigated novel algorithms for collection, identification, detection and geo-location of modern emitter signals. Experimented with digital hardware solutions for capturing modern emitter signals. Improved feature extraction techniques for performance across multiple data sets, improve modeling efficiency for algorithms, investigate new classifier techniques, and improve performance on cross-platform data. Applied previously developed Level Zero fusion algorithms to recorded data for performance analysis. Derived distributed fusion approach that operates across a network of distributed, multi-modality, sensors. Incorporated machine learning approaches into event discovery. Continued development of an automated capability to search and retrieve objects of interest in full motion video (FMV) sources and correlate with information from multiple intelligence sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.085"
                                            },
                                            "Text": {
                                                "val": "Continue development prototype hardware and software solutions for modern emitter signals which improve upon the signal characterization, detection and mitigation of coding and channel condition effects, and advance information extraction capabilities. Continue algorithmic improvements in signal characterization, detection and mitigation of coding\/channel condition effects. Develop improvements for feature extraction methods and performance across multiple data sets. Finalize evaluation of FMV exploitation tools, and select the best of breed. Initiate the development of capabilities for the exploitation of intelligence information using topological mathematical approaches applied to the SIGINT domain."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.646"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.646"
                                            },
                                            "Text": {
                                                "val": "Test and integrate enhanced Electronic signals intelligence non-traditional feature extraction capabilities into airborne platforms. Investigate Deep Neural Network features and classifiers. Improve scatter statistics for model mismatch conditions. Refine confidence measures for real-time language identification. Continue to develop topological algorithm analytics to exploit features for anomaly and\/or pattern detection. Continue SIGINT characterization algorithm development and refine methods based on feedback. Develop specialized SIGINT change detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Command Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop modeling and simulation technologies for the next generation of planning, assessment, and execution environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.892"
                                            },
                                            "Text": {
                                                "val": "Developed a CATALiST (Common Automated Targeting Architecture Linking integrated Solution Threads) framework which includes: data and user management; security and role-based access; integrated and re-configurable workflows linking targeting materials production tasks, tools, and dashboards; dashboards which enable real-time management of targeting material production resources; and several automated tools integrated within the framework to increase product quality, shorten the production time, as well as incorporate cyber, electronic warfare, and kinetic targeting options across classified domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.414"
                                            },
                                            "Text": {
                                                "val": "Continue to develop a capability that identifies targets with non-kinetic data and propose new workflows for such targets. Work towards illustrating the time saved for Battle Damage Assessment (BDA) by performing assessment with non-geospatial intelligence data. Conduct tests using electromagnetic data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.317"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.317"
                                            },
                                            "Text": {
                                                "val": "Continue building capabilities to support BDA and non-kinetic integration. Develop capability that semi-automatically extracts and visualizes relationships within target system, automatically prioritize\/rank targets based on identified relationships, semi-automatically update understanding of the target situation analysis when new batches of reports arrive and illustrates how integration of non-kinetics and prioritization that comes from target system analysis can help bomb damage assessment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625319"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Dominance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "59.712"
                        },
                        "BudgetYearOneBase": {
                            "val": "59.712"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "56.815"
                        },
                        "BudgetYearThree": {
                            "val": "58.695"
                        },
                        "BudgetYearFour": {
                            "val": "62.226"
                        },
                        "BudgetYearFive": {
                            "val": "62.739"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires the development of superior, intelligent on demand computing to enable information superiority to include advances in secure information sharing across domains and boundaries as well as technologies that successfully deter any adversary from attacking computer systems anytime, anywhere by ensuring the Air Force’s ability to; assess, maintain presence on, and deliver effects to adversary systems; detect, defend and respond to attacks on friendly computer systems and provide forensic analysis concerning those attack attempts; and provide cyber situational awareness to Air Force Commanders. In addition, the Air Force requires technology development that produces computing architectures with greater capacity and sophistication for addressing constrained, dynamic mission objectives; “game-changing” computing power to the warfighter, disruptive computing power at the tactical edge and for federated grid services; and interactive and real-time computing improving the usability of high performance computing to the Air Force. It includes technologies in computational sciences and engineering, computer architectures and software intensive systems.\n\nPrior to FY 2017 cyber work performed internal to this program within Project 625315, Connectivity and Protection Technology, and Project 625316, Info Management and Computational Technology now will be reported under this project, Cyberspace Dominance Technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Defense Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop cyber defense and supporting technologies to detect, defend, and respond to attacks on computer systems as well as provide forensic concerning attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.081"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.081"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed under Project 625315, Connectivity and Protection Technology in the effort, Cyber Defense Technologies\n\nContinue development of Decision Engine and tesbed. Initiate demonstration of all system system components, with reduced scale and feature set.\nDevelop validation techniques that assess qualitative effects of mission awareness analytics. Develop a secure foundation for mission models that cross DoD-domains while maintaining robustness, awareness capabilities, and engage assurance technologies. Include live autonomous systems and integrate Stockbridge facility into cyber exercise structure. Address new gaps identified in the initial effort, expand upon results of initial effort, and explore additional capabilities. Continue collaborations with University Center of Excellence in Assured Cloud Computing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Offense Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop offensive cyber operations technologies to access, maintain presence on, and deliver effects to adversary systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.424"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.424"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed under Project 625315, Connectivity and Protection Technology in the effort, Cyber Offense Technologies\n\nContinue to research new technology that shows promise and game changing possibility. Develop technologies to remain current with new waveforms and signals. Continue SOA mission component development for use in the Air Force Life Cycle Management Center CMP system. Transition components, including Cyber Time and Cyber Mission Planning, for use in the CMP system. Continue red-teaming new components to improve security."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Architectural Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop the architectural mechanisms that form the basis for predictable software and high assurance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.571"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.571"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed under Project 625316, Info Management and Computational Technology in the effort, Advanced Architectural Technologies.\n\nContinue cyber hardened processor for embedded weapon systems. Develop a runtime environment that can monitor and maintain a trusted and resilient envelope of operation. Initiate fabrication for the prototype neuromorphic processor hardware."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Processing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop automatic and dynamically reconfigurable, scalable, affordable distributed peta-flop processing technologies for real-time global information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.979"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.979"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed under Project 625316, Info Management and Computational Technology in the effort, Processing Technologies\n\nAdvance and test 128 by 128 Memristor Cross-Bar and apply application.  Develop and test TrueNorth and Secure Processor input\/output native network. Work to complete evaluation and test of context-aware services for historical human intelligence and scene understanding on open source database. Test and evaluate capability to automatically generate tactical actionable intel relevant to mission\/analyst needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop methods and technologies for controlled operation of information systems during attacks and fault conditions, minimizing vulnerabilities of cyber attacks, and guaranteeing the accuracy and correctness of data and codes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.560"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.560"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed under Project 625315, Connectivity and Protection Technology in the effort, Survivability Technologies\n\nContinue to research revolutionary concepts and capabilities for automated and autonomous processes addressing cyber survivability using an operational system laboratory to host modular RDT&E. Integrate basic machine learning functions into defensive cyber operations systems. Research and create prototype for memory isolation and disk introspection. Research processing vulnerabilities between encryption mechanisms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross Domain Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop secure cross domain discovery services for access to services outside the existing domain. Develop the tools to allow collaboration of workflows required by the Air Force net-centric information management system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.488"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.488"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed under Project 625316, Info Management and Computational Technology in the effort, Cross Domain Technologies\n\nContinue research on cross domain change detection, cross domain machine to machine mediation layer and multiple levels of security mobile secure foundation technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Technologies for Spectrum Warfare"
                                    },
                                    "Description": {
                                        "val": "Develop technologies combining electronic warfare, signals intelligence (SIGINT), communications, and cyber technologies that provide synergistic access, exploitation and effects across air and cyber domains in congested and contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.609"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.609"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed under Project 625315, Connectivity and Protection Technology in the effort, Cyber Technologies for Spectrum Warfare.\n\nContinue development of active and passive methods to locate, acquire and process data and signals of interest."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62OMMS"
                    },
                    "ProjectTitle": {
                        "val": "Research Site Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.478"
                        },
                        "CurrentYear": {
                            "val": "21.256"
                        },
                        "BudgetYearOne": {
                            "val": "21.728"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.728"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "21.099"
                        },
                        "BudgetYearThree": {
                            "val": "21.522"
                        },
                        "BudgetYearFour": {
                            "val": "21.962"
                        },
                        "BudgetYearFive": {
                            "val": "22.393"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The AFRL Information Directorate leads the discovery, development and implementation of information science and technology to drive transformation within the Air Force and across the DoD. The focus of the work is to provide the warfighter with the required technology-based capabilities to defend the Nation by unleashing the power of innovative information science and technology to anticipate, find, fix, track, target, engage, and assess anything, anytime, anywhere. Since the site is a single-purpose location not located on a military installation, the Information Directorate has unique requirements for supporting its S&T mission.  As the host unit, the directorate is responsible to provide the Rome Research Site infrastructure at Rome, NY and provide for the continued operations of all Rome Research Site properties, buildings, and services necessary for the research mission.  Operations include: logistics and communication services, utilities, maintenance of facilities and structures, safety and security of the workforce and visiting researchers, and ensures compliance with the laws, regulations and directives that pertain to site operations.  These services are host unit responsibilities and are necessary to provide a safe and effective environment for the Research Site's workforce and mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rome Research Infrastructure"
                                    },
                                    "Description": {
                                        "val": "Provide the necessary services and support including, but not limited to: fire inspections, refuse collection, water, electricity, steam, heat, custodial, and grounds maintenance services to the Research Site. Provide the necessary support for the maintenance and repair of Research Site facilities (buildings and other structures), vehicle and equipment lease and security\/safety inspections and services as necessary for compliance and safety\/security of personnel and research assets.  Provide the Research Site with long haul communications (using the Government Services Administration (GSA) set of NETWORX contracts for Continental U.S.), trunk connectivity and wireless communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.478"
                                            },
                                            "Text": {
                                                "val": "Provided civilian payroll and non-pay costs for installation operations in support of the Rome Research Site property and all onsite personnel. Provided facilities, facility operations, facility sustainment, support equipment, contracts and associated costs to plan, manage and execute the following functions: fire prevention, disaster preparedness, plant operation and purchase of commodity, refuse collection, pavement clearance of snow and ice, grounds maintenance including landscaping, real property special inspections, pest control and custodial services. Provided Real Property Management & Engineering Services, including: (1) Facility Management and Administration and (2) Installation Engineering Services. Facility Management includes public works management costs, contract management, material procurement, facility data management, furnishings management costs, and real estate management. Installation Engineering Services included annual inspection of facilities, master planning, overhead of planning and design, overhead of construction management, and non-Sustainment and Restoration Modernization (SRM) service calls. Provided basic installation communication services, including long haul trunk and telecommunications services. Provided site vehicle lease under GSA for logistics, security, and mission support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.256"
                                            },
                                            "Text": {
                                                "val": "Provide civilian payroll and non-pay costs for installation operations in support of the Rome Research Site property and all onsite personnel. Provide facilities, facility operations, facility sustainment, support equipment, contracts and associated costs to plan, manage and execute the following functions: fire prevention, disaster preparedness, plant operation and purchase of commodity, refuse collection, pavement clearance of snow and ice, grounds maintenance including landscaping, real property special inspections, pest control and custodial services. Provide Real Property Management & Engineering Services, including: (1) Facility Management and Administration and (2) Installation Engineering Services. Facility Management includes public works management costs, contract management, material procurement, facility data management, furnishings management costs, and real estate management. Installation Engineering Services includes annual inspection of facilities, master planning, overhead of planning and design, overhead of construction management, and non-SRM service calls. Provide basic installation communication services, including long haul trunk and telecommunications services. Provide site vehicle lease under GSA for logistics, security, and mission support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.728"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.728"
                                            },
                                            "Text": {
                                                "val": "Provide civilian payroll and non-pay costs for installation operations in support of the Rome Research Site property and all onsite personnel. Provide facilities, facility operations, facility sustainment, support equipment, contracts and associated costs to plan, manage and execute the following functions: fire prevention, disaster preparedness, plant operation and purchase of commodity, refuse collection, pavement clearance of snow and ice, grounds maintenance including landscaping, real property special inspections, pest control and custodial services. Provide Real Property Management & Engineering Services, including: (1) Facility Management and Administration and (2) Installation Engineering Services. Facility Management includes public works management costs, contract management, material procurement, facility data management, furnishings management costs, and real estate management. Installation Engineering Services includes annual inspection of facilities, master planning, overhead of planning and design, overhead of construction management, and non-SRM service calls. Provide basic installation communication services, including long haul trunk and telecommunications services. Provide site vehicle lease under GSA for logistics, security, and mission support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}