{
    "id": "3473636d52bda62b960eeb5fd63237c5baaeb9a5",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA6_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605602A"
        },
        "ProgramElementTitle": {
            "val": "Army Technical Test Instrumentation and Targets"
        },
        "R1LineNumber": {
            "val": "145"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "43.961"
            },
            "CurrentYear": {
                "val": "51.550"
            },
            "BudgetYearOne": {
                "val": "52.404"
            },
            "BudgetYearOneBase": {
                "val": "52.404"
            },
            "BudgetYearTwo": {
                "val": "49.354"
            },
            "BudgetYearThree": {
                "val": "54.270"
            },
            "BudgetYearFour": {
                "val": "56.753"
            },
            "BudgetYearFive": {
                "val": "58.238"
            }
        },
        "ProgramElementNote": {
            "val": "Not applicable for this item."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element provides critical front-end investments for development of new test methodologies; test standards; advanced test technology concepts for long range requirements; future test capabilities; advanced development of modeling and simulation (M&S) and instrumentation prototypes; and the full development of test instrumentation for the United States Army Test and Evaluation Command (ATEC), which includes the Operational Test Command (OTC) at Ft Hood, Texas; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; Yuma Test Center (YTC) at Yuma Proving Grounds (YPG), Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska and the Tropics Regions Test Center (TRTC), at various locations); and Redstone Test Center (RTC), Redstone Arsenal, Alabama. OTC consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Integrated Test and Evaluation Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas. These activities support the development and fielding cycle of all Army acquisition programs including rapid fielding initiatives. Sustainment funding maintains existing testing capabilities at all locations by replacing unreliable, uneconomical, and irreparable instrumentation, as well as incremental upgrades of hardware and software for modeling and simulation (M&S) and instrumentation systems to assure adequate test data collection capabilities. This data supports acquisition milestone decisions for all commodity areas throughout the Army including programs such as the Joint Light Tactical Vehicle (JLTV), Advanced Multi-Purpose Vehicle (AMPV),  Network Integration Evaluation (NIE), Patriot Advance Capability Phase 3 (PAC-3), Warfighter Information Network - Tactical (WIN-T), Stryker, Bradley, Abrams, Guided Multiple Launch Rocket System (GMLRS), Joint Tactical Radio System (JTRS),and the Distributed Common Ground System - Army (DCGS-A)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "45.573"
                },
                "CurrentYear": {
                    "val": "51.550"
                },
                "BudgetYearOne": {
                    "val": "52.773"
                },
                "BudgetYearOneBase": {
                    "val": "52.773"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.961"
                },
                "CurrentYear": {
                    "val": "51.550"
                },
                "BudgetYearOne": {
                    "val": "52.404"
                },
                "BudgetYearOneBase": {
                    "val": "52.404"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.612"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.369"
                },
                "BudgetYearOneBase": {
                    "val": "-0.369"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.612"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.369"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.369"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease to programs due to adjustments in inflation rates."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "628"
                    },
                    "ProjectTitle": {
                        "val": "Developmental Test Technology & Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.858"
                        },
                        "CurrentYear": {
                            "val": "41.688"
                        },
                        "BudgetYearOne": {
                            "val": "42.512"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.512"
                        },
                        "BudgetYearTwo": {
                            "val": "34.092"
                        },
                        "BudgetYearThree": {
                            "val": "35.755"
                        },
                        "BudgetYearFour": {
                            "val": "37.874"
                        },
                        "BudgetYearFive": {
                            "val": "38.865"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program provides critical front-end investments for development of new test methodologies, test standards, advanced test technology concepts for long range requirements, future test capabilities, and advanced instrumentation prototypes for subordinate commands of the Army Test and Evaluation Command (ATEC). These capabilities are required to support developmental testing requirements of high priority Army systems supporting Army modernization efforts. Where practical, efficiencies will be gained through the common use of developmental instrumentation in operational testing.  A key element is sustaining aging instrumentation which maintains existing capabilities at test facilities by replacing unreliable, uneconomical and irreparable instrumentation, as well as lifecycle replacement and incremental upgrades of instrumentation and software, reducing their average age to assure adequate testing capabilities. This project develops and sustains developmental test instrumentation and capabilities that provide the data necessary to support acquisition milestone decisions for all commodity areas throughout the Army. Significant examples include new instrumentation for the testing of Command, Control, Communication and Computer (C4) systems, upgrades to existing radars to extend their economic life, common data collection and analysis tools, non-intrusive instrumentation to test Unmanned Ground Vehicles and sensors, high speed - high definition digital imaging systems to capture missile flight events, and automation software to improve data collection of reliability, availability, and maintainability (RAM) testing."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Developmental Test Technology Investment"
                                    },
                                    "Description": {
                                        "val": "Develops, acquires and sustains critical test technology and instrumentation: Provides the necessary test instrumentation, computer and communications systems, data collection, analysis and reporting equipment and other test capabilities to successfully develop and test Army weapons and equipment. Provides the necessary live, virtual and constructive environment, hardware-in-the-loop capabilities and models and simulations needed for testing the Army materiel. Acquires instrumentation to measure performance of C4 systems; reliability, availability and maintainability (RAM) data collection on tracked and wheeled vehicles; ballistic transducers for measuring chamber pressures during ammunition tests; supports development of common data collection instrumentation and data management systems used in testing across all test commodity areas and test lifecycles; continues replacement and upgrade of range control instrumentation, radar, optics and telemetry equipment used in missile testing; acquires data recorders, signal conditioning equipment, data processing equipment and other instrumentation for various aircraft tests; upgrades natural environments test instrumentation used for testing weapon systems, vehicles, munitions and support equipment in extreme hot desert environments as well as extreme cold conditions; continues upgrade of survivability\/vulnerability test capabilities in support of live fire testing; upgrades and replaces mobile range communications equipment and digital end devices; and improves test efficiency through the use of smart devices as data collectors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.416"
                                            },
                                            "Text": {
                                                "val": "Continued to provide, acquire and upgrade instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and support the test capability of live fire survivability testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.688"
                                            },
                                            "Text": {
                                                "val": "Continues to provide, acquire and upgrade instrumentation for C4, RAM, ballistics, missile, aviation and environmental testing across all test commodity areas, and enhance\/expand the use of common data collectors, smart devices, and enterprise data management tools"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.512"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.512"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide, acquire and upgrade instrumentation for C4, RAM, ballistics, missile, aviation and environmental testing across all test commodity areas and enhance\/expand the use of common data collectors, smart devices, and enterprise data management tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Homemade Explosive Characterization Study"
                                    },
                                    "Description": {
                                        "val": "Homemade explosives are the prevalent underbody threat in Operation Enduring Freedom area of operation. Currently live fire testing cannot use Army G2-validated homemade explosive surrogate because its performance has varied greatly from test-to-test. This study will characterize subscale and full scale repeatability of Army G2-validated surrogate homemade explosive charge for use in live fire test events and compare the performance relative to TNT standard. Results from this homemade explosive characterization will inform efforts to improve combat vehicle survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.442"
                                            },
                                            "Text": {
                                                "val": "Completed the quantification of target responses of homemade explosive surrogates and additional standard TNT mine threats used in live fire testing and provide data set to support future verification, validation, and accreditation (VV&A) of underbody blast modeling and simulation tools."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62C"
                    },
                    "ProjectTitle": {
                        "val": "Modeling and Simulation Instrumentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.103"
                        },
                        "CurrentYear": {
                            "val": "9.862"
                        },
                        "BudgetYearOne": {
                            "val": "9.892"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.892"
                        },
                        "BudgetYearTwo": {
                            "val": "15.262"
                        },
                        "BudgetYearThree": {
                            "val": "18.515"
                        },
                        "BudgetYearFour": {
                            "val": "18.879"
                        },
                        "BudgetYearFive": {
                            "val": "19.373"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "The U.S. Army Test and Evaluation Command (ATEC) plans, conducts and reports on operational tests, assessments and experiments in order to provide essential information for the acquisition and fielding of War Fighting Systems.  Operational Test (OT) Instrumentation collects required data from both the systems being tested and the surrounding activities for real-time test control as well as for supporting effectiveness, survivability, and suitability analysis.  The Army's OPTEMPO has reduced the number of tactical units and vehicles available to support OT, making enhancement of live forces through simulation essential for testing in a realistic, operational environment by simulating tactical engagements, additional units, message traffic, effects, and terrain.  ATEC OT Modeling, Simulation and Instrumentation (MS&I) funding is used to adapt capabilities from other organizations (including within ATEC), purchase off-the-shelf systems, and develop and sustain OT-unique simulation and instrumentation systems.  As required, the Program Executive Office for Simulation, Training, and Instrumentation (PEO STRI) Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) provides development and integration of major simulation and instrumentation systems.  The MS&I (Sustainment and Minor Development) program funds the expertise and the adaptation, purchases, minor development and sustainment requirements that support systems undergoing OT. Costs unique to specific systems under test may require Program Manager (PM) funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modeling, Simulation and Instrumentation"
                                    },
                                    "Description": {
                                        "val": "Develop and enhance ATEC's simulation\/stimulation of Mission Command, Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Improve and sustain our Real-Time Casualty Assessment (RTCA) (including Integrated LVC Test Environment (ILTE)) capabilities. Plus develop, enhance, and sustain our Performance Instrumentation Systems, Time Space Positioning Information (TSPI) and Telemetry Systems, and Imaging Systems together with their associated data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.103"
                                            },
                                            "Text": {
                                                "val": "FY15 Planned Programs - Continued to sustain and enhance ATEC's simulation\/stimulation of Mission Command, Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Continue to improve our Real-Time Casualty Assessment (RTCA) (including ILTE) capabilities to support future AMPV and the Bradley Performance Improvement Program (PIP), Stryker PIP, and Abrams PIP OTs. Sustain and develop our Performance Instrumentation Systems and associated data management, Time Space Positioning Information (TSPI) and Telemetry Systems and associated data management, and Imaging Systems and associated data management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.862"
                                            },
                                            "Text": {
                                                "val": "FY16 Planned Programs - continues to sustain and enhance ATEC's Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Continue to improve our Real-Time Casualty Assessment (RTCA) (including ILTE) capabilities to support future AMPV, and the Bradley Performance Improvement Program (PIP), Stryker PIP, and Abrams PIP OTs. Sustain and develop our Performance Instrumentation Systems, Time Space Positioning Information (TSPI) and Telemetry Systems, and Imaging Systems and associated data management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.892"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.892"
                                            },
                                            "Text": {
                                                "val": "FY17 Planned Programs - will continue to sustain ATEC's Fire Support, Air Defense, Reconnaissance and Surveillance, and Network OT tools. Improve our Real-Time Casualty Assessment (RTCA) secure network and tactical engagement capabilities to support future AMPV, AH-64 FOT&E, and the Bradley Performance Improvement Program (PIP), Stryker PIP, and Abrams PIP OTs. Sustain Performance Instrumentation Systems, Time Space Positioning Information (TSPI) and Telemetry Systems, and Imaging Systems and associated data management capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}