{
    "id": "3781b1e3fd7ac67d473a789ebb4c96b1daae2a4f",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604258N"
        },
        "ProgramElementTitle": {
            "val": "Target Systems Development"
        },
        "R1LineNumber": {
            "val": "164"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "66.251"
            },
            "CurrentYear": {
                "val": "71.152"
            },
            "BudgetYearOne": {
                "val": "36.662"
            },
            "BudgetYearOneBase": {
                "val": "36.662"
            },
            "BudgetYearTwo": {
                "val": "1.296"
            },
            "BudgetYearThree": {
                "val": "1.326"
            },
            "BudgetYearFour": {
                "val": "1.356"
            },
            "BudgetYearFive": {
                "val": "1.389"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds the development and procurement of Aerial Target Systems, Sea\/Sub Surface Target Systems, Target Control systems, and associated Target Threat Simulation Program and Target Augmentation and Auxiliary Systems required to replicate real world threats.  These capabilities are required to execute developmental\/operational test and evaluation of naval combat weapon systems and to satisfy advanced fleet training requirements.\n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST AND EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "66.718"
                },
                "CurrentYear": {
                    "val": "112.606"
                },
                "BudgetYearOne": {
                    "val": "102.984"
                },
                "BudgetYearOneBase": {
                    "val": "102.984"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "66.251"
                },
                "CurrentYear": {
                    "val": "71.152"
                },
                "BudgetYearOne": {
                    "val": "36.662"
                },
                "BudgetYearOneBase": {
                    "val": "36.662"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.467"
                },
                "CurrentYear": {
                    "val": "-41.454"
                },
                "BudgetYearOne": {
                    "val": "-66.322"
                },
                "BudgetYearOneBase": {
                    "val": "-66.322"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-41.454"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.862"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.329"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-64.406"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-64.406"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.916"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.916"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in Target Systems Development by $1.500M as required for the Department of the Navy to comply with the Bipartisan Budget Act of 2015.  \n\nFY15 was increased by a $0.862 million to GQM-173A Multi-Stage Supersonic Target (MSST) as additional funds were required to support the GQM-173A RDTEN range extension activities for integration of a new booster intended to significantly reduce technical and schedule risk in Development Testing efforts. \n\nIn FY16, Aerial Target System Development  was decreased by $37.4M for termination of the MSST program and ASW Target was reduced by $4.054M for Parrotfish program termination. All associated MSST investment funding has been removed from Aerial Target System Development in FY 2017 ($56.025M) and future years for the program termination by the Department of the Navy.  \n\nIn FY17 Wpn Sys T&E Trng Dev\/Proc (Full-Scale Aerial Target (FSAT) QF-16 and FSAT\/QF-4 programs) was reduced by $6.4 million for underexecution & ASW Target was reduced by $1.505 million to cancel the program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0609"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Target System Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "60.039"
                        },
                        "CurrentYear": {
                            "val": "38.098"
                        },
                        "BudgetYearOne": {
                            "val": "11.310"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.310"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "109.447"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission of the Aerial Target Systems Development program is the design and development of threat representative subsonic and supersonic aerial targets that simulate threat weapon systems.  In addition to representative air vehicles, this includes development of Target Control (TC) systems, and associated Target Augmentation and Auxiliary Systems (TA\/AS) which are used to replicate specific threats.  Targets are developed to support test and evaluation of combat systems required to defend fleet surface and air units in a hostile environment. As to specific hardware development, this project includes:\n\n - Supersonic Targets: GQM-163A Supersonic Sea-Skimming Target (SSST) and GQM-173A Multi-Stage Supersonic Target (MSST) . Supersonic targets represent supersonic anti-ship cruise missile threats. The design and development of GQM-163A SSST capabilities provide threat representative targets that are used in direct support of Developmental Test and Evaluation, Operational Test and Evaluation, and Live Fire Test and Evaluation of major combat weapons programs and, to a lesser degree, support fleet training. GQM-163A is a non-recoverable supersonic sea skimming aerial target, capable of speeds in excess of Mach 2.5 and cruise altitudes from 15 to 66 ft. The GQM-163A has also demonstrated a capability to perform a higher altitude diving threat profile. Funding is also provided for closing out the GQM-173A MSST development effort.\n\n - Subsonic Targets: BQM-177A Subsonic Aerial Target (SSAT) development primarily represents subsonic anti-ship cruise missile threats, replacing legacy BQM-34 and BQM-74 targets with a modernized subsonic target with increased capabilities. The BQM-177A SSAT provides threat representation for developmental and operational Test & Evaluation events of major combat weapons systems programs and in support of fleet training events. Specifically, the BQM-177A provides critical live-fire Test and Evaluation events for AEGIS, SM-6, SM-2, RAM, and ESSM.\n\n - TTSP and TC and TA\/AS development: The Target Threat Simulation Program (TTSP) provides the payload equipment required to electronically enhance aerial\/surface targets to provide threat representative Radio Frequency signatures, specifically the Electronic Attack and Threat Radar Emissions (Active Emitters). TC provides command and control of targets to enable the execution of threat-representative mission profiles. The mission also includes the design, development and qualification of various Target Mission Support Systems including but not limited to: Scalar Scorers, Scoring Ground Station, Telemetry Antennas, Radar and Locator Beacons, Identification, Friend or Foe, and associated Test Sets. TA\/AS enables each target to be uniquely configured for specific mission profiles and provide high fidelity simulation of foreign threats. TA\/AS-configured targets are used for radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement and testing, radar cross section evaluation, decoy-effectiveness testing, maneuver analysis, electronic warfare evaluation, warhead-effectiveness testing and evaluation of fleet tactics. TA\/AS scoring capabilities include both surface and airborne scalar and vector scoring systems. \n\nIn addition to the design and development of target hardware and software, funding supports studies performed by a University Affiliated Research Center (UARC) to specify and verify needed target performance for future target development. For the design and validation of targets under development, the UARC will provide engineering studies in areas such as structures, controls, guidance, and propulsion. For those hardware and software items presently under development by commercial vendors, the UARC will provide oversight and validation of vendor design and development approach."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Supersonic Targets"
                                    },
                                    "Description": {
                                        "val": "Provides funding for the development of GQM-163A upgrades\/evolutionary development to keep pace with evolving threat characteristics. Efforts include continued development of performance envelope characteristics to include flight termination performance and quad launch capability. Funding will also support closeout of the GQM-173 development effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.805"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Completed GQM-173 Captive Carry Phase II and III testing and performed a subsystem level vehicle flight test. Continued ground testing and began validation of the models and simulations. Conducted Program Management Reviews (PMR), System Functional Review, and technical design meetings. Commenced improvements to the GQM-163 quad launch capability infrastructure to accommodate an increased number of targets from two to four."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.653"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commencement of shutdown activities in support of pending GQM-173A Multi-Stage Supersonic Target program termination, which includes closeout of ground and captive carry testing, Sprint Vehicle subsystem level flight tests, and validation of the models and simulations utilizing the Hardware In the Loop test bed.  Continue the GQM-163A Supersonic Sea Skimming Targets  Quad Launch effort, which will provide the required improvements in the current infrastructure of the launch capability to accommodate the increased number of targets from two to four.  Commence Radome and Radar Altimeter design and development efforts and Orbital Front End System space allocation studies for SSST."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Subsonic Targets"
                                    },
                                    "Description": {
                                        "val": "The BQM-177A Subsonic Aerial Target represents subsonic anti-ship cruise missile threat in direct support of the Test & Evaluation of major combat weapons systems programs and fleet training. It is the follow-on to the BQM-74 and BQM-34 targets, featuring increased speed, longer range, lower cruise altitudes and greater maneuverability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.984"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued testing for qualification of software functionality and Rocket Assisted Take Off (RATO)\/structures.  Conducted design reviews and flight tests to validate integrity of target. Provided government program management, engineering and logistics support and contract support services towards accomplishment of developmental efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.464"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete testing for qualification of RATO\/structures. Continue to conduct design reviews and complete flight tests to\nvalidate integrity of target and address deficiencies when discovered. Provide government program management, engineering and logistics support and contract support services towards accomplishment of developmental efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.571"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.571"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Navy led flight testing to support a Milestone C\/procurement decision and award the Low Rate Initial Production (LRIP) 1 contract. Continue to review final design documents and perform required target characteristic testing to support key performance parameters and attributes. Provide government program management, engineering and logistics support and contract support services towards the completion of the engineering, manufacturing and developmental efforts of the BQM-177A Subsonic Aerial Target for transition to LRIP2 and Full Rate Production efforts in FY18."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Threat Simulation Program (TTSP), Target Control (TC) and Target Augmentation and Auxiliary Systems (TA\/AS)"
                                    },
                                    "Description": {
                                        "val": "Continue to support the development of TC and TA\/AS capable of supporting Test and Evaluation (T&E) and fleet training activities.  TC involves the improved command and control systems capable of controlling multiple targets simultaneously while delivering adequate fidelity of T&E telemetry data. Continue to support design, development and qualification of Target Mission Support Systems including but not limited to Scalar Scorers, Scoring Ground Station, Telemetry Antennas, Radar and Locator Beacons, identification friend or foe and associated test sets. Augmentation and auxiliary systems must be capable of augmenting targets in support of radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement\/test, radar cross section evaluation, decoy effectiveness, maneuver analysis, electronic warfare, warhead effectiveness and evaluation of fleet tactics, readiness and training. The TTSP provides the payload equipment required to electronically enhance aerial\/surface targets to provide threat representative Radio Frequency (RF) signatures, specifically the Electronic Attack  and Threat Radar Emissions (Active Emitters). The TTSP accomplishes this by providing a collection of modules which are integrated into individual targets in various configurations to provide the ability to simulate the RF environment.  TTSP equipment in various configurations is certified for carriage in aerial\/surface targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.250"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and integrated threat electronic attack & active emitter simulators.  Worked with National Air and Space Intelligence Center (US Air Force)to gather intelligence data and briefed aerial target threat simulation capabilities during biennial Top 20 Electronic Attack Threat Working Group meeting at Point Mugu, CA.  Provided support to enterprise team for Electronic Attack \/ Anti-Ship Cruise Missile (EA\/ASCM) working group meetings in preparation for DOT&E data call regarding simulation shortfalls.  Completed a millimeter wave ALQ-167 for the Electronic Attack system integration project.  Continued BQM-34(S) Local Engineering Change (LEC) support to enable carriage of TTSP threat simulation payloads.  Provided three single and one  dual Open Loop Seeker (OLS) presentations for surface weapons testing at Point Mugu, CA.  Provided a Dual Stream GQM-163A presentation with DPT-2B emitter with rhombic horn antenna.  Provided multiple East Coast \/ West Coast Fleet Events with BQM-74E DPT-2B and DPT-2C emitter sets.  Provided \nNavy and Joint Test & Evaluation programs with electronic attack payloads on aerial targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype and integration of threat electronic attack & active emitter simulators.  Gather and exploit threat intelligence. Support the development and qualification of Target Mission Support Systems (TMSS). As a result of the termination of the GQM-173A Multi-Stage Supersonic Target program, development of new threat simulations are necessary to satisfy the Fleet's requirements to build operator confidence and proficiency in operation of anti-ship cruise missile defense systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.739"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.739"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype and integration of threat electronic attack & active emitter simulators.  Gather and exploit threat intelligence. Support the development and qualification of TMSS."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN 228000"
                                    },
                                    "Title": {
                                        "val": "Aerial Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.683"
                                        },
                                        "CurrentYear": {
                                            "val": "40.792"
                                        },
                                        "BudgetYearOne": {
                                            "val": "137.484"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "137.484"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "140.770"
                                        },
                                        "BudgetYearThree": {
                                            "val": "142.854"
                                        },
                                        "BudgetYearFour": {
                                            "val": "145.253"
                                        },
                                        "BudgetYearFive": {
                                            "val": "148.068"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "WPN 612020"
                                    },
                                    "Title": {
                                        "val": "Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.094"
                                        },
                                        "CurrentYear": {
                                            "val": "1.116"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.316"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.316"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.225"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.496"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.513"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.544"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Supersonics: The GQM-163A Supersonic Sea-Skimming Target (SSST) will continue and complete development of the Quad Launch capability. The SSST program will also commence the development and design efforts for a new Radome and Radar Altimeter required to emulate emerging threat systems and begin Orbital Front End System space allocation studies.  Commencing in FY 2016, MSST development and testing activities and associated follow-on procurement have been terminated by the Department of the Navy.\n\nSubsonics: The BQM-177A Subsonic Aerial Target program is an Acquisition Category IVM. The program is currently undergoing extensive developmental testing with Critical Design Review to be completed 1st Quarter FY16. The Test Readiness Review \/ Flight Readiness Review is scheduled to be completed in 3rd Quarter FY16 with Milestone C achievement in 1st Quarter FY17. IOC is scheduled for 4th Quarter FY18 and acquisition requirements are in-work for a sole-source Firm Fixed Price follow-on Full Rate Production contract with anticipated award in 1st Quarter FY19. \n\nTarget Threat Simulation Program (TTSP), Target Control, and Target Augmentation and Auxiliary Systems: TTSP will continue to award contracts to support the development of electronic attack & threat simulations. Additional contracts will be awarded to support the development and design of Target Mission Support Systems upgrades."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT         PERFORMANCE REQUIREMENT               OBJECTIVE                       THRESHOLD                  TEST RESULT\n\n BQM-177           Maximum Speed at Low Altitude                  0.95 M @ 6.6 ft @              0.90 M @10.0 ft @           TBD\n EMD                   [Mach (M) at feet (ft) above wave                 Sea State 5                             Sea State 3\n program              crest at WMO Sea State conditions]"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0610"
                    },
                    "ProjectTitle": {
                        "val": "Wpn Sys T&E Trng Dev\/Proc"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "31.818"
                        },
                        "BudgetYearOne": {
                            "val": "24.094"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.094"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "55.912"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the development and procurement of aerial targets and associated systems used exclusively for test and evaluation of naval weapons systems which closely represent current and projected threats to fleet units in the joint strike and the littoral warfare environments. These representations must include characteristics related to size, performance envelope, and electromagnetic and infrared signatures. As threats change, changes must be made to keep the targets threat representative in response to changes in the test requirements of the developers of naval weapons systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "QF-16 Full-Scale Aerial Target (FSAT)"
                                    },
                                    "Description": {
                                        "val": "The QF-16 FSAT is being developed as a 4th generation full scale threat representative target providing a replacement to the existing FSAT\/QF-4 which are maintained and operated by the Air Force.  The QF-16 is a converted F-16 aircraft that provides a supersonic, high altitude, remote-controlled aerial target.  This target will have full command and control capability through normal flight maneuvers.  The FSAT target presentations will support aircraft and weapons systems testing and development, including that of the Joint Strike Fighter, AIM-9X Sidewinder missile, AIM-120 Advanced Medium Range Air-to-Air Missile, and Standard Missile-6."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "31.000"
                                            },
                                            "Articles": {
                                                "val": "5"
                                            },
                                            "Text": {
                                                "val": "Procure five (5) QF-16 FSAT test assets; Conduct regeneration and conversion of QF-16 aircraft retrieved from Davis Monthan AFB storage.  Conduct FY16 missions and standup the QF-16 at Tyndall, AFB and Hollman, AFB."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.094"
                                            },
                                            "Articles": {
                                                "val": "4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.094"
                                            },
                                            "Articles": {
                                                "val": "4"
                                            },
                                            "Text": {
                                                "val": "Procure four (4) QF-16 FSAT test assets; Conduct regeneration and conversion of QF-16 aircraft retrieved from Davis Monthan AFB storage."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "QF-4 Full-Scale Aerial Target (FSAT)"
                                    },
                                    "Description": {
                                        "val": "The QF-4 FSAT is a supersonic, high altitude, remote-controlled aerial target.  This target has full command and control capability through normal flight maneuvers.  The program will include engineering and logistics support for the FSAT, including aviation depot level repairables and procurement of kit material. The QF-4 target presentations support aircraft and weapons systems testing and development, including that of the Joint Strike Fighter, AIM-9X Sidewinder missile, Advanced Medium Range Air-to Air Missile and Standard Missile 6."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.818"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct FY16 missions with Air Force QF-4's at Hollman, AFB."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A Memorandum of Agreement was signed between the United States Navy (USN) and The United States Air Force (USAF) for QF-16 Full-Scale Aerial Target Program. Milestone C was achieved in 1st Quarter FY14.  IOC is planned for 3rd Quarter FY16.\n\nThe Navy is using RDT&E funding to procure the QF-16s because they are used\/expended to satisfy RDT&E requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT          PERFORMANCE REQUIREMENT                OBJECTIVE                 THRESHOLD             TEST RESULT\n\nQF-4                Flight Termination Sys.- Reliable                 Achieve requirement        Threshold=objective       Satisfactory\nFull                  & effective auto & manual failsafe\nScale                 fast destruct, orbit destruct, &\nAerial Target               destruct receiver capability\n\n\n\nQF-16                Drone Mission Performance                           Achieve requirement         Threshold=objective       TBD          \nFSAT                    Payload Integration                                       Achieve requirement    Threshold=objective      TBD \nSuperiority            carry, operation & monitoring TEMS,\nTarget                  ALE-47, AIM-9, ALQ-188, ALQ-167 ALE-56 & 300 Gallon Fuel Tank"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0612"
                    },
                    "ProjectTitle": {
                        "val": "Surface Targets Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.262"
                        },
                        "CurrentYear": {
                            "val": "1.236"
                        },
                        "BudgetYearOne": {
                            "val": "1.258"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.258"
                        },
                        "BudgetYearTwo": {
                            "val": "1.296"
                        },
                        "BudgetYearThree": {
                            "val": "1.326"
                        },
                        "BudgetYearFour": {
                            "val": "1.356"
                        },
                        "BudgetYearFive": {
                            "val": "1.389"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops seaborne targets and their related target augmentation systems in support of air-to-surface and surface-to-surface weapons test and evaluation and fleet training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Surface Targets Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.262"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched target modifications and operational changes to reduce Explosive Ordnance Disposal (EOD) involvement during exercises involving High Explosive (HE) or tracer rounds. Developed electronic steering remote control interface for powered seaborne targets. Supported software development and continued testing of single hardware platform for Portable Command and Control Unit (PCCU) and System for Naval Target Control (SNTC). Tested PCCU ground station enhancements to allow remote control of more than 15 independent seaborne targets. Reviewed existing capabilities of program of record (POR) seaborne targets inventory with regard to threats, weapons test schedules and evolving fleet training requirements. Continued refining design and fabrication of passive radio frequency (RF) reflectors across varied aperture lengths to reduce unit cost and ease fabrication. Researched additional lower cost manufacturing and fielding methods for POR targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.236"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop predictive models for response of Low Cost Modular Target (LCMT) and Polyethylene Tow Target (PETT) behind weaving tow vessels. Develop stability-in-sea-state analysis tool to customize configurations of LCMT. Conduct test and evaluation of basic formation algorithms with High Speed Maneuverable Surface Target (HSMST). Develop advanced target swarm formations with real-time group reassignments. Develop enhanced precision for real-time scoring banner on seaborne targets. Develop real-time display of weapon system lethality utilizing human target system (Humannequin). Integrate SeaCAN on-board remote control system with new platform and systems for Fast Attack Craft Target (FACT). Test new FACT platform performance and measure radar cross section and infrared signatures. Develop improved target navigation control tools for Portable Command and Control Unit (PCCU)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop graphical user interface (GUI) for target formation control during swarm training and test and evaluation exercises. Implement advanced control modes. Integrate and test target collision avoidance hardware and software algorithms. Develop and implement additional on-screen graphics to support complex target presentations. Measure and populate data in stability software tool to include additional target platforms. Research development of predictive algorithms for stability of dynamic towed targets at higher speeds. Develop advanced radar and infrared signature enhancement for powered targets. Monitor developments in Command and Control and support developments for System for Naval Target Control (SNTC) applicable to seaborne targets."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/5429"
                                    },
                                    "Title": {
                                        "val": "ASW SE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "14.593"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.319"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.319"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.501"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.733"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.962"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.189"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "70.297"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Review capability of inventory with respect to threat, weapons test schedules and fleet training requirements.  OBJECTIVE:  Available inventory of seaborne targets to meet fleet requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2159"
                    },
                    "ProjectTitle": {
                        "val": "ASW TARGET"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.950"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.950"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Provide performance improvements to MK39 Mod 2 Expendable Mobile ASW Training Targets (EMATT) and MK30 Mod 1 Targets programs to address identified performance shortfalls in the current Fleet of ASW Targets and to provide technology development for the next-generation ASW Target programs to stimulate higher fidelity active sonar systems and torpedo sonar systems which have expanded frequency coverage than current systems.  These sonar and torpedo systems are being fielded on the P-8, SH-60R, and AN\/SQQ-89 capable surface ships and the MK54 Mod 0 and MK48 Mod 7 Torpedoes. Dynamically the target needs to emulate both low and high speed ends of threat submarines performance envelope to provide required training realism."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ASW Target Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY2015 funded efforts addressed MK39 EMATT performance shortfalls which included upgrading the MK39 EMATT Graphical Unit Interface (GUI) to work with Windows 7 or later operating system; perform an analysis to identify a more robust hardware interface solution; and identify the scope of effort required to make the Portable Target Programmer (PTP) Information Assurance (IA) compliant.  Funding was also provided to integrate the results of the ASW Trade Study Analysis Report into the MK39 EMATT program and upgrade MK39 EMATT Acoustic Response to integrate with MK54 Mod 1 Torpedo and Sonar Active\/Passive frequencies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "3141"
                                    },
                                    "Title": {
                                        "val": "ASW Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.515"
                                        },
                                        "CurrentYear": {
                                            "val": "3.353"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.302"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.302"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.812"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.018"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.243"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.472"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "7194.715"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "- Frequent IPT meetings with contract and government technical program personnel.\n- Rigorous acoustic, environmental and in-water dynamic test program.\n- Complete DMEA LMS MK39 EMATT Acoustic Response Contract Delivery Order.\n- Integrate the results of the ASW Trade Study Analysis Report into the MK39 EMATT Acoustic Response Effort.\n- Complete MK39 EMATT Graphical Unit Interface (GUI) efforts with Windows 7 efforts."
                        }
                    }
                }
            ]
        }
    }
}