{
    "id": "3a59a8913f977d62763c3095ab1e6be30ae324c4",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603123N"
        },
        "ProgramElementTitle": {
            "val": "Force Protection Advanced Technology"
        },
        "R1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "25.149"
            },
            "CurrentYear": {
                "val": "38.044"
            },
            "BudgetYearOne": {
                "val": "48.438"
            },
            "BudgetYearOneBase": {
                "val": "48.438"
            },
            "BudgetYearTwo": {
                "val": "49.554"
            },
            "BudgetYearThree": {
                "val": "30.803"
            },
            "BudgetYearFour": {
                "val": "16.769"
            },
            "BudgetYearFive": {
                "val": "16.769"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "There are two new Leap Ahead initiatives starting in FY 2016 - Forward Deployed Energy & Communications Outpost (FDECO) INP and Medium Displacement Unmanned Surface Vehicle (MDUSV) effort."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (20 Jan 2015). This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century. The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nThis PE addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This program supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial and air) and the protection of those platforms. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.831"
                },
                "CurrentYear": {
                    "val": "38.044"
                },
                "BudgetYearOne": {
                    "val": "49.256"
                },
                "BudgetYearOneBase": {
                    "val": "49.256"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "25.149"
                },
                "CurrentYear": {
                    "val": "38.044"
                },
                "BudgetYearOne": {
                    "val": "48.438"
                },
                "BudgetYearOneBase": {
                    "val": "48.438"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.682"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.818"
                },
                "BudgetYearOneBase": {
                    "val": "-0.818"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.683"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.818"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.818"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2912"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Advanced Technology"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "22.613"
                        },
                        "CurrentYear": {
                            "val": "35.371"
                        },
                        "BudgetYearOne": {
                            "val": "45.713"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.713"
                        },
                        "BudgetYearTwo": {
                            "val": "46.780"
                        },
                        "BudgetYearThree": {
                            "val": "28.029"
                        },
                        "BudgetYearFour": {
                            "val": "13.995"
                        },
                        "BudgetYearFive": {
                            "val": "13.995"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "There are two new Leap Ahead initiatives starting in FY 2016 - Forward Deployed Energy & Communications Outpost (FDECO) INP and Medium Displacement Unmanned Surface Vehicle (MDUSV) effort."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This project supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms. For the new FY 2016 effort, Forward Deployed Energy and Communications Outpost (FDECO) INP, the project addresses advanced technology development associated with providing the undersea energy and communications infrastructure necessary to assure undersea dominance; extend the reach of undersea assets; enhance SA and standoff advantage without reducing forward presence and; provide endurance for unmanned systems necessary for force multiplication in an A2\/AD environment.  For the new FY 2016 effort, Medium Displacement Unmanned Surface Vehicle (MDUSV), the project will radically change the way the Navy does mine influence sweep, ASW and EW missions; it will introduce larger USVs to the Navy; and it will introduce advanced autonomy to the surface Navy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SURFACE SHIP & SUBMARINE HULL MECHANICAL & ELECTRICAL (HM&E)"
                                    },
                                    "Description": {
                                        "val": "Activity includes: advanced technology demonstrations to evaluate emerging energy technologies and advanced technology development for Unmanned Sea Surface Vehicles. \n\nThe funding increase from FY 2015 to FY 2016 is due to the initiation of the Medium Displacement Unmanned Surface Vehicle (MDUSV) Leap Ahead effort and the FDECO program that initiates fully from a study of distributed, open, adaptable, and scalable architectures suitable to future Naval demands. To full scale INP Project to transition the key advanced technology elements, Forward Deployed Energy (FDE), Forward Deployed Communications (FDC) and Forward Deployed Docking (FDD) into acquisition programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of autonomous navigation for Unmanned Sea Surface Vehicles from a host ship \n- Continued efforts to conduct advanced technology demonstrations to evaluate emerging energy technologies using Navy and Marine Corps facilities as test beds. \n- Initiated Forward Deployed Energy & Communications Outpost (FDECO) Architecture Planning Study to analyze distributed, open, adaptable, and scalable architectures suitable to future Naval demands."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.743"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015. \n- Initiate the FDECO INP project.\n- Initiate Medium Displacement Unmanned Surface Vessel (MDUSV) effort to demonstrate the operational benefit of a highly autonomous, large USV with a modular payload capability and demonstrate at-sea three modular payloads.  The activity will consist of advancements to autonomous control, payload integration, and at-sea demonstration of vessel autonomous control and payloads supporting mine warfare, anti-submarine warfare and electronic warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.487"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.487"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AIRCRAFT TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The Aircraft Technology activity develops technologies for enhanced capability of Naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, scalable Naval air vehicle technologies, such as - autonomous air vehicle command and control, helicopter and tiltrotor rotor drive systems, aerodynamics, propulsion systems, materials, structures and flight controls for future and legacy air vehicles. This activity directly supports the Naval Aviation Enterprise Science and Technology Objectives and the Naval Science and Technology Strategic Plan, principally in the Autonomy and Unmanned Systems, Platform Design and Survivability, Power and Energy and Total Ownership Cost Focus Areas. \n\nThe funding increase from FY 2015 to FY 2016 is due to the initiation of the joint TERN program.  \n\nThe funding increase from FY 2016 to FY 2017 is due to the increase investment in the joint TERN effort and to maturation of Autonomous Aerial Cargo\/Utility System (AACUS) technology from advanced research to advanced development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.179"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued demonstration of initial core software, sensor, air vehicle, and capability applications for Autonomous Aerial Cargo\/Utility System (AACUS). \n- Continued the advanced technology demonstration portion of the Variable Cycle Advanced Technology (VCAT) Program. Critical technology development efforts will begin with major engine manufactures and system contractors to develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based Tactical Air (TACAIR)\/Intelligence, Surveillance and Reconnaissance(ISR) systems. \n- Continued VCAT Phase I variable cycle engine\/propulsion subsystem technology development efforts through completion.\n- Demonstrated sensor improvements, capability expansion and technology maturation of the Autonomous Aerial Cargo\/Utility System (AACUS)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.628"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015.\n- Initiate the joint TERN program to conduct an at sea demonstration of Vertical Take-Off and Landing (VTOL) enabling technologies in support of DDG-51 and LCS-2 based future long endurance Unmanned Air Vehicle (UAV) capabilities.\n- Demonstrate portability to another rotary wing aircraft capability expansion and technology maturation of the Autonomous Aerial Cargo\/Utility System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.226"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.226"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016.\n- Continue the AACUS program by demonstrating the capability to perform the assault support mission from mission request to final landing on a multiple delivery flight."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goals of this advanced technology program are the development of technologies which focus on the warfighter and providing the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage, while preserving operational capability. Overall metric goals are to transition the advanced technology projects into acquisition programs. Each Activity within this PE has unique goals and metrics, some of which include classified quantitative measurements. Specific examples of metrics under this PE include: - Advanced technology demonstrations to evaluate emerging energy technologies. \n\nFor the new FY 2016 effort, Forward Deployed Energy and Communications Outpost (FDECO) INP, the overall goals of this advanced technology program are the development of technologies which focus on energy management and transfer technologies that enable persistent undersea operations by UxV Fleet; provide system architectures that are persistent, scalable and mission agile; provide communication and energy infrastructure available in degraded and contested environments and; provide a platform-agnostic solution that reduces development and maintenance costs.  Overall metric goals are to transition the key advanced technology elements, Forward Deployed Energy (FDE), Forward Deployed Communications (FDC) and Forward Deployed Docking (FDD) into acquisition programs. Each Activity within this PE has unique goals and metrics, some of which include classified quantitative measurements. Specific examples of metrics include: - Advanced technology demonstrations to evaluate energy & data transmission and persistent connectivity."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3049"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.536"
                        },
                        "CurrentYear": {
                            "val": "2.673"
                        },
                        "BudgetYearOne": {
                            "val": "2.725"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.725"
                        },
                        "BudgetYearTwo": {
                            "val": "2.774"
                        },
                        "BudgetYearThree": {
                            "val": "2.774"
                        },
                        "BudgetYearFour": {
                            "val": "2.774"
                        },
                        "BudgetYearFive": {
                            "val": "2.774"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Develop advanced technologies, critical to protecting naval installations, to provide seamless full spectrum protection against asymmetric terrorist attack by improving the ability to: sense developing and immediate threats; shape our responses through improved situational awareness and decision making; shield personnel, mission critical facilities, infrastructure, and operating fleet assets; maintain essential functions; and sustain and restore critical services in the aftermath of an incident.  Technologies developed will also seek to reduce the required manpower and skill levels devoted to the force protection mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EMERGING THREATS"
                                    },
                                    "Description": {
                                        "val": "This activity includes development of advanced technologies critical to protecting naval installations, and will provide seamless, full spectrum protection against asymmetric terrorist attack by improving the ability to: sense developing and immediate threats; shape our responses through improved situational awareness and decision making; shield personnel, mission critical facilities, infrastructure, and operating fleet assets; maintain essential functions; and sustain and restore critical services in the aftermath of an incident.  Technologies developed will also seek to reduce the required manpower and skill levels devoted to the force protection mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.536"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of lower cost\/higher performance Force Protection sensors and automated detection algorithms, and decision support tools. \n- Continued research to reduce force protection manpower and equipment costs through automation and predictive learning algorithms. \n- Continued threat characterization research and perception experiments for sensor performance optimization and model development and validation. \n- Continued development of all weather sensors optimized for installation of force protection. \n- Continued research into sensors for use in counter-surveillance around protected facilities. \n- Continued research to advance sensor fusion capabilities in high density networks with diverse sensor grids. \n- Continued development of assessment algorithms and information analysis technologies to augment skills or replace persons in operations centers. \n- Continued interim demonstration of acoustic sensors for perimeter and area surveillance in realistic environments. \n- Continued development of protection technology for naval installation power and energy infrastructure. \n- Continued expansion of research into sensors and countermeasures for use against unmanned underwater to include surface swimmers, underwater divers, and underwater diver propulsion aids.  \n- Continued demonstration of multi-band electro-optical sensors and fusion algorithms in adverse weather conditions. \n- Initiated demonstration of sensors and countermeasures for use against underwater to include surface swimmers, underwater divers, diver propulsion aids, and underwater unmanned vehicles.\n- Initiated research in non-acoustic detection, tracking, classification, and engagement of underwater threats to naval installations. \n- Initiated development of autonomous unmanned harbor defense systems for perimeter patrol and threat interdiction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.673"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015.\n- Initiate research into automated vehicle entry control point monitoring, automatic vehicle classification, risk assessment and logic system decision making.\n- Initiate development of non-contact biometric verification technologies to support unmanned automated access control systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.725"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.725"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goals of this advanced technology program are the development of technologies which will provide seamless full spectrum protection against asymmetric terrorist attack by improving the ability to protect naval installations. Overall metric goals are to reduce the required manpower and skill levels devoted to the force protection mission. Specific metric under the Project includes: 50% reduction of manpower associated with FP surveillance, situational awareness, and decision making, 2x improvement in electro-optical sensor performance in adverse weather conditions, 50% reduction in sensor cost per square or cubic meter of detection at a given resolution, and a 50% reduction in false alarm rates for automated detection and tracking algorithms both above and below water."
                        }
                    }
                }
            ]
        }
    }
}