{
    "id": "3ebc4aa82e90455fd9500857fc85040a94fdcddc",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605873M"
        },
        "ProgramElementTitle": {
            "val": "Marine Corps Program Wide Supt"
        },
        "R1LineNumber": {
            "val": "180"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "17.449"
            },
            "CurrentYear": {
                "val": "13.627"
            },
            "BudgetYearOne": {
                "val": "22.247"
            },
            "BudgetYearOneBase": {
                "val": "22.247"
            },
            "BudgetYearTwo": {
                "val": "17.875"
            },
            "BudgetYearThree": {
                "val": "20.827"
            },
            "BudgetYearFour": {
                "val": "21.255"
            },
            "BudgetYearFive": {
                "val": "21.699"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Project 2930 Phase 0 Activities (Phase A) has been terminated and does not have funding beyond FY2014."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides the analytical foundation for the Marine Corps Studies System (MCSS), including mandated Mission Area Analyses and Cost and Operational Effectiveness Analyses. The MCSS is the front end of the Marine Corps' acquisition system.  This PE also supports the material acquisition process as follows: managing the Marine Corps Operational Test and Evaluations (OT&E); providing Chem Bio Consequence Management of capabilites for Weapons of Mass Destruction (WMD) incident response forces; and conducting Phase A activities to investigate potential material solutions that validate needs, program costs, business decisions, and prevent undue delays in pursuing priority requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.849"
                },
                "CurrentYear": {
                    "val": "13.649"
                },
                "BudgetYearOne": {
                    "val": "22.536"
                },
                "BudgetYearOneBase": {
                    "val": "22.536"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.449"
                },
                "CurrentYear": {
                    "val": "13.627"
                },
                "BudgetYearOne": {
                    "val": "22.247"
                },
                "BudgetYearOneBase": {
                    "val": "22.247"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.400"
                },
                "CurrentYear": {
                    "val": "-0.022"
                },
                "BudgetYearOne": {
                    "val": "-0.289"
                },
                "BudgetYearOneBase": {
                    "val": "-0.289"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.022"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.210"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.610"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.289"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.289"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding increase of $8.620M from FY16 to FY17 is primarily attributable to the Marine Corps Studies and Analysis program efforts that will support 55 new studies and analyses projects directed and approved by the Commandant of the Marine Corps and Assistant Commandant of the Marine Corps."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0030"
                    },
                    "ProjectTitle": {
                        "val": "Studies & Analysis\/MC"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.395"
                        },
                        "CurrentYear": {
                            "val": "1.258"
                        },
                        "BudgetYearOne": {
                            "val": "7.876"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.876"
                        },
                        "BudgetYearTwo": {
                            "val": "3.365"
                        },
                        "BudgetYearThree": {
                            "val": "4.988"
                        },
                        "BudgetYearFour": {
                            "val": "5.090"
                        },
                        "BudgetYearFive": {
                            "val": "5.201"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Marine Corps Requirements Oversight Council (MROC), has established Operations Analysis Division (OAD), as the sole operations research, analytic support, and studies management program for the Marine Corps Study System (MCSS). OAD provides Senior Military Leadership with a comprehensive understanding of operations and advanced analytic and statistical support. In compliance with Executive Order #13589 OAD's major focus is achieving greater efficiency, productivity, and innovation through operations research methodologies such as: statistical analysis, multi-objective decision methods, optimization, cost analysis, and a wide range of computer-based models and combat simulations. Division analysts are credited with innovations in analysis of amphibious operations and Irregular Warfare (IW) that have expanded state-of-the-art operations research methods across DOD. OAD quantifies resource allocation decisions pertaining to weapon systems, strategic personnel,training management, and equipment acquisition. Efforts are guided by the Commandant's Strategic Plan and Planning Guidance. \n\nFuture studies support Marine Air-Ground Task Forces (MAGTF's) and Marine Expeditionary Units (MEU's) with research analysis and modeling and simulation focused on aviation, amphibious, and ground operations enhancing the ability of the Marine Corps to increase operational, logistical and equipment efficiencies and capabilities and provide a unique, well trained, equipped and educated force.  \n\nThis program element supports four specialized analytical groups within OAD: (1) Current Operations Analysis and Support Team (COAST) - responsible for providing deployed on site professional operations analysis support to: Special Purpose MAGTFs in CENTCOM and AFRICOM; (2) Analysis Branch (AB) responsible for executing a select portfolio of studies for senior leadership; (3) Mission Area Analysis (MAA) responsible for capability analysis and support to the JCIDS process; and (4) Joint External Analysis Branch (JEA), the Marine Corps' sole representative in the Joint modeling arenas. \n\nThe increase from FY16 to FY17 ($6.618M) reflects funding to support projected operations research, modeling and simulation, analytic support, to the OPFORS, HQMC, and the Joint community, JCIDS Support and studies management. The funding will support a significant increase in studies, operations research and analyses, and modeling and simulation to support the Commandant's Planning Guidance (CPG), Defense Planning Guidance, Quadrennial Defense Review (QDR), Chairman's Joint Force Assessment, Chairman's Strategic Seminar Series Wargames, Annual Joint Staff Force Sufficiency Assessments, and POTUS.  Anticipate 55+ studies to include follow on Phase II and Phase III efforts. Focus areas of concentration: Manpower\/Personnel; Intelligence, Information and Networks; Plans, Policy, and Operations; Infrastructure and Readiness; Resources, Programs, and Assessments; Capability Integration; Research, Development and Acquisition; General Concept Development; and Weapons Systems analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Studies & Analysis\/MC"
                                    },
                                    "Description": {
                                        "val": "The Marine Corps Studies System (MCSS), the sole responsibility of the Operations Analysis Division (OAD), Combat Development and Integration (CD&I), Marine Corps Combat Development Command (MCCDC) provides research and analysis to ensure a greater understanding of issues and alternatives concerning organizations, tactics, doctrine, policies, force plans, strategies, procedures, intelligence, weapon selection, systems' programs and resource allocation. Through the MCSS, the Marine Corps nominates, approves, commences, manages and distributes the resultant analytical products. Efforts are evaluated and selected by the \"quarterly calls for studies\" and is targeted to a particular audience that understands current and future USMC mission requirements and the need for comprehensive analyses that meets the Commandant's Strategic Goals, saves lives, and utilizes funds efficiently.  Research conducted produces comprehensive and integrated analyses aligned to Senior Leadership's requirements and decision timelines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.395"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued - Efforts in the following areas of interest:\n  * Gender Integration: Coordinated and conducted analytical support to the Marine Corps Force Integration Program (MCFIP) Women in Infantry as directed by Annex D to the Marine Corps Force Integration Campaign Plan Logistics\/Combat Service Plan.\n  * Energy: Multi-functional area tasks which supported: continued refinement, alignment and application of Marine Air Ground Task Force (MAGTF) Power and Energy Model (MPEM) and the Operational Energy Capabilities Improvement Fund (OECIF).\n   * Current Operations: Total Force Structure Process (TFSP); Human Resources Development Process (HRDP); Global Force Management (GFM); Weapons Systems; Equipment Requirements and Resources; Irregular Warfare; Information Operations; Cyber Warfare; Live vs. Simulation Ground Based Training; and Intelligence, Surveillance, and Reconnaissance (ISR).   \n\n- Completed: (examples)\n  * CH-53K Requirements Analysis determined procurement quantity for heavy lift helicopters in response to DOD Inspection General Inquiry (IG) suggesting the USMC was procuring excess aircraft. Impact: the acquisition objective was validated preserving 44 CH-53K aircraft in the aviation program of record affecting $22.2B of planned expenditures.\n  * Chemical Biological Radiological Nuclear Defense Equipment and Medicant Study produced a tool used by commodity managers to reduce USMC storage cost saving the USMC $18M per year for chemical warfare defense equipment.  \n  * Guam Combat Ready Storage Point (CRSP) Analysis Study saved $60M in MILCON by justifying cancellation of the building of a $60M facility not needed or desired by the Operating Forces and the Installation based requirements and the actual capabilities of the facility.\n  * Medium Lift Helicopter Requirements Analysis Ground Based Air Defense. Analysis examined the ability of planned medium lift force structure to meet operational demands for Major Combat Operations and forward deployed forces. Impact: detailed analysis of force structure, operational demands, and acquisition plans provided a firm analytic basis for MV-22 requirements, potentially affecting the program of record by $1.6B \n  * USMC Search and Rescue (SAR) study found that SAR is a necessary capability to maintain and a Joint SAR option should be pursued given its low cost. Impact: study found the cost difference between the lowest cost option and the most expensive option for maintaining SAR is over $10 Million annually. \n  * Ground Based Air Defense (GBAD) Weapons Systems Phase I determined the non kinetic option (High Power Microwave, High Energy Laser, and Electronic Warfare) were not as cost effective as kinetic rockets and gun systems.\n\n- Initiated: MCSS accepted 52 new studies which provided analysis, wargaming scenarios and modeling and simulation to address Marine Corps issues and alternatives concerning organizations, tactics, doctrine, policies, force plans, strategies, procedures, intelligence, weapon selection, systems programs and resource allocations. IT technologies and included: Digital Electronic Jammers, maneuvering Surface to-Surface Missiles, Directed Energy Weapons. Focus areas include Space, Irregular Warfare, Information Operations, Cyber warfare and evolving war fighting techniques and support operations required new exploration and development. M&S creation and enhancement are required to delineate and understand the emerging weapons capabilities as well as demand development of software techniques to implement changes. Efforts support the Commandant's Planning Guidance (CPG), Defense Planning Guidance, Quadrennial Defense Review (QDR), Chairman's Joint Force Assessment, Chairman's Strategic Seminar Series Wargames, and Annual Joint Staff Force Sufficiency Assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts initiated in FY15 unless noted as completed below. \n\n- Complete: Phase I MCFIP efforts; Amphibious Ship risk assessments Phase I; MAGTF-CR Phase I\n\n- Initiate: The Marine Corps Studies System (MCSS) will fund study initiatives to implement the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) strategic plan for defense basic research. This plan defines specific and quantifiable actions to help create conditions for defense basic research investments capable of creating high-payoff, transformative breakthroughs for DoD though research, analysis, and modeling and simulation. \n  Areas of concentration include: Ground Based Simulation Training; Wartime Medical Requirements; GBAD Weapons Systems Phase II, Cyber and Manpower Allocations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.876"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.876"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-  Continue all efforts not completed in FY16.\n \n-  Initiate: The increase of $6.618M will support more than 55 new studies to include follow on Phase II and Phase III  prior year efforts and areas of concentrated Manpower\/Personnel; Intelligence, Information and Networks; Plans, Policy, and Operations; Infrastructure and Readiness; Resources, Programs, and Assessments; Capability Integration; Research, Development and Acquisition; General Concept Development; and Weapons Systems studies.\n\nThe funding will increase studies, operations research and analyses, and modeling and simulation to support the Commandant's Strategic Plan (CPG), Defense Planning Guidance, Quadrennial Defense Review (QDR), Chairman's Joint Force Assessment, Chairman's Strategic Seminar Series Wargames, Annual Joint Staff Force Sufficiency Assessments, and POTUS within the Marine Corps Studies System (MCSS) specialized fields."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Provide analytical documentation and support to decision makers for resolution of current and future operational and logistical issues identified by operating forces. Utilize OAD Subject Matter Experts (SME), Marine Corps University, and Naval Post Graduate School to conduct studies and analysis projects in basic and applied research and advanced technology development. Develop and maintain a current operations analysis reachback network with other government and Coalition agencies such as Center for Army Analysis, Joint Capabilities Integration and Development System (JCIDS), JIEDDO J9, Joint Trauma Analysis and Prevention of Injury in Combat (JTAPIC) program, The Technical Cooperation Program (TTCP), NATO Systems Analysis & Studies (SAS), etc.\n\nAnalysis results are employed to assist the Commandant, Assistant Commandants, Unit Commanders and the Commanding General (CG), Combat Integration Division, Marine Corps Combat Development Command (CD&I,MCCDC), Crisis Response (CR) Special Purpose Marine Air-Ground Task Forces (SPMAGTFs; CENTCOM, AFRICOM and SOUTHCOM), in addition to the Marine Expeditionary Units that are deployed around the globe and provide a continuous program of mission area analyses, formal studies, rapid response analytic efforts, and the supervision of research projects to fulfill mission. OAD provides combat analyst assessment teams for national emergencies and contingencies; is responsible for initiating, conducting or supervising all official Marine Corps studies; maintaining official Marine Corps scenarios; and participating in and reviewing the efforts of external activities such as the Office of Secretary of Defense and the Joint Staff. Baseline analysis supports Mission Capability Packages (MCPs), Investment Strategy, Joint Capability Areas (JCAs), and the Naval Strategic Plan providing the DoN assessments for future force development. Operations data and analysis support provided to USMC organizations: MCCDC, Marine Corps Intelligence Activity (MCIA), Marine Corps Warfighting Lab (MCWL), Marine Corps Central Command (MARCENT), Systems Command, Training and Education Command (TECOM).  The Modeling and Simulation Analytical Toolkit (MSAT) supports analysis involving irregular warfare missions executed in a future Defense Planning Guidance scenario.  These missions include information operations, offensive tactical and operational CYBER operations, foreign internal defense, special direct action arising from intelligence gathered from HUMINT and technical (SIGINT,CYBER) means."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0033"
                    },
                    "ProjectTitle": {
                        "val": "OT&E Support"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "11.236"
                        },
                        "CurrentYear": {
                            "val": "12.024"
                        },
                        "BudgetYearOne": {
                            "val": "12.281"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.281"
                        },
                        "BudgetYearTwo": {
                            "val": "12.550"
                        },
                        "BudgetYearThree": {
                            "val": "14.254"
                        },
                        "BudgetYearFour": {
                            "val": "14.559"
                        },
                        "BudgetYearFive": {
                            "val": "14.858"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Marine Corps Operational Test and Evaluation Activity (MCOTEA) supports the material acquisition process by managing the Marine Corps Operational Test (OT) programs for Acquisition Categories (ACAT) I through ACAT IV (less OT of manned aircraft) and performs other functions that may be directed by the Commandant of the Marine Corps. The primary purpose of Operational Test and Evaluation (OT&E) is to provide information to the Milestone Decision Authority (MDA) regarding the Operational Effectiveness (OE) and Operational Suitability (OS) of the system addressed at a decision point. MCOTEA must ensure that the Marines in the Operating Forces receive the very best possible equipment and support. MCOTEA must also ensure each system proposed for acquisition is tested adequately, evaluated objectively and reported independently.\n\nMarine Corps Operational Test and Evaluation Activity (MCOTEA) is the only unit that provides the Marine Corps with required operational test and evaluation (OT&E) capability, ensuring the Marine Corps is compliant with laws and regulations, and ensuring that training and equipment are operationally effective, relevant, and suitable.  Additionally, MCOTEA's early involvement, coordination, and oversight in developmental testing and evaluation of new combat and combat support systems ensures that our Marines are the best trained, and have the best equipment, with the lowest test costs for taxpayers. Finally, MCOTEA's support of rapid acquisitions ensures that Marines in the fight are supported with the newest and most advanced equipment and that the Marine Corps is compliant with regulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MCOTEA"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.236"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued evaluating, quantifying, and reporting the operational effectiveness, suitability, and survivability of planned acquisitions that meet warfighter capabilities and providing Milestone Decision Authority (MDAs) with a comprehensive understanding of operational risk associated with ACAT programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.024"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue with evaluating, quantifying and reporting on 15 Programs for the operational effectiveness, suitability and survivability of planned acquisitions to meet warfighting capabilities and will be providing Milestone Decision Authority (MDAs) to programs that are inherently governmental and a comprehensive understanding of operational risk associated with ACAT programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.281"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.281"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue with evaluating, quantifying and reporting on programs for the operational effectiveness, suitability and survivability of planned acquisitions to meet warfighting capabilities and will be providing Milestone Decision Authority (MDAs) to programs that are inherently governmental and a comprehensive understanding of operational risk associated with ACAT programs."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2330"
                    },
                    "ProjectTitle": {
                        "val": "Chem Bio Consequence Mgmt"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.818"
                        },
                        "CurrentYear": {
                            "val": "0.345"
                        },
                        "BudgetYearOne": {
                            "val": "2.090"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.090"
                        },
                        "BudgetYearTwo": {
                            "val": "1.960"
                        },
                        "BudgetYearThree": {
                            "val": "1.585"
                        },
                        "BudgetYearFour": {
                            "val": "1.606"
                        },
                        "BudgetYearFive": {
                            "val": "1.640"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Family of Incident Response Systems (FIRS) consists of equipment, systems, and services designed to provide Weapons of Mass Destruction (WMD) incident response forces the capabilities needed to effectively respond to a terrorist attack using Chemical, Biological, Radiological, Nuclear, and High-Yield Explosives (CBRNE). FIRS meets the mission requirements for the detection; mass casualty decontamination; force protection; responder inter-agency interoperability; Command, Control, Communications, Computers & Intelligence (C4I); urban search and rescue; medical and general support requirements needed by these forces to mitigate the effects of a CBRNE terrorist attack. FIRS relies primarily on Commercial Off-The-Shelf\/Non-Developmental Items (COTS\/NDI) equipment and systems that meet the particular mission requirements of Consequence Management (CM). Nuclear, Biological, and Chemical (NBC) systems are adopted if they meet the CM mission requirements. FIRS Research & Development effort allows the program to keep abreast of emerging technologies in the commercial sector and address operational capability gaps that cannot be met by commercial items.\n\nThe increase in funding from FY16 to FY17 ($1.745M) reflects the increase of additional testing efforts required to maintain chemical and safety standards."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "FIRS: Reconnaissance Mission Area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.332"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued verification testing for personal protective, detection, identification, and decontamination material solutions.\n- Completed Non-Destructive Chemical, Biological Analysis enabling effective Personal Protective Equipment Decontamination strategies.\n- Completed development of the Dismounted Reconnaissance Sets, Kits, and Outfits (DR SKO) for computer based training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.007"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue verification testing for personal protective, detection, identification, and decontamination material solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.830"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.830"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue verification testing for personal protective, detection, identification, and decontamination material solutions\n- Initiate Unified Command Suite Block II (UCSb2) and Common Analytical Laboratory System - Field Confirmatory Integrated System (CALS FC-IS) naval systems integration."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIRS: Force Protection Mission Area"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued verification testing of the new positive\/negative pressure adaptable mask (M55).\n- Completed interface testing of commercially available Self-Contained Breathing Apparatus (SCBA).\n- Completed interface testing of new NFPA Class ensemble.\n- Completed verification and interface testing of new chemical, biological sock.\n- Completed battery anaylsis for Gas Chromatograph Mass Spectrometer (GCMS)\/Sample Desorption Module (SDM)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.338"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete verification testing of the new positive\/negative pressure adaptable mask (M55)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiate Verification and Validation (V&V) testing for various chemical technologies and the Explosive Ordinance    \n  Disposal Bomb Suit.\n- Initiate V&V testing for Tritium Leak Detector."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}